{
  "id": "a0542911-0e48-42f6-87f4-3dd004c89272",
  "name": "Prof. Sam Vaknin",
  "youTubeChannelId": "UCLadFapyecCYAeuTqc12avA",
  "episodes": [
    {
      "id": "bbf85a77-a312-4783-bf30-02c1d387a184",
      "title": "Surprising Truths About Smear Campaigns: Structure, Membership, Dynamics",
      "description": "When targeted, narcissists and psychopaths relish smear campaigns because these provide them with attention, excitement and thrills; justify their grandiose paranoid ideation; legitimize their aggression; and affirm their victimhood. They do not experience shame, remorse, intimidation, chastisement, or fear (even if they pretend otherwise), but rage and elation.\n\nTruth can also be a smear campaign when taken out of context (decontextualized)\n\nForm of gangstalking, narrative role-reversal (victimhood)\n\nExample of smear campaign instigator triadic dynamics:\n\nSmear campaigns involve pathetic losers. \n\nPsychopathic cult leader masquerading as a benevolent guru: self-righteous moralizing to disguise the projection. The inducer. Unable to maintain long-term relationships, especially with intimate partners. Substance user.\n\nFaded bloated past their prime histrionic, failed wannabe impostor, pretending to be an investigative journalist, expert, or researcher to lend an air of faux professionalism and objectivity to her or his pursuit of narcissistic supply and celebrity. Sublimates her paranoia as a form of ostentatious faux courage. The exploiter. Could be more than one.\n\nEternal cult member with a cult mind to blindly follow orders down the cult leader’s rabbit hole in return for a sense of belonging to an extended family, friendship, intimacy, and being accepted warts, shortcomings, repulsiveness, and all. The slave. Could be more than one.\n\nThe shapeshifting triumvirate recruits people with grievances, real or imagined, to do their bidding and act as cannon fodder or flying monkeys. \n\nProselytizers vs. Disseminators: canonical text, exegesis and deconstruction, embellishments \n\nAll smear campaigns are conspiracy theories. Narrative themes of smear campaign are folkloric: sexual abuse, fraud, malice, comeuppance, morality play of good vs. evil.\n\nCultlike dynamics (for me or against me, friend or foe, chosen few, privileged information and arcane knowledge)\n\nInducer in shared psychosis and narcissist in shared fantasy\n\nPreemptive epistemic injury (real victim disbelieved): victim confused, isolated, questions own sanity and reality\n\nCreating unsafe environment\n\nInvolved mentally disturbed people, self-enhancement, defense against ego-dystonic shame and guilt, loss, and nuance\n\nRescuer-savior, crusader complex\n\nSplitting, self-splitting, and projection (of both traits and actions), reaction formation\n\nHarvesting sympathy, allegiance, loyalty, commitment, validation, soothing, empowerment\n\nExternalized aggression (e.g., revenge for shaming humiliation, esp. in public), virulent envy\n \nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3\n\nWATCH Smear Campaign: Turn Narcissist\u0027s Flying Monkeys Against Him/Her https://www.youtube.com/watch?v=dvcElTrz4s4\n\nSmear campaigns are premeditated, calculated, relentless: psychopathic (antisocial)\n\n",
      "release": "2026-02-15T13:32:37Z",
      "duration": "00:35:48",
      "explicit": false,
      "youTubeId": "aSkBWAhPXLo",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aSkBWAhPXLo"
      }
    },
    {
      "id": "986e6887-bd6a-4ca9-a516-376ba6eda49d",
      "title": "Why Narcissist Feels Entitled to Magical, Enchanted Life",
      "description": "The Uses of Enchantment: The Meaning and Importance of Fairy Tales\n\nNarcissists feels entitled to magical, enchanted life in which the impossible happens time and again, effortlessly and unexpectedly. Fairy tale or movie that unfold inexorably in accordance with some internal logic. \n\nEnchant the pedestrian and sources of disenchantment/reality. Disenchantment feels like defeat, a trap, suffocating and stifling \n\nMagical thinking\n\nAddicted to Surprises: universe smiles on him/her, proof of love, care; adrenaline and dopamine rushes (thrill-seeking)\n\nEnchantment is recreation of maternal safe base\n\nDisenchantment: boredom, envy, anger, other negative affects\n\nCoercive enchantment: shared fantasy, crime, dramatic antics, enchanted instability and unpredictability, recklessness \n\nEscapism as enchantment: substance use, cults, video games, the online world (cybersphere), exclusionary ideologies, antagonistic conflict, nihilism, instrumentalizing, idealization and idolizing, erotomania and other narrative delusions, cognitive distortions and biases\n\nManic schemes\n\nMedia exposure (celebrity) even via antisocial, defiant, or contumacious acts \n\nConsumption\n\nIf all else fails: delusional self-enchantment via self-enhancement of self-concept (false self) and self-supply\n \nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: \nhttps://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2026-01-28T13:26:57Z",
      "duration": "00:27:33",
      "explicit": false,
      "youTubeId": "UwnvxHHGTfw",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UwnvxHHGTfw"
      }
    },
    {
      "id": "fa47893b-0f5e-4411-a875-2c4e489069da",
      "title": "Bully Narcissists Are Cowards (Not the Malignant Ones!)",
      "description": "Escalation is very common as boundaries are tested and breached \n\nBullies are craven\n\nPsychopaths anxious, reaction formation via externalized aggression (defiance, recklessness, impunity)\n\nNarcissists hypervigilant, paranoid, anxious, fragile, compensatory narcissism (superiority, impregnability, impunity)\n\nMalignant narcissist: 4D game is afoot\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Author Page: https://www.amazon.com/stores/Sam-Vaknin/author/B000APLOFK/allbooks",
      "release": "2026-01-15T14:31:40Z",
      "duration": "00:28:39",
      "explicit": false,
      "youTubeId": "4lxoG3SisHY",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4lxoG3SisHY"
      }
    },
    {
      "id": "118070e0-d754-4611-adfe-ef94db679b43",
      "title": "Predatory Women (Compilation 2 of 2)",
      "description": "Watch compilation 1 here: https://www.youtube.com/watch?v=eV1gB3-dE_8\n\nBorderline, psychopathic, histrionic, and narcissistic women are often predatory.\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: \nhttps://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2025-11-06T14:32:46Z",
      "duration": "01:13:06",
      "explicit": false,
      "youTubeId": "uwAiOWsHp9I",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uwAiOWsHp9I"
      }
    },
    {
      "id": "ec70c2bd-0aab-42b0-8cad-eaed3b6a0822",
      "title": "Wikipedia: Narcissistic Cult, Cabal",
      "description": "AI chatbots have begun to warn people about the unreliability of Wikipedia. \n\nIn the English Wikipedia, there are only 500 active editors out of 50,000,000 users. It is no longer a “CROWDsourced” resource, but a closed, delusional, fantasy-prone cult, a shared fantasy. \n\nShocking admission by a top Wikipedian is representative of the ethos. Slp1: “I tend to edit articles that take my fancy and have no connection to my professional and academic background.” Wikipedia \u0022editor\u0022 slp1 ( https://en.wikipedia.org/wiki/User:Slp1 ). And she is PROUD of it!\n\nWikipedia is a cult with cult leaders and arcane, obscure, deliberately obfuscating language and procedures, far more cumbersome than any university, research lab protocols, or peer-reviewed journal. Wikipedia has become an exclusionary and xenophobic in-group.\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: \nhttps://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2025-10-18T12:45:47Z",
      "duration": "00:41:44",
      "explicit": false,
      "youTubeId": "6SeB-SqucmY",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6SeB-SqucmY"
      }
    },
    {
      "id": "4c1536f7-7488-413c-9cb5-f50ac95cd8e6",
      "title": "Curing One Mental Illness with Another?",
      "description": "Fantasies, Delusions Reduce Anxiety, Depression (Anxiolytic, Antidepressant)\n\nRestore control, empower\n\nIntroduce omnipotent allies\n\nSelf-enhance (paranoid)\n\nReverse time\u0027s arrow (consequences determine antecedents)\n\nShut off reality (select for congruency)\n\nFoster a secure base or back to the womb (idealization of parental figures such as lover, god, or leader)\n\nGuarantee immunity (as divinity or harmless child)\n\nPurge enemies\n\nControl and channel or sublimate threatening negative affects (such as envy) to avoid self-defeat, self-harm, or self-destruction\n\nImbue life with ego-syntonic narrative meaning, purpose, goals, and direction (prescriptive)\n\nHealing involves ego syntony and full functionality. Should it also include reality testing? If one mental illness (e.g. delusional disorder or paranoia) cures another - is this healing?\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Author Page: https://www.amazon.com/stores/Sam-Vaknin/author/B000APLOFK/allbooks",
      "release": "2025-07-29T12:35:33Z",
      "duration": "00:23:54",
      "explicit": false,
      "youTubeId": "JdqzArEd-XM",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JdqzArEd-XM"
      }
    },
    {
      "id": "8f501a37-b8a5-4db1-bd68-0c864735595e",
      "title": "Populist Personality Cults, Charisma, Collective Narcissism",
      "description": "Nihilism as organizing principle\n\nImprovisation and gut management \n\nCosmic historic mission \n\nOppose anything and everything the elites support - just because they support it.\n\nDifferent value system, different civilization:\n\nRule of law is rigged and weaponized, crime is forgivable when offset against other qualities and behaviors\nCorruption and nepotism (OK if visible)\nHard work is slavery\nDue process only to the in-group\nDEI is oppression\nFactual truth is an opinion\nExpertise, intellect, and learning are suspect Machiavellian brainwashing\nEthical values are luxuries\nPatriotism is exclusionary, xenophobic\nReligion is an ideal, not a prescription\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Author Page: https://www.amazon.com/stores/Sam-Vaknin/author/B000APLOFK/allbooks",
      "release": "2025-07-14T13:00:47Z",
      "duration": "00:19:14",
      "explicit": false,
      "youTubeId": "is5k0H4dFOI",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=is5k0H4dFOI"
      }
    },
    {
      "id": "7f570ac1-46a2-4d43-8655-e076e124ebba",
      "title": "Narcissist\u0027s 10 Commandments, Godly Injunctions to You",
      "description": "Narcissism is a primitive religion and the narcissist is its implacable deity which demands human sacrifice. \n\nThe messages of the narcissist are religious and missionary.\n\nThe narcissist\u0027s Ten Commandments: \n\nYou will acknowledge my superiority, uniqueness, and perfection and you will dwell in the promised land of the shared fantasy\n\nMy speech and conduct are beyond reproach and never to be doubted, challenged, or criticized. I am the yardstick of all that is just and true, the sole giver of the Law, your absolute master. \n\nYou are my creation, you exist only through me and in me, you will never deviate, divert, contradict, or challenge who I made you to be\n\nI mediate between you and reality, nothing is veritable until I decree it and make it so\n\nI am your entire world, you need no one else but me\n\nServing and adulating me elevates and improves you, makes you a better, self-actualized version of yourself\n\nI expect your unconditional love and unalloyed devotion even when you are tested and are called to sacrifice yourself \n\nYou will fear my punishment and retribution if you were to break any of these commandments. You will avoid all situations, circumstances, and environments which may lead you astray. \n\nYou are the sinner and I am the redeemer: whatever goes wrong is your fault; I am your savior, rescuer, healer, fixer, and protector\n\nNever deviate from these commandments and you will have a happy life. Do not doubt, overthink, analyze, or criticize. Submit.\n\nYou are welcome to my FREE seminar: “Scientific Healing and Recovery from Narcissistic Abuse: Evidence-based Practices (clinical and self-help)”.\n\nClick on this link for details:\n\nhttps://vrfoundation.net/thank-you-south-east-european-university-seeu-and-commonwealth-institute-for-advanced-professional-studies-ciaps/\n\nSee you there!\n\nSam Vaknin\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Author Page: https://www.amazon.com/stores/Sam-Vaknin/author/B000APLOFK/allbooks",
      "release": "2025-04-23T12:46:23Z",
      "duration": "00:24:04",
      "explicit": false,
      "youTubeId": "SxpiF0q5Y3M",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SxpiF0q5Y3M"
      }
    },
    {
      "id": "f68728fd-9ad1-4a09-990e-dba223669e4f",
      "title": "Did the Narcissist Hypnotize You? (Compilation)",
      "description": "Hypnoid states involve a choice to be hypnotized, empathy, a suggestible state of mind, people-pleasing, and role-playing within a shared fantasy.\n\nEntraining, Hypnotist’s introject (hence posthypnotic suggestion). \n\nThe narcissist uses on you entraining, a kind of trance.\n\nHypnosis as a shared fantasy with role-playing: \n\nOutsourcing reality testing;\nFitting into narrative (scripting) and affirming the delusions as realistic, acceding to goals;\nSuspension of disbelief/judgment of right and wrong (narcissist\u0027s introject);\nExternal regulation of moods and emotions, sense of self-worth, self-perception and self-image;\nConfusion of external and internal;\nAssigned role playing;\nSymbiotic-infantile merger/fusion with secure base parental figure;\nSelf-states.\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Author Page: https://www.amazon.com/stores/Sam-Vaknin/author/B000APLOFK/allbooks",
      "release": "2025-01-09T18:18:37Z",
      "duration": "01:24:17",
      "explicit": false,
      "youTubeId": "plUgpj_9Vcw",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=plUgpj_9Vcw"
      }
    },
    {
      "id": "d0276884-697a-48a4-b70e-dc502cb6d238",
      "title": "Dynamics, Grief in Relationships with Narcissists, Cluster B (Zagreb Seminar, Part 4 of 5)",
      "description": "At first, the narcissist or borderline idealizes you. Then comes the ineluctable devaluation and discard, followed by the most profound grief you have ever experienced.\n\nThe field of personality disorders is at an impasse, reflected in the competing diagnostic models in the DSM 5-TR (the categorical lists of diagnostic criteria imported verbatim from the DSM-IV-TR vs. the dimensional, descriptive alternative models, relegated to the appendices). We need to reconceive of cluster B personality disorders as posttraumatic dissociative conditions involving self-states (subpersonalities with pseudoidentities). \n\nThis seems to be the most clinically rigorous way to rid ourselves of excessive comorbidities and polythetic diagnoses. Recasting cluster B personality disorders as post-traumatic conditions which involve dissociation goes a long way towards resolving these outstanding conundrums and provides for hitherto absent efficacious treatment modalities. \n\nClinicians Seminar in Zagreb, December 8, 2024, Organized by Snaga Namjere https://snaganamjere.com/\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-12-27T14:22:01Z",
      "duration": "00:40:49",
      "explicit": false,
      "youTubeId": "HDVQ7nGmf0o",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HDVQ7nGmf0o"
      }
    },
    {
      "id": "6d2c9219-d6e4-47bf-a655-6d29a131f11d",
      "title": "From Symbiotic Magical Thinking to Separation Trauma (Zagreb Clinicians Seminar, Part 2 of 5)",
      "description": "Life\u0027s first major traumas and the compulsive need to be seen.\n\nThe field of personality disorders is at an impasse, reflected in the competing diagnostic models in the DSM 5-TR (the categorical lists of diagnostic criteria imported verbatim from the DSM-IV-TR vs. the dimensional, descriptive alternative models, relegated to the appendices). We need to reconceive of cluster B personality disorders as posttraumatic dissociative conditions involving self-states (subpersonalities with pseudoidentities). \n\nThis seems to be the most clinically rigorous way to rid ourselves of excessive comorbidities and polythetic diagnoses. Recasting cluster B personality disorders as post-traumatic conditions which involve dissociation goes a long way towards resolving these outstanding conundrums and provides for hitherto absent efficacious treatment modalities. \n\nClinicians Seminar in Zagreb, December 8, 2024, Organized by Snaga Namjere https://snaganamjere.com/\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-12-18T13:21:50Z",
      "duration": "01:15:47",
      "explicit": false,
      "youTubeId": "y91xCCRDLus",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=y91xCCRDLus"
      }
    },
    {
      "id": "a89efe33-80e3-45e4-9e3e-c210c4e57b3d",
      "title": "Cluster B Personality Disorders Revisited (Zagreb Clinicians Seminar, December 2024, Part 1 of 5)",
      "description": "The field of personality disorders is at an impasse, reflected in the competing diagnostic models in the DSM 5-TR (the categorical lists of diagnostic criteria imported verbatim from the DSM-IV-TR vs. the dimensional, descriptive alternative models, relegated to the appendices). We need to reconceive of cluster B personality disorders as posttraumatic dissociative conditions involving self-states (subpersonalities with pseudoidentities). \n\nThis seems to be the most clinically rigorous way to rid ourselves of excessive comorbidities and polythetic diagnoses. Recasting cluster B personality disorders as post-traumatic conditions which involve dissociation goes a long way towards resolving these outstanding conundrums and provides for hitherto absent efficacious treatment modalities. \n\nClinicians Seminar in Zagreb, December 8, 2024, Organized by Snaga Namjere https://snaganamjere.com/",
      "release": "2024-12-17T13:10:24Z",
      "duration": "01:04:20",
      "explicit": false,
      "youTubeId": "tU4y1MGU1I8",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tU4y1MGU1I8"
      }
    },
    {
      "id": "75ea2531-6c19-411e-976e-806f94f45ab7",
      "title": "Flying Monkey Psychology in Narcissist’s Shared Fantasy",
      "description": "With the flying monkey, the narcissist creates an attenuated cult-like shared fantasy. \n\nThe narcissist is the flying monkey’s role model. But the flying monkey also serves as savior-rescuer and maternal protective figure. \n\nNarcissist devalues, discards, and punishes vicariously, by proxy, through the agency of the flying monkey, the narcissist’s long arm, an extension of his omnipotence. Flying monkeys, therefore, buttress the narcissist’s grandiosity.\n \nThe flying monkey experiences the shared fantasy the way an intimate partner does: feel chosen, unique, omnipotent, in the know, thrilled/excited/aroused, useful (needed), legitimized.\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: \nhttps://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-11-29T13:30:24Z",
      "duration": "00:07:28",
      "explicit": false,
      "youTubeId": "QRUc7NRSqJc",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QRUc7NRSqJc"
      }
    },
    {
      "id": "6fce8fbb-4ac1-4ac0-8686-8bef8ea36313",
      "title": "DANGER When Narcissists Switch, Align: Cope, Survive",
      "description": "WATCH Signs of SWITCHING in Narcissists and Borderlines\nhttps://www.youtube.com/watch?v=xrISNGzMdp0\n\nNarcissistic switching:\n\nReactive (mortification)\n\nEndogenous (collapse)\n\nType (cerebral to somatic, overt to covert or schizoid)\n\nSwitching between self-states: borderline, primary psychopath\n\nIndividuates internally, via switching\n\nSwitching between internalized and externalized aggression\n\nRole of dissociation\n\nNarcissistic alignment is when narcissists choose a narcissist – contemporary, historical, or fictitious character - as a role model to be emulated.\n\nSome signs of switching: Talkativity (hyper-verbalizing), hyperreflexivity (pseudo-psychosis) and HYPERACTIVITY followed by a period of subdued, slow motion, hesitant reactivity.\n\nBPD and NPD are prone to switching owing to splitting and self-splitting defenses (previous self-state all bad while new self-state all bad).\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: \nhttps://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-11-06T13:52:26Z",
      "duration": "00:32:16",
      "explicit": false,
      "youTubeId": "41o7WsRWo6w",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=41o7WsRWo6w"
      }
    },
    {
      "id": "8c554335-8c35-43fc-82db-a0d84d6fe7e0",
      "title": "Your Role, Punishment in Narcissist’s Narrative",
      "description": "People with a disorganized erratic cluster B personality disorder create simultaneous but mutually exclusive narratives of their lives intended to manage dissonance, both internal and external (with reality). These narratives are the equivalents of self-states or “multiple” personalities (subpersonalities).\n\nExamples of such narratives: I am normal, I have a loving family, I am promiscuous, I am a psychopath. \n\nWhen these narratives collapse, the disordered person allocates them to his/her nearest and dearest as if these were theatre productions or movies (e.g., the narcissist’s shared fantasy). The role of these actors is to validate the reality of the narratives (the same function of narcissistic supply in NPD). \n\nThe actors dissociate (depersonalize and derealize) within the fantasy. \nBecause these actors are misperceived as internal objects, offloading the narratives onto them unburdens the disordered person. The actions of the actors or agents are owned by the disordered person without the attendant risks or adverse consequences.\n\nWhen the actors regain independence, agency, and personal autonomy, they become persecutory objects and the disordered person experiences narcissistic mortification. \n\nThe disordered person attempts to hoover them or to co-opt anyone new in their lives. Should this strategy fail, they try to destroy the frustrating objects.\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: \nhttps://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-09-27T12:16:06Z",
      "duration": "00:29:01",
      "explicit": false,
      "youTubeId": "J3OmIwanTvk",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J3OmIwanTvk"
      }
    },
    {
      "id": "d5b33bc4-8d54-4b5f-9374-8ef468004c4d",
      "title": "Prosocial (Communal) Malignant Narcissist",
      "description": "3 Types of Malignant Narcissist: Grandiose, Covert, Borderline parallels high-functioning, prosocial/communal, and low-functioning. \n\nLow-functioning malignant narcissist utterly dysfunctional while high-functioning malignant narcissist professionally functional and interpersonally dysfunctional. \n\nIn low-functioning (borderline) malignant narcissist, human contact of any kind - from shopping to dating - triggers sadism, justified by grandiose contempt and haughtiness. The cumulative adverse outcomes are such that the malignant narcissist gradually drifts towards withdrawal and avoidance (schizoid behaviors) as a way to preserve ego syntony via alloplastic defenses (\u0022I should waste my precious time and towering intellect\u0022). \n\nProsocial (Communal) Narcissist able to function professionally and interpersonally within an in-group. Directs his psychopathy and sadism exclusively at the out-group. Always charismatic leader. \n\nLITERATURE\n\nWATCH 3 Types of Malignant Narcissist: Grandiose, Covert, Borderline https://www.youtube.com/watch?v=V2fJK9sylhU\n\nWATCH Malignant Covert Narcissist Becomes Primary Psychopath to Compensate for Collapse https://www.youtube.com/watch?v=FlaDDwzJG-E\n\nOtto F. Kernberg (2020) Malignant Narcissism and Large Group Regression, The Psychoanalytic Quarterly, 89:1, 1-24, January 2020\nDOI: 10.1080/00332828.2020.1685342 (https://doi.org/10.1080/00332828.2020.1685342)\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-07-19T12:20:42Z",
      "duration": "00:24:52",
      "explicit": false,
      "youTubeId": "6lcnSfM2MXw",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6lcnSfM2MXw"
      }
    },
    {
      "id": "be5ed8be-bc98-49b0-8dcc-a012a26f9c70",
      "title": "3 Types of Malignant Narcissist: Grandiose, Covert, Borderline",
      "description": "LITERATURE\n\nWATCH Malignant Covert Narcissist Becomes Primary Psychopath to Compensate for Collapse https://www.youtube.com/watch?v=FlaDDwzJG-E\n\nOtto F. Kernberg (2020) Malignant Narcissism and Large Group Regression,\nThe Psychoanalytic Quarterly, 89:1, 1-24, January 2020\nDOI: 10.1080/00332828.2020.1685342 (https://doi.org/10.1080/00332828.2020.1685342)\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-07-04T12:21:51Z",
      "duration": "00:08:18",
      "explicit": false,
      "youTubeId": "V2fJK9sylhU",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V2fJK9sylhU"
      }
    },
    {
      "id": "232d389d-2a42-4d12-8e35-e41fd01c23ff",
      "title": "How Narcissist\u0027s Inner Child Sees YOU",
      "description": "Narcissist\u0027s inner child is not his/her true self: it is a compendium of needs, especially the need to find a substitute mother and the need to separate and individuate.\n\nIDEALIZATION in shared fantasy\nShe is ... GOOD MOTHER (breast)\n\nPerfect, ideal, all good\nSecure base: safe, trustworthy, reliable, resilient, responsive\nLoves unconditionally: forgiving, accepting, authentic, rewarding\nPower couple\n\nDEVALUATION in shared fantasy\nShe is ... BAD MOMMY (breast)\n\nImperfect, all bad, persecutory\nUnsafe, untrustworthy, unreliable, fragile/weak/vulnerable\nManipulative, transactional, fake, denying, rejecting, frustrating\nTraitor, envious, passive-aggressive\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-06-26T15:26:20Z",
      "duration": "00:30:30",
      "explicit": false,
      "youTubeId": "-_GrVpKgqXA",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-_GrVpKgqXA"
      }
    },
    {
      "id": "2718845a-8292-4438-aa31-3aa3939ee972",
      "title": "Give Narcissists Taste of Own Medicine: Brainwash, Entrain Them",
      "description": "Introjection (regression to womb-matrix, infancy): snapshotting installs Trojan Horse in narcissist’s mind\n\nRepetition and entraining:\n\nGrandiosity challenging\nIdeational misattribution\nFeigned helplessness (savior/rescuer)\nMass psychegenic (cult)\n\nEgo syntonic narrative with survival (positive) adaptation (motivation to introject and assimilate narrative): anxiolytic (separation insecurity (abandonment anxiety)); triumphant-antagonistic (e.g., justice restored, omnipotence affirmed); grandiosity-enhancing and grandiosity-congruent.\n\nYour flying monkeys: peer dynamics and hive mind, the in group or cult personality (outsourcing of cognitive processes and acquiring a social identity): belonging and acceptance (surrogate family), self-worth, modeling, peer pressure, operant conditioning, normative regulation, negative identity, social referents.\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-06-04T12:36:19Z",
      "duration": "00:41:55",
      "explicit": false,
      "youTubeId": "48zo6XIT44Y",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=48zo6XIT44Y"
      }
    },
    {
      "id": "9859ab8c-8f4e-4713-9d1c-daf22e2e0a1a",
      "title": "Smear Campaign: Turn Narcissist\u0027s Flying Monkeys Against Him/Her",
      "description": "WATCH Surprising Truths About Smear Campaigns: Structure, Membership, Dynamics https://www.youtube.com/watch?v=aSkBWAhPXLo\n\nOnly correct response to smear campaign: no response.\n\nDamage to reputation non-existent among true friends and just workplaces, great among fake ones. So, smear campaign is a useful filter or membrane.\n\nTurning an agent into an asset (double agent) in counterintelligence.\n\nAppear collaborative and compliant, thank the flying monkey, act as if you are scared in order to elicit additional info and lower the guard of the conspirators.\n\nFeed the narcissist with wrong info, disinformation (with nuggets of truth).\n\nSpy on the narcissist and anticipate his/her next moves.\n\nIdentify others involved in the conspiracy of the campaign.\n\nExpose the narcissist’s often criminal conspiracy to law enforcement, media, or online.\n\nAlternatively, keep the evidence against the narcissist and his flying monkeys for future use in case of extortion. \n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-05-31T12:16:40Z",
      "duration": "00:29:34",
      "explicit": false,
      "youTubeId": "dvcElTrz4s4",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dvcElTrz4s4"
      }
    },
    {
      "id": "3e0a7849-de99-4c8a-ad44-e9943ac1121d",
      "title": "Malignant Covert Narcissist Becomes Primary Psychopath to Compensate for Collapse",
      "description": "The covert narcissist is a collapsed narcissist. Having failed as a narcissist, s/he becomes a primary psychopath (as a self-state). Malignant narcissism compensates for collapsed covert narcissism.\n\nWATCH Doormat Covert Narcissist Turns Primary Psychopath https://www.youtube.com/watch?v=QA3Zuu_O0-M\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-04-16T12:39:47Z",
      "duration": "00:48:21",
      "explicit": false,
      "youTubeId": "FlaDDwzJG-E",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FlaDDwzJG-E"
      }
    },
    {
      "id": "ff5d9b53-cb1b-4de1-bf47-3779343615aa",
      "title": "Hatebombing: Malignant Narcissist’s Inverted Shared Fantasy",
      "description": "Locus of grandiosity of malignant (psychopathic) and sadistic narcissists is their invulnerability, unemotionality, flat attachment, rigidity, and heartless cruelty (disguised as altruism, if prosocial).\n\nThey are transactional:\n\nTo the narcissist, all people are useful tools (in both senses of the word) or collateral damage. The impact the narcissist is having on people’s lives, for better or for worse, is a mere by-product or a side effect of his/her pursuit of grandiosity-affirming narcissistic, sadistic, or self-supply. \n\nDo you care about me? Narcissist: I do. You are useful to me. But, don’t you have emotions for me? N: I don’t do emotions. I do relationship maintenance. I do business: give and take. So, why stay in touch? N: I owe you. I repay my debts. Plus, you could still be useful. \n\nTheir shared fantasy is inverted; they start with hatebombing, devaluation and discard (the whole point of the fantasy), mixed with negative idealization (mythological demonization). So, their fantasies are extremely short, nasty, and brutal.\n\nIn rare cases, when the potential partner is also a malignant or sadistic narcissist, they become codependent or borderline, though still manifesting dysregulated abuse and coercive behaviors. \n\nIn such inverted shared fantasies, they transition to the role of a victim, letting the counterparty initiate the separation by betraying them (betrayal fantasy). \n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2024-02-21T14:30:23Z",
      "duration": "00:42:38",
      "explicit": false,
      "youTubeId": "lD93sQn-AcY",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lD93sQn-AcY"
      }
    },
    {
      "id": "504ed9e9-e574-4f17-94ee-c68039e96fd4",
      "title": "\u0022Spiritual\u0022 Narcissist Casts Narrative Spell on YOU (with Dr. Lisa Alastuey)",
      "description": "\u0022Spiritual\u0022 narcissists manifest as victims, godlike deities, or healers-rescuers-saviors. They use narratives to enchant and captivate within cultlike structures. \n\nLisa\u0027s YouTube channel Youtube Channel -https://www.youtube.com/c/LisaAlastuey/featured\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2023-09-28T12:26:10Z",
      "duration": "00:58:13",
      "explicit": false,
      "youTubeId": "_2SAVMS6xno",
      "subjects": [
        "Spritual Narcissist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_2SAVMS6xno"
      }
    },
    {
      "id": "9d2bbff5-a852-47fa-b8c8-a6df7de9c85d",
      "title": "WARNING: Don’t Join Narcissist’s Death Cult (Narcissist Forgets, Recalls You DAILY)",
      "description": "Counselling with Sam Vaknin or Lidija Rangelovska https://www.narcissistic-abuse.com/ctcounsel.html\n\nDM my Instagram https://www.instagram.com/narcissismwithvaknin\n\nDissociating the external, threatening object.\n\nAutonomy, agency force recall and lead to triggering, frustration, resentment, and aggression.\n\nThis happens multiple times a day.\n\nSo, narcissist must eliminate you.\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2023-07-11T12:05:10Z",
      "duration": "00:06:29",
      "explicit": false,
      "youTubeId": "O0IcMdylTtA",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=O0IcMdylTtA"
      }
    },
    {
      "id": "7c75cc51-6b3e-4436-9cd8-37c0487c7bf2",
      "title": "Mystical Experiences, Religion as Mental Illness",
      "description": "Similar to the narcissist\u0027s shared fantasy, mystical experiences and religions founded on these experiences are delusional regressions to an infantile phase prior to separation-individuation from god/cosmos/nature and merger/fusion/oceanic feeling/enmeshment/engulfment (no self-object or object representations).\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Store: https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2022-03-17T14:04:17Z",
      "duration": "00:48:54",
      "explicit": false,
      "youTubeId": "XYXch8oVJsc",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XYXch8oVJsc"
      }
    },
    {
      "id": "a485b2d8-cf3e-44aa-ac52-37f7aa246c84",
      "title": "Narcissism, the New Faith - Part 2: Missionary Cult and the End of Society",
      "description": "FIRST PART Narcissism, the New Faith - Part 1: Distributed God and Human Sacrifice  https://www.youtube.com/watch?v=b87WQj3q0_w\n\nPathological narcissism is the abused child\u0027s personal religion, with the False Self as the godhead. The child sacrifices his true self to the false self in return for the latter\u0027s grandiose fantasies and defelection of the pain and hurt suffered by the traumatized child. The narcissist then proceeds to extract narcissistic supply from other people in order to validate the reality of the False Self: he acts like a missionary trying to convert his sources of supply into his private religion or cult. As more people became narcissists, narcissism turned into an organizing and explanatory principle of human societies everywhere, imbuing the narcissists\u0027 life with meaning and prescribing or proscribing behavior and technological progress. Narcissism is the newest faith and its godhead is a distributed, network deity with each node in the network - each narcissist - a god unto himself.\n\n(From the book \u0022Malignant Self-love: Narcissism Revisited\u0022 by Sam Vaknin - Click on this link to purchase the print book, or 16 e-books, or 3 DVDs with 16 hours of video lectures on narcissists, psychopaths, and abuse in relationships: http://www.narcissistic-abuse.com/thebook.html)",
      "release": "2019-01-14T14:16:18Z",
      "duration": "00:15:59",
      "explicit": false,
      "youTubeId": "buNFfb43oC0",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=buNFfb43oC0"
      }
    },
    {
      "id": "41f9e531-3f29-4adc-b2aa-6d4a3f7c03cf",
      "title": "Narcissist\u0027s Cult",
      "description": "Everything You Need to Know about Narcissists, Psychopaths, and Abuse - click on this link: http://www.narcissistic-abuse.com/faq1.html\r\n\r\nThe narcissist is the guru at the centre of a cult. Like other gurus, he demands complete obedience from his flock: his spouse, his offspring, other family members, friends, and colleagues. He feels entitled to adulation and special treatment by his followers. He punishes the wayward and the straying lambs. He enforces discipline, adherence to his teachings, and common goals. The less accomplished he is in reality -- the more stringent his mastery and the more pervasive the brainwashing. (From the book \u0022Malignant Self-love: Narcissism Revisited\u0022 by Sam Vaknin - Click on this link to purchase the print book, or 16 e-books, or 2 DVDs with 12 hours of video lectures on narcissists, psychopaths, and abuse in relationships: http://www.narcissistic-abuse.com/thebook.html)",
      "release": "2010-08-07T15:54:50Z",
      "duration": "00:07:46",
      "explicit": false,
      "youTubeId": "epxbn7iwVjo",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=epxbn7iwVjo"
      }
    }
  ]
}