{
  "id": "e65ee991-9bbd-44b0-bed0-e2a94e295b5d",
  "name": "PROFILER AFRICA",
  "spotifyId": "68mYFWQxKysEiHfRijwxuW",
  "appleId": 1455830293,
  "youTubeChannelId": "UCuXmxpgcJs-osSPJ3cbbOUA",
  "episodes": [
    {
      "id": "b1d2101c-5946-4f9c-a9bb-05b34de623ac",
      "title": "THE KRUGERSDORP CULT KILLINGS with Author Jana Marx",
      "description": "We’re joined by Jana Marx, author of The Krugersdorp Cult Killings: Inside Cecilia Steyn\u0027s Reign of Terror, who digs deep into the chilling saga of the Electus Per Deus cult. Between 2012 and 2016, a group led by Cecilia Steyn committed a series of brutal murders that shook South Africa to its core. These killings were driven by a toxic mix of religious extremism, manipulation, and revenge, with Steyn brainwashing followers into believing they were on a divine mission. Jana’s book exposes the twisted inner workings of this cult, and we’ll take you through the gruesome details of the murders, the investigation, and the eventual trial that brought the perpetrators to justice.\n\r\nDon’t miss this chilling look into one of South Africa\u0027s most notorious cults and the devastating impact of their actions.\n\r\n🌟 Support the Show\r\n• Become a YouTube member for exclusive extras and behind-the-scenes insights.\r\n• Join our Patreon at patreon.com/profilerafrica to support our work.\r\n• Drop a Super Like to help us create more episodes—we’ll thank you in the next show!\n\r\n➡️ Engage with Us\r\n• Like and subscribe on YouTube to keep South African true crime stories alive.\r\n• Hit the notification bell to stay updated on new episodes.\r\n• Send us your questions for Gerard—they might feature in a future Q\u0026A: profilerafricainfo@gmail.com\n\r\n#TrueCrime #ProfilerAfrica #SouthAfricanCrime #ForensicFiles #CrimeSceneInvestigation #PsychologyOfMurder #SAJustice #CriminalMind",
      "release": "2025-03-25T15:54:52Z",
      "duration": "01:41:39",
      "explicit": false,
      "spotifyId": "2vPuX8S6I25F7QNnPp4a86",
      "appleId": 1000700872260,
      "youTubeId": "nEU7CucMXTI",
      "subjects": [
        "Electus per Deus",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2vPuX8S6I25F7QNnPp4a86",
        "apple": "https://podcasts.apple.com/podcast/the-krugersdorp-cult-killings-with-author-jana-marx/id1455830293?i=1000700872260",
        "youtube": "https://www.youtube.com/watch?v=nEU7CucMXTI"
      }
    },
    {
      "id": "50a43677-304e-40c1-b7ae-1c7fda2f7293",
      "title": "The Krugersdorp Cult Killers",
      "description": "In this episode of True Crime Room, hosted by Derek Riedle, we delve into the chilling and twisted case of the Krugersdorp Cult Killers, also known as \u0022Electus per Deus.\u0022 Over four years, this group carried out a string of brutal murders, all under the guise of divine purpose. What drove this cult to such horrific acts? Was it faith, greed, or manipulation? Join Derek as he uncovers the dark truths behind the crimes and the disturbing psychology of cult leaders and their followers.\n\n🔴 Don’t forget to like, subscribe, and hit the bell icon for more in-depth true crime stories.\n\nSupport the show and access exclusive content:\n👉 Become a Friend of the Channel on Patreon: patreon.com/profilerafrica\n👉 Get behind-the-scenes access by joining YouTube Membership\n\n#TrueCrime #KrugersdorpCultKillers #ElectusPerDeus #SouthAfricaCrime #TrueCrimeRoom #CultPsychology #MurderMystery #CrimeInvestigation #TrueCrimeCommunity #CrimeDocumentary #MurderInvestigation #CultCrimes #CrimeStory",
      "release": "2024-12-19T18:00:06Z",
      "duration": "00:47:26",
      "explicit": false,
      "youTubeId": "nZ7mNaa4dtY",
      "subjects": [
        "Electus per Deus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nZ7mNaa4dtY"
      }
    }
  ]
}