{
  "_ts": 0,
  "id": "016487b8-bb3d-49bd-b017-f30c41742891",
  "name": "propagandatechniques",
  "youTubeChannelId": "UCPo9ItJX2Q3wexrCQwySFFA",
  "episodes": [
    {
      "id": "73b19c4b-020a-43e4-b12b-8f0f0cf5f9d3",
      "title": "Jehovah\u0027s Witnesses and Repetition for Emphasis (Argumentum ad Nauseam) Internet Dangers",
      "description": "This video exposes the propagandists from the Writing Department of the Watchtower Bible and Tract Society using \u0022Repetiton For Emphasis\u0022 to hold captive the minds of the Jehovah\u0027s Witnesses in a pen of false \u0022security\u0022 by repeating incessantly over the past ten years the words \u0022internet\u0022 and \u0022dangers,\u0022 until the two words are synonymous, which is another propaganda technique called \u0022Use Association,\u0022 virtually guaranteeing to instill such a powerful phobia that the majority of their victims will never find videos such as this one on the internet revealing how this propaganda is being implemented, all in the name of God.\n\nThese are two very powerful mind control techniques. When used simultaneously, they create a synergistic effect on the minds of the unsuspecting cult members.\nSource: http://www.orange-papers.org/orange-propaganda.html",
      "release": "2009-01-14T04:23:49Z",
      "duration": "00:04:31",
      "explicit": false,
      "youTubeId": "hkOtU7ldK8I",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hkOtU7ldK8I"
      }
    },
    {
      "id": "617f0a7d-5ef8-4441-a8fb-a61e7589f7a9",
      "title": "Jehovah\u0027s Witnesses and Hypnotic Bait and Switch",
      "description": "This video shows how the propaganda technique \u0022Hypnotic Bait and Switch\u0022 is accomplished and used as a mind control tool by psychologically destructive cults in order to promote thought reform.",
      "release": "2008-10-30T00:22:54Z",
      "duration": "00:05:34",
      "explicit": false,
      "youTubeId": "KTBGK50AmEU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KTBGK50AmEU"
      }
    }
  ]
}