{
  "_ts": 0,
  "id": "c8ecbc87-7a63-4314-b79e-8f416a961055",
  "name": "Prospera TV Network",
  "youTubeChannelId": "UC2ZIPIFrZkQgnmDM62u5h1g",
  "episodes": [
    {
      "id": "18388607-7cf6-45d0-82f6-8f01888faec0",
      "title": "LET GLORY SHINE: When Stories Collide: A Cult Survivor Reunion with Orpah Sindt",
      "description": "Let Glory Shine | When Stories Collide: A Cult Survivor Reunion with Orpah Sindt\n\nIn this deeply moving episode of Let Glory Shine, host Martha Glory Kartaoui sits down with a familiar face from her past, Orpah Sindt, a fellow survivor from the same cult that shaped much of their early lives. For the first time on camera, these two courageous women open up about their individual journeys through trauma, indoctrination, and spiritual abuse, and what it meant to finally reunite in Dallas just one month ago after years of separation.\n\nOrpah shares her own raw testimony, revealing the emotional toll of her experience and the strength it took to reclaim her voice. Together, they explore the complexities of healing, the power of being seen, and what happens when two survivors come full circle in truth and transformation.\n\nThis is more than a conversation. It’s a divine intersection. A sacred homecoming.\n\nLet Glory Shine...a light in the darkness for every Battle Angel who has ever felt alone in their pain. Don’t miss this unforgettable episode.\n\n#LetGloryShine #CultSurvivor #HealingJourney #Reunion #TraumaRecovery #FaithAndFreedom",
      "release": "2025-06-19T23:00:06Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "SGFmzdneCos",
      "subjects": [
        "Samanta Roy Institute of Science and Technology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SGFmzdneCos"
      }
    },
    {
      "id": "e7ec9dda-2f26-4f0a-a051-d8cd9c6427a8",
      "title": "LET GLORY SHINE: Cults Uncovered - Martha Glory Kartaoui Answers the Questions You\u0027re Afraid to Ask",
      "description": "Let Glory Shine | Cults Uncovered: Martha Glory Kartaoui Answers the Questions You’re Afraid to Ask\n\nIn this eye-opening episode of Let Glory Shine, host Martha Kartaoui tackles the most pressing and misunderstood questions about cults, not just from her own experience as a survivor, but to bring clarity, truth, and healing to others who may be questioning their own reality.\n\nWhat is a cult, really?\nHow do smart, capable people end up in one?\nWhat are the signs that you might be in a cult — even a “spiritual” one?\nAnd if you are… how do you get out?\n\nMartha holds nothing back as she breaks the silence around manipulation, mind control, spiritual abuse, and the slow erosion of identity. Whether you\u0027re in it, came out of it, or know someone who might be trapped, this episode is a must-watch.\n\nYou’re not crazy. You’re not alone. And yes, there is a way out. Let this episode be the light that guides you.\n\n#LetGloryShine #MarthaKartaoui #CultAwareness #SpiritualAbuse #HealingFromManipulation #FaithAndFreedom #ProsperaTV",
      "release": "2025-06-12T17:46:16Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "L1kC_oTd3-E",
      "subjects": [
        "Samanta Roy Institute of Science and Technology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L1kC_oTd3-E"
      }
    }
  ]
}