{
  "id": "520b7a85-da47-453a-b236-97147c19d284",
  "name": "Psychiatry \u0026 Psychotherapy",
  "youTubeChannelId": "UCDV4XSQbdB3n6X3QirO5i_w",
  "episodes": [
    {
      "id": "31c31662-4592-4154-9e1d-c77c1cb315e1",
      "title": "Transference Focused Psychotherapy \u0026 Personality Disorders with Dr. Otto Kernberg",
      "description": "00:47 Fleeing Nazi Austria\n05:49 Early Influences\n22:55 Borderline Level of Functioning and Primitive Defenses\n30:24 Sexual Life in Borderline and Narcissistic Personality\n45:08 Transference-Focused Psychotherapy and Reflective Function\n1:03:52 Histrionic Personality\n1:09:35 Paranoid Personality\n1:11:19 Schizoid Personality\n1:18:37 Why Therapists Want to Help\n\nIn this insightful interview, Dr. Otto Kernberg, renowned psychiatrist and pioneer of Transference-Focused Psychotherapy (TFP), shares profound insights into personality disorders, including Borderline Personality Disorder (BPD), narcissistic, schizoid, paranoid, and histrionic personalities.\n\nDr. Kernberg explores core psychoanalytic concepts such as identity diffusion, primitive defense mechanisms (splitting, projective identification), and the dynamics of sexuality and aggression within personality disorders. Learn how Transference-Focused Psychotherapy uniquely enhances reflective functioning and emotional integration, transforming patient outcomes.\n\nEssential viewing for therapists, psychology students, and anyone interested in deepening their understanding of personality structure, psychoanalytic theory, and effective psychotherapy approaches.\n\n 🌐 Interested in learning more about personality disorders and Transference-Focused Psychotherapy? Visit https://istfp.org/ to explore insightful resources and information. \n\n 🛠️ Are you a mental health professional seeking specialized training in Transference-Focused Psychotherapy? Discover upcoming training programs here: https://istfp.org/training/tfp-trainings/\n\nLink to Blog: \nhttps://www.psychiatrypodcast.com/psychiatry-psychotherapy-podcast/episode-239-transference-focused-psychotherapy-otto-kernberg-borderline-personality\n\nBy listening to this episode, you can earn 1.5 Psychiatry CME Credits: https://www.psychiatrypodcast.com/cme-program",
      "release": "2025-04-25T17:49:55Z",
      "duration": "01:29:22",
      "explicit": false,
      "youTubeId": "uyPquOVhO-c",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uyPquOVhO-c"
      }
    }
  ]
}