{
  "_ts": 0,
  "id": "9156966a-9523-460c-a306-c27e8dccbbc8",
  "name": "Psychedelic Medicine Podcast with Dr. Lynn Marie Morski",
  "spotifyId": "5Aynz3iJqk8JWkHMLoc9aI",
  "appleId": 1476831468,
  "youTubeChannelId": "UCID_dLlFQJGazS3hTQ7lf8A",
  "episodes": [
    {
      "id": "56348e9e-ee46-4d70-b9dc-b8cdc8e6ae07",
      "title": "Guruism and Cult Dynamics in Psychedelic Practices with Joseph Holcomb Adams",
      "description": "In this episode, Joseph Holcomb Adams joins to discuss the important topic of guruism and cult dynamics in psychedelic communities. Joseph is an ethicist who specializes in issues related to psychedelics, altered states, and transformative experiences. In this conversation, Joseph introduces the concepts of a guru, guruism, and cult dynamics. He describes the social-psychological mechanisms behind the devotee-guru relationship and the development of ideological conformity in cults, explaining how the heightened states induced by psychedelics can contribute to these dynamics if participants and facilitators are not aware of these dangers and vigilant in guarding against them. Joseph explains that psychedelic experiences can lead to “experiential verification,” where the participant’s sense of the facilitator as a wise spiritual guide can seem to be confirmed through the intense mystical nature of the experience, which in turn can feed into a guru-disciple power dynamic where the participant feels reliant on the facilitator for their healing. In closing, Joseph focuses on the profound importance of education on these topics. He emphasizes that these potentially harmful dynamics will always be present, so raising awareness is crucial as psychedelic healing continues to become more mainstream. In this episode you\u0027ll hear: The spectrum of cult dynamics How guruism and cult dynamics can become amplified in psychedelic practices How psychedelics influence suggestibility, transference, and projection Why it can be easy for psychedelic facilitators to unintentionally fall into guruism Ego inflation following psychedelic experiences How ecstatic ritual experiences promote group cohesion What can be done to address the risks of guruism and cultic dynamics in psychedelic practices The importance of informed consent Quotes: “[During a psychedelic experience] it can be very easy for the participant to basically associate and identify this mind-opening experience, this earth-shattering spiritual experience, with this person who facilitated it for them, who is right there, who seems to know all about this space of consciousness that they’re experiencing.” [13:22] “If the facilitator… already has a big, inflated sense of their spiritual knowledge and ability, then that’s already right there, pushing them to step into that guru role and this can happen from their own psychedelic use.” [30:06] “When we’re engaging in psychedelic-enhanced ecstatic group rituals, what we’re doing here is we’re basically using powerful neuropharmacological tools to help us really powerfully tap into these potentialities that are in our primordial nature as social, instinctively religious beings… That’s what we’re messing around with here.” [38:23] “The most important risk mitigation factors—really it’s education and the awareness that comes from it.” [43:52] Links: Joseph’s website Joseph on LinkedIn Joseph’s chapter, “Guruism and Cultic Social Dynamics in Psychedelic Practices and Organisations” co-authored with Jules Evans in Current Topics in Behavioral Neurosciences “Oxytocin modulates charismatic influence in groups” by Ilanit Gordon and Yair Berson, 2018 Psychedelic Safety Flags: A Color System to Help Assess Practitioner Ethics and Safety Previous episode: The Challenging Psychedelic Experiences Project with Jules Evans Previous episode: Avoiding the Traps of Psychedelic Self-Absorption with Adam Aronovich PhD(c) Psychedelic Medicine Association Porangui",
      "release": "2025-02-05T10:00:00Z",
      "duration": "00:49:53.0310000",
      "explicit": true,
      "spotifyId": "4KYNQtAtcPNLcokaHclE55",
      "appleId": 1000689256368,
      "youTubeId": "2QweNvX3pi0",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4KYNQtAtcPNLcokaHclE55",
        "apple": "https://podcasts.apple.com/podcast/guruism-and-cult-dynamics-in-psychedelic-practices/id1476831468?i=1000689256368",
        "youtube": "https://www.youtube.com/watch?v=2QweNvX3pi0"
      }
    }
  ]
}