{
  "id": "116fb4bc-52a4-4e8f-8be7-617f5a43c355",
  "name": "Purity Sensation",
  "youTubeChannelId": "UCF67IB2MOklVKc4DGvOc9Kg",
  "episodes": [
    {
      "id": "393f7681-92a6-4613-88b5-b3949c71d559",
      "title": "Sigrid \u0026 Anastasia Share Their TRUTH as Ex-Spiritual Wives of Venant Wong (KAP) \u0026 Shivananda Swamiji",
      "description": "What happens behind the closed doors of spiritual leaders? In this powerful and eye-opening video, Sigrid and Anastasia Armanova— former wives of renowned spiritual leaders Venant Wong and Swami Shivananda (Swami G)— break their silence to reveal the hidden truths behind the charismatic personas of these men.\n\nThe truth always prevails — are you ready to hear it?\n\n00:10 – Introduction: Meet Sigrid and Anastasia, and learn why they decided to speak out.\n05:45 – Anastasia: How the relationship started – “love bombing” and the illusion of a perfect match.\n12:50 – Sigrid: The early stages of awakening and how manipulation begins under the guise of growth.\n20:10 – Trauma Bonds: The cycle of emotional highs and lows that traps individuals in toxic relationships.\n27:55 – Open Relationships and Double Standards: The imbalance of expectations in spiritual partnerships.\n34:50 – Public Persona vs. Private Actions: When the truth behind the spiritual leader is revealed.\n42:05 – Realizations: The moments when intuition and external evidence confirm the manipulation.\n48:40 – Women Speaking Out: Stories of betrayal and shared experiences coming to light.\n56:00 – The Difficulty of Leaving: Emotional dependence, societal pressure, and personal sacrifices.\n01:05:20 – Steps Toward Freedom: Sigrid and Anastasia share how they began reclaiming their power.\n01:15:05 – Healing and Accountability: Reflections on personal recovery and the responsibility of exposing the truth.\n01:25:30 – Lessons Learned: How to recognize manipulation and why integrity in spiritual communities matters.\n01:45:26 – Divine Feminine and Consciousness: Embracing inner strength and challenging duality.\n01:57:45 – Exposing Deception: Unmasking lies, manipulation, and the impact of toxic leadership.\n02:02:15 – Moving Forward: How their revelations have shaped healing and inspired others.\n\nSpeaking from a place of integrity—not anger or revenge—they expose the manipulation, lack of empathy, and harmful double standards that caused deep emotional, psychological, and spiritual harm to those who trusted them. This raw and unapologetically honest conversation sheds light on the dark side of spiritual leadership and the devastating consequences it can have on individuals and communities.\n\nSigrid and Anastasia courageously share their stories to raise awareness and demand accountability in spiritual communities. This is not about revenge—it’s about responsibility, truth, and creating a safer, more ethical spiritual environment for everyone.\n\nIf you’ve ever questioned the integrity of spiritual leaders or wondered about the darker side of spiritual communities, this video is a must-watch.\n\nSigrid instagram.com/sigridbrelid\nAnastasia instagram.com/anastasia_armanova\n\n #VenantWong #SpiritualLeaders #SpiritualAbuse #HealingFromTrauma #ToxicRelationships #Manipulation #kap#kundaliniactivationprocess #kundalini #narcissisticabuse #healingtrauma #exposinggurus #narcissisticmanipulation #spiritualmiscinduct",
      "release": "2024-12-16T02:50:49Z",
      "duration": "02:03:42",
      "explicit": false,
      "youTubeId": "-jFKczaqJLA",
      "subjects": [
        "Shivananda Swamiji",
        "Venant Wong"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-jFKczaqJLA"
      }
    }
  ]
}