{
  "id": "fe792332-250f-4829-9092-4dde2d1bc648",
  "name": "Pushing The Limits",
  "spotifyId": "2zLyo8cN20TJoXj0pHzqf1",
  "youTubeChannelId": "UChmeKugJc0C-x5E2jyuZgYQ",
  "episodes": [
    {
      "id": "56a9ddb6-756b-49b1-8cc0-bb0f05c61ae5",
      "title": "Epstein survivor calls for Trump’s impeachment",
      "description": "Epstein survivor calls for Trump’s impeachment over handling of investigation \n\n🎙️ New to streaming or looking to level up? Check out StreamYard and get $10 discount! 😍 https://streamyard.com/pal/d/5510601779183616",
      "release": "2025-12-24T22:19:03Z",
      "duration": "01:56:17",
      "explicit": false,
      "youTubeId": "AW4o6nMQXeA",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AW4o6nMQXeA"
      }
    },
    {
      "id": "f0d3bc9d-8ba4-4a7e-8919-12b0e3d8ba89",
      "title": "Why Weren’t Epstein Co-Conspirators Charged? Epstein Victim Lawyer Gloria Allred Explains",
      "description": "Renowned civil-rights attorney Gloria Allred joins Brian Shapiro on Pushing the Limits for a powerful, wide-ranging interview on the Jeffrey Epstein files, the Department of Justice’s handling of survivor information, and what she calls a profound failure of accountability. \n\nAllred, who has represented 27 Epstein survivors, explains why the DOJ violated the Epstein Files Transparency Act, why victims’ names were wrongly published, and how the botched release has retraumatized survivors. She also addresses the lack of charges against alleged Epstein co-conspirators, conflicting statements from DOJ officials, and growing concerns that justice is being obstructed to protect powerful figures.\n\nBrian presses Allred on allegations involving Donald Trump, Bill Clinton, and others named in the files, the suspicious death of Epstein, and why transparency matters more than politics. Throughout the conversation, Allred makes one thing clear: this should never be about party loyalty — it must be about justice for the victims.\n\nThis is a must-watch legal breakdown from one of the most influential attorneys in America.\n\n🔔 Subscribe for more interviews, investigations, and political commentary from Pushing the Limits.\n💬 Comment below: Do you trust the DOJ to fully release the Epstein files?\n\nFor free and unbiased Medicare help, dial 212-461-4078 to speak with my trusted partner, Chapter, or go to https://askchapter.org/limits\n \nChapter and its affiliates are not connected with or endorsed by any government entity or the federal Medicare program. Chapter Advisory, LLC represents Medicare Advantage HMO, PPO, and PFFS organizations and stand alone prescription drug plans that have a Medicare contract. Enrollment depends on the plan’s contract renewal. While we have a database of every Medicare plan nationwide and can help you to search among all plans, we have contracts with many but not all plans. As a result, we do not offer every plan available in your area. Currently we represent 50 organizations which offer 18,160 products nationwide. We search and recommend all plans, even those we don’t directly offer. You can contact a licensed Chapter agent to find out the number of products available in your specific area. Please contact Medicare.gov, 1-800-Medicare, or your local State Health Insurance Program (SHIP) to get information on all of your options.\n\nSupport our work at https://www.pushingthelimits.live",
      "release": "2025-12-24T18:52:57Z",
      "duration": "00:18:29",
      "explicit": false,
      "youTubeId": "Wt9UExeZfFc",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Wt9UExeZfFc"
      }
    },
    {
      "id": "91173786-a49c-4cad-9ae8-4e3fb5aba13a",
      "title": "Trump supporters are in revolt over the Epstein Files with Special Guest Mark Epstein",
      "description": "Pushing the Limits with Brian Shaipro is a thought-provoking podcast that delves into the most pressing issues of the day, offering a fresh perspective on the world we live in. The show is hosted by Brian Shaipro, who is joined by a diverse range of guests, including experts, activists, and thought leaders. In Season 1, Episode 1, Brian Shaipro tackles the complex and intriguing topic of the Jeffrey Epstein case, its connections to Donald Trump, and the broader implications for the MAGA movement. The episode features in-depth interviews with Mark Epstein, Jeffrey Epstein\u0027s brother, and Ron Filipkowski, a journalist from Midas Touch. Mark Epstein shares his insights on the recent video released by Pam Bondi, stating, \u0022This is more BS... What are they hiding? Why is Pam Bondi and Donald Trump not wanting to talk about your brother anymore? All of a sudden, what are they hiding?\u0022 Ron Filipkowski adds, \u0022I think a lot of what Bongino is doing is very self-serving... It\u0027s really all about him.\u0022 The episode provides a nuanced exploration of the Epstein case, its connections to high-profile figures, and the reactions of the MAGA movement. The conversation also touches on Donald Trump\u0027s recent press conference, where he announced plans to impose secondary tariffs on Russia in fifty days. Ron Filipkowski criticizes this move, saying, \u0022The Kremlin is laughing at this fifty-day thing that was put in place by Trump earlier today. Fifty days are going to go by. Nothing is going to change. And then Donald Trump won\u0027t want to talk about Vladimir Putin in the war in Ukraine no more than he wants to talk about the Jeffrey Epstein files.\u0022 Brian Shaipro and Ron Filipkowski discuss the implications of Trump\u0027s actions, highlighting the lack of concrete measures to address the ongoing conflict in Ukraine. The hosts also examine the broader context of Trump\u0027s presidency, including his handling of foreign policy and the economy. Ron Filipkowski notes, \u0022We\u0027re headed towards a recession. People are going to be losing their medical coverage and Medicaid, maybe upwards of fifteen to twenty million people. People are losing their jobs. They\u0027re suffering in this country.\u0022 The conversation highlights the disconnect between Trump\u0027s rhetoric and the reality on the ground, with many Americans struggling to make ends meet. The episode also touches on the topic of trans rights, with Brian Shaipro criticizing the MAGA movement for prioritizing issues like trans athletes over more pressing concerns like economic inequality. Ron Filipkowski adds, \u0022They want to ban books. They want to attack the LGBTQ community. They want to attack trans people. And they think drag queens are bad and undocumented immigrants are the reasons why there\u0027s so much crime in this country, which couldn\u0027t be further from the truth.\u0022 The conversation highlights the divisive tactics employed by the MAGA movement and the need for a more nuanced and inclusive approach to addressing social issues. Throughout the episode, Brian Shaipro and his guests offer a critical perspective on the Trump administration and the MAGA movement, highlighting the need for greater accountability and transparency. The conversation is marked by a sense of urgency and concern, as the hosts and their guests grapple with the complex and often disturbing implications of Trump\u0027s actions. As the episode comes to a close, Brian Shaipro reflects on the importance of continuing the conversation and pushing the limits of what is possible in pursuit of a more just and equitable society. The episode is a thought-provoking exploration of the most pressing issues of our time, and it sets the stage for a nuanced and in-depth examination of the Trump administration and its impact on American society. With its diverse range of guests and topics, Pushing the Limits with Brian Shaipro is a must-listen for anyone seeking to stay informed and engaged on the most critical issues of our time. The show\u0027s commitment to critical thinking and nuanced analysis makes it a valuable resource for anyone looking to deepen their understanding of the world we live in.",
      "release": "2025-07-15T00:00:00",
      "duration": "01:56:16.3130000",
      "explicit": false,
      "spotifyId": "5njq7qS8uoBU54VWoczlHU",
      "youTubeId": "pMZoA6HhF8M",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5njq7qS8uoBU54VWoczlHU",
        "youtube": "https://www.youtube.com/watch?v=pMZoA6HhF8M"
      }
    },
    {
      "id": "76b3cc8e-5ceb-47af-862d-0bdc01196a3f",
      "title": "Psychologist Breaks Down The MAGA Cult In 2 Minutes",
      "release": "2025-02-17T22:37:56Z",
      "duration": "00:04:07",
      "explicit": false,
      "youTubeId": "7hBZWW4kQ5Q",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7hBZWW4kQ5Q"
      }
    }
  ]
}