{
  "id": "315898a9-daeb-4d0e-a5fd-73a43efee45d",
  "name": "Put Your Books Down",
  "spotifyId": "7G0ucyE4dPCRivQRS0rf94",
  "appleId": 1630463592,
  "episodes": [
    {
      "id": "5a908d88-27af-4795-92d1-cdc61cabd684",
      "title": "Did the Elizabeth Smart Documentary Change How We See True Crime?",
      "description": "What happens when a Netflix documentary is so good it ruins your entire emotional stability? Natalie Sanderson Jones and Angela Bingham hit record and immediately spiral. In this episode of Put Your Books Down, the hosts unpack Netflix\u0027s Elizabeth Smart documentary—why it hits differently than every true-crime special before it, how the media failed a family in real time, and why believing girls (especially nine-year-old girls) would\u0027ve changed everything. From shocking bystander behavior to the cult-like delusion that let kidnappers hide in plain sight, this conversation is equal parts hilarious, furious, and deeply human. Angela brings firsthand context from living in Salt Lake City during the case, Natalie delivers an all-time rant on polygraphs, and somehow… a menopausal laser mishap still makes an appearance. Because this is Put Your Books Down, and emotional whiplash is the brand. \u0026#x1f3a7; Watch now, then go hug someone you love. Check out our website here: https://putyourbooksdown.com/ Watch the show on our YouTube Channel: https://www.youtube.com/playlist?list=PLb18ywHqVOG_d2BKfy_-XS3MaDi6dz6s7 Follow Put Your Books Down on social media: Facebook: https://www.facebook.com/putyourbooksdown Instagram: https://www.instagram.com/putyourbooksdown/ Natalie on IG: https://www.instagram.com/nataliesanderson/ Angela on IG: https://www.instagram.com/angelabinghamofficial/ Podcast produced by http://clantoncreative.com",
      "release": "2026-02-03T06:00:00Z",
      "duration": "00:44:34.3380000",
      "explicit": false,
      "spotifyId": "3rKCW8miVh43Ck0FCsrXAp",
      "appleId": 1000747820447,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3rKCW8miVh43Ck0FCsrXAp",
        "apple": "https://podcasts.apple.com/podcast/did-the-elizabeth-smart-documentary-change-how-we-see/id1630463592?i=1000747820447"
      }
    }
  ]
}