{
  "_ts": 0,
  "id": "7a1320df-8027-458b-bf30-749b0ed487d0",
  "name": "Queen of Karma",
  "youTubeChannelId": "UCRMtelO586kp5vP5mzWx1Ig",
  "episodes": [
    {
      "id": "89acf674-b108-4e68-b373-36c1ac28d48b",
      "title": "ECKANKAR: THE PATH OF SPIRITUAL CONTROL",
      "description": "#eckankar\n#cults\n#religiouscults\n\nIn this livestream, we’re diving into the mysterious world of Eckankar—a lesser-known but still active cult founded by Paul Twitchell in the 1960s. Before starting Eckankar, Twitchell worked his way up in Scientology and even achieved the level of \u0022Clear.\u0022 But instead of sticking with L. Ron Hubbard\u0027s teachings, he borrowed heavily from them—along with ideas from Theosophy, Radhasoami, and other traditions—to create his own spiritual movement.\n\nWe’ll explore Twitchell’s early life, the lies he told about his background, and how scholar David C. Lane exposed its plagiarized roots. Lane’s groundbreaking research revealed just how much of Eckankar was copied from other sources—and how Twitchell manipulated his image to appear as a divine messenger.\n\nIf you’ve never heard of Eckankar, you’re not alone—but it’s time we start talking about it again. This is a great introduction to this religious cult. \n\nFor my other coverage of the Eckankar cult, see these videos/streams:\nTheir Glossary of Terms - https://youtube.com/live/eJnQQ3JbURI?feature=share\n\nEckankar Book Reviews:\nSpiritual Stress Relief - https://youtu.be/i7GytPYJi4o\nThe Power of Gratitude - https://youtu.be/dX8oWT1ZKRo\nFinding Life\u0027s Purpose - https://youtu.be/knS4awjWriY\nHu - https://youtu.be/89PgGLS9HMg\nSecrets of Divine Creativity - https://youtu.be/bKhAZm_krPw\nDivine Guidance - https://youtu.be/6yNo9Eqi-PA\nKarma \u0026 Reincarnation - https://youtube.com/live/WR76-ruLVRE?feature=share\n\nOther Coverage:\nReacting to a Soul Travel Experience - https://youtu.be/iGL85LoH2xY\nReacting to Harold Klemp - https://youtu.be/_N9s72sPnpo\nCult Discussion on Eckankar - https://youtube.com/live/MWuP2VUXdmY?feature=share\nMore on Soul Travel - https://youtube.com/live/sOrOk2SMkGU?feature=share\n\nResources for this Stream:\nThe Making of a Spiritual Movement book - https://www.amazon.com/Making-Spiritual-Movement-Twitchell-Eckankar/dp/0961112468\nSurviving the Cult Eckankar - https://www.angelfire.com/hi2/eckankarsurvivors/\nOMGuru Article - https://www.om-guru.com/html/saints/twitchell01.html\nEckankar HU Chant: Experience the Sound of Soul - https://youtu.be/B0Y8o_-1drM?si=z1y9VGP-2IikVSQ4\nHU: Experience the Sound of Soul - https://youtu.be/jgBoCO3Dw2g?si=89KhzC38gyPNXNY_\nModern Day Eck Masters - https://religionsmn.carleton.edu/exhibits/show/eckankar/organization-and-clergy/modern-day-eck-masters\n\n🎙️ New to streaming or looking to level up? Check out StreamYard and get $10 discount! 😍 https://streamyard.com/pal/d/5053796024582144",
      "release": "2025-06-19T21:27:45Z",
      "duration": "01:37:03",
      "explicit": false,
      "youTubeId": "dOrK-LwODjI",
      "subjects": [
        "Eckankar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dOrK-LwODjI"
      }
    },
    {
      "id": "5900aa8c-3936-4753-812a-2965529387e3",
      "title": "MLM Cult Forever Living Wants YOU to Pay to Work for Them",
      "description": "#foreverliving  \n#mlmexposed  \n#antimlm \n\nForever Living, one of the most well-known MLMs in the world, is now charging its distributors a $3 monthly fee just to access their back office and run their so-called \u0022business.\u0022 In this video, I break down what this fee means, why it\u0027s problematic, and how it\u0027s yet another example of MLM companies profiting off their own members rather than actual product sales.\n\nThis is a classic move used by multi-level marketing schemes to squeeze money from their downlines under the guise of \u0022business tools.\u0022 But is it ethical? Is it even legal? And how does it reflect on the overall MLM business model?\n\nLet’s talk about it.\n\n👉 Don’t forget to like, comment, and subscribe for more deep dives on scams, cults, and MLM exploitation.\n\nPlease support small businesses! Such as PenAndTam, run by Louisiana Swamp!! Check it out here and grab some great stuff: https://www.ebay.com/usr/penandtam\n\nIf you join my members, you will get access to perks (like cool emojis!) and I will promote your business! All proceeds go back into the channel and into our calls of action. Join here:\nhttps://www.youtube.com/channel/UCRMtelO586kp5vP5mzWx1Ig/join\n\nJust be sure to send me the information via email! If you ever want to reach out to me here: bethgibbons74@gmail.com\n\nInstead of using O-Connect, use StreamYard to create streams like this!! Use my affiliate link here: https://streamyard.com/pal/d/4512413140647936 \n\nThanks so much for all your support! Means a lot! Much love to you all! xo\n\nDiscord : QUEEN OF KARMA#8669\nE-mail : bethgibbons74@gmail.com\nMERCH: https://teespring.com/stores/throwing-spade\nIG : @xoqueenofkarmaxo \nTwitter : https://twitter.com/KarmaTroll001\nPayPal : paypal.me/queenofkarma13\n\n** Copyright Disclaimer: Under Section 107 of the Copyright Act 1976, allowance is made for \u0022fair use\u0022 for purposes such as criticism, comment, news reporting, teaching, scholarship and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Furthermore, all clips are used for fair use commentary, criticism, and educational purposes.  See Hosseinzadeh v. Klein, 276 F.Supp.3d 34 (S.D.N.Y. 2017) Equals Three, LLC v. Jukin Media, Inc., 139 F. Supp. 3d 1094 (C.D. Cal. 2015). As was ruled in Hosseinzadeh v. Klein, 276 F.Supp.3d 34 (S.D.N.Y. 2017), clips from an original work may be used to “comment on and critique a work”, and the use of clips is “reasonable to accomplish the transformative purpose of critical commentary”.  See also NXIVM v. The Ross Institute, Inc., 364 F.3d 471 (2nd Cir. 2004) (quotations from course materials for critical commentary was fair use).  I believe my video is transformative in nature in order to criticize and comment and is not intended as a market substitute for the original video. **\n\n*Disclaimer: All opinions expressed in this video are mine alone and do not reflect on anyone else. I speak out about these topics to the best of my ability and knowledge and only speak for myself.*",
      "release": "2025-06-02T18:44:31Z",
      "duration": "00:08:21",
      "explicit": false,
      "youTubeId": "1NpdSE7mO4A",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1NpdSE7mO4A"
      }
    }
  ]
}