{
  "id": "12126328-73da-4c63-95eb-4a988a18a216",
  "name": "Queens Public Library",
  "youTubeChannelId": "UCK6U0EiWmYt4jG30XquPn6Q",
  "episodes": [
    {
      "id": "fa9e26ca-08d3-411a-b968-8cabc0dead19",
      "title": "Culture Connection: “Sure, I’ll Join Your Cult”: An Evening with Actress and Comedian Maria Bamford",
      "description": "We’re delighted to host an evening with one of the nation’s funniest comedians. Maria Bamford is an outsider among outsiders who has forever fought to find a place to belong. From struggling with mental illness to navigating a career in the arts, she has tried almost every method possible to not only be a part of the world, but to want to be a part of it.\r\n\r\nBamford will talk about her memoir, “Sure, I’ll Join Your Cult”—which features her “trademark blend of disarming intimacy and dark whimsy” (Publishers Weekly)—with her fellow Culture Connection guests. \r\n\r\nA much-in-demand comedian, writer, and actor, Mia Jackson has spent the last few years on tour with Amy Schumer and performs at the Comedy Cellar when she\u0027s not on the road. Her credits include \u0022Life \u0026 Beth\u0022 (Hulu) and a Comedy Central half-hour special.\r\n\r\nDavid Shoemaker is a professor of philosophy at Cornell University and the author of the upcoming \u0022Wisecracks: Humor and Morality in Everyday Life.\u0022\r\n\r\nFilmmaker and producer Taylor Purdee will serve as our moderator. https://www.hoperunshighfilms.com/\r\n\r\nBorrow \u0022Sure, I’ll Join Your Cult\u0022 from the Library: https://www.queenslibrary.org/search/book?searchField=Sure%2C\u002BI%E2%80%99ll\u002BJoin\u002BYour\u002BCult\u0026category=book\u0026searchFilter=\r\n\r\nLearn More about David Shoemaker: https://sites.google.com/site/dshoemakr/home  \r\n\r\nLearn More about Mia Jackson: https://www.miajackson.com/\r\n\r\nLearn More about Maria Bamford: https://www.mariabamford.com/",
      "release": "2024-04-06T12:18:39Z",
      "duration": "01:04:54",
      "explicit": false,
      "youTubeId": "wPFgmgehkvQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wPFgmgehkvQ"
      }
    }
  ]
}