{
  "id": "a8d61631-3d9d-48dc-9b2e-bbf19aedbc16",
  "name": "Quillette Podcast",
  "spotifyId": "5OexgXX1vghj0rizOSvVeR",
  "appleId": 1441708286,
  "youTubeChannelId": "UCUK9GA3mt1fVKWj91wW7mfQ",
  "episodes": [
    {
      "id": "7a2d880c-7534-4ddc-a1f5-f7ed6bc6441e",
      "title": "Escaping a Religious Cult, Gay Activism and Addiction: Ben Appel on Identity, Recovery and Belonging",
      "description": "In this episode, Ben Appel shares his transformative journey from a conservative and cult-like upbringing into LGBTQ activism and writing. We discuss the psychological toll of growing up within a coercive community, the impact of leaving that space, addiction and recovery, and how writing became a vehicle for healing and self-expression. We also dig into the evolution of marriage equality, current debates within LGBTQ activism, and what community really means in a shifting cultural landscape.\n\n📌 Takeaways\n\nBen Appel discusses his journey from a conservative background into LGBTQ activism.\n\nThe conversation explores the complexities of identity and the role of community.\n\nAppel reflects on the cultural shift after marriage equality.\n\nThe psychological consequences of leaving a controlling environment are unpacked.\n\nAddiction, recovery, and writing as a coping mechanism play central roles.\n\nThe episode examines how LGBTQ activism has changed—particularly around trans rights.\n\nThe importance of self-acceptance and belonging is emphasised.\n\nChapters\n00:00 Intro / Pre-Conversation\n03:27 Navigating Political Landscapes\n04:37 The Evolution of Activism\n05:07 Assimilation vs. Radicalism\n05:51 Personal Reflections on Activism\n06:59 Language and Identity\n09:18 Growing Up in a Cult\n12:19 Covenant Communities Explained\n14:22 The Psychological Toll\n16:28 Freedom and Control\n18:45 Community Life and Pressure\n21:27 Leaving the Community\n23:01 Struggling With Identity\n28:12 Scrupulosity and Self-Judgement\n33:04 A Turning Point in New Orleans\n36:51 Descent Into Addiction\n41:53 Finding Recovery and New Community\n47:56 The Journey of Self-Discovery\n48:08 How Marriage Changed Things\n52:33 Love and Activism\n54:43 Awakening of a New Activist\n58:25 Navigating New Orthodoxy\n01:02:17 Breaking Point at Columbia\n01:05:29 Community, Belonging \u0026 Identity\n\n\nQuillette is an Australian-based online magazine that focuses on long-form analysis and cultural commentary. It is politically non-partisan, but relies on reason, science, and humanism as its guiding values.\n\nQuillette was founded in 2015 by Australian writer Claire Lehmann. It is a platform for free thought and a space for open discussion and debate on a wide range of topics, including politics, culture, science, and technology.\n\nQuillette has gained attention for publishing articles and essays that challenge modern orthodoxy on a variety of topics, including gender and sexuality, race and identity politics, and free speech and censorship.\n\n---\n\nQuillette\u0027s revenue comes from our readers. We are a grassroots organisation that relies on voluntary subscriptions and community membership as our primary revenue stream.\n\nSupport Quillette by becoming a subscriber: https://quillette.com/#/portal/signup\n\nOr donate send us a one-off tip: https://quillette.com/#/portal/support\n\nWe made our website using Ghost, a powerful app for new-media creators to publish, share, and grow a business around their content. It comes with modern tools to build a website, publish content, send newsletters \u0026 offer paid subscriptions to members. Try it here: https://ghost.org/?via=claire91",
      "release": "2025-11-30T23:35:53Z",
      "duration": "01:07:50",
      "explicit": false,
      "spotifyId": "18BsRmIDO7KuzsBDZJIoz3",
      "appleId": 1000739031781,
      "youTubeId": "xiVpHeKhCxs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18BsRmIDO7KuzsBDZJIoz3",
        "apple": "https://podcasts.apple.com/podcast/a-gay-authors-escape-from-cults-drugs-queer/id1441708286?i=1000739031781",
        "youtube": "https://www.youtube.com/watch?v=xiVpHeKhCxs"
      }
    },
    {
      "id": "eefe9057-f3ac-422b-91be-245d88e7e032",
      "title": "From Cult Child to Chess Wunderkind",
      "description": "Quillette podcast host Jonathan Kay speaks with Danny Rensch about his astounding journey from the ‘Church of Immortal Consciousness’ to the role of Chief Chess Officer at Chess.com Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-10-20T05:10:00Z",
      "duration": "00:37:30.5790000",
      "explicit": false,
      "spotifyId": "65CMMMBwGq3aX2i3MyarpJ",
      "appleId": 1000732602613,
      "youTubeId": "eJi8aOULkys",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65CMMMBwGq3aX2i3MyarpJ",
        "apple": "https://podcasts.apple.com/podcast/from-cult-child-to-chess-wunderkind/id1441708286?i=1000732602613",
        "youtube": "https://www.youtube.com/watch?v=eJi8aOULkys"
      }
    }
  ]
}