{
  "id": "a5f473eb-9a9a-46e6-8554-c5ebe9c973ec",
  "name": "Quincee Gideon, PsyD",
  "spotifyId": "",
  "appleId": null,
  "youTubeChannelId": "UCZOcDTjSJNkOHJuYZthnPXQ",
  "episodes": [
    {
      "id": "576e9bf5-bec3-4992-b7f8-9aa8aa003d8a",
      "title": "A Series- Demystifying Cults: Two by Twos",
      "description": "Quincee Gideon, PsyD talks about the Two by Twos (2x2s), this is a home based religious movement, originated in Ireland by an evangelical preacher, William Irvine.  The church is called “The Way” or “The Truth”. Irvine was known for comfortable lifestyle (speculation of church funds) and “weakness with women”. In this video, Dr. Quincee talks about some of the concerning features that are seen in cult groups. \n\nSome cult features in this group you will see:\n\n🚩Preachers are itinerant (stay at churches for short periods of times and then move to another church) and work in groups of two. \n🚩Believe that all god’s teachings must be expressed orally (almost nothing is written down)- red flag\n🚩Ministers do not own homes or draw salaries\n🚩King James Bible is the only book used\n🚩Have to hear the preaching directly because it’s god speaking through minister or “worker” \n🚩Salvation requires self-sacrifice and suffering is revered \n🚩Modest dress, no jewelry, long hair for women, short hair for men, avoiding frivolous activities such as watching movies or TV, no social media \n\n\nHi there! Are you a religious trauma or cult abuse survivor? Are you wondering how in the world you\u0027re ever going to make sense of what happened to you? Join us in our monthly support membership and learn how cults and rigid religions work to emotionally manipulate you and how you can recover. \n\nJoin us at: traumastery.com/yonmt\n\nNeed personalized and specific feedback in your religious trauma or cult recovery journey? We have intensive coaching options available at: \n\ntraumastery.com/coaching\n\nWhere else you can find me:\n\nINSTAGRAM: http://instagram.com/drquincee\n\nPRIVATE PRACTICE: http://www.woventraumatherapy.com\n\nSubscribe to get new videos covering all the mental health topics you are searching for!",
      "release": "2022-05-09T16:12:09Z",
      "duration": "00:05:34",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "vbam9qkcTdw",
      "subjects": [
        "Two By Twos",
        "2 By 2s",
        "William Irvine"
      ],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=vbam9qkcTdw"
      }
    },
    {
      "id": "d5b7e04d-e30e-4c4b-8ad1-6dd4eae9ba43",
      "title": "A Series- Demystifying Cults: The Assembly of YHWHhoshua",
      "description": "Quincee Gideon, PsyD talks about the small sect of the Sacred Name group in Colorado, The Assembly of YHWHhoshua. This group differs from other Sacred Name groups because they believe that god\u0027s true name is Yahweh (spelled YHWH). Laycher Gonzalez was the founder of this group who was a self-proclaimed prophet. In this video, Dr. Quincee talks about some of the concerning features that are seen in cult groups. \n\nSome cult features in this group you will see:\n🚩You can\u0027t have drawings, painting or photos\n🚩Strict dress code: wool nun-habit like clothing for women.  Couldn’t show any body parts beyond face.\n🚩They  have to eat “pure and natural” food\n🚩Teaches Roman Catholic Church and other daughter churches are the “great whore” referred to in Rev. 17 and U.S. is modern Babylon\n🚩Members don’t pay taxes and don’t contribute to social security \n🚩Social security numbers are believed to be a form of governmental control leading tot he mark of the Beast. \n🚩Believing Yahweh and Hoshua are the true names for God and Jesus and so they blot out any other name for god in their books. \n🚩No holidays are celebrated because believed to be pagan \n🚩No medical interventions allowed; rely on faith and prayer for healing \n🚩Have their own school because they believe other schools would ruin their children \n🚩Haircuts, cologne, jewelry, and dating all forbidden \n\nHi there! Are you a religious trauma or cult abuse survivor? Are you wondering how in the world you\u0027re ever going to make sense of what happened to you? Join us in our monthly support membership and learn how cults and rigid religions work to emotionally manipulate you and how you can recover. \n\nJoin us at: traumastery.com/yonmt\n\nNeed personalized and specific feedback in your religious trauma or cult recovery journey? We have intensive coaching options available at: \n\ntraumastery.com/coaching\n\nWhere else you can find me:\n\nINSTAGRAM: http://instagram.com/drquincee\n\nPRIVATE PRACTICE: http://www.woventraumatherapy.com\n\nSubscribe to get new videos covering all the mental health topics you are searching for!",
      "release": "2022-04-30T06:03:21Z",
      "duration": "00:04:40",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "H2v5jWlSafM",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=H2v5jWlSafM"
      }
    },
    {
      "id": "acc10ec8-4565-4b18-a282-0721d00f8ad1",
      "title": "A Series- Demystifying Cults: The Duggars (IBLP)",
      "description": "Quincee Gideon, PsyD talks about some of the concerning features of The Duggars which is the family known for their TV show 19 Kids and Counting. This group is also known as the Institute in Basic Life Principles (IBLP). In this video, Dr. Quincee talks about some of the concerning features that are seen in cult groups.\n\nSome red flags of this cult feature:\n🚩Men have complete authority no matter what  (sex, finances, clothing choices of women and children, education access, and even adult children dating) \n🚩No birth control and strict requirements for when women have to participate in sex. Women cannot ever initiate a conversation with men. Women have “7 needs” they need to fulfill for their husbands (and those are all gross)  \n🚩No discipline or accountability for a dangerous leader\n🚩Do not believe in professional counseling\n🚩TW: Believe that all issues (including child abuse and sexual assault) have to be dealt with inside the church— no outside or police involvement\n🚩Fear-mongering: god is always ready to punish/kill you and the devil is right around the corner.  If in doubt, the men have authority to decide how bad your behavior is.\n🚩Specific homeschool materials and no outside education is allowed\n🚩TW: Rape is seen as “vaccinating” against temptation for premarital sex. \n🚩If you are sick, then God is mad at you and teaching you a lesson. \n\nLearn more about cult recovery over on our blog: https://traumastery.com/blog/cult-recovery-4-common-red-flags\n\nHi there! Are you a religious trauma or cult abuse survivor? Are you wondering how in the world you\u0027re ever going to make sense of what happened to you? Join us in our monthly support membership and learn how cults and rigid religions work to emotionally manipulate you and how you can recover. \n\nJoin us at: traumastery.com/yonmt\n\nNeed personalized and specific feedback in your religious trauma or cult recovery journey? We have intensive coaching options available at: \n\ntraumastery.com/coaching\n\nWhere else you can find me:\n\nINSTAGRAM: http://instagram.com/drquincee\n\nPRIVATE PRACTICE: http://www.woventraumatherapy.com\n\nSubscribe to get new videos covering all the mental health topics you are searching for!",
      "release": "2022-04-18T19:54:35Z",
      "duration": "00:07:16",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "LYBK3Gn1Yyk",
      "subjects": [
        "Duggars",
        "IBLP",
        "Institute in Basic Life Principles",
        "Bill Gothard"
      ],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=LYBK3Gn1Yyk"
      }
    },
    {
      "id": "43100168-62d6-4809-9978-cbddba7a26ef",
      "title": "A Series- Demystifying Cults: Twelve Tribes",
      "description": "Quincee Gideon, PsyD talks about some of the concerning features of Twelve Tribes-- a group that has recently been in the news after the devastating fires in Colorado.  In this video, Dr. Quincee talks about some of the concerning features that are seen in cult groups. \n\nCult groups might force you to: \n\n🚩  Believe that you will be blessed by God according to how many of your possessions you give to the cult when you join, which makes it hard to leave. \n🚩  Have to work without compensation for \u0022the good of the group\u0022. Twelve Tribes has also had complaints of child labor. \n🚩 Require homeschooling for indoctrination of children and restrict access to outside world and education that might challenge the cult\u0027s beliefs. \n🚩 Use of coercion and control \n🚩 Us vs then mentality: racism, homophobia, misogyny have been reported from ex-members.\n🚩 All or nothing belief- you are in or you are out and you are cut off from the community if you disagree or challenge. \n🚩 Charismatic authoritarian leader that oversees life decisions of followers\n🚩 Active recruitment— and looks for vulnerable people. \n\nLearn more about religious trauma and cult recovery: INSTAGRAM.COM/DRQUINCEE\n\nHere\u0027s some further media sources on this: (https://www.denverpost.com/2022/03/07/yellow-deli-twelve-tribes-cult-exploitation/)\n\nhttps://www.denverpost.com/2022/03/03/twelve-tribes-cult-child-abuse/\n\nWhere else you can find me:\n\nINSTAGRAM: http://instagram.com/drquincee\n\nPRIVATE PRACTICE: http://www.woventraumatherapy.com\n\nTRAUMA COACHING AND EDUCATION: https://traumastery.com/\n\nSubscribe to get new videos covering all the mental health topics you are searching for!",
      "release": "2022-04-11T19:59:33Z",
      "duration": "00:06:49",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "3NW0QPoXpPQ",
      "subjects": [
        "Twelve Tribes",
        "12 Tribes",
        "Yellow Deli"
      ],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=3NW0QPoXpPQ"
      }
    }
  ]
}