{
  "id": "dc0f1bcc-2e98-4d1e-9d8e-f2ccaadb7f8d",
  "name": "I Can\u0027t Hustle Any Harder Than This",
  "spotifyId": "5jBv0UUSTVnkP1RoOawRj0",
  "appleId": 1793770530,
  "youTubeChannelId": "UCQ5NlYOTCPGoJt-Y-BBe4tg",
  "episodes": [
    {
      "id": "d7b9bc35-8f35-499e-878e-762fe97ce256",
      "title": "What Happens After You Leave a Business Cult with Anna Failla",
      "description": "In this episode, hosts Rachael Wonderlin and Natalie De Paz welcome back returning guest Anna Failla for a candid follow-up on her time inside Devil Corp, and more importantly, the fallout after she left.\n\nAnna previously shared how she was recruited into what’s widely referred to online as “Devil Corp,” a shadowy, pyramid-shaped sales ecosystem operating through rotating LLCs. This conversation picks up where that story left off, with the financial and psychological ripple effects, as well as what happened to the people who stayed behind.\n\nTogether, they unpack how cult-like work environments isolate young employees, glamorize hustle, blur ethical lines, and make leaving feel like failure. Anna reflects on the long road to untangling identity, trust, and ambition, including how vulnerability, therapy, and community helped her rebuild.\n\nKey Takeaways:\n\n– Leaving is only the beginning. The hardest part of Devil Corp was emotionally unpacking the experience years later.\n\n– Pyramid-shaped systems thrive on isolation. Multiple LLCs, siloed teams, and constant “leadership” check-ins prevented employees from comparing notes.\n–Shame keeps people quiet. Many former colleagues declined to speak publicly, not because the experience wasn’t harmful, but because it was embarrassing.\n\n– Stability isn’t failure. Choosing a 9-to-5, lateral career moves, or creative fulfillment over constant hustle can be an act of healing.\n– Not all takeaways are clean or simple. Anna learned real sales and business skills, even while experiencing deep manipulation and burnout.\n\nMemorable Quotes: \n\n“The business became my religion, my friend group, my whole world — and I didn’t see it until I saw it.”\n\n“They sell you the idea, not the job, because if they told you the job, you wouldn’t take it.”\n\n“There’s this unspoken rule that leaving hustle culture feels like betrayal.”\n\n“Collecting skill sets instead of titles changed everything for me.”\n\n“Stability gets framed as failure — and that’s part of the manipulation.”\n\n\nAbout the Guest: \n\nAnna Failla is a Pittsburgh-based creative professional and a returning guest on I Can’t Hustle Any Harder Than This. She previously shared her firsthand experience working inside Devil Corp, a controversial, cult-like sales organization often discussed on Reddit and YouTube. Today, she prioritizes stability, creativity, and family life, while openly sharing her story to help others recognize red flags in predatory work environments.\n\n\nAbout Rachael:\nRachael Wonderlin is a dementia care consultant and gerontologist. She founded her consultancy, Dementia By Day, in 2014. She is the author of When Someone You Know is Living in a Dementia Care Community, Creative Engagement, and The Caregiver’s Guide to Memory Care and Dementia Communities.\n\nFind out more at www.rachaelwonderlin.com and Instagram.com/dementiabyday.",
      "release": "2026-01-20T09:01:05Z",
      "duration": "00:58:09",
      "explicit": false,
      "spotifyId": "32DHwEt2XUFkGPFNRhX53v",
      "appleId": 1000745873734,
      "youTubeId": "dIlj5luMNcQ",
      "subjects": [
        "Corporate Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/32DHwEt2XUFkGPFNRhX53v",
        "apple": "https://podcasts.apple.com/podcast/what-happens-after-you-leave-a-business-cult-with/id1793770530?i=1000745873734",
        "youtube": "https://www.youtube.com/watch?v=dIlj5luMNcQ"
      }
    },
    {
      "id": "43fb3938-b73c-4972-85fc-29b204510023",
      "title": "\u0022I was in a business cult!\u0022 PART 2 w/ Anna Failla",
      "description": "WOW. We had so much fun interviewing Anna about her experience in #DevilCorp that we knew we had to do it again! Before tuning into Part Two, check out Part One.\n\nShortly after graduating college, Anna was offered a job with a \u0022marketing company\u0022 who promised that, if she worked hard enough, she could one day become a BUSINESS OWNER!\n\nShoutout to Sarah Edmondson, whose book, SCARRED, I couldn\u0027t put down. Also, rest in peace, Mike Rinder, famous ex-Scientologist. Thank you both for the hard work you\u0027ve done getting people out of cults!\n\nAs you may have guessed, that didn\u0027t exactly pan out. Join us as we hear more about Anna\u0027s wild ride.",
      "release": "2025-04-01T10:00:56Z",
      "duration": "00:38:35",
      "explicit": false,
      "spotifyId": "56sPdks8NPQjU6JamBGEkg",
      "appleId": 1000701706225,
      "youTubeId": "dOMvCYEOyHw",
      "subjects": [
        "Corporate Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/56sPdks8NPQjU6JamBGEkg",
        "apple": "https://podcasts.apple.com/podcast/i-was-in-a-business-cult-part-2-with-anna-failla/id1793770530?i=1000701706225",
        "youtube": "https://www.youtube.com/watch?v=dOMvCYEOyHw"
      }
    },
    {
      "id": "45f03816-2664-4f13-bd8e-2db8e513c31f",
      "title": "\u0022I was in a business cult!\u0022 PART 1 with Anna Failla",
      "description": "\u0022It turned out that there wasn\u0027t an apartment for each of us, paid for by the company, like they said there would be. There were four of us, sleeping on air mattresses, in a one-bedroom apartment.\u0022\n\nJoin us as we talk to Anna Faila about her experience in a business cult, \u0022DevilCorp,\u0022 (real name changed, of course) during her early 20s. When Anna and I first started talking about entrepreneurship, I had no idea that our discussion would lead here, but I knew immediately we needed to bring her on the podcast.\n\nThis was the wildest interview we\u0027ve done yet and we loved it so much, we\u0027re bringing Anna back for a second one! \n\n#entrepreneurship #scam #scammer #business #cults #devilcorp",
      "release": "2025-03-04T11:30:38Z",
      "duration": "00:28:39",
      "explicit": false,
      "spotifyId": "6a1iWKrCzh8Du5xWly31lo",
      "appleId": 1000697606598,
      "youTubeId": "stxDEt3XohI",
      "subjects": [
        "Corporate Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6a1iWKrCzh8Du5xWly31lo",
        "apple": "https://podcasts.apple.com/podcast/i-was-in-a-business-cult-part-1-with-anna-failla/id1793770530?i=1000697606598",
        "youtube": "https://www.youtube.com/watch?v=stxDEt3XohI"
      }
    }
  ]
}