{
  "id": "f7265e8e-3fb1-4f95-82bf-e9395baa6463",
  "name": "Rachel Bernstein",
  "youTubeChannelId": "UC67JLTD22dSnVadqXKcYPcA",
  "episodes": [
    {
      "id": "3a4f1ba9-fc44-42fd-b26a-40a81e72200a",
      "title": "IndoctriNation - BONUS EPISODE PREVIEW: Leaving the Prison of Shame and Fear w/ Daniel Shaw LCSW",
      "description": "This is just a preview of our latest Patreon exclusive bonus episode. You can hear the show in its entirety by becoming a supporter at:\n\n\nhttps://www.patreon.com/indoctrination\n\n\nDaniel Shaw, LCSW, is a psychoanalyst in private practice in New York City and in Nyack, New York; and Faculty and Supervisor at The National Institute for the Psychotherapies in New York. His papers have appeared in Psychoanalytic Inquiry, Contemporary Psychoanalysis, Psychoanalytic Perspectives, and Psychoanalytic Dialogues, and most recently, his book, Traumatic Narcissism: Relational Systems of Subjugation, was published by Routledge for the Relational Perspectives Series and nominated for the prestigious Gradiva Award. His book Traumatic Narcissism and Recovery: Leaving the Prison of Shame and Fear was published in 2021. In 2018, the International Cultic Studies Association awarded Dan the Margaret Thaler Singer Award for advancing the understanding of coercive persuasion and undue influence.\n\n\n\nDan returns to the show to discuss with Rachel the ideas he explores in his new book, Traumatic Narcissism and Recovery: Leaving the Prison of Shame and Fear. Together, they reflect on the current landscape of recovery in their respective fields and compare notes on the ways patients and mental health professionals can be successful in cases of cult recovery.\n\n\nMore info on Dan\u0027s work is available here:\nhttps://danielshawlcsw.com/\n\n\nYou can find his latest book here:\nhttps://www.goodreads.com/book/show/56844700-traumatic-narcissism-and-recovery\n\n\nYou can hear Dan\u0027s previous appearances on the show here: \nhttps://podcasts.apple.com/am/podcast/traumatic-narcissism-in-politics-w-dan-shaw/id1373939526?i=1000507568685\n\n\nhttps://podcasts.apple.com/am/podcast/collective-disassociation-w-dan-shaw/id1373939526?i=1000508465936\nEpisode link: https://soundcloud.com/indoctrinationshow/bonus-episode-preview-leaving-the-prison-of-shame-and-fear-w-daniel-shaw-lcsw\n\n(video made with https://www.headliner.app)",
      "release": "2022-06-09T23:18:12Z",
      "duration": "00:12:47",
      "explicit": false,
      "youTubeId": "0jd7J8jOd8Q",
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0jd7J8jOd8Q"
      }
    },
    {
      "id": "1799aec3-b152-477e-9017-531c4d28cc1b",
      "title": "Collective Disassociation w/ Dan Shaw",
      "description": "Dan Shaw is a licensed clinical social worker and a psychoanalyst in private practice in New York City and in Nyack New York. He was originally trained as an actor at Northwestern University with the renowned teacher Uta Hagen in New York City. Dan later worked as a missionary for an Indian guru. His eventual recognition of cultic aspects of his organization led him to become an outspoken activist in support of individuals and families. Traumatically abused in cults, simultaneous with leaving this group, Dan began his training in the mental health profession becoming a faculty member and supervisor at the National Institute for the Psychotherapies in New York publishing papers on psychoanalytic inquiry, contemporary psychoanalysis, and psychoanalytic dialogues and most recently published his book, Traumatic Narcissism, Relational Systems of Subjugation for the relational perspective series, which was nominated for the distinguished Gradiva Award in 2018, the International Cultic Studies Association awarded him the Margaret Thaler Singer Award for advancing the understanding of coercive persuasion and undue influence. Dan\u0027s book, Traumatic Narcissism and Recovery, Leaving the Prison of Shame and Fear, will be published by Routledge in 2021.\n\nDan and Rachel discuss how the collective disassociation of the U.S. from its own brutal origins has shaped the current political landscape and is in fact a case of \u0022history not remembered is repeated\u0022 They consider possible solutions by utilizing early education and collaborative de-radicalization. Dan provides his analysis of the roots of the sociological issues in the country that have led to tragic events such as the Capitol Insurrection.\n\nBefore You Go: Rachel explains the dangers of under-educating citizens about the historical abuses perpetrated by systems of control. She describes the part of human nature that can ultimately lead to a cyclical repetition of historical tragedies.\n\nThanks to our newest Patreon supporters: Ron Mortenson, Katherine Matheson, Sarah Wood, and Marlene Pine\n\nHelp us continue the show at:\nwww.patreon.com/indoctrination",
      "release": "2021-02-12T03:25:33Z",
      "duration": "00:41:48",
      "explicit": false,
      "youTubeId": "FfLVz99vOjA",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FfLVz99vOjA"
      }
    },
    {
      "id": "638c730b-9af4-40e2-b951-3e0ed47ad7d2",
      "title": "Traumatic Narcissism in Politics w/ Dan Shaw",
      "description": "Dan Shaw is a licensed clinical social worker and a psychoanalyst in private practice in New York City and in Nyack New York. He was originally trained as an actor at Northwestern University with the renowned teacher Uta Hagen in New York City. Dan later worked as a missionary for an Indian guru. His eventual recognition of cultic aspects of his organization led him to become an outspoken activist in support of individuals and families. Traumatically abused in cults, simultaneous with leaving this group, Dan began his training in the mental health profession becoming a faculty member and supervisor at the National Institute for the Psychotherapies in New York publishing papers on psychoanalytic inquiry, contemporary psychoanalysis, and psychoanalytic dialogues and most recently publishing his book, Traumatic Narcissism, Relational Systems of Subjugation for the relational perspective series, which was nominated for the distinguished Gradiva Award in 2018, the International Cultic Studies Association awarded him the Margaret Thaler Singer Award for advancing the understanding of coercive persuasion and undue influence. Dan\u0027s book, Traumatic Narcissism and Recovery, Leaving the Prison of Shame and Fear, will be published by Routledge in 2021.\n\nDan and Rachel discuss the current U.S. political landscape as it relates to traumatic narcissism. They go in-depth on the delusion of the current conspiracy theories that are a result in part of the political indoctrination created by malignant narcissists in power.\n\nBefore You Go: Rachel discusses the destructive potential inherent when narcissists gain significant political power. She continues by expanding on Dan\u0027s idea of invisible mania as it relates to political extremists such as Qanon supporters.\n\nThanks to our newest Patreon supporters: Evanne Heath and Muriel Barton!\nTo help support the show and get cool benefits like bonus content and merchandise, please become a patron at www.patreon.com/indoctrination\n\nAlready a patron? Follow this link to learn how to upgrade your tier on Patreon to get even more benefits!\n\nsupport.patreon.com/hc/en-us/articl…o%20switch%20to",
      "release": "2021-02-07T06:34:06Z",
      "duration": "00:55:57",
      "explicit": false,
      "youTubeId": "JKzp07SePY4",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JKzp07SePY4"
      }
    }
  ]
}