{
  "id": "d657eb9b-5643-4f00-8965-b06b5b83e9ac",
  "name": "Radical Resilience",
  "spotifyId": "7f836JeCFSd8ywkeKGyEek",
  "appleId": 1605271532,
  "episodes": [
    {
      "id": "fc7d3589-38b9-4dac-b29d-7b39c1a85899",
      "title": "The Escape with Martha Kartaoui",
      "description": "Martha Kartaoui was born and grew up in a dangerous religious cult and escaped at the age of 25. She is resilient and this is her story. Submit your story of resilience to be in The Global Resilience Project Book 2 here: http://www.bit.ly/GRP2023 Learn more about The Global Resilience Project, read the stories of resilience, sign up for the newsletter and submit your story here: https://theglobalresilienceproject.com/ Trigger Warning: The Resilience Project provides an open space for people to share their personal experiences. Some content in this podcast may include topics that you may find difficult. The listener’s discretion is advised. About the Guest: Martha Kartaoui us a Certified Life and Health Coach/Spiritual Mentor, and has over 16 years of experience as a Licensed Therapeutic Massage Therapist. Links: https://instagram.com/marthakartaoui https://www.facebook.com/martha.kartaou www.picwellnessllc.com https://www.facebook.com/PICWELLNESS/ https://instagram.com/picwellness https://www.linkedin.com/in/martha-kartaoui-44318893 About the Host: Blair Kaplan Venables is an expert in social media marketing and the president of Blair Kaplan Communications, a British Columbia-based PR agency. She brings fifteen years of experience to her clients, including global wellness, entertainment and lifestyle brands. She is the creator of the Social Media Empowerment Pillars, has helped her customers grow their followers into the tens of thousands in just one month, win integrative marketing awards and more. USA Today listed Blair as one of the top 10 conscious female leaders in 2022, and Yahoo! listed Blair as a top ten social media expert to watch in 2021. She has spoken on national stages, and her expertise has been featured in media outlets, including Forbes, CBC Radio, Entrepreneur, and Thrive Global. In the summer of 2023, a new show that will be airing on Amazon Prime Video called \u0027My Story\u0027 will showcase Blair\u0027s life story. She is the co-host of the Dissecting Success podcast and the Radical Resilience podcast host. Blair is an international bestselling author and has recently published her second book, \u0027The Global Resilience Project.\u0027 In her free time, you can find Blair growing The Global Resilience Project\u0027s community, where users share their stories of overcoming life\u0027s most challenging moments. Learn more about Blair: https://www.blairkaplan.ca/ The Global Resilience Project; https://theglobalresilienceproject.com/ Alana Kaplan is a compassionate mental health professional based in Winnipeg, Manitoba. She’s a child and family therapist at a Winnipeg-based community agency, and a yoga teacher. Fueled by advocacy, Alana is known for standing up and speaking out for others. Passionate about de-stigmatizing and normalizing mental health, Alana brings her experience to The Global Resilience Project team, navigating the role one’s mental health plays into telling their story. Engaging in self-care and growth is what keeps her going and her love for reading, travel, and personal relationships helps foster that. When she’s not working, Alana can often be found on walks, at the yoga studio, or playing with any animal that she comes across. The Global Resilience Project: https://theglobalresilienceproject.com/ Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode and think that others could benefit from listening, please share it using the social media buttons on this page. Do you have some feedback or questions about this episode? Leave a comment in the section below! Subscribe to the podcast If you would like to get automatic updates of new podcast episodes, you can subscribe to the podcast on Apple Podcasts or on your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review.",
      "release": "2023-07-28T08:00:00Z",
      "duration": "00:27:06.3000000",
      "explicit": true,
      "spotifyId": "3xvoqqHFh0TnMmCOxu7D8y",
      "appleId": 1000622664417,
      "subjects": [
        "Samanta Roy Institute of Science and Technology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3xvoqqHFh0TnMmCOxu7D8y",
        "apple": "https://podcasts.apple.com/podcast/the-escape-with-martha-kartaoui/id1605271532?i=1000622664417"
      }
    }
  ]
}