{
  "_ts": 0,
  "id": "84dd47d3-7f7f-4654-aa9a-70480b469ec2",
  "name": "Radically Genuine Podcast with Dr. Roger McFillin",
  "spotifyId": "4D3FvCjDBW7EYv34XGBx7i",
  "appleId": 1573253801,
  "episodes": [
    {
      "id": "1b1b30ad-122f-43bb-a2a8-4b337b87a54e",
      "title": "122. Inside the Troubled Teen Treatment Industry",
      "description": "Join Elaine Walters as she recounts her journey within the controversial Straight Incorporated, a program claiming to reform teenage drug users through tough love and AA principles. However, the reality was starkly different: with no professional counseling, Straight Incorporated relied on coercive tactics, peer pressure, and mind control to recondition its participants. Elaine sheds light on the absence of adult supervision, the program\u0027s detrimental effects, and her struggle with misdiagnosis and overmedication within the psychiatric system. Surviving Straight Inc Note: This podcast episode is designed solely for informational and educational purposes, without endorsing or promoting any specific medical treatments. We strongly advise consulting with a qualified healthcare professional before making any medical decisions or taking any actions. *If you are in crisis or believe you have an emergency, please contact your doctor or dial 911. If you are contemplating suicide, call 1-800-273-TALK to speak with a trained and skilled counselor. RADICALLY GENUINE PODCAST Dr. Roger McFillin / Radically Genuine Website YouTube @RadicallyGenuine Dr. Roger McFillin (@DrMcFillin) / X (Twitter) Substack | Radically Genuine | Dr. Roger McFillin Instagram @radicallygenuine Contact Radically Genuine —----------- FREE DOWNLOAD! DISTRESS TOLERANCE SKILLS —---------- ADDITIONAL RESOURCES Mother Jones 2007: The Cult That Spawned the Tough-Love Teen Industry Straight Inc - Child Abuse in Residential Treatment | Medical Whistleblower 22:00 - The Stanford Prison Experiment (Summary \u0026#43; Lessons) 37:00 - Suicide in the Age of Prozac - Mad In America 48:00 - X - Dr. Sanil Rege: Antipsychotics Change Brain Networks in FEP 1:09:00 - Boy, Interrupted: A Story of Akathisia - Mad In America 1:11:00 - Radically Genuine Podcast with Dr. Roger McFillin | 64. Medication Induced Akathisia: Chris Paige, LCSW",
      "release": "2024-02-15T08:00:00Z",
      "duration": "01:21:30.0710000",
      "explicit": true,
      "spotifyId": "3i6EznfdK9hnsDu1zSylKL",
      "appleId": 1000645420082,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3i6EznfdK9hnsDu1zSylKL",
        "apple": "https://podcasts.apple.com/podcast/122-inside-the-troubled-teen-treatment-industry/id1573253801?i=1000645420082"
      }
    }
  ]
}