{
  "id": "e1fe54c8-c1d5-44c6-95e1-f636d5d21052",
  "name": "Ratf**ker",
  "spotifyId": "2y6zZGKvWDppNq54Tlc7B3",
  "appleId": 1648374596,
  "episodes": [
    {
      "id": "e7a73d3b-f873-416c-9260-22e052ef5e49",
      "title": "Chapter Three: The Trojan Horse",
      "description": "Thanks to David Wallace and Richard Marsh, the Klondike Papers blew up online - and nothing garnered more attention than Wallace’s claim that there was a plot to get rid of Prime Minister Justin Trudeau. Could it be true? Cherise and Jesse try to get to the bottom of what actually happened, and in doing so discover a complex network of Brethren business with extensive political connections around the globe. Written and reported by Jesse Brown and Cherise Seucharan Audio editing and sound design by Tristan Capacchione Original music by Nathan Burley Additional music by Audio Network Editorial Assistance by Sarah Lawrynuik Executive Producer, Jesse Brown To hear two bonus episodes of Ratfucker right now, support Canadaland by going to: https://canadaland.com/join If you value this podcast, please support us. We rely on listeners like you paying for journalism. As a supporter, you’ll get premium access to all our shows ad free, including early releases and bonus content. You’ll also get our exclusive newsletter, discounts on Canadaland merch, invites and tickets to our live and virtual events, and more than anything, you’ll be a part of the solution to Canada’s journalism crisis and you’ll be keeping our work free and accessible to everybody. Come join us now, click the link in your show notes or go to https://canadaland.com/join You can listen ad-free on Amazon Music—included with Prime. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-14T08:05:28Z",
      "duration": "00:48:44.8780000",
      "explicit": false,
      "spotifyId": "09o7eUIxF5dlAJEPBauw2a",
      "appleId": 1000586076072,
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09o7eUIxF5dlAJEPBauw2a",
        "apple": "https://podcasts.apple.com/podcast/chapter-three-the-trojan-horse/id1648374596?i=1000586076072"
      }
    },
    {
      "id": "f63ac3a7-1dca-4c3f-9edf-719b18ccdc61",
      "title": "Chapter Two: The Brethren",
      "description": "Richard Marsh was born into the Plymouth Brethren Christian Church. He got out of the group he calls a cult and has made it his mission to expose the Brethren for their alleged abuses. Now he’s on the run from Brethren members who’ve been searching for him for years. The man hired to hunt Marsh down? David Wallace. Written and reported by Jesse Brown and Cherise Seucharan Audio editing and sound design by Tristan Capacchione Original music by Nathan Burley Additional music by Audio Network Editorial Assistance by Sarah Lawrynuik Executive Producer, Jesse Brown To hear all of Ratfucker now, plus bonus content, support Canadaland by going to: https://canadaland.com/join If you value this podcast, please support us. We rely on listeners like you paying for journalism. As a supporter, you’ll get premium access to all our shows ad free, including early releases and bonus content. You’ll also get our exclusive newsletter, discounts on Canadaland merch , invites and tickets to our live and virtual events, and more than anything, you’ll be a part of the solution to Canada’s journalism crisis and you’ll be keeping our work free and accessible to everybody. Come join us now, click the link in your show notes or go to https://canadaland.com/join You can listen ad-free on Amazon Music—included with Prime. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-07T08:30:57Z",
      "duration": "00:42:42.8210000",
      "explicit": false,
      "spotifyId": "0hueKV56rKIBv9OM0sbCoM",
      "appleId": 1000585300204,
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hueKV56rKIBv9OM0sbCoM",
        "apple": "https://podcasts.apple.com/podcast/chapter-two-the-brethren/id1648374596?i=1000585300204"
      }
    },
    {
      "id": "57bdc32f-01d1-4744-be4e-7e8cee550269",
      "title": "Chapter One:  The Klondike Papers",
      "description": "Meet David Wallace, political fixer and dirty tricks operative. After a career in the shadows, he’s turned whistleblower, leaking his files and sparking a conspiracy theory. But why? And can he be trusted? Written and reported by Jesse Brown and Cherise Seucharan Audio editing and sound design by Tristan Capacchione Original music by Nathan Burley Additional music by Audio Network Editorial Assistance by Sarah Lawrynuik Executive Producer, Jesse Brown To hear all of Ratfucker now, plus bonus content, support Canadaland by going to: https://canadaland.com/join If you value this podcast, please support us. We rely on listeners like you paying for journalism. As a supporter, you’ll get premium access to all our shows ad free, including early releases and bonus content. You’ll also get our exclusive newsletter, discounts on Canadaland merch , invites and tickets to our live and virtual events, and more than anything, you’ll be a part of the solution to Canada’s journalism crisis and you’ll be keeping our work free and accessible to everybody. Come join us now, click the link in your show notes or go to https://canadaland.com/join Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-31T07:05:30Z",
      "duration": "00:42:34.9840000",
      "explicit": false,
      "spotifyId": "6Vvt3vrJFJ61W8lWi7tUbt",
      "appleId": 1000584461551,
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Vvt3vrJFJ61W8lWi7tUbt",
        "apple": "https://podcasts.apple.com/podcast/chapter-one-the-klondike-papers/id1648374596?i=1000584461551"
      }
    }
  ]
}