{
  "_ts": 0,
  "id": "1b98b5c0-3d3e-443a-945e-f22e7f3e8446",
  "name": "REALWOMEN/REALSTORIES",
  "youTubeChannelId": "UC4KUIwEy5gS6dE3imFyFUTw",
  "episodes": [
    {
      "id": "97e6c5b3-8382-473b-b5d4-13b2e3c908f3",
      "title": "Jonestown: The True Story of the Deadly Mass Murder in 1978 (Cult Documentary)",
      "description": "Featuring never-before-seen footage, this documentary film delivers a startling new look at the Peoples Temple, headed by preacher Jim Jones who, in 1978, led more than 900 members to Guyana, where he orchestrated a mass \u0022suicide\u0022 (murder) via tainted punch.\n\nThe film unfolds chronologically and covers the formative years of Jim Jones\u0027 life and the birth, rise and eventual demise of the Peoples Temple. The story is told through interviews with the surviving members of the Peoples Temple, their family members and the survivors of Congressman Leo Ryan\u0027s ill-fated trip to Guyana.\n\nIn each article, TV special or book about cults, Jonestown can\u0027t be missing. The cult with the largest number of victims in recent history is something to be studied and why many people still believe in those false prophets is not exactly a mystery, but not entirely understood.\n\nThis extremely interesting documentary shows the effects of religion on society and the gullibility of people in general. The parallels and correlations between Jones and so many other religions is amazing, and one should view this documentary with a view to their own personal situation in their religion.\n\nDISCLAIMER: THIS DOCUMENTARY IS UNDER GLOBAL EXCLUSIVE LICENSE FROM WGBH. SHOULD YOU HAVE ANY QUERIES OR QUESTIONS, PLEASE CONTACT US AT: mu@matanuziel.com\n-\nPlease tap the \u0022Thanks\u0022 button under this video or join our Patreon for bonus content and more: \nhttps://www.patreon.com/realwomenrealstories\nFOLLOW US ON LINKEDIN:\nhttps://bit.ly/3HNRmRz",
      "release": "2024-10-12T19:15:06Z",
      "duration": "01:25:33",
      "explicit": false,
      "youTubeId": "hfKr34UmtcQ",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hfKr34UmtcQ"
      }
    },
    {
      "id": "36607dc0-9381-48a2-96ab-912c22c35a75",
      "title": "The End Of The World Cult (Cult \u0026 Child Abuse Documentary)",
      "description": "This documentary concerns a filmmaker who was allowed to have access to a cult in New Mexico....and WHY they allowed this outside into their compound is confusing to say the least.\n\nMichael Travesser used to be a sailor called Wayne Bent. Then he became the self-proclaimed Messiah, claiming to know the exact hour of an apocalyptic event that will mark the end of the world. You might not believe him, but dozens of people did. In fact, they relied on his every word and served him with absolute devotion.\n\nIn this remarkable film, members of Travesser\u0027s cult - the Lord Our Righteousness Church - begin preparing for death as Travesser tells them time is fast running out.\n\nFilmmaker Ben Anthony obtains unique access to the cult\u0027s Strong City compound in New Mexico, USA, to capture the former Seventh Day Adventist minister\u0027s powerful hold over his tribe.\n\nOn December 15, 2008, jurors convicted Travesser (Wayne Bent) of one count of criminal sexual contact of a minor and two counts of contributing to the delinquency of a minor. He was acquitted of a second charge of criminal sexual contact with a minor. Bent was allowed to return to Strong City, the sect\u0027s compound near Clayton, pending sentencing. On December 30, 2008, Judge Gerald Baca imposed the maximum sentence of 18 years but suspended eight years.\n\nWayne Bent was paroled from prison in February 2016 after being diagnosed with a cancer that threatened the hearing in his left ear.\n\nThis documentary is well made and worth seeing. But it might also make you angry... We know it did with us. This is because the parents of one of the abused teens apparently had left the cult and left their underaged daughter in the cult. How can anyone be dumb enough to join a cult? Have they done any research before joining? Why are cult members so incredibly gullible and stupid? Why do cult members believe preposterous things?\n\nDISCLAIMER: GLOBAL EXCLUSIVE LICENSE FROM CHANNEL 4 TO REALWOMEN/REALSTORIES. SHOULD YOU HAVE ANY QUERIES OR QUESTIONS, PLEASE CONTACT US AT: mu@matanuziel.com\n-\nPlease tap the \u0022Thanks\u0022 button under this video or join our Patreon for bonus content and more: \nhttps://www.patreon.com/realwomenrealstories\nFOLLOW US ON LINKEDIN:\nhttps://bit.ly/3HNRmRz",
      "release": "2024-08-31T18:00:07Z",
      "duration": "00:48:30",
      "explicit": false,
      "youTubeId": "ZtvLiQb5vlQ",
      "subjects": [
        "Lord Our Righteousness Church",
        "Seventh-day Adventist Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZtvLiQb5vlQ"
      }
    },
    {
      "id": "5fc7eb6b-1f7a-4ef5-9bfd-86d838cfb3e2",
      "title": "THE JESUS CULT: FRAUDSTERS POSING AS JESUS AND MARY MAGDALENE? (Cult Documentary)",
      "description": "SUBSCRIBE! → https://bit.ly/2CwckC3\n-\nDirected by Thomas Leader, this documentary is about Alan John \u0027AJ\u0027 Miller, an Australian Christian spiritual leader who has claimed to be the resurrected Jesus Christ.\n\nMiller is the leader of Divine Truth, a Christian organization based in Kingaroy, Queensland, which he founded in 2007. His teachings are global, reaching tens of thousands across the internet, and his followers worship him worldwide, funding his existence and tours. Many travel thousands of miles to hear him teach, where he is often accompanied by his partner Mary Suzanne Luck, who claims to be the reincarnation of Mary Magdalene. She had never regarded herself as such prior to meeting Miller.\n\nAlan John Miller has claimed that he can remember \u0027everything\u0027 that has occurred over the past 2000 years. Despite this claim, he claims to be unable to speak Aramaic, the language spoken by Jesus. He has also claimed to have met many prominent historical figures during the afterlife, including Plato, Socrates and Aristotle.\n\nLike many cult leaders, Alan Miller has made numerous \u0027prophecies\u0027 that have turned out to be false. In 2012, he claimed that tsunamis as high as 100 meters would devastate the coasts of Australia. He also encouraged his followers to see the film \u00272012\u0027, as he claimed the events of the film regarding the end of the world would literally eventuate.\n\nAlan John Miller has been heralded by the media as a fantasist, and even a dangerous cult leader. With unique and exclusive access, For the Love of God explores the history of this man\u0027s life. What do you think about it? Give your valuable opinion in the comment section, and if you think more people should watch this documentary, share it on social media and with your friends and family. Be sure to follow us for more updates.\n\nCONTENT LICENSED FROM ESPRESSO MEDIA TO REALWOMEN/REALSTORIES. SHOULD YOU HAVE ANY QUERIES OR QUESTIONS, PLEASE CONTACT US AT: mu@matanuziel.com\n-\n*Please tap the \u0022Thanks\u0022 button under this video or join our Patreon for bonus content and more: \nhttps://www.patreon.com/realwomenrealstories\n*FOLLOW US ON LINKEDIN:\nhttps://bit.ly/3HNRmRz",
      "release": "2023-07-22T20:45:08Z",
      "duration": "00:54:45",
      "explicit": false,
      "youTubeId": "-Q0Q47znpyc",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-Q0Q47znpyc"
      }
    }
  ]
}