{
  "id": "0f19bcd1-fb02-476b-a768-7b94274d8a06",
  "name": "Real Crime",
  "youTubeChannelId": "UC1s9576cQFdQq3QTtTxocmA",
  "episodes": [
    {
      "id": "070e8fd6-4385-4a5d-bc37-ae867a63b94c",
      "title": "What Drove Charles Manson to Kill? Behind The Cult Murders",
      "description": "This documentary takes you deep into the disturbing story of Charles Manson and the infamous Manson Family murders of 1969. You\u0027ll learn about Manson\u0027s turbulent childhood, his early life in and out of institutions, and how he developed the manipulative skills to attract a devoted following. The film details the horrifying events of the Tate and LaBianca murders, revealing the brutality and the twisted ideology of \u0022Helter Skelter\u0022 that fueled these real crime stories. We explore the police investigation, the eventual arrests, and the sensational trial that captivated America. This is the real story behind one of history\u0027s most notorious criminal cases, offering a comprehensive look at the dark secrets and chilling legacy of Charles Manson.\n\nMake sure you subscribe to get your regular crime fix: youtube.com/c/RealCrime\n\nReal Crime On Spotify: https://open.spotify.com/show/0JLjqhHBRN8qMTGKikm97B?si=Fnshg5sfSxmljxiW7wJrZg\n\nAny queries, please contact us at: \nowned-enquiries@littledotstudios.com\n\n#truecrime #realcrime #crime",
      "release": "2025-07-23T19:00:55Z",
      "duration": "00:46:06",
      "explicit": false,
      "youTubeId": "zKaioSDWJxY",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zKaioSDWJxY"
      }
    },
    {
      "id": "28a41bca-e3a6-49fb-9321-e587a85e0d55",
      "title": "The Moonie Cult Exposed By Former Member",
      "description": "Reverend Sun Myung Moon, founder of the Unification Church, claimed to be the Messiah and built a global empire through thought reform, mass weddings, and strict control over followers. Born in North Korea in 1920, he used manipulative recruitment tactics, amassing wealth through businesses and politics. Despite legal troubles, his followers saw him as a persecuted prophet. Many ex-members describe the church as a controlling cult, leaving lasting psychological scars.\n\nMake sure you subscribe to get your regular crime fix: youtube.com/c/RealCrime\n\nAny queries, please contact us at: \nowned-enquiries@littledotstudios.com\n\n#truecrime #realcrime #crime",
      "release": "2025-02-18T19:00:11Z",
      "duration": "00:44:31",
      "explicit": false,
      "youTubeId": "HOgmW7u0F4A",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HOgmW7u0F4A"
      }
    },
    {
      "id": "1306f510-cfe9-4af5-bf63-d8c2645ff923",
      "title": "Jim Jones: The Man Who Caused A Mass Death",
      "description": "In this episode of Cult of Personality tells the story of Jim Jones and the People\u0027s Temple, a church that started with a message of equality and hope but ended in tragedy. Jim Jones was a charismatic leader who brought people together by promising a better world. Over time, he became controlling and abusive, demanding loyalty and money from his followers. He moved his community to a remote jungle in Guyana, where life was hard, and people felt trapped. When outside investigations began, Jones convinced over 900 people to take poison in a mass death at Jonestown in 1978. What began as a dream for a better life became a heartbreaking disaster.\n\nMake sure you subscribe to get your regular crime fix: youtube.com/c/RealCrime\n\n\nAny queries, please contact us at: \nowned-enquiries@littledotstudios.com\n\n#truecrime #realcrime #crime",
      "release": "2025-01-21T18:00:13Z",
      "duration": "00:44:41",
      "explicit": false,
      "youTubeId": "HSDeI8ZQdc8",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HSDeI8ZQdc8"
      }
    },
    {
      "id": "c844a8c7-7d3c-4c36-91d7-ac28a17ba31e",
      "title": "Inside Charles Manson’s Dangerous Cult That Led to Murder",
      "description": "Charles Manson became the leader of a hippie group in the California desert. He used his words to control his followers and convinced them to kill people, including actress Sharon Tate, in 1969. Manson\u0027s ability to manipulate his followers made him the leader of one of the most infamous cults ever.\n\nMake sure you subscribe to get your regular crime fix: youtube.com/c/RealCrime\n\nAny queries, please contact us at: \nowned-enquiries@littledotstudios.com\n\n#truecrime #realcrime #crime",
      "release": "2025-01-07T20:00:28Z",
      "duration": "00:44:57",
      "explicit": false,
      "youTubeId": "gE_u_PJL5_I",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gE_u_PJL5_I"
      }
    },
    {
      "id": "f8e7dffd-1ef1-479e-b070-8a27e44ec054",
      "title": "The Shocking Crime Revelations Inside Ultra-Orthodox Jewish Sect (Full Documentary) | Real Crime",
      "description": "Revealing the crimes of child sex abuse in Australia and focusing on the ultra-orthodox Jewish sect Chabad. It highlights the story of Manny Wax, a survivor of child sex abuse in the Chabad community, who exposed the scandal and became the public face of it. Three individuals were arrested and convicted of child sex crimes as a result of Manny\u0027s revelations. The video also mentions a royal commission examining the ultra-orthodox attitudes that may have hindered victims from speaking out about the abuse. The live webcast of the commission was watched by many and it was the most watched since the commission began in 2013.\n\nMake sure you subscribe to get your regular crime fix: youtube.com/c/RealCrime\n\nFrom \u0022Breaking the Silence\u0022\n\nContent licensed from Sideways Film to Little Dot Studios.\nAny queries, please contact us at: \nowned-enquiries@littledotstudios.com",
      "release": "2023-02-18T19:30:02Z",
      "duration": "00:57:49",
      "explicit": false,
      "youTubeId": "T68_Sv-dR8g",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T68_Sv-dR8g"
      }
    },
    {
      "id": "12eac3ed-dbd2-470f-87af-433228f1677f",
      "title": "The Murderous Cult Of Nation Of Yahweh | The FBI Files | Real Crime",
      "description": "The \u0027R.I.C.O.\u0027 investigation of the Nation of Yahweh and its former leader, Yahweh ben Yahweh.\n\nThe decapitation of a young African-American male led the Miami-Dade police and the FBI along a trail of death. Authorities discovered that the man was a dissident member of a religious cult headed by a man who called himself Yahweh ben Yahweh, or \u0027God, Son of God\u0027.\n\nMake sure you subscribe to get your regular crime fix: youtube.com/c/RealCrime\n\nFrom The FBI Files S3 EP10\n\nContent licensed from New Dominion Pictures to Little Dot Studios.\nAny queries, please contact us at: \nowned-enquiries@littledotstudios.com",
      "release": "2020-05-16T20:30:02Z",
      "duration": "00:50:06",
      "explicit": false,
      "youTubeId": "xVg2lGBibZc",
      "subjects": [
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xVg2lGBibZc"
      }
    }
  ]
}