{
  "id": "1b98b5c0-3d3e-443a-945e-f22e7f3e8446",
  "name": "REALWOMEN/REALSTORIES",
  "spotifyId": "",
  "appleId": null,
  "youTubeChannelId": "UC4KUIwEy5gS6dE3imFyFUTw",
  "episodes": [
    {
      "id": "5fc7eb6b-1f7a-4ef5-9bfd-86d838cfb3e2",
      "title": "THE JESUS CULT: FRAUDSTERS POSING AS JESUS AND MARY MAGDALENE? (Cult Documentary)",
      "description": "SUBSCRIBE! → https://bit.ly/2CwckC3\n-\nDirected by Thomas Leader, this documentary is about Alan John \u0027AJ\u0027 Miller, an Australian Christian spiritual leader who has claimed to be the resurrected Jesus Christ.\n\nMiller is the leader of Divine Truth, a Christian organization based in Kingaroy, Queensland, which he founded in 2007. His teachings are global, reaching tens of thousands across the internet, and his followers worship him worldwide, funding his existence and tours. Many travel thousands of miles to hear him teach, where he is often accompanied by his partner Mary Suzanne Luck, who claims to be the reincarnation of Mary Magdalene. She had never regarded herself as such prior to meeting Miller.\n\nAlan John Miller has claimed that he can remember \u0027everything\u0027 that has occurred over the past 2000 years. Despite this claim, he claims to be unable to speak Aramaic, the language spoken by Jesus. He has also claimed to have met many prominent historical figures during the afterlife, including Plato, Socrates and Aristotle.\n\nLike many cult leaders, Alan Miller has made numerous \u0027prophecies\u0027 that have turned out to be false. In 2012, he claimed that tsunamis as high as 100 meters would devastate the coasts of Australia. He also encouraged his followers to see the film \u00272012\u0027, as he claimed the events of the film regarding the end of the world would literally eventuate.\n\nAlan John Miller has been heralded by the media as a fantasist, and even a dangerous cult leader. With unique and exclusive access, For the Love of God explores the history of this man\u0027s life. What do you think about it? Give your valuable opinion in the comment section, and if you think more people should watch this documentary, share it on social media and with your friends and family. Be sure to follow us for more updates.\n\nCONTENT LICENSED FROM ESPRESSO MEDIA TO REALWOMEN/REALSTORIES. SHOULD YOU HAVE ANY QUERIES OR QUESTIONS, PLEASE CONTACT US AT: mu@matanuziel.com\n-\n*Please tap the \u0022Thanks\u0022 button under this video or join our Patreon for bonus content and more: \nhttps://www.patreon.com/realwomenrealstories\n*FOLLOW US ON LINKEDIN:\nhttps://bit.ly/3HNRmRz",
      "release": "2023-07-22T20:45:08Z",
      "duration": "00:54:45",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "-Q0Q47znpyc",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=-Q0Q47znpyc"
      }
    }
  ]
}