{
  "_ts": 0,
  "id": "45a48bb8-390d-4631-ac5e-79488e39dcab",
  "name": "Real Talk with Rachel Awtrey",
  "spotifyId": "24uwT9w4Vpw2vhPz7xCWK0",
  "appleId": 1386475315,
  "youTubeChannelId": "UCwgS8ZRVm3Ivk_yvOJguyuw",
  "episodes": [
    {
      "id": "6a864296-c50a-4a35-91ae-9dd69313477c",
      "title": "Cult Confessions: Bethany Joy Lenz Tells All | Episode 314",
      "description": "Bethany Joy Lenz spent a decade in a cult—now, she’s revealing the shocking truths she uncovered, the mind games that kept her trapped, and the lessons that changed her forever. In this episode, she opens up about manipulation, control, and the road to freedom and what Jesus teaches all of us through it. CONNECT FURTHER WITH RACHEL: https://rachelawtrey.com/ SOCIAL MEDIA: https://www.instagram.com/realtalkpodcast https://www.instagram.com/rachel.awtrey/ CONTACT: podcast@rachelawtrey.com This video/podcast may contain affiliate links, sponsorships, or products I’ve received for free. I only share things I truly love and think will bring you value. If you purchase through my links, I may earn a small commission at no extra cost to you. Thanks for your support! ADVERTISE ON THE SHOW: To inquire about host-read ads or to become the show’s next Presenting Sponsor, please send an email to podcast@rachelawtrey.com or those at That Sounds Fun Network. EPISODE CREDITS: Podcast Cover Photography: Jay Barr Photography Intro Music: \u0022Luxurious\u0022 by Sunny Tones DISCLAIMERS: The views and opinions expressed in each episode are those of the individual contributors and do not necessarily reflect those of the podcast host and team or the owner of this Intellectual Property. This podcast is not an authority of legal advice, and listeners are encouraged to seek professional counsel with regard to their brand, business, and otherwise. We all hope you enjoy and find value in each episode. Many of the product and service promotions in each episode are under the negotiated terms of affiliate or sponsorship agreements. If a link is clicked and a purchase is made, an affiliate commission may be received. However, we recommend products or services that we personally endorse and believe may be beneficial to others. This information is disclosed in accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising.\u0022 Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-02-12T10:00:00Z",
      "duration": "00:31:07.4980000",
      "explicit": false,
      "spotifyId": "7udj4sDWDPb4WQW5Z5HDLT",
      "appleId": 1000691366496,
      "youTubeId": "b9iTp5lZO4U",
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7udj4sDWDPb4WQW5Z5HDLT",
        "apple": "https://podcasts.apple.com/podcast/cult-confessions-bethany-joy-lenz-tells-all-episode-314/id1386475315?i=1000691366496",
        "youtube": "https://www.youtube.com/watch?v=b9iTp5lZO4U"
      }
    }
  ]
}