{
  "_ts": 0,
  "id": "32383926-8e88-4508-8e9c-808fc507e603",
  "name": "Real Stories",
  "youTubeChannelId": "UCu4XcDBdnZkV6-5z2f16M0g",
  "episodes": [
    {
      "id": "70a2fe8c-5ff3-4e7a-8f8c-4129d976ebd7",
      "title": "David Koresh: Inside the Final Moments of a Cult Leader",
      "description": "Today we revisit the 51-day Waco standoff between David Koresh\u0027s Branch Davidians and the FBI, revealing the dramatic clash of faith and power that led to a tragic conclusion. While witnessing Koresh\u0027s rise as a charismatic leader, exploring his controversial teachings, and examining the escalating tension from the ATF raid to the final fire. Through firsthand accounts, we explore the complex motivations and failures that continue to fuel debate.\n\nInstagram - @realstoriesdocs\n\n\nAny queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2025-04-19T17:00:59Z",
      "duration": "00:45:57",
      "explicit": false,
      "youTubeId": "p5wi5KI8M-s",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=p5wi5KI8M-s"
      }
    },
    {
      "id": "925e2a11-668f-4dfa-a78d-57dd4de0051f",
      "title": "Our Father, The Manic Cult Leader",
      "description": "MANIC chronicles the filmmaker\u0027s struggle to make sense of the legacy of mental illness wreaking havoc over her siblings’ lives.\nConvinced that her father holds a key piece of the puzzle, she sets out to find the truth about him, and discovers a man known alternately as a cult leader, a scam artist, a prophet, and a father of fifteen.\n\nA man whose charisma and visions brought people together under the promise of spiritual enlightenment but left behind a legacy of pain and betrayal. Born George Edwards, he was no ordinary man. With a larger-than-life personality and unshakable confidence, he rose to become the self-proclaimed prophet of a close-knit yet deeply fractured community.\n\nHis followers saw him as a savior, a guiding light who promised to unlock the mysteries of the universe. But behind the scenes, Sean’s manic episodes and unchecked power spiraled into chaos. Families were torn apart, relationships were strained, and what began as a hopeful movement turned into a cautionary tale of manipulation and disillusionment.\n\nInstagram - @realstoriesdocs\n\nAny queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2025-01-04T18:00:31Z",
      "duration": "01:25:41",
      "explicit": false,
      "youTubeId": "VCRf_qazO9s",
      "subjects": [
        "The Significants",
        "Herbalife"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VCRf_qazO9s"
      }
    },
    {
      "id": "deab4d48-d658-4e4f-a885-13d99fc6043b",
      "title": "Growing Up In A Doomsday Cult: David Berg \u0026 The Children of God",
      "description": "In this eye-opening documentary, join us as we delve into the unsettling world of The Children Of God cult. Led by the charismatic David Berg, this group initially appeared as a beacon of hope during the hippie movement but hid a dark reality of manipulation and abuse.\n\nDiscover the shocking practices and deceptive tactics used by Berg to control his followers, exploiting their trust and twisting religious teachings for his own gain. Through gripping testimonies and insights, we unravel the psychological impact on individuals raised within the cult, shedding light on the importance of awareness and critical thinking in preventing manipulation.\n\nJoin us on this journey to uncover the truth behind The Children Of God, and gain valuable insights into recognizing and guarding against manipulation tactics in any setting. Whether you\u0027re a skeptic, seeker, or simply curious, this documentary offers a compelling narrative that will leave you informed and empowered.\n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\nContent licensed from Red Arrow Studios. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-05-26T15:00:23Z",
      "duration": "00:45:26",
      "explicit": false,
      "youTubeId": "LCFyGp_m9ic",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LCFyGp_m9ic"
      }
    },
    {
      "id": "56c456de-ca7e-430f-9ffc-449212f6b4e4",
      "title": "How To Escape A Cult: Ex’s Members Of Warren Jeff’s Fundamentalist Mormon Church Tell Their Stories",
      "description": "The chilling truth behind life in a secretive cult. In this gripping documentary, we unravel the mysteries of Warren Jeffs\u0027 tyrannical rule and the courageous journeys of those who dared to break free.\n\nFrom forced marriages to unimaginable abuse, follow the heart-wrenching stories of individuals trapped within Jeffs\u0027 grasp. Their struggles and triumphs will keep you on the edge of your seat, shedding light on the harsh realities faced by cult members.\n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\n\nContent licensed from Red Arrow Studios. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-05-12T17:30:01Z",
      "duration": "00:46:26",
      "explicit": false,
      "youTubeId": "500AGPW9nL8",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=500AGPW9nL8"
      }
    },
    {
      "id": "a9f10d1b-861c-4197-baa3-1f160e16ee92",
      "title": "The FBI\u0027s Waco Siege: David Koresh’s 51-Day Last Stand (Cult Documentary) | @RealStories",
      "description": "An in-depth look into the life of David Koresh, the enigmatic leader at the heart of the Waco Siege saga, peeling back the layers to uncover the untold stories and hidden motivations that drove his followers to the edge.\n\nFrom the shocking truths behind Koresh\u0027s apocalyptic prophecies, to his manipulation of followers, and the tragic events that led to the infamous 1993 Waco siege.\n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\nContent licensed from True Vision. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-04-27T23:00:33Z",
      "duration": "00:45:33",
      "explicit": false,
      "youTubeId": "ziciNZ0-bB4",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ziciNZ0-bB4"
      }
    },
    {
      "id": "bbd77317-c755-413c-a555-902674d4a6d3",
      "title": "Messiah Or Manipulator?: Escaping the Grip of Sun Myung Moon\u0027s Unification Church (Cult Documentary)",
      "description": "Ever wondered what goes on behind closed doors in a cult? Join us as we uncover the truth behind Reverend Moon\u0027s charismatic persona and the devoted followers who see him as nothing short of a Messiah. Through firsthand accounts from former members, you\u0027ll get an inside look at how the Unification Church operates, from its intense indoctrination methods to its control over every aspect of its members\u0027 lives, including their marriages.\n\nFrom Reverend Moon\u0027s early days claiming clairvoyance to his encounters with religious figures, we\u0027ll trace the origins of the Unification Church and its rise to prominence in South Korea in the 1950s.\n\nBut it\u0027s not all spiritual enlightenment – we\u0027ll also shine a light on the darker side of Reverend Moon\u0027s empire, from his controversial support for politicians like Richard Nixon to his brushes with the law over tax evasion\n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\n\nContent licensed from [DISTRIBUTOR]. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-04-21T17:30:00Z",
      "duration": "00:45:15",
      "explicit": false,
      "youTubeId": "1coLKJq6x9U",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1coLKJq6x9U"
      }
    },
    {
      "id": "7a20b49b-a107-49d6-852b-a78ca6fd6626",
      "title": "How Charles Manson Manipulated People Into Committing Murder (Cult Documentary) | @RealStories",
      "description": "Uncover the dark charisma and manipulation tactics of Charles Manson. Join us as we explore how Manson\u0027s hippie commune turned into a murderous cult, shaking the foundations of the Summer of Love in 1969.\n\nIn this gripping narrative, we hear firsthand accounts from Diane Lake, the youngest member of the Manson Family, revealing the seductive allure and terrifying reality of life under Manson\u0027s spell.\n\nInstagram - @realstoriesdocs\n\nContent licensed from Red Arrow Studios. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-04-14T17:30:01Z",
      "duration": "00:45:41",
      "explicit": false,
      "youTubeId": "MNrs8OL9zd8",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MNrs8OL9zd8"
      }
    },
    {
      "id": "1a69bf10-d695-4317-b239-f1da00228ac0",
      "title": "From Preacher to Tyrant: The Rise and Fall of Jim Jones (Cult Documentary) | @RealStories",
      "description": "🎥 Ready to explore the captivating yet chilling story of the People\u0027s Temple and its charismatic leader, Jim Jones? Welcome to \u0022Cult of Personality,\u0022 where we unravel the gripping tale behind one of history\u0027s most infamous cults.\n\n🔍 Join us as we delve into the intriguing journey of the People\u0027s Temple, from its early days of inclusivity to the shocking depths of manipulation and tragedy under Jim Jones\u0027 reign.\n\n💡 Discover the psychological tactics used by cult leaders to maintain control and loyalty, including staged threats and simulated attacks to test devotion.\n\n🌎 Follow along as we trace the cult\u0027s path from Indiana to California and finally to the remote jungles of Jonestown, Guyana, where the world was rocked by the devastating events of the Jonestown massacre in 1978.Twitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\nContent licensed from Red Arrow Studios. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-04-01T17:30:00Z",
      "duration": "00:45:25",
      "explicit": true,
      "youTubeId": "31flnQNlN4g",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=31flnQNlN4g"
      }
    },
    {
      "id": "f890fd5c-3a8e-46e2-a2ee-7fe79aacadc0",
      "title": "American Heretics: The Politics of the Gospel (Christian Nationalism Documentary) | Real Stories",
      "description": "American Heretics: The Politics of the Gospel takes audiences into the buckle of Bible belt where a group of defiant ministers, congregations, and community leaders are challenging deeply rooted fundamentalist Christian doctrine in favor of a Gospel of Inclusion. Labeled as “heretics” for their beliefs and actions, they refuse to wield their faith as a sword sharpened by literal interpretations of the Bible. Especially those fundamentalist Christian interpretations that continue to justify nationalism and hack away at landmark civil rights protections for women, minorities, immigrants, and the LGBTQ communities. \n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\nSubscribe to Real Stories #Shorts for bitesize documentary content: shorturl.at/dAKT3\n\nContent licensed from [MVD]. Any queries, please contact us at: owned-enquiries@littledotstudios.com\n \n\nIf you loved this film, Real Stories has hundreds more full-length documentaries, click the link to enjoy: http://bit.ly/1GOzpIu",
      "release": "2022-07-21T16:00:15Z",
      "duration": "01:27:09",
      "explicit": false,
      "youTubeId": "B-ePCiUgD0Y",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=B-ePCiUgD0Y"
      }
    },
    {
      "id": "feb42b8d-c687-4dbc-a60a-1e7c9a8b6894",
      "title": "The Brain Washing of My Dad (Family Non-Ficton Film) | Real Stories",
      "description": "Jen Senko, a documentary filmmaker, looks at the rise of right-wing media through the lens of her WWII vet father who changed from a life-long, nonpolitical Democrat to an angry, right-wing fanatic after his discovery of talk radio on a lengthened commute to work.\n\nIn trying to understand how this happened, she not only finds this to be a phenomenon, but also uncovers some of the forces behind it: a plan by Roger Ailes under Nixon to create a media for the GOP; the Lewis Powell Memo, urging business leaders to influence institutions of public opinion - especially the universities - the media and the courts; and under Reagan, the dismantling of the Fairness Doctrine - all of which helped to change the entire country\u0027s direction and culture, misinformed millions, divided families and even the country itself.\n\nFrom The Brain Washing of My Dad (2015)\n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\nReal Stories Tapes: True Crime is a brand new podcast hosted by Emmy-nominated TV host and true-crime obsessive Stephanie Bauer (Searching For...). It takes some of the most popular true-crime documentaries on your Real Stories channel and transforms them into riveting audio, meaning you can enjoy them wherever you listen to your podcasts. https://podfollow.com/real-stories-tapes-true-crime \n\nContent licensed from Blue Ant International. Any queries, please contact us at: owned-enquiries@littledotstudios.com\n\n\nIf you loved this film, Real Stories has hundreds more full-length documentaries, click the link to enjoy: http://bit.ly/1GOzpIu",
      "release": "2021-09-30T16:00:17Z",
      "duration": "01:29:36",
      "explicit": false,
      "youTubeId": "FS52QdHNTh8",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FS52QdHNTh8"
      }
    },
    {
      "id": "3bc3f3e8-ee0e-46ea-aa95-f735fd39f094",
      "title": "Reggie Yates \u0026 South Africa\u0027s Millionaire Preacher | Real Stories Full-Length Documentary",
      "description": "South Africa\u0027s Millionaire Preacher | Reggie Yates Extreme | Real Stories\n\nReggie Yates concludes his travels around South African communities by spending a week with Prophet Mboro - a charismatic yet controversial church leader who is adored by his thousands of followers, and renowned as much for his dancing as he is for the \u0060miracles\u0027 he performs. Boasting a collection of expensive cars and wearing an array of jewelry, Mboro has emerged a millionaire from the boom in Pentecostal \u0060mega-churches\u0027. The former BBC Radio DJ asks if Mboro can possibly be a messenger from God and confronts some home truths when recalling the time he rejected the African Pentecostal faith. \n\nFrom Reggie Yates\u0027 Extreme South Africa: The Millionaire Preacher\n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\nTo listen to some of the best new documentary filmmakers talk on The Doc Exchange podcast, click this link: https://podfollow.com/the-doc-exchange-a-real-stories-podcast/view\n\nContent licensed from Silverlining TV. Any queries, please contact us at: owned-enquiries@littledotstudios.com\n\nIf you loved this film, Real Stories has hundreds of more full-length documentaries, click the link to enjoy: http://bit.ly/1GOzpIu\n\nSouth Africa\u0027s Millionaire Preacher | Reggie Yates Extreme | Real Stories",
      "release": "2021-03-13T17:00:09Z",
      "duration": "00:50:15",
      "explicit": false,
      "youTubeId": "On18k9npMus",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=On18k9npMus"
      }
    },
    {
      "id": "e04f50cb-c2e4-4edb-81ec-07d42c512caa",
      "title": "The Church: Code of Silence (Corrupt Priest Documentary) | Real Stories",
      "description": "Secret internal documents reveal how church officials have protected priests accused of pedophilia by moving them from country-to-country, sometimes as far away as to Africa. They call it \u0027the geographical solution\u0027. Even Pope Francis is implicated. When he was bishop of Buenos Aires, he tried to influence the Argentinean justice system in order to protect a convicted priest. \n\nFrom Cameroon to Argentina, America to France and Italy, this investigation traces the transfers of pedophile priests.\n\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\nTwitter: https://twitter.com/realstoriesdocs\n\nContent licensed from Java Films. Any queries, please contact us at: owned-enquiries@littledotstudios.com\n\n\n\nWant to watch more full-length Documentaries? \nClick here: http://bit.ly/1GOzpIu",
      "release": "2019-11-16T18:00:03Z",
      "duration": "00:53:38",
      "explicit": false,
      "youTubeId": "R3Mdd56mx3o",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R3Mdd56mx3o"
      }
    },
    {
      "id": "a82aed38-24aa-47a7-997f-f47de61e6704",
      "title": "For The Love Of God: The Man Who Thinks He\u0027s Jesus (Cult Documentary) | Real Stories",
      "description": "For the Love of God is a unique and compelling documentary examining the world of a man who believes he has had a 2000 year existence as Jesus Christ. Featured on Sky News, ITV’s This Morning, and the BBC, former IT worker Alan John Miller has been heralded by the media as a fantasist, and even a dangerous cult leader. However, his teachings are global, reaching tens of thousands across the internet, and his followers worship him worldwide, funding his existence and tours. Many travel thousands of miles to hear him teach, where he is often accompanied by his partner Mary Magdalene.\n\nWant to watch more full-length Documentaries? \nClick here: http://bit.ly/1GOzpIu\n\nFollow us on Twitter for more - https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\nFor The Love Of God: The Man Who Thinks He\u0027s Jesus (Cult Documentary) - Real Stories",
      "release": "2018-02-22T18:00:05Z",
      "duration": "00:58:00",
      "explicit": false,
      "youTubeId": "hXpLVmL2esw",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hXpLVmL2esw"
      }
    },
    {
      "id": "9b40911d-268a-4a0b-91d1-e66295990282",
      "title": "One Man, Six Wives And 29 Children",
      "description": "A 51-year-old Mormon with six wives and 29 children considers taking a seventh wife, a decision which is complicated by his son\u0027s affection for the same woman.\n\nWant to watch more full-length Documentaries? \nClick here: http://bit.ly/1GOzpIu\n\nFacebook - https://www.facebook.com/RealStoriesC...\nInstagram - @realstoriesdocs\nTwitter: https://twitter.com/realstoriesdocs\n\n\nContent licensed from Digital Rights Group (DRG). Any queries, please contact us at: owned-enquiries@littledotstudios.com\n\nProduced by United Productions\nOne Man Has Six Wives And 29 Children (Polygamy Documentary) - Real Stories",
      "release": "2016-12-09T17:00:03Z",
      "duration": "00:49:34",
      "explicit": false,
      "youTubeId": "vqORJHyNWJc",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vqORJHyNWJc"
      }
    }
  ]
}