{
  "_ts": 0,
  "id": "32383926-8e88-4508-8e9c-808fc507e603",
  "name": "Real Stories",
  "youTubeChannelId": "UCu4XcDBdnZkV6-5z2f16M0g",
  "episodes": [
    {
      "id": "56c456de-ca7e-430f-9ffc-449212f6b4e4",
      "title": "How To Escape A Cult: Ex’s Members Of Warren Jeff’s Fundamentalist Mormon Church Tell Their Stories",
      "description": "The chilling truth behind life in a secretive cult. In this gripping documentary, we unravel the mysteries of Warren Jeffs\u0027 tyrannical rule and the courageous journeys of those who dared to break free.\n\nFrom forced marriages to unimaginable abuse, follow the heart-wrenching stories of individuals trapped within Jeffs\u0027 grasp. Their struggles and triumphs will keep you on the edge of your seat, shedding light on the harsh realities faced by cult members.\n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\n\nContent licensed from Red Arrow Studios. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-05-12T17:30:01Z",
      "duration": "00:46:26",
      "explicit": false,
      "youTubeId": "500AGPW9nL8",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=500AGPW9nL8"
      }
    },
    {
      "id": "a9f10d1b-861c-4197-baa3-1f160e16ee92",
      "title": "The FBI\u0027s Waco Siege: David Koresh’s 51-Day Last Stand (Cult Documentary) | @RealStories",
      "description": "An in-depth look into the life of David Koresh, the enigmatic leader at the heart of the Waco Siege saga, peeling back the layers to uncover the untold stories and hidden motivations that drove his followers to the edge.\n\nFrom the shocking truths behind Koresh\u0027s apocalyptic prophecies, to his manipulation of followers, and the tragic events that led to the infamous 1993 Waco siege.\n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\nContent licensed from True Vision. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-04-27T23:00:33Z",
      "duration": "00:45:33",
      "explicit": false,
      "youTubeId": "ziciNZ0-bB4",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ziciNZ0-bB4"
      }
    },
    {
      "id": "bbd77317-c755-413c-a555-902674d4a6d3",
      "title": "Messiah Or Manipulator?: Escaping the Grip of Sun Myung Moon\u0027s Unification Church (Cult Documentary)",
      "description": "Ever wondered what goes on behind closed doors in a cult? Join us as we uncover the truth behind Reverend Moon\u0027s charismatic persona and the devoted followers who see him as nothing short of a Messiah. Through firsthand accounts from former members, you\u0027ll get an inside look at how the Unification Church operates, from its intense indoctrination methods to its control over every aspect of its members\u0027 lives, including their marriages.\n\nFrom Reverend Moon\u0027s early days claiming clairvoyance to his encounters with religious figures, we\u0027ll trace the origins of the Unification Church and its rise to prominence in South Korea in the 1950s.\n\nBut it\u0027s not all spiritual enlightenment – we\u0027ll also shine a light on the darker side of Reverend Moon\u0027s empire, from his controversial support for politicians like Richard Nixon to his brushes with the law over tax evasion\n\nTwitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\n\nContent licensed from [DISTRIBUTOR]. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-04-21T17:30:00Z",
      "duration": "00:45:15",
      "explicit": false,
      "youTubeId": "1coLKJq6x9U",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1coLKJq6x9U"
      }
    },
    {
      "id": "7a20b49b-a107-49d6-852b-a78ca6fd6626",
      "title": "How Charles Manson Manipulated People Into Committing Murder (Cult Documentary) | @RealStories",
      "description": "Uncover the dark charisma and manipulation tactics of Charles Manson. Join us as we explore how Manson\u0027s hippie commune turned into a murderous cult, shaking the foundations of the Summer of Love in 1969.\n\nIn this gripping narrative, we hear firsthand accounts from Diane Lake, the youngest member of the Manson Family, revealing the seductive allure and terrifying reality of life under Manson\u0027s spell.\n\nInstagram - @realstoriesdocs\n\nContent licensed from Red Arrow Studios. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-04-14T17:30:01Z",
      "duration": "00:45:41",
      "explicit": false,
      "youTubeId": "MNrs8OL9zd8",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MNrs8OL9zd8"
      }
    },
    {
      "id": "1a69bf10-d695-4317-b239-f1da00228ac0",
      "title": "From Preacher to Tyrant: The Rise and Fall of Jim Jones (Cult Documentary) | @RealStories",
      "description": "🎥 Ready to explore the captivating yet chilling story of the People\u0027s Temple and its charismatic leader, Jim Jones? Welcome to \u0022Cult of Personality,\u0022 where we unravel the gripping tale behind one of history\u0027s most infamous cults.\n\n🔍 Join us as we delve into the intriguing journey of the People\u0027s Temple, from its early days of inclusivity to the shocking depths of manipulation and tragedy under Jim Jones\u0027 reign.\n\n💡 Discover the psychological tactics used by cult leaders to maintain control and loyalty, including staged threats and simulated attacks to test devotion.\n\n🌎 Follow along as we trace the cult\u0027s path from Indiana to California and finally to the remote jungles of Jonestown, Guyana, where the world was rocked by the devastating events of the Jonestown massacre in 1978.Twitter: https://twitter.com/realstoriesdocs\nFacebook - https://www.facebook.com/RealStoriesChannel\nInstagram - @realstoriesdocs\n\nContent licensed from Red Arrow Studios. Any queries, please contact us at: owned-enquiries@littledotstudios.com",
      "release": "2024-04-01T17:30:00Z",
      "duration": "00:45:25",
      "explicit": true,
      "youTubeId": "31flnQNlN4g",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=31flnQNlN4g"
      }
    }
  ]
}