{
  "id": "35affc3b-cf41-4ccc-a784-d46794250b79",
  "name": "Real Housewives Recaps",
  "youTubeChannelId": "UCvMAbIHDKjDFvmDE7nA6BuQ",
  "episodes": [
    {
      "id": "b11154a4-5f25-4173-9967-6f53c6363d6e",
      "title": "Meghan Markle and the 7M Dancer Cult Connection",
      "description": "Hi All! Today we were minding our business watching Netflix Dancing For The Devil the 7M TikTok Cult, you know as you do, and I found a connection to Meghan Markle! I explain the connection and it leads to so many questions. Including what would Harry be like in a cult? Would he demand a birthday horse? \n\nDancing for the Devil: The 7M TikTok Cult is a 2024 American documentary film that centers around the cult allegations against 7M Films, a company which had recruited TikTok dancers, and follows the life of Miranda Wilking. A three-episode series, it was directed by Derek Doneen and was released on May 29, 2024, on Netflix. \n\nHarry \u0026 Meghan is an American documentary series streaming on Netflix, and starring Prince Harry, Duke of Sussex and Meghan, Duchess of Sussex. The series has six parts and covers the couple\u0027s relationship from their early courtship to their decision to step back as working members of the British royal family and their subsequent activities. The series also includes interviews with family, friends, historians, and journalists. It is being released in two volumes, on December 8 and December 15, 2022, respectively. \n\nharry and meghan, netflix, netflix series, meghan and harry, meghan markle, tired of narcissists, tiktoks, viral tiktoks, sugars, Politico article, Meghan Markle is a Narcissist, narcissist, narcissistic, politico, meghan markle news, prince harry, prince harry miserable, piers morgan, meghan markle narcissistic, meghan markle curtsey, meghan markle curtsy, suits, meghan markle lies, meghan markle interview, south park, south park harry and meghan, southpark, south park meghan and harry, zadok the priest, neil sean, archewell, archewell investigation, tom parker bowles, tom bradby meghan markle full interview, spare us, samantha markle, zadok the priest coronation anthem, meghan markle fashion, robert jobson,\n\n#harryandmeghan #netflix #netflixseries #netflixseries2022 #meghanandharry #meghanmarkle #meghanmarkleandprinceharry #harry #princessdiana #theroyalfamily #theroyals #whattowatchonnetflix #whattowatch #tiktok #tiktokviral #tiktokvideo #tiktokvideos",
      "release": "2024-06-06T12:00:39Z",
      "duration": "00:15:17",
      "explicit": false,
      "youTubeId": "ZDhxsMBmuDE",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZDhxsMBmuDE"
      }
    }
  ]
}