{
  "id": "e501b8d8-4c0d-4c24-bf0b-3c0bf4a20725",
  "name": "Rebranding Evol / The Synanon Cult and CEDU Legacy",
  "youTubeChannelId": "UCKxGZFdQx_bhkAOEkZX0Zfg",
  "episodes": [
    {
      "id": "9b4f1075-57f6-4b31-a9d7-cea57065e4d5",
      "title": "Synanon Hollywood Trailer from Synanon Movie with Outtakes and B Roll Footage | Rebranding Evol",
      "description": "Synanon Hollywood Trailer from Synanon Movie with Outtakes and B Roll Footage | Rebranding Evol\n\nTRIGGER WARNING\n______________________________________________________________________\n\nThis is some footage that I have come across in my research of Synanon and the Church of Synanon Cult. Please do not proceed to watching this footage if you suffer tremendously from PTSD or other diagnosis that were caused by torture in the troubled teen industry, by the g*v, or by a cult or trafficking operation. Please know that every single survivor is important, you matter.\n\nIf you need someone to talk to or help please email us at:\n\nrebrandingevol@gmail.com\n\n______________________________________________________________________\n\nThis footage is that of the Hollywood trailer for the film titled \u0022Synanon\u0022. I have always wondered why so many famous people went to CEDU and RMA and it really does seem to make sense that Synanon was in Santa Monica and famous people would hang out there.\n\nI guess, for me, this video is testament that the \u0022fiends\u0022 were actually hanging around the \u0022squares\u0022 in Los Angeles. \n\nThis footage also shows a Hollywood rendition of \u0022The Game\u0022 which featured attack therapy. Even in the movie it looks mild compared to what it actually was like in real life. People referred to it as \u0022Fight Club but with words\u0022. \n\nI am so glad to be healing from my journey, I hope that this helps solve some of the mystery for you involving CEDU and the Synanon cult. I will continue to keep unlocking closed doors so that we can all see what is behind the veil that has been covered up so deeply.\n\n-MK ORPHAN\n\n#cult #truecrime #love #sober #NA #hollywood #trailer #movie #esoteric #knowledge #charlesmanson #synanon #CEDU #illumination #illuminati #masonic #mason #satanic #CIA #coverup #government #ops #thetruthshallsetyoufree #eagle #eagles #music #famous #almostfamous #musicindustry #scandal #behindthescenes #TTI #iseeyou #troubledteenindustry #church #churchcult #parapsychology #behavioral #DIA #airforce #navy #MKULTRA #BLUEBIRD #OPERATION #rockymountains #elite #video #journal #journalism #gypsy #truth #truthatallcosts #trafficking #human #humanity #torture #war #USSR #humantraffickingawareness #PTSD #mentalillness #mentalhealth #trauma #stockholm #brainwashed #tactics #brainwashing #sharontate #stanford #UCLA #UCSF #dirty #Charlesdiedrich #monarch #projectmonarch #britneyspears #amywhinehouse #kurtcobain #dead",
      "release": "2024-12-13T08:39:25Z",
      "duration": "00:06:30",
      "explicit": false,
      "youTubeId": "dstViHzNDPI",
      "subjects": [
        "Synanon",
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dstViHzNDPI"
      }
    },
    {
      "id": "2591578a-7c80-4f97-8354-95610ba2bbd8",
      "title": "What it\u0027s Like to Graduate from a Cult / Rocky Mountain Academy Graduation Ceremony / CEDU / TTI",
      "description": "Rocky Mountain Academy Graduation | CEDU | North Idaho\n\nTRIGGER WARNING!\n\nThis video contains subject matter that can be disturbing to some viewers. Some of the people that are in this video, sadly, have passed away. I dedicate all of my work to those friends. May you rest easy.\n\n*******************************************************************************************************\n\nWhen I was 15 I was kidnapped by my own father and my sister. I had been emancipated in the state of Washington but they tricked me and once I figured out what they were up to, and I tried to get out of the car, they held me in the car for about 5 miles while I was pleading and fighting and screaming… trying to get away.\n\nI ended up at a “boarding school” for bad teenagers, although it was not a school it was a cult. \n\nThis is a clip, taken out of a promotional video, that is of graduation. The day that I escaped. \n\nI had no idea that this video even existed, finding it was sort of a shock to the system. It’s like it was yesterday, but at the same time so far away.\n\nI cannot believe that they put us through a week of sleep deprivation, primal scream therapy, abuse, starvation, temperature fluctuations and more, just to get us into a state of transcendental meditation or shall I say hypnosis. \n\nThey believed in the pendulum swing, to the degree that you feel sadness, to that same degree you will feel joy.\n\nRest in peace to all of the homies in this video that are no longer with us. You are loved and missed. \n\nTo contact us write to:\n\nrebrandingevol@gmail.com\n\nThank you for being respectful.\n\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n\n#TTI #CEDU #Rockymountainacademy #troubledteen #abuse #truecrime #parapsychology #psychology #psych #mentalhealth #schools #camps #parishilton #rebrandingevol #evil #hurt #murder #allegations #hollywood #cult #jimjones #Synanon #netflix #HBO #documentary #podcast #news #journalism #journalist #found #illuminati #masons #masonic #elite #elitist #reptilian #conspiracy #conspiracytheory #truth #brainwashing #mindcontrol #KGB #CIA #coldwar #russia #war #tactics #warcrimes #kids #experiment",
      "release": "2024-11-21T17:44:16Z",
      "duration": "00:04:04",
      "explicit": false,
      "youTubeId": "CLk4-thNBNo",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CLk4-thNBNo"
      }
    },
    {
      "id": "4c83ed32-7788-4e41-b7f6-87637144ed1f",
      "title": "Rebranding Evol / The Synanon Cult and CEDU Legacy Live Stream",
      "release": "2024-11-19T17:42:28Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "NRnq2khgsTY",
      "subjects": [
        "Synanon",
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NRnq2khgsTY"
      }
    },
    {
      "id": "b8d1d72c-ec0f-4cba-90bc-1eb99608cda9",
      "title": "Jim Jones | People\u0027s Temple | Lost Footage | Creepy Cult Story | Synanon | CEDU | Chuck Dederich",
      "description": "Jim Jones | People\u0027s Temple | Lost Footage | Creepy Cult Story | Synanon | CEDU | Chuck Dederich Connection\n\nIn my research I found this video. There are some more, and I\u0027m going to do some shorts. This is seriously crazy.\n\nI found that \u0022The Synanon Game\u0022 was played by Jim Jones because he istied Synanon in 1970. It seems that Synanon had quite the afect on him. They called it \u0022The Jones Game\u0022.\n\nThis story just gets crazier and crazier. This is not my footage. Footage is from archive.org.\n\nThanks for watching, please subscrive and hit the alert button so you can see when new videos come out! \n\nDon\u0027t drink the KoolAid! \n\nEmail: RebrandingEvol@gmail.com\n\n#jimjones #cedu #cedusurvivor #synanon #human #peoplestemple #suicide #suicidecult #cult #synanoncult #thegame #synanongame #church #lucifer #death #dying #Guyana #northerncalifornia #santamonica #mindcontrol #creepy #horror #mkultra #ego #fake",
      "release": "2023-07-31T21:49:45Z",
      "duration": "00:22:58",
      "explicit": false,
      "youTubeId": "036GkDlP5_U",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=036GkDlP5_U"
      }
    },
    {
      "id": "a9bdaaf0-543a-41fc-926e-b9d3b43ebead",
      "title": "SYNANON Cult Lingo and Code Phrases PART 1 | Rebranding Evol | Breaking it Down | CEDU | Code Speak",
      "description": "#SYNANON #Cult Lingo and #code  Phrases PART 1 | Rebranding Evol | Breaking it Down | CEDU | Code #Speak \n\n\nThank you for supporting us and watching our videos. \n\nHere is the info for the video below:\n\nVIDEO 4\n\n#REBRANDINGEVOL | THE STORY OF THE #CHURCH OF SYNANON CULT\nAND THE CEDU #LEGACY\n\nPlease be aware that there is a trigger warning for most of my videos. This subject matter contains, but is not limited to, child abuse, #true #crime, sexual assault, #violence, #missing people and even #murder. The #brainwashing techniques discussed are for mature audiences only, proceed with caution.\n\nTHICKENED #LIGHT\n\nI never have to work very hard to use the information that I live in a motion-normal universe, that what is here today will inevitably change tomorrow. The only thing in this universe which resists movement is the #human #ego, which is probably the reason we are always so uncomfortable. Synanon is simply my attempt to get a few other heads in tune with the very simple scientific truth that things don\u0027t stand still.\n\n- CED (Chuck E. Dederick 0.1968)\n\nOUT OF AGREEMENT\n\nOut of Agreement means that something is against the rules, not allowed. If you wrote a list of the \u0022Out of Agreement\u0022 things you did, this is a \u0022Dirt List\u0022 and you are \u0022Dirty\u0022.\n\nCUTTING UP MUSIC\n\nCutting Up Music referred to playing, singing, humming or talking about music that was not in agreement or was against the rules. This would make an individual \u0022dirty\u0022 as well.\n\nDIRT / DIRTY\n\nWhen you have \u0022Dirt\u0022 it means you have broken the rules and are, AKA, Out of Agreement. This means that you need to \u0022clean up\u0022 your \u0022dirt\u0022 so vou can be \u0022in agreement\u0022 again and be \u0022clean\u0022.\n\nRAPS / THE GAME\n\nRaps / The Synanon Game - This was three times a week at CEDU and it was attack therapy. The only rules were no violence or getting out of your chair. People had to sit on chairs in a circle, and if you had something confrontational to tell someone you had to get up and walk across the room to speak to them... usually they started screaming at you, and many times it was more than one person. Up to 5 or 6.\n\nPROPHEET WORKSHOPS\n\nProphet Workshops were basically really long raps but with fun things added like sleep and light deprivation (so you didn\u0027t know if it was day or night), temperature fluctuations, physical violence and more. The longest one was 7 nights of absolute, delusional sleep deprivation. You had to\nsign an NDA if you participated. NO, Paris Hilton did not do The Summit Propheet.\n\n\nThank you for watching and supporting our channel. Please support by hitting the like and subscribe button, and then by hitting the white alert on the bell so you can be notified of our next video.\n\nIf you would like to reach out, or you would like to send us your story please email rebrandingevol@gmail.com.\n\nALL ORIGINAL MUSIC ALL RIGHTS RESERVED",
      "release": "2023-07-25T10:55:55Z",
      "duration": "00:05:35",
      "explicit": false,
      "youTubeId": "tXLQgFq1ahQ",
      "subjects": [
        "Synanon",
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tXLQgFq1ahQ"
      }
    },
    {
      "id": "6904b808-e3aa-473c-90af-133f55deca74",
      "title": "Rebranding Evol | EP2 | Introduction to Cult Lingo for Easy Indoctrination into the Cult Society",
      "description": "Rebranding Evol | EP2 | Introduction to Cult Lingo for Easy Indoctrination into the Cult Society\n\nTRIGGER WARNING: Violent cults and drugs in this content. \n\nWhen you walk into a place like #CEDU it is concerning to say the least. After I had been kidnapped, illegally, and taken to a \u0022school\u0022 deep in the woods of North Idaho, I instantly knew I was in a #cult.\n\nThere was a lot of #code being spoken and then taught, the students would teach each other in order to confuse the Psyche and make it easier to infiltrate and #reprogram. \n\nThe first one I heard was \u0022cutting up music\u0022 and this referred to talking about musicians and bands that were \u0022out of agreement\u0027. \u0022Out of agreement\u0022 referred to breaking the rules or things that were not allowed, like certain Beatles songs but not others. By the time you were there for at least two years you knew all of the ones you weren\u0027t \u0022allowed\u0022 to listen to. \n\nPlease hit like and subscribe to our channel so we can continue to get more information to you about these, sometimes, deadly cults that still exist in America. \n\nOur next episode will be breaking down more of these terms. \n\nThanks for watching!",
      "release": "2023-07-19T04:26:48Z",
      "duration": "00:05:54",
      "explicit": false,
      "youTubeId": "yT5D_k1e6uw",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yT5D_k1e6uw"
      }
    },
    {
      "id": "80a72919-378f-4b9e-8aa8-6d64807cfbb1",
      "title": "Rebranding Evol | The Story of the Church of Synanon and the CEDU Legacy",
      "description": "Rebranding Evol | The Story of the Church of Synanon and the CEDU Leagacy\n\nHave you ever wondered about the #Synanon #cult? What went on there, or what the survivors have to say about it? Well, in the true crime world, this subject is gaining popularity. Synanon went on to rebrand and open more schools under the name CEDU, which stands for Charles E Dederich University. These schools were all teenagers. I am doing a lot of research for a book I\u0027m writing about it so I\u0027m sharing as I go along.  \n\nThis is a reel about \u0022Who is Synanon\u0022 and it is a  good starting point. We are going to explore so much of the inner and outer workings of these cults, what their ties are to #FreeMasonry as well as people like #jimjones.\n\nI was in one of these for 3 years. I\u0027m ready to talk. \n\nTRIGGER WARNING:\n\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\u002B\nSome of the things in these videos can be very triggering. Especially for members who are no longer there and trying to rehabilitated from the trauma. Proceed with caution. \n\nPrivate Truth Seekers HQ Facebook Group:",
      "release": "2023-07-13T14:22:23Z",
      "duration": "00:11:06",
      "explicit": false,
      "youTubeId": "XpOE_0U_6NA",
      "subjects": [
        "Synanon",
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XpOE_0U_6NA"
      }
    }
  ]
}