{
  "id": "ce2ceb85-41af-4362-b39e-6594326b2c3f",
  "name": "Recovering From Religion",
  "spotifyId": "4scB8HYMpWT5zXIWzONTFL",
  "appleId": 1440611090,
  "episodes": [
    {
      "id": "c298e9e1-0288-4a3c-a0f9-21391c1f7a7e",
      "title": "E204: Surviving a Christian Cult w/ Andrew Pledger",
      "description": "This week on RfRx, Andrew Pledger comes on the show to share his experiences of his upbringing in a fundamentalist Christian cult and the level of control and mental abuse he experienced as a student at Bob Jones University as a member of the LGBTQ\u002B community. Andrew will further discuss his experiences with fundamentalism and the intersection of religious trauma and queerness. Andrew Pledger is a content creator, activist, and writer who uses social media to share his story and inspire others. He is a religious trauma survivor who was homeschooled K-12 and raised in a fundamentalist Christian cult (Independent Fundamental Baptist movement). He brings awareness to spiritual and religious abuse. Being a part of the LGBTQ\u002B community and experiencing religious trauma has inspired him to pursue psychology to help survivors. After being homeschooled, he found his way to Bob Jones University. He attended the fundamentalist Christian college for over three years until he was expelled in his last semester for sharing his story and denouncing fundamentalist teachings. Andrew comes on the show to share his experiences of his upbringing and the level of control and mental abuse he experienced at Bob Jones University. He has a limited podcast premiering soon called \u0022Surviving Bob Jones University: A Christian Cult.\u0022 This podcast explores the school\u0027s history, the psychology of fundamentalism, the criteria for cults, and survivors\u0027 experiences. For RfRx comments, inquiries \u0026 topical questions, email us at RfRx@recoveringfromreligion.org. Any time you are struggling with religious doubts or fears you can connect with a trained RfR Helpline agent 24 hours a day, 7 days a week. To chat online go to http://www.recoveringfromreligion.org. To talk over the phone, dial: (844) 368-2848 in the US \u0026 Canada If you are in need of professional help, we can offer the Secular Therapy Project to provide options to connect with a professional therapist. All therapists have been thoroughly vetted by our organization and offer only evidence-based and non-religious treatment. Connect with them at http://www.seculartherapy.org. Follow us on Facebook, Twitter, Instagram and Tiktok. Volunteer: http://www.recoveringfromreligion.org/volunteer Donate: https://www.recoveringfromreligion.org/donate  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/recovering-from-religion/message",
      "release": "2023-11-08T00:00:00",
      "duration": "01:30:49.0730000",
      "explicit": false,
      "spotifyId": "6uFbEkYzg5QInV4IHuptco",
      "appleId": 1000634184325,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6uFbEkYzg5QInV4IHuptco",
        "apple": "https://podcasts.apple.com/podcast/e204-surviving-a-christian-cult-w-andrew-pledger/id1440611090?i=1000634184325"
      }
    }
  ]
}