{
  "_ts": 0,
  "id": "08967b61-208c-4795-93b3-89cc9eb47fd3",
  "name": "Red Room",
  "spotifyId": "3kp6ReWgfWUGj7wAtjZH4i",
  "appleId": 1598396029,
  "youTubeChannelId": "UCc6efn3qLWkN2fj_CDSEOCA",
  "episodes": [
    {
      "id": "18ff5f4a-10e9-4a0e-b813-94e4df6377f9",
      "title": "The Zizians: From Rationalism to Radicalism (Patreon Teaser)",
      "description": "This is an excerpt of a 2025 episode of Red Room called The Zizians: From Rationalism to Radicalism that is hosted over on Patreon. It discusses a 2025 tech-cult known as The Zizians, who are tied to multiple deaths. Their story is a wild mix of ideology, obsession, and deadly consequences. Listen to the full episode here: www.patreon.com/redroompod Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-06-04T01:00:00Z",
      "duration": "00:20:05.2890000",
      "explicit": false,
      "spotifyId": "5ZMoCWvjDR8ISKo2zcI3QM",
      "appleId": 1000711098064,
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZMoCWvjDR8ISKo2zcI3QM",
        "apple": "https://podcasts.apple.com/podcast/the-zizians-from-rationalism-to-radicalism-patreon-teaser/id1598396029?i=1000711098064"
      }
    },
    {
      "id": "6d9a5184-a99a-4f96-ab22-fb67f80e3836",
      "title": "The TechBro Guru Who Promises Enlightenment | Bentinho Massaro\u0027s Cult of Personality",
      "description": "Bentinho Massaro is a self-styled spiritual guru with a massive online following and a string of disturbing allegations trailing behind him; from utopian dreams in Sedona to cult accusations and a follower’s tragic death... is this the future of wellness, or just another rebrand of control? Join RED ROOM on Patreon (7 day free trial) Sources/further reading Tech Bro Guru: Inside the Sedona Cult of Bentinho Massaro – Be Scofield Ex-Cult Members Describe Abuse by ‘Monster’ Bentinho Massaro – Be Scofield Be Scofield’s Articles on Cults and Spiritual Abuse A Little Bit Culty Podcast – Bentinho Massaro Part 2 The Mirror Effect – Survivor Accounts and Advocacy Spiritual Guru or Creepy Cult Leader? – Dazed My Journey into the Dark, Hypnotic World of a Millennial Guru – Cult Education Institute Massaro’s Organization Is a Cover to Give Him Everything He Craves – Cult Education Institute Bentinho Massaro – Wikipedia ‘If you die in the process, it doesn’t matter’: the rise of Bentinho Massaro – The Guardian Inside the World of Bentinho Massaro, Instagram’s Cult Leader for the Tech Set – Rolling Stone The Controversial Guru Who Wants to \u0027Upgrade Civilization\u0027 Levitating Spiritual Guru Wants to Enlighten the World | Bentinho Massaro Case Analysis Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-06-02T02:00:00Z",
      "duration": "00:53:03.1240000",
      "explicit": false,
      "spotifyId": "2AyBFgXgYfSKBzW05SDX2U",
      "appleId": 1000710804232,
      "subjects": [
        "Bentinho Massaro"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AyBFgXgYfSKBzW05SDX2U",
        "apple": "https://podcasts.apple.com/podcast/the-techbro-guru-who-promises-enlightenment-bentinho/id1598396029?i=1000710804232"
      }
    },
    {
      "id": "bb4dbbff-d4c7-4e45-933e-7f342f803c92",
      "title": "The Reptilian YouTuber Cult That Turned Deadly | Sherry Shriner",
      "description": "Sherry Shriner was a YouTuber who claimed to fight reptilian overlords...until her online cult was linked to suicide, paranoia, and murder. This is the dark side of digital influence. Sign up to Red Room on Patreon Sources The Devil You Know S02E02 Orgone Warrior | Sherry Shriner True Crime Documentary Tony Russo\u0027s Dragged Into the Light TheWrap Grunge cultfacts.com https://www.thedailybeast.com/web/20170803081134/ Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-05-26T01:00:00Z",
      "duration": "00:50:32.2930000",
      "explicit": false,
      "spotifyId": "05g5cRTOHAh6fr1Q6ksxuq",
      "appleId": 1000709840149,
      "subjects": [
        "Sherry Shriner"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/05g5cRTOHAh6fr1Q6ksxuq",
        "apple": "https://podcasts.apple.com/podcast/the-reptilian-youtuber-cult-that-turned-deadly-sherry/id1598396029?i=1000709840149"
      }
    },
    {
      "id": "6628a098-39ad-46d6-8e26-134a404da538",
      "title": "Christina Gallagher \u0026 Her House of Prayer in Achill",
      "description": "This week we investigate the rise and controversy surrounding Christina Gallagher\u0027s House of Prayer on Achill Island, uncovering the mystery behind its alleged miracles, financial dealings, and the Catholic Church\u0027s disownment. Get in touch: redroompod@gmail.com Sign up to Patreon for weekly deep dives \u0026 exclusive content Follow me on Instagram Follow Red Room on Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-09-23T01:00:00Z",
      "duration": "00:38:19.6110000",
      "explicit": false,
      "spotifyId": "3W8h1todcPlhqtAziUZLOj",
      "appleId": 1000670339492,
      "subjects": [
        "House of Prayer Achill",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3W8h1todcPlhqtAziUZLOj",
        "apple": "https://podcasts.apple.com/podcast/christina-gallagher-her-house-of-prayer-in-achill/id1598396029?i=1000670339492"
      }
    },
    {
      "id": "4effc1ea-af99-41d8-b1f1-d6ff7f8855a0",
      "title": "The Cult of Woo: JZ Knight \u0026 Ramtha\u0027s School of Enlightenment",
      "description": "content warning: this episode mentions instances of childhood sexual abuse What does a suburban Pacific Northwest housewife, a former Irish priest and Q Anon members have in common? Well, they all co-sign the teachings of Ramtha: a 35,000-year-old warrior who speaks through a woman called JZ Knight, at her school of enlightenment. This week we\u0027re discussing JZ\u0027 Knights\u0027 early life, and looking at how she went from the daughter of a cotton-picking single Mother to the leader of one of the whackiest New-Age cults ever. Get in touch: redroompod@gmail.com Sign up to Patreon for weekly deep dives \u0026 exclusive content Follow me on Instagram Follow Red Room on Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-09-16T01:00:08Z",
      "duration": "00:48:11.6240000",
      "explicit": true,
      "spotifyId": "3Rv1UTa9AeEwit7A32qY2F",
      "appleId": 1000669639328,
      "subjects": [
        "Ramtha\u0027s School of Enlightenment"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Rv1UTa9AeEwit7A32qY2F",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-woo-jz-knight-ramthas-school-of-enlightenment/id1598396029?i=1000669639328"
      }
    },
    {
      "id": "475c889a-a3e9-4e4d-9b88-f12844b6214f",
      "title": "QAnon: The Conspiracy Behind The Cult",
      "description": "QAnon is many things; a conspiracy theory, a digital phenomenon and according to many, a cult that has taken over the minds of their loved ones. This week we are deep-diving on the conspiracy theory behind QAnon, and asking how an online puzzle became possibly one of the world\u0027s largest cults. Get in touch: redroompod@gmail.com HBO Documentary Sign up for weekly deep dives \u0026 exclusive content Follow me on Instagram Follow Red Room on Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-09-09T01:00:37Z",
      "duration": "01:10:55.3990000",
      "explicit": true,
      "spotifyId": "1gN5HZupbW6ZfQcfIpkTuY",
      "appleId": 1000668817363,
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gN5HZupbW6ZfQcfIpkTuY",
        "apple": "https://podcasts.apple.com/podcast/qanon-the-conspiracy-behind-the-cult/id1598396029?i=1000668817363"
      }
    },
    {
      "id": "075e4035-28a5-4a24-b2b2-2b67f5fea0ee",
      "title": "Tony Quinn \u0026 EDUCO: Ireland\u0027s Own NXIVM?",
      "description": "Today we\u0027re exploring the life of Tony Quinn, the Irish spiritual leader who built a global following with his Educo program, which has been accused of being a cult. We\u0027ll explore how Quinn\u0027s teachings, wealth and \u0022psychic powers\u0022, led to his controversial rise in the oil industry, leaving a legacy of financial manipulation and psychological control. From his humble beginnings to his multi-million euro empire, discover the unsettling truth behind the man who convinced thousands to follow his path—and pay the price. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-09-02T01:00:55Z",
      "duration": "00:36:55.9410000",
      "explicit": false,
      "spotifyId": "1tPBOdcvPcgPWvq8NMNfYK",
      "appleId": 1000667998814,
      "subjects": [
        "EDUCO",
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1tPBOdcvPcgPWvq8NMNfYK",
        "apple": "https://podcasts.apple.com/podcast/tony-quinn-educo-irelands-own-nxium/id1598396029?i=1000667998814"
      }
    },
    {
      "id": "76b90300-b89c-45e8-82b4-759096b72896",
      "title": "Aum Shinrikyo: The Cult That Turned to Terrorism",
      "description": "In this episode, we explore the rise and fall of Aum Shinrikyo, the doomsday cult behind Japan\u0027s deadliest act of domestic terrorism. We’ll uncover how a seemingly spiritual group evolved into a deadly organization, leading to the infamous 1995 Tokyo subway sarin attack. Sign up for weekly deep dives \u0026 exclusive content Follow me on Instagram Follow Red Room on Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-08-26T01:00:49Z",
      "duration": "00:39:31.8660000",
      "explicit": false,
      "spotifyId": "0ZCXFLsZsLpt1KAzoeZh4S",
      "appleId": 1000666578734,
      "subjects": [
        "Aum Shinrikyo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ZCXFLsZsLpt1KAzoeZh4S",
        "apple": "https://podcasts.apple.com/podcast/aum-shinrikyo-the-cult-that-turned-to-terrorism/id1598396029?i=1000666578734"
      }
    },
    {
      "id": "47555d92-7038-44ef-a45d-70203561a1e1",
      "title": "Japa Meditation Ireland: A Cult of Abuse",
      "description": "Cults are not always whacky organised communities that live in a commune... in fact, many modern-day cults exist right under our noses. New-age spiritual gurus have gentrified many of the legitimate practices of the East, like meditation and yoga, and used them to gain the trust of vulnerable individuals. Dennis Curran and Shashi Dubey were two of these gurus, who started Japa Meditation Ireland, and used it to abuse its members, financially, mentally and sexually. Sign up for weekly deep dives \u0026 exclusive content Follow me on Instagram Follow Red Room on Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-08-19T01:00:52Z",
      "duration": "00:33:03.4770000",
      "explicit": false,
      "spotifyId": "3oGb4RLVt56taTud4RBXgY",
      "appleId": 1000665823958,
      "subjects": [
        "Japa Meditation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3oGb4RLVt56taTud4RBXgY",
        "apple": "https://podcasts.apple.com/podcast/japa-meditation-ireland-a-cult-of-abuse/id1598396029?i=1000665823958"
      }
    },
    {
      "id": "3786ae4a-4a2b-4920-afc1-ca4b72d8ba80",
      "title": "Donegal\u0027s Cultish History: The Silver Sisterhood (Part 2)",
      "description": "Turns out there was not just one, but two cults that lived in that big 8-bedroom house in Donegal. In 1982, the house changed hands to a group called The Silver Sisterhood, but the people of Burtonport would not know any peace. While this group were quieter on paper, what they got up to within the house was another world of strange, we\u0027re talking Victorian era roleplay, caning and eh... video game development? BBC Sounds Docuseries Sign up for weekly deep dives \u0026 exclusive content Follow me on Instagram Follow Red Room on Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-08-12T01:01:00Z",
      "duration": "00:34:33.7040000",
      "explicit": false,
      "spotifyId": "54oIIB4yUwK9BbMLHUMuUs",
      "appleId": 1000664983460,
      "subjects": [
        "Silver Sisterhood"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/54oIIB4yUwK9BbMLHUMuUs",
        "apple": "https://podcasts.apple.com/podcast/donegals-cultish-history-the-silver-sisterhood-part-2/id1598396029?i=1000664983460"
      }
    },
    {
      "id": "18ed8f00-c72e-4316-8283-b36acaebbe25",
      "title": "Donegal\u0027s Cultish History: The Screamers (Part 1)",
      "description": "On the North West Coast of Ireland is a small fishing village called Burtonport. On the surface, it is similar to many of Ireland\u0027s more rural villages however scratch the surface and you will hear stories of the cults that called it home for 20 years. Between 1974 and 1992, two cults chose Burtonport as their home, and brought controversy, news reporters and unrest to the otherwise sleepy village. Today we will look at The Atlantis Commune, otherwise known as \u0022The Screamers\u0022; a group that came from the UK to Donegal to practice primal scream therapy, led by Jenny James. Sign up for weekly deep dives \u0026 exclusive content Follow me on Instagram Follow Red Room on Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-08-12T01:00:24Z",
      "duration": "00:33:30.6970000",
      "explicit": false,
      "spotifyId": "4IMKmZrPR6i4yp7h1ySYE3",
      "appleId": 1000664983459,
      "subjects": [
        "The Screamers"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4IMKmZrPR6i4yp7h1ySYE3",
        "apple": "https://podcasts.apple.com/podcast/donegals-cultish-history-the-screamers-part-1/id1598396029?i=1000664983459"
      }
    },
    {
      "id": "631c2160-5565-4748-8106-3a8464ac3906",
      "title": "How The CIA Created Charles Manson (Patreon Teaser)",
      "description": "This is a clip from a recent 90 minute deep dive hosted exclusively in its entirety over on Patreon. WWW.PATREON.COM/REDROOMPOD Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-07-17T17:00:00Z",
      "duration": "00:10:10.0890000",
      "explicit": false,
      "spotifyId": "60RWwzfhZgvDnwoSaaQlV5",
      "appleId": 1000662547891,
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/60RWwzfhZgvDnwoSaaQlV5",
        "apple": "https://podcasts.apple.com/podcast/how-the-cia-created-charles-manson-patreon-teaser/id1598396029?i=1000662547891"
      }
    },
    {
      "id": "4167b669-9cb2-41c1-b9c8-01f66943394a",
      "title": "*BONUS* A Deep Dive on Diddy: Violence, Abuse \u0026 Trafficking",
      "description": "CW: sexual abuse, domestic violence, grooming Sean Combs, also known as Puff, Puff Daddy, P Diddy and ‘Love’ has been one of the most prominent figures in hip hop for over 30 years. There have always been rumours about Puff’s personal life, from rumours of bisexuality to straight-up accusations of abuse - but the recent lawsuit filed by his long-time ex-girlfriend Cassie Ventura has opened up a pandora\u0027s box of accusations that he can no longer hide from. It has even reopened questions surrounding the mysterious death of his ex Kim Porter - who died in suspicious circumstances after she threatened to release a tell-all novel about Diddy and their relationship. This week we’re deep-diving on Diddy, and looking at all of his shady connections from the last 30 years. Sign up for weekly deep dives \u0026 exclusive content Follow me on Instagram Follow Red Room on Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-03-29T02:00:26Z",
      "duration": "01:18:59.7090000",
      "explicit": true,
      "spotifyId": "1FJxG1DEdIApCwySvEJkJO",
      "appleId": 1000650791886,
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1FJxG1DEdIApCwySvEJkJO",
        "apple": "https://podcasts.apple.com/podcast/bonus-a-deep-dive-on-diddy-violence-abuse-trafficking/id1598396029?i=1000650791886"
      }
    },
    {
      "id": "77272ab2-5d78-4b30-ab2d-7d8d220fd907",
      "title": "The Irish Exorcist: Malachi Martin, Hostage To The Devil",
      "description": "Did you know one of the world\u0027s most famous Exorcists was Irish? Father Malachi Martin was a fascinating man, who lived quite an incredible life. As well as studying The Dead Sea Scrolls, being fluent in Hebrew and Arabic and becoming a celebrity author, he was also a renowned Exorcist. This week we\u0027re looking at his life, legacy and the controversy surrounding the legitimacy of his claims about demonic possession. SIGN UP TO PATREON --- Send in a voice message: https://podcasters.spotify.com/pod/show/redroompod/message Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-10-16T05:00:00Z",
      "duration": "00:25:43.4710000",
      "explicit": false,
      "spotifyId": "6bL4fLqDjlKM9OnbVowF0M",
      "appleId": 1000631434162,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6bL4fLqDjlKM9OnbVowF0M",
        "apple": "https://podcasts.apple.com/podcast/the-irish-exorcist-malachi-martin-hostage-to-the-devil/id1598396029?i=1000631434162"
      }
    },
    {
      "id": "aebc5089-8a5f-4f7c-b98a-880f0e6e4e05",
      "title": "Danny Masterson, Scientology \u0026 The Trial That Exposed It All",
      "description": "Content Warning: In this episode of Red Room we discuss the details of Danny\u0027s Masterson\u0027s recent trial, where he was accused and convicted of two accounts of rape. In 2020, actor Danny Masterson - known mostly for his role on the early 2000s hit sitcom That 70s Show was charged with forcibly raping three women in separate incidents between 2001 and 2003. In an added layer of conspiracy, the Church of Scientology have been accused of covering up and enabling Masterson, by the victims; all three of whom were also practising Scientologists. This week we are deep diving on the trial, the accusations and focusing on the controversy now surrounding Ashton Kutcher \u0026 Mila Kunis; who not only got involved in the trial, but unveiled skeletons in their own closet. My Episode on Scientology \u0026 The Cult of The Celebrity Resources for victims of rape, sexual assault \u0026 sexual violence Links/Further Reading LAPD PROBING SCIENTOLOGY AND DANNY MASTERSON FOR MULTIPLE RAPES, COVER-UP | The Underground Bunker Danny Masterson\u0027s Accuser Tearfully Takes the Stand to Describe Alleged Rape Woman says she set boundaries, but actor Masterson raped her | AP News Actor Masterson\u0027s ex says she had to pull hair to stop rape | AP News \u0026#96;That 70s Show\u0027 actor Danny Masterson charged in 3 rapes | AP News Leah Remini speaks out after Danny Masterson\u0027s rape sentencing | EW.com Danny Masterson Allegedly Spit on Victim as She Fought Back During Rape, Woman Tells Court The Most Shocking Revelations From Danny Masterson\u0027s First Rape Trial - E! Online Danny Masterson sentenced to 30 years to life for raping former Scientologists How Laura Prepon Quietly Responded After Danny Masterson Was Accused Of Rape Danny Masterson’s ex-stepdad accuses siblings of lying to help \u0027That ’70s Show\u0027 star READ: \u0027That \u002770s Show\u0027 Stars Mila Kunis and Ashton Kutcher\u0027s Full Letters of Support for Convicted Rapist Danny Masterson Ex-Scientologist claims that Ashton Kutcher and Mila Kunis did not know their letters supporting Danny Masterson would be made public - and says the actor \u0027knows very well the kind of guy that he was\u0027 | Daily Mail Online Who was Ashley Ellerin and how did she die? – The Irish Sun Ashton Kutcher and Mila Kunis sorry for ‘pain’ caused by letters on behalf of Danny Masterson | US news | The Guardian Danny Masterson Accuser Breaks Down in Tears While Recounting Rape Ashton Kutcher\u0027s Lies Allowed Michael Gargiulo To Kill Again The alleged role of Scientology in the Danny Masterson rape case | About That Laura Prepon\u0027s \u0027Complex Relationship\u0027 With Danny Masterson Is Likely Why She\u0027s Remained Silent After Rape Conviction Ashton Kutcher Steps Down as Board Chair of Anti-Child-Sex-Abuse Organization Danny Masterson bet Ashton Kutcher to French kiss Mila Kunis at 14 | EW.com --- Send in a voice message: https://podcasters.spotify.com/pod/show/redroompod/message Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-09-19T05:00:00Z",
      "duration": "00:58:43.8400000",
      "explicit": false,
      "spotifyId": "0XwFTwgRFv5Cxnupig6na4",
      "appleId": 1000628372448,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0XwFTwgRFv5Cxnupig6na4",
        "apple": "https://podcasts.apple.com/podcast/danny-masterson-scientology-the-trial-that-exposed-it-all/id1598396029?i=1000628372448"
      }
    },
    {
      "id": "f5a40fab-605b-4924-9941-e44864d268d0",
      "title": "Do Secret Societies Run The World? | Bohemian Grove, The Freemasons \u0026 Cicada 3301 #RedRoomRevisits",
      "description": "This week we are exploring the world of Secret Societies. From Bohemian Grove to the Freemasons, these private boys clubs are often said to hold the world in the palm of their hand, members are apparently puppet masters of the universe and bred for success from the get-go.... but just how powerful are they really? We take a look at The Bohemian Club, Skull and Bones 322, The Freemasons, The Order of St Hubertus and Cicada 3301 and try to answer the question, do secret societies really run the world? ♦️WANT MORE RED ROOM?♦️Subscribe to WEEKLY episodes of Red Room: https://www.patreon.com/redroompod Follow me on Instagram: https://www.instagram.com/jenny.claffey/ Follow Red Room on Instagram: https://www.instagram.com/redroom.pod/ --- Send in a voice message: https://podcasters.spotify.com/pod/show/redroompod/message Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-04-03T05:00:02Z",
      "duration": "00:29:56.3360000",
      "explicit": false,
      "spotifyId": "2RHCpHtwbmQWew2j7AvnoA",
      "appleId": 1000607060383,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2RHCpHtwbmQWew2j7AvnoA",
        "apple": "https://podcasts.apple.com/podcast/do-secret-societies-run-the-world-bohemian-grove/id1598396029?i=1000607060383"
      }
    },
    {
      "id": "bc0367eb-9ac7-4a68-9f3f-7300924db56a",
      "title": "I Was Warren Jeffs 65th Wife",
      "description": "This week on the pod I am speaking to Briell Decker.Briell was born and raised within the FLDS Church, a fundamentalist sect of the Latter Day Saints that practice Polygamy. Her life was never normal; she had no TV, was forced out of school before High School and she could not date or mingle with boys - any semblance of a normal teenage childhood was banned.Her life changed forever when she had just turned 18 and Warren Jeffs requested her to be married to him, as one of his then 64 wives. Briell\u0027s father brought her to the leader, and she was married instantly. Briell spent the next 8 years under the control of the FLDS Church, where she was drugged to keep quiet and all measures were taken to keep her within the organisation. This is her story, on how she escaped and how she took the power back.Watch her TedTalk: https://www.youtube.com/watch?v=hWmsoCIuDn4\u0026ab_channel=TEDxTalks--- Send in a voice message: https://podcasters.spotify.com/pod/show/redroompod/message Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-07T04:30:00Z",
      "duration": "00:51:51.3660000",
      "explicit": false,
      "spotifyId": "74Fwwrt8D9j3Ic74R3c9kk",
      "appleId": 1000578655951,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/74Fwwrt8D9j3Ic74R3c9kk",
        "apple": "https://podcasts.apple.com/podcast/i-was-warren-jeffs-65th-wife/id1598396029?i=1000578655951"
      }
    },
    {
      "id": "4279cbd2-89b5-41d5-81da-5df17a0b074b",
      "title": "The Good Witch! Patti Negri on Seances, Ghost Hunting, The Cecil Hotel \u0026 Everyday Witchcraft",
      "description": "This month\u0027s freebie is an amazing and fun interview with celebrity psychic-medium \u0026 Good Witch, Patti Negri!Patti Negri is a Psychic-Medium and \u0022Good Witch\u0022 best known for her recurring role on the Travel Channel and Discovery Plus\u0027s #1 show GHOST ADVENTURES. She is the international best-selling author of OLD WORLD MAGICK FOR THE MODERN WORLD: Tips, Tricks and Techniques to Empower and Create a Life You Love. Patti\u0027s body of work includes appearances on dozens of shows including MASTER CHEF, AMERICA’S GOT TALENT, WipeOut, The Trevor Moore Show and Jeff Lewis\u0027 FLIPPING OUT.Patti has a popular weekly podcast called THE WITCHING HOUR.Patti\u0027s website: www.pattinegri.comWatch the video we mentioned, of Patti at The Cecil Hotel: https://www.youtube.com/watch?v=zYMMzcJhHG4Sign up for weekly episodes: www.patreon.com/redroompod--- Send in a voice message: https://podcasters.spotify.com/pod/show/redroompod/message Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-03-03T03:30:00Z",
      "duration": "01:02:43.4080000",
      "explicit": false,
      "spotifyId": "2f17UabJdF1rQsHOgEAquz",
      "appleId": 1000552867594,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2f17UabJdF1rQsHOgEAquz",
        "apple": "https://podcasts.apple.com/podcast/the-good-witch-patti-negri-on-seances-ghost-hunting/id1598396029?i=1000552867594"
      }
    },
    {
      "id": "f3f82e77-f439-4ec0-9c01-b279185957a2",
      "title": "Scientology \u0026 The Cult of Celebrity",
      "description": "This week we take a deep dive into the Church of Scientology and their relationship to (and obsession with) celebrities. From alleged cover-ups, arranged marriages to using the charisma of the celebrity to spread their beliefs far and wide, there is no Scientology without the A-list celeb, and seemingly nothing they won’t do to keep their A-listers loyal followers.In this episode we cover the beginnings of this profitable relationship and how it was always L Ron Hubbard’s wish to be a celebrity Church. We also talk about how John Travolta got involved with Scientology, how they helped his career and reputation before casting him aside and how now, they seem to be doing little to cover his tracks. Of course we take a look at Tom Cruise, the Church’s alleged #2, and how the organisation have curated relationships, staff and an entire life for their most famous and devoted member. Video’s played Leah Remini interview at Scientology Celebrity Centre Hollywood 1998: https://youtu.be/FbENIJrPGyoJohn Travolta: Scientology has better tools than Catholicism: https://youtu.be/MEGVEqgGCMEJohn Travolta talks Scientology on Charlie Rose 1999: https://youtu.be/ArFPrqJvlwIJohn Travolta Talks About Scientology on Charlie Rose Show (2005): https://youtu.be/vGl907oeoeQScientology and Battlefield Earth: https://youtu.be/VHDk8YvgNlwTom Cruise Scientology Video - ( Original UNCUT ): https://youtu.be/UFBZ_uAbxS0Tom Cruise\u0027s Heated Interview With Matt Lauer: https://youtu.be/tFgF1JPNR5ETom Cruise\u0027s Freedom Medal of Valor acceptance speech at the church of Scientology: https://youtu.be/eZ8ciJZvjykFBI REPORTS \u0026 INVESTIGATIONSScientology Under FBI Investigation For Work Done For Tom Cruise: Report: https://www.huffpost.com/entry/tom-cruise-scientology-under-fbi-investigation_n_820250Nazanin Boniadi’s FBI testimony: Cast as Tom Cruise’s girlfriend by Scientology: https://tonyortega.org/2017/05/10/nazanin-boniadi-fbi-testimony-cast-as-tom-cruises-girlfriend-by-scientology/For weekly episodes of Red Room sign up to Patreon: www.patreon.com/redroompodFor all enquires about this podcast please contact redroompod@gmail.com--- Send in a voice message: https://podcasters.spotify.com/pod/show/redroompod/message Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-01-17T14:31:40Z",
      "duration": "01:08:19.3950000",
      "explicit": false,
      "spotifyId": "7pIql0JcH8tcLweQFkLHun",
      "appleId": 1000548123452,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7pIql0JcH8tcLweQFkLHun",
        "apple": "https://podcasts.apple.com/podcast/scientology-the-cult-of-celebrity/id1598396029?i=1000548123452"
      }
    }
  ]
}