{
  "id": "b63603ab-4017-45db-b74d-b90550650033",
  "name": "Redacted",
  "youTubeChannelId": "UCoJhK5kMc4LjBKdiYrDtzlA",
  "episodes": [
    {
      "id": "a985eefb-6272-4210-bc5e-cec504c08cc3",
      "title": "BREAKING! CRIMINAL CHARGES COMING FOR BILL AND HILLARY CLINTON IN EPSTEIN CASE | Redacted",
      "description": "Bill and Hillary Clinton both did not show up for their congressional testimony. They were set to testify in front of the House Oversight Committee.\n\nLIVE STREAM SCHEDULE:\nMonday - Thursday 1PM PST / 3PM CENTRAL / 4PM EST\n\n✨FAIR USE NOTICE: This video may contain copyrighted material. Such material is made available for educational purposes only. This constitutes a \u0027fair use\u0027 of any such copyrighted material as provided for in Title 17 U.S.C. section 106A-117 of the US Copyright Law.\n\n#redacted #claytonmorris #natalimorris #news #independentjournalists\n-----\nAbout Natali and Clayton Morris:\nClayton Morris is a former FOX News anchor. Natali Morris is a former anchor and reporter for MSNBC, CNBC and CBS News. On Redacted, the married couple (not brother and sister!) and former mainstream news professionals take an in-depth look at the news the mainstream media largely ignores. They explore the legal, social, financial, and personal issues that matter to you. They want to set the record straight and bring you the stories nobody else tells. Along with the facts and the complete picture, Redacted offers real-world analysis without an agency driven by corporate overloads. With Clayton’s extensive journalism experience, he isn’t afraid to demand the truth from authorities. Redacted is an independent platform, unencumbered by external factors or restrictive policies, on which Clayton and Natali Morris bring you quality information, balanced reporting, constructive debate, and thoughtful narratives. \n\nDISCLAIMER:\nSome of the links in this description and in our videos may be affiliate links, and pay us a small commission if you use them. We really appreciate the support.\n\nThe content in our YouTube videos SHALL NOT be construed as tax, legal, insurance, construction, engineering, health \u0026 safety, electrical, financial advice, or other \u0026 may be outdated or inaccurate; it is your responsibility to verify all information. We are not financial advisers. We only express our opinions based on our experiences. Your experience may be different. Investing of any kind involves risk. While it is possible to minimize risk, your investments are solely your responsibility. You must conduct your own research. There is NO guarantee of gains or losses on investments. Once again we are not securities dealers or brokers, investment advisers or financial advisers, and you should NOT rely on the information herein as investment advice. Any investment should be made only after consulting a professional investment advisor and only after reviewing the financial statements and other pertinent corporate information. Further, readers are advised to read and carefully consider the Risk Factors identified and discussed in the profiled company’s  SEC and/or other government filings. Investing in securities, particularly microcap securities, is speculative and carries a high degree of risk.\n\nThese videos are for entertainment purposes ONLY. IF stocks or companies are mentioned, we MAY have an ownership interest in them -- DO NOT make buying or selling decisions based on these videos. If you need advice, please contact a qualified CPA, attorney, insurance agent, contractor/electrician/engineer/etc., financial advisor, or the appropriate professional for the subject you would like help with. Linked items may create a financial benefit for our company.",
      "release": "2026-01-17T21:00:52Z",
      "duration": "00:07:30",
      "explicit": false,
      "youTubeId": "rG81D6h1tcY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rG81D6h1tcY"
      }
    }
  ]
}