{
  "_ts": 0,
  "id": "91d0e716-fe9d-42d6-a37e-d5bbafdd9678",
  "name": "Reese Waters",
  "youTubeChannelId": "UCCcr-MvAMettt8yktc9t4ag",
  "episodes": [
    {
      "id": "10eb7d22-e053-47d7-9048-96b7b2a82fff",
      "title": "Pardoned J6 Defendant Calls Trump a Cult Leader",
      "description": "Maga Granny calls Maga a cult and Trump a cult leader. Go to my sponsor https://aura.com/reesewaters to get a 14-day free trial and see if any of your\ndata has been exposed\n\nPardon this. The former Maga Granny refuses to accept Trump’s pardon for actions during the January 6th Insurrection. Pamela Hemphill insists on taking responsibility for role she played in trying to overturn the 2020 election results. Hemphill, who was also arrested on January 6, has refused to accept Trump’s pardon, instead deciding to take responsibility for the role she played in trying to overturn the 2020 election results which made Joe Biden victorious over Trump. And now she wants you to know--it really is a cult. That\u0027s right she has thrown down her colors. \n\nPresident Donald Trump\u0027s Presidential pardons have sparked attention, its not just the reality TV stars Todd Chrisley \u0026 Todd Chrisley back n TV. This is due to their significant financial implications. A recent analysis by former Justice Department Pardon Attorney Liz Oyer has claimed that these pardons could negate over $1 billion in debts from fines and restitution. This was shared by US Senator Cory Booker on Instagram, underscoring the argument that President Trump pardoned individuals who were not only able to evade incarceration but also financial restitution mandated by the courts.\n#maga #pardon #january6 #j6 #redpill \n\nJoin this channel to really set it off:\nhttps://www.youtube.com/channel/UCCcr-MvAMettt8yktc9t4ag/join\nPATREON: Patreon.com/ReeseWaters\n\nSupport the Channel 🙏🏽 \n\nMERCH SHOP: reesewaters.com/shop\nVenmo: https://venmo.com/u/ReeseWaters\nCashapp: $ReeseWatersTips\nPaypal: @ReeseWatersTips\n\nFollow Me on Social 👏🏽\n#reesewaters\nTwitter:  https://twitter.com/reesewaters\nInstagram: https://instagram.com/@reesewaters\nEmail: reese.waters@gmail.com",
      "release": "2025-06-11T14:30:06Z",
      "duration": "00:30:32",
      "explicit": false,
      "youTubeId": "Zgf18qHhyRE",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Zgf18qHhyRE"
      }
    }
  ]
}