{
  "id": "cdef5948-a930-4549-9004-088e6558010d",
  "name": "Reinvention Room with Allison Hare",
  "spotifyId": "4gPdrTqc6O3BlCkhJYuiVI",
  "appleId": 1461830152,
  "youTubeChannelId": "UCmZIiUjqRHPe-mjrWS5GdNw",
  "episodes": [
    {
      "id": "4f06b913-8ea1-481c-b781-d2c9c2a0f05d",
      "title": "Cult of Perfection: Ruby Franke, Mormon Culture, and Non-Mormon Utah Life",
      "description": "This episode is a deep cultural exploration of Ruby Franke, the Mormon mommy vlogger whose shocking story of child abuse captivated—and horrified—the world. Joined by mental wellness coach and Utah resident (and non-Mormon) Janelle Devlin, we\u0027re unpacking the disturbing Hulu docuseries Devil in the Family, discussing perfectionism, the powerful draw of cults, and what life is like as an outsider in the heart of Mormon country. If you\u0027re fascinated by the intersections of faith, social media fame, and human psychology, this conversation is a must-listen. Notable Timestamps: (02:15) Introduction to Ruby Franke and the Hulu docuseries (09:45) Mormon exceptionalism and the pressure to perform (21:30) The dark side of family vlogging and lack of child consent (34:00) Non-Mormon life in Utah and navigating local culture (47:15) Psychological insights into Ruby Franke’s narcissism (59:00) Impact of social media on parenting and personal identity (1:15:30) \u0022Jack Mormons\u0022 and cultural nuances in Utah (1:25:00) Is Kevin Franke guilty or brainwashed? Links \u0026 Resources: Connect with Janelle Devlin and learn more about her retreat: Instagram @DevlinWorldwide Book a FREE clarity call with Allison Hare: allisonhare.com/freecall Hulu Docuseries: Devil in the Family Be sure to rate, review, and follow this podcast on your player and also, connect with me IRL for more goodness and life-changing stuff. Sign up for the free Reinvention Roadmap weekly email AllisonHare.com Follow me on Instagram , LinkedIn , Facebook , and YouTube . Schedule a FREE breakthrough call with me Want to take these ideas and apply them to your life? Let\u0027s do it! DOWNLOAD the free PDF - 40 Simple Ways to Add Energy To Your Day - get a quick burst of energy right now and KEEP IT! Reb3l Dance Fitness - Try it at home! Free month with this link . Personal Brand - need help building yours? Schedule a call with me here and let\u0027s discuss. Feedback and Contact:: allison@allisonhare.com",
      "release": "2025-03-27T04:00:00Z",
      "duration": "01:00:23.0900000",
      "explicit": true,
      "spotifyId": "5nPLook5wcJ9shWBN7eoo6",
      "appleId": 1000701006960,
      "youTubeId": "Qni5HxeAQig",
      "subjects": [
        "Connexions",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5nPLook5wcJ9shWBN7eoo6",
        "apple": "https://podcasts.apple.com/podcast/cult-of-perfection-ruby-franke-mormon-culture-and/id1461830152?i=1000701006960",
        "youtube": "https://www.youtube.com/watch?v=Qni5HxeAQig"
      }
    }
  ]
}