{
  "id": "cdef5948-a930-4549-9004-088e6558010d",
  "name": "Reinvention Room with Allison Hare",
  "spotifyId": "4gPdrTqc6O3BlCkhJYuiVI",
  "appleId": 1461830152,
  "youTubeChannelId": "UCmZIiUjqRHPe-mjrWS5GdNw",
  "episodes": [
    {
      "id": "5ad0d095-a502-4509-bb27-7a6ae27d03ee",
      "title": "Escaping the NXIVM Cult: Sarah Edmondson’s Story Pt 2",
      "description": "NXIVM is back in the headlines after Allison Mack’s new podcast — but for Sarah Edmondson, the story never ended.\nIn this episode of Reinvention Room, she reveals what life after the NXIVM cult really looks like — healing from coercive control, rebuilding self-trust, and finding freedom again.\n\nIn this episode, you will learn:\n\nHow Sarah escaped the NXIVM cult and reclaimed her voice\n\nHow coercive control shows up in modern culture\n\nWhat healing after manipulation really takes\n\nPre-order the new book, A Little Bit Culty by Sarah Edmondson and Anthony \u0022Nippy\u0022 Ames: https://checkout.square.site/merchant/MLR16M1R576DP/checkout/25UI2OVABMV3RD4YF55WQ755\n\nSign up for the free Reinvention Roadmap weekly email https://www.allisonhare.com/email\n\nVisit my website https://allisonhare.com\n\nFollow me\nhttps://www.instagram.com/allison__hare\n\nhttps://www.linkedin.com/in/allisonhare/\n\nhttps://www.facebook.com/search/top/?q=Allison%20Hare\n\nhttps://www.youtube.com/channel/UCmZIiUjqRHPe-mjrWS5GdNw\n\nTAKE THE QUIZ and find out your Podcast Personality Type https://allisonhare.com/personality\n\nDOWNLOAD the free podcast equipment guide https://go.allisonhare.com/equipment",
      "release": "2025-11-13T11:00:00Z",
      "duration": "00:39:48.4300000",
      "explicit": true,
      "spotifyId": "5ZTQXiavs10Et3eF0RtG2b",
      "appleId": 1000736575028,
      "youTubeId": "BcY9N13dH9A",
      "subjects": [
        "NXIVM",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZTQXiavs10Et3eF0RtG2b",
        "apple": "https://podcasts.apple.com/podcast/escaping-the-nxivm-cult-sarah-edmondsons-story-pt-2/id1461830152?i=1000736575028",
        "youtube": "https://www.youtube.com/watch?v=BcY9N13dH9A"
      }
    },
    {
      "id": "a244203b-b72a-4a86-ab2c-273e1fbb2fa4",
      "title": "Inside the NXIVM Cult: Sarah Edmondson\u0027s story - Part 1",
      "description": "If you think you’d never fall for a cult, think again.\nThe NXIVM cult didn’t lure the weak — it attracted smart, curious, ambitious people looking for growth and belonging. People just like us.\nAnd right in the middle of it was Sarah Edmondson, a high-ranking member who helped blow it wide open in The New York Times and HBO’s The Vow.\nIn this conversation, we unpack how something that looked like empowerment turned into manipulation — and how the need to belong can become a weapon.\nSarah shares what actually happened inside NXIVM, how coercive control disguised itself as “self-improvement,” and the exact moment she realized she was part of something dark.\nWe talk about the psychology that keeps smart people compliant, the power structures that mirrored everyday life, and what breaking free really cost her.\nIt’s part cult exposé, part human study — and all about reclaiming your voice when someone else has tried to own it.\nWhat You’ll Learn in This Episode\nHow the NXIVM cult disguised coercive control as personal growth\nThe psychology of belonging and why smart people get trapped\nThe moment Sarah Edmondson decided to blow it all open\nHow language and hierarchy keep people obedient without force\nWhat the NXIVM story teaches us about modern cults and power\nResources MentionedPodcast: A Little Bit Culty hosted by Sarah Edmondson \u0026 Nippy Ames\nPre-Order new book: A Little Bit Culty\nThe Vow (HBO docuseries)\nScarred by Sarah Edmondson (book)\nSarah Edmondson’s website – sarahedmondson.com\n Quotes (from Sarah Edmondson)“Cults don’t prey on weakness — they prey on hope.” 09:2409:2409:24\n“I didn’t wake up and think, ‘Oh God, I’m in a cult.’ It was a slow drip of trust and fear.” 15:0215:0215:02\n“The brand became my evidence. It was the proof we weren’t crazy.” 27:1827:1827:18\n“I had to reclaim my story before someone else told it for me.” 34:4534:4534:45\n“Once you understand coercive control, you start seeing it everywhere.” 42:1142:1142:11\n Timestamps (Key Moments)0:00 Intro – How NXIVM hooked smart people\n5:40 Sarah joins NXIVM and finds community\n12:55 The early red flags everyone missed\n22:18 The branding and Sarah’s breaking point\n30:04 The New York Times story that blew it open\n42:00 The psychology of control and obedience\n52:33 Outro – Reclaiming power after indoctrination\n Tips / TakeawaysBelonging is a human need — and that’s what makes it so exploitable.\nCoercive control often sounds like self-improvement until you question it.\nRecovery starts with reclaiming your own definition of truth and power.\n\nBe sure to rate, review, and follow this podcast on your player and also, connect with me IRL for more goodness and life-changing stuff.\nSchedule a FREE podcast clarity call with me - Your future audience is out there. Talk to them!Sign up for the free Reinvention Roadmap weekly emailAllisonHare.comFollow me on Instagram, LinkedIn, Facebook, and YouTube.DOWNLOAD the free podcast equipment guide- No guesswork, no google rabbit holes, start recording todayReb3l Dance Fitness - Try it at home! Free month with this link.Personal Brand - need help building yours? Schedule a call with me here and let\u0027s discuss.Feedback and Contact:: allison@allisonhare.com",
      "release": "2025-11-06T11:00:00Z",
      "duration": "00:52:20",
      "explicit": false,
      "spotifyId": "78MisVqSEHRxh3Ecv2d4HU",
      "appleId": 1000735542456,
      "youTubeId": "hXf3KXwmiVs",
      "subjects": [
        "NXIVM",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/78MisVqSEHRxh3Ecv2d4HU",
        "apple": "https://podcasts.apple.com/podcast/inside-the-nxivm-cult-sarah-edmondsons-story-part-1/id1461830152?i=1000735542456",
        "youtube": "https://www.youtube.com/watch?v=hXf3KXwmiVs"
      }
    },
    {
      "id": "4f06b913-8ea1-481c-b781-d2c9c2a0f05d",
      "title": "Cult of Perfection: Ruby Franke, Mormon Culture, and Non-Mormon Utah Life",
      "description": "This episode is a deep cultural exploration of Ruby Franke, the Mormon mommy vlogger whose shocking story of child abuse captivated—and horrified—the world. Joined by mental wellness coach and Utah resident (and non-Mormon) Janelle Devlin, we\u0027re unpacking the disturbing Hulu docuseries Devil in the Family, discussing perfectionism, the powerful draw of cults, and what life is like as an outsider in the heart of Mormon country. If you\u0027re fascinated by the intersections of faith, social media fame, and human psychology, this conversation is a must-listen. Notable Timestamps: (02:15) Introduction to Ruby Franke and the Hulu docuseries (09:45) Mormon exceptionalism and the pressure to perform (21:30) The dark side of family vlogging and lack of child consent (34:00) Non-Mormon life in Utah and navigating local culture (47:15) Psychological insights into Ruby Franke’s narcissism (59:00) Impact of social media on parenting and personal identity (1:15:30) \u0022Jack Mormons\u0022 and cultural nuances in Utah (1:25:00) Is Kevin Franke guilty or brainwashed? Links \u0026 Resources: Connect with Janelle Devlin and learn more about her retreat: Instagram @DevlinWorldwide Book a FREE clarity call with Allison Hare: allisonhare.com/freecall Hulu Docuseries: Devil in the Family Be sure to rate, review, and follow this podcast on your player and also, connect with me IRL for more goodness and life-changing stuff. Sign up for the free Reinvention Roadmap weekly email AllisonHare.com Follow me on Instagram , LinkedIn , Facebook , and YouTube . Schedule a FREE breakthrough call with me Want to take these ideas and apply them to your life? Let\u0027s do it! DOWNLOAD the free PDF - 40 Simple Ways to Add Energy To Your Day - get a quick burst of energy right now and KEEP IT! Reb3l Dance Fitness - Try it at home! Free month with this link . Personal Brand - need help building yours? Schedule a call with me here and let\u0027s discuss. Feedback and Contact:: allison@allisonhare.com",
      "release": "2025-03-27T04:00:00Z",
      "duration": "01:00:23.0900000",
      "explicit": true,
      "spotifyId": "5nPLook5wcJ9shWBN7eoo6",
      "appleId": 1000701006960,
      "youTubeId": "Qni5HxeAQig",
      "subjects": [
        "Connexions",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5nPLook5wcJ9shWBN7eoo6",
        "apple": "https://podcasts.apple.com/podcast/cult-of-perfection-ruby-franke-mormon-culture-and/id1461830152?i=1000701006960",
        "youtube": "https://www.youtube.com/watch?v=Qni5HxeAQig"
      }
    }
  ]
}