{
  "_ts": 0,
  "id": "05842109-cc34-4f26-957a-d930547584f3",
  "name": "Relationscapes Podcast",
  "spotifyId": "79FGvTJ3jRp9qwqoeKn1DY",
  "appleId": 1693024809,
  "youTubeChannelId": "UCJWYYyjaMyfaInJdoiDBGGQ",
  "episodes": [
    {
      "id": "7955271b-c1b1-439a-8c5d-352fdf8adf15",
      "title": "Coming of Age in a Cult and Beyond (with Guinevere Turner)",
      "description": "One January day in 1975, seven-year-old Guinevere Turner put on her best dress, hugged her favorite toy tightly, and waited for the spaceship to arrive. The world was ending and she would be saved, spirited away to Venus with the rest of her enormous and enlightened family.\n\n\n\nWhen the prophecy failed, the cult carried on. But Guinevere would soon find herself thrown out into the world beyond, where things somehow became more nightmarish than before.\n\n\n\nIn this episode, Guinevere Turner joins us to talk about her remarkable memoir, When the World Didn\u0027t End (https://amzn.to/4h72isd) .\n\n\n\nNote: This episode includes discussion of psychological manipulation and sexual abuse. Listener discretion is advised.\n\n\n\n \n\nSHOW NOTES\n\n     \n     \n  •  Buy the book here (https://amzn.to/4h72isd) .\n     \n     \n  •  Read Guinevere\u0027s piece in The New Yorker that led to her memoir here (https://www.newyorker.com/magazine/2019/05/06/my-childhood-in-a-cult) . \n     \n     \n     \n     \n     \n     \nABOUT THE GUEST\n\n\nGuinevere Turner is an acclaimed screenwriter and director. She co-wrote the screenplays for American Psycho and The Notorious Bettie Page and, most recently, wrote the screenplay for Charlie Says. She also wrote and starred in the film Go Fish and was a writer and actor on Showtime’s The L Word. An essay she wrote for The New Yorker is the inspiration for this memoir. She lives in New York and Los Angeles.\n\n\n\nA full transcript is available here at relationscapes.org (https://www.relationscapes.org/p/turner-transcript/) . ",
      "release": "2025-07-11T13:59:20Z",
      "duration": "01:06:00",
      "explicit": false,
      "spotifyId": "5W62wT0ydPQtIqQGnc4ePq",
      "appleId": 1000682980279,
      "youTubeId": "zW2Q7pzxg30",
      "subjects": [
        "The Lyman Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5W62wT0ydPQtIqQGnc4ePq",
        "apple": "https://podcasts.apple.com/podcast/coming-of-age-in-a-cult-and-beyond-with-guinevere-turner/id1693024809?i=1000682980279",
        "youtube": "https://www.youtube.com/watch?v=zW2Q7pzxg30"
      }
    }
  ]
}