{
  "_ts": 0,
  "id": "8c86f9a0-6804-43d0-9517-d12463c681a8",
  "name": "Relentless Indigenous Woman Podcast",
  "spotifyId": "6iLA4Gwna3XqLfKVEwYnmW",
  "appleId": 1705493595,
  "episodes": [
    {
      "id": "c84a9654-8ab4-4032-b024-ed24cf4d8dda",
      "title": "Ep. 23: Sacred Rage \u0026 Queer Truth: Jayli Wolf on Healing Through Music",
      "description": "In an unfiltered conversation, Jayli Wolf and I demolish the toxic religious trauma from our Jehovah\u0027s Witness and evangelical backgrounds. We expose how these belief systems systematically stripped us of autonomy, sexuality, and indigenous spiritual connections, leaving behind a toxic landscape of shame, fear, and suppressed rage. From forced door-to-door preaching to suffocating purity culture, we unpack how these institutions control and silence young women, especially those who are queer and indigenous. Our dialogue transforms into a fierce declaration of reclamation. Through art, music, feminine rage, and radical self-love, we\u0027re actively dismantling these oppressive internalized narratives. Jayli\u0027s music becomes a powerful outlet for healing, transforming pain into sound that challenges colonial and religious systems. We celebrate questioning everything, trusting our intuition, and creating space for our full, messy, beautiful selves - a defiant love letter to our younger, silenced versions. Jayli’s Bio Jayli Wolf is a Saulteau First Nation musician, sound weaver, poet, actress, and filmmaker whose art is a portal to healing, reclamation, and truth. Her solo breakout single Child of the Government—a visceral anthem about the Sixties Scoop—garnered national acclaim, including a spot on CBC Music’s Top 10 Canadian Songs of 2021 and a Best Music Video award at the Venice Short Film Awards.Raised in a trailer park and told she was half-Mexican, Jayli didn’t learn about her First Nations roots until age eight, when her father—an unwitting survivor of the Sixties Scoop—reached out. Her journey of reconnection with her culture, identity, and Spirit now pulses through everything she creates. A former Jehovah’s Witness, Jayli left what she calls a Doomsday cult to pursue music and self-liberation. Today, her critically acclaimed EP Wild Whisper and her roles in films like Run Woman Run continue to showcase her depth and unapologetic voice. Nominated for multiple JUNO and film awards, Jayli alchemizes revelation into sound, crafting work that elevates the soul and invites collective healing. www.jayliwolf.com IG \u0026 TikTok: @jayliwolf - www.relentlessindigenouswoman.ca - Music Produced by Anishnaabe DJ Boogey the Beat Send Us a Text with Your Thoughts or Questions!",
      "release": "2025-06-28T11:00:00Z",
      "duration": "00:50:48.2800000",
      "explicit": true,
      "spotifyId": "3mZK0piGeGjjVt5iXQLEUs",
      "appleId": 1000714920247,
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mZK0piGeGjjVt5iXQLEUs",
        "apple": "https://podcasts.apple.com/podcast/ep-23-sacred-rage-queer-truth-jayli-wolf-on-healing/id1705493595?i=1000714920247"
      }
    }
  ]
}