{
  "id": "cdf20f83-7704-46f4-a8a0-f68883750eb4",
  "name": "Religion Media Centre",
  "youTubeChannelId": "UCthZf6RVTqJki6oTQTB6qmw",
  "episodes": [
    {
      "id": "001bceb7-4324-43c0-b064-9b91d54b7cb6",
      "title": "RMC Briefing: \u0027Seismic shock\u0027 as Archbishop of Canterbury Justin Welby resigns over abuse scandal",
      "description": "The resignation of Justin Welby as Archbishop of Canterbury has left the Church of England reeling.  There is consensus that he had no option after the publication of the Makin report which exposed the horrific abuse of young men and boys by the barrister, John Smyth, and a decades-long cover-up by the Church of England.\n\nSmyth led Christian summer camps run by the Iwerne Trust which Justin Welby attended as a young man. From the mid-1970s, Smyth groomed boys and then took them back to his garden shed where they were beaten until they bled. The abuse was known about in the church from the early 1980s but was covered up. Smyth left the country and died in 2018, having never been brought to justice.\n\nIn a statement, Justin Welby said he was taking personal and institutional responsibility for the failure to act on the John Smyth abuse between 2013 and 2024 and had a profound sense of shame at the historic safeguarding failures of the Church of England. His resignation, which is without precedent, has been described as a seismic shock. Roger Bolton hosts this discussion with guests:\n\n-Andrew Graystone, author of Bleeding for Jesus, an account of John Smyth\u0027s abuse\n-Susie Leafe, Director of Anglican Futures\n-Mark Stibbe, survivor, author and former vicar\n-Frances Martin, reporter with the Church Times\n-Professor Linda Woodhead, King\u0027s College, London\n-Prof Helen King, member of the General Synod\n\nFor more information on Religion Media Centre briefings: info@religionmediacentre.org.uk",
      "release": "2024-11-13T12:03:56Z",
      "duration": "00:55:52",
      "explicit": false,
      "youTubeId": "ztUyC40JqzM",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ztUyC40JqzM"
      }
    }
  ]
}