{
  "id": "118ac42d-1c08-4b74-a94b-c07a985c38b0",
  "name": "RESILIENT A.F. with Blair and Alana",
  "spotifyId": "3HABVK6tznPWn5dxCP4QtH",
  "appleId": 1784484341,
  "youTubeChannelId": "UC_bfjq2D0hVRH9GopoRxqgA",
  "episodes": [
    {
      "id": "42ec8a21-b335-41b0-95c7-880b6fe62023",
      "title": "Escaping a Sex Cult with Sarah Edmondson | 045",
      "description": "In this episode, Blair Kaplan Venables interviews Sarah Edmondson, an actress and whistleblower of the NXIVM cult, about her journey and experiences. Sarah joined NXIVM in 2005, believing it was a personal development program, but later discovered its darker, cult-like nature. She describes the red flags she encountered, including high-pressure sales tactics and the eventual branding with cult leader Keith Raniere\u0027s initials. Sarah emphasizes the importance of self-education, therapy, and community support in recovery. She also discusses the upcoming book she co-authored with her husband, which aims to help others identify and escape from cult-like. This is her story and she is RESILIENT A.F. Pre-order Sarah\u0027s upcoming book on her website at Sarahedmondson.com/book. Buy the books: https://theglobalresilienceproject.com/books/ Be featured in RESILIENT A.F.: Stories of Resilience Vol. 3: https://blairkaplan.kartra.com/page/RAF26 About the Guest: Sarah Edmondson is a Canadian actress and voice-over artist who has starred in multiple TV series and more than a dozen films. Her whistleblower story following her departure from personal and professional development company NXIVM is told in her memoir, Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life, the CBC podcast “Uncover: Escaping NXIVM,” and critically acclaimed HBO documentary series on NXIVM, The Vow. Co-hosted by her husband and fellow NXIVM whistleblower Anthony “Nippy” Ames, her podcast, A Little Bit Culty, explores the fads, beliefs, and trends that blur the line between devotion and dysfunction to help people understand, heal from, and avoid abusive situations. Besides her work as an actor and podcaster, Sarah attends conferences and events as a speaker, host, and cult-recovery advocate. Her TEDx talk, “How to spot a cult,” is featured on TED.com. Links: Email: sarah@sarahedmondson.com Website: www.sarahedmondson.com Facebook: https://www.facebook.com/sarah.edmondson.752 Instagram: https://www.instagram.com/sarahedmondson/ Twitter: https://twitter.com/sarahjedmondson Book:https://amzn.to/4hVquPu ⚠️ Content Note: Some episodes may contain themes that could be distressing. Please take care of yourself while listening, and don’t hesitate to seek support from a mental health professional if needed. About the Hosts: Blair Kaplan Venables is a British Columbia-based grief and resilience expert and coach, motivational speaker and the Founder of The Global Resilience Project. Her expertise has been featured on media platforms like Forbes, TEDx, CBC Radio, Entrepreneur, and Thrive Global. She is named the Top Grief and Resilience Expert of the Year 2024 by IAOTP. USA Today listed Blair as one of the top 10 conscious female leaders to watch and she empowers others to be resilient from stages around the world. \u0027MyStory,’ which is a television show available on Amazon Prime Video, Apple TV\u0026#43; and Google Play, showcases Blair\u0027s life story. She is the host of the Radical Resilience podcast and specializes in helping people strengthen their resilience muscle using scientifically proven methods and guides grieving high performers with her Navigating Grief Framework. The Global Resilience Project’s award-winning book series are international bestsellers, and her fourth book, RESILIENT A.F.: Stories of Resilience Vol 2, will be published in January 2025. In her free time, you can find Blair writing, in nature, travelling the world and helping people to strengthen their resilience muscles. Links: https://www.blairkaplan.ca/ https://theglobalresilienceproject.com https://www.linkedin.com/in/blairdkaplan https://www.facebook.com/blair.kaplan https://www.facebook.com/BlairKaplanCommunications https://www.instagram.com/globalresiliencecommunity https://www.instagram.com/blairfromblairland/ https://www.facebook.com/globalresiliencecommunity https://www.linkedin.com/company/the-global-resilience-project blair@blairkaplan.ca Alana Kaplan is a compassionate mental health professional based in Winnipeg, Manitoba, Canada. She works in the mental health field, and is a co-host of the Resilient A.F. podcast. Fueled by advocacy, Alana is known for standing up and speaking out for others. Passionate about de-stigmatizing and normalizing mental health, Alana brings her experience to The Global Resilience Project’s team, navigating the role one’s mental health plays in telling their story. Engaging in self-care and growth keeps her going, and her love for reading, travel, and personal relationships helps foster that. When she’s not working, Alana can often be found on walks, working on a crossword puzzle, or playing with any animal she sees. Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode and think that others could benefit from listening, please share it using the social media buttons on this page. Do you have some feedback or questions about this episode? Leave a comment in the section below Subscribe to the podcast If you would like to get automatic updates of new podcast episodes, you can subscribe to the podcast on Apple Podcasts or on yourfavorite podcast app. Leave us an Apple Podcasts review. Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review.",
      "release": "2025-09-16T11:00:00Z",
      "duration": "01:01:10.5610000",
      "explicit": true,
      "spotifyId": "1ZQTvLIFGVLpbEAVZEJhdV",
      "appleId": 1000727039378,
      "youTubeId": "MEL_CaQzGhc",
      "subjects": [
        "NXIVM",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ZQTvLIFGVLpbEAVZEJhdV",
        "apple": "https://podcasts.apple.com/podcast/escaping-a-sex-cult-with-sarah-edmondson-045/id1784484341?i=1000727039378",
        "youtube": "https://www.youtube.com/watch?v=MEL_CaQzGhc"
      }
    }
  ]
}