{
  "id": "fab9b862-e0d4-4898-846e-a1d68a97eddf",
  "name": "Resilience and Relationships (R\u0026R)",
  "spotifyId": "5beIXmJCmEq9ZcGKg1DibD",
  "appleId": 1588808625,
  "episodes": [
    {
      "id": "393ab876-9809-475f-80fc-3569f46ee945",
      "title": "Unpacking Human Trafficking: A Survivor\u0027s Perspective - Guest Kim Kelley - Resilience \u0026 Relationships (R\u0026R) - Stephanie Olson and Rebecca Saunders",
      "description": "402-521-3080\nIn this conversation, Stephanie Olson and Rebecca Saunders engage with Kim Kelley, a survivor of child trafficking, who now advocates for effective solutions to combat human trafficking and child exploitation. They discuss the complexities of trafficking, the need for trauma-informed care, and the importance of community involvement and law enforcement training. Kim emphasizes the misconceptions surrounding \u0027rescuing\u0027 children and the necessity for transparency in NGOs and social services. The conversation highlights the critical role of survivor involvement in shaping effective programs and the need for collaborative approaches to protect children.\nranchtx.org\nDigital Defenders United - digitaldefendersunited.org \nTakeaways\nKim Kelly is a survivor of child trafficking and now advocates for effective solutions.\nUnderstanding the complexities of human trafficking is crucial for effective intervention.\nLaw enforcement often lacks the necessary training to identify and assist trafficking victims.\nCommunity involvement is essential in preventing child exploitation.\nThe misconception of \u0027rescuing\u0027 children can lead to further trauma.\nEffective solutions require collaboration between various sectors, including law enforcement and NGOs.\nSurvivor involvement is critical in shaping effective programs and solutions.\nTransparency in funding and organizational effectiveness is necessary for real impact.\nTrauma-informed care is essential in supporting survivors of trafficking.\nEducation and awareness are key components in combating trafficking.\n\n\nSound bites\n\n\u0022Awareness is powerful, but we need to take action.\u0022\n\u0022Not all abuse is trafficking.\u0022\n\u0022If we don\u0027t understand the problem, we can\u0027t solve it.\u0022\n\n\nChapters\n\n00:00 Introduction to Resilience and Relationships\n02:29 Understanding Child Trafficking and Exploitation\n06:42 The Role of Law Enforcement in Child Protection\n12:52 Defining Human Trafficking and Its Impact\n18:36 The Complexity of Rescuing Children\n25:31 Challenges in Social Services and Law Enforcement Training\n29:54 Understanding Trauma-Informed Approaches\n36:12 The Role of Law Enforcement in Aftercare\n37:32 Vetting Organizations for Effectiveness\n40:19 The Importance of Tailored Healing Modalities\n48:45 Funding and Transparency in Nonprofits\n56:47 Connecting with Experts and Resources\nSupport the show\nEveryone has resilience, but what does that mean, and how do we use it in life and leadership? Join Stephanie Olson, an expert in resiliency and trauma, every week as she talks to other experts living lives of resilience. Stephanie also shares her own stories of addictions, disordered eating, domestic and sexual violence, abandonment, and trauma, and shares the everyday struggles and joys of everyday life. As a wife, mom, and CEO she gives commentaries and, sometimes, a few rants to shed light on what makes a person resilient. So, if you have experienced adversity in life in any way and want to learn how to better lead your family, your workplace, and, well, your life, this podcast is for you!\n\nhttps://setmefreeproject.net\n https://www.stephanieolson.com/",
      "release": "2025-10-01T17:00:00Z",
      "duration": "00:56:04",
      "explicit": false,
      "spotifyId": "4mbaXCs7ENvPygicgiXeYS",
      "appleId": 1000729558869,
      "subjects": [
        "Human Trafficking",
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mbaXCs7ENvPygicgiXeYS",
        "apple": "https://podcasts.apple.com/podcast/unpacking-human-trafficking-a-survivors-perspective/id1588808625?i=1000729558869"
      }
    }
  ]
}