{
  "id": "33fb04ab-ecaa-438a-bcfc-e14a535ea4c2",
  "name": "Retrieving Sanity: Mental Health Recovery from Addictions and Traumas",
  "spotifyId": "0S3xfznGVV6ZkRuIXcMYUb",
  "appleId": 1668670029,
  "youTubeChannelId": "UCGj_FMlJ5ZSrNhCaAacvFYg",
  "episodes": [
    {
      "id": "ecb8e2d6-60d1-488a-a619-f50dcaa51e74",
      "title": "The Deceptive Truth Behind Troubled Youth Programs with Dr. Corey Jentry",
      "description": "Keegan Read and Dr. Corey Jentry discuss the complexities of the troubled teen industry, the impact of environmental factors on adolescent development, and the challenges faced in treatment programs. Dr. Jentry shares his personal journey through addiction recovery, highlighting the disconnect between treatment expectations and reality, the importance of compliance in treatment, and the struggles of transitioning back to life after treatment. The conversation emphasizes the need for better advocacy and understanding of mental health and recovery, as well as the significance of education and self-discovery in personal growth. In this conversation, Dr. Corey Jentry discusses the complexities of the treatment industry, particularly focusing on the troubled teen industry and the efficacy of various treatment methods. He shares his personal experiences and insights into the mythology surrounding recovery, the disillusionment he faced in the treatment world, and the importance of understanding the science behind treatment efficacy. The conversation also touches on the societal expectations placed on men regarding mental health and the ethical concerns surrounding the business of treatment. Takeaways The troubled teen industry often profits from trauma. Teenage years are a critical developmental phase, not a mental health diagnosis. External factors like family environment significantly impact teen behavior. Treatment programs can sometimes exacerbate existing issues rather than resolve them. Compliance in treatment is often mistaken for progress. The disconnect between treatment expectations and reality can lead to further issues. Life after treatment can be challenging without proper support and skills. Cultural perspectives on recovery can vary greatly between regions. Education and self-discovery are crucial for personal growth post-treatment. Advocacy for better treatment practices is essential. The treatment industry often promotes a mythology of the \u0027good life\u0027 that is misleading. Disillusionment can arise when one sees the business side of recovery. Many treatment programs lack scientific grounding and evidence-based practices. The troubled teen industry is fraught with ethical concerns and questionable practices. Adolescents often face complex mental health challenges that require nuanced understanding. Identity formation is crucial in therapy, especially for teenagers. Men\u0027s mental health struggles are often overlooked in discussions about treatment. Families should approach treatment options with the same scrutiny as they would for education. The financial dynamics of the treatment industry can lead to exploitation. It\u0027s essential to question the legitimacy of treatment programs and their claims. Chapters 00:00 Introduction to Troubled Youth and Recovery 02:13 Core Experiences of Growing Up in a Troubled Environment 05:07 The Allure of Treatment Programs 07:40 The Reality of Treatment Programs 10:34 The Struggles of Compliance and Control 13:29 The Impact of Group Dynamics in Treatment 16:08 The Transition Out of Treatment Programs 19:08 Navigating Life After Treatment 21:41 The Struggles of Early Recovery 23:44 Finding Purpose in Education 26:20 The Journey into Academia 27:33 Transitioning to the Professional World 31:23 Disillusionment with the Recovery Industry 36:03 Understanding the Troubled Teen Industry 38:35 The Reality of Behavioral Health Treatment 41:11 Navigating Teenage Mental Health 44:54 The Male Perspective on Mental Health 47:00 Educating Families on Treatment Options 52:21 The Economics of Behavioral Health Care 53:42 Understanding Healthcare Fraud in Treatment Centers 56:15 The Deregulated Nature of the U.S. Healthcare System 57:31 The Importance of Community in Healing 59:08 Challenges in Mental Health Funding 01:01:49 The Role of Identity in Recovery 01:04:14 Navigating Transitions and Change 01:05:38 The Journey of Self-Discovery 01:07:58 Integrating Mental Health Practices 01:12:30 Retrieving Sanity: Personal Reflections and Practices #podcast #mentalhealthpodcast #retrievingsanity #troubledteenindustry #addictionrecovery #addictiontreatment #healingjourney #traumarecovery #traumahealing #roughchildhood #resilience Call 988 if you are experiencing ANY mental crisis! Be sure to check out Retrievingsanity.com for all past guest resources! Want to be a guest on Retrieving Sanity: A Mental Health Podcast? Send Keegan Read a message on PodMatch, here: https://www.podmatch.com/hostdetailpreview/retrievingsanitypodcast\n\nGet the reflection sheet here: https://drive.google.com/file/d/1Up8q-nBWQTIKZgivMiW9_KcD_HgJ0VMF/view?usp=sharing Check his website here: https://www.jentryconsultingservices.com/",
      "release": "2025-12-07T18:51:54Z",
      "duration": "01:16:08.5680000",
      "explicit": true,
      "spotifyId": "1f8F3zMwNaIghdJqgwRtXY",
      "appleId": 1000740103345,
      "youTubeId": "7GeeuKsAApA",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1f8F3zMwNaIghdJqgwRtXY",
        "apple": "https://podcasts.apple.com/podcast/the-deceptive-truth-behind-troubled-youth-programs-with/id1668670029?i=1000740103345",
        "youtube": "https://www.youtube.com/watch?v=7GeeuKsAApA"
      }
    }
  ]
}