{
  "id": "4284ce13-49b8-4a38-82c4-c9e1f5dedf31",
  "name": "REVOLUTIONS PER MOVIE",
  "spotifyId": "2v2licLI46PfYxQA0GTwHH",
  "appleId": 1706022094,
  "episodes": [
    {
      "id": "6257305f-7a4e-4791-a23a-60838f818a88",
      "title": "\u0027THE SOURCE FAMILY\u0027 w/ Jon Raymond",
      "description": "This week, we talked to Jon Raymond (author of Denial, Freebird; screenwriter of Old Joy, First Cow \u0026 Showing Up w/ Kelly Reichardt, Mildred Pierce w/ Todd Haynes) about The Source Family documentary, which follows the rock n’ roll hippie California cult of the same name. We also talk about Jon’s work with Kelly Reichardt, why so many cult leaders also want to be rock n’ roll stars, the legacy and legitimacy of Yahowa 13’s music recordings \u0026 how The Source Family might have been The Monkees of the California cult scene. So get your stars aligned and your multidimensional soup ready for this week’s episode of Revolutions Per Movie. JON RAYMOND: https://www.simonandschuster.com/books/Denial/Jon-Raymond/9781982181840 https://plazm.com/bios/jon-raymond/ REVOLUTIONS PER MOVIE: Host Chris Slusarenko (Eyelids, Guided By Voices, owner of Clinton Street Video rental store) is joined by actors, musicians, comedians, writers \u0026 directors who each week pick out their favorite music documentary, musical, music-themed fiction film or music videos to discuss. Fun, weird, and insightful, Revolutions Per Movie is your deep dive into our life-long obsessions where music and film collide. New episodes of Revolutions Per Movies are released every Thursday, and if you like the show, please subscribe, rate, and review it on your favorite podcast app. The show is also a completely independent affair, so the best way to support the show is through our Patreon at patreon.com/revolutionspermovie, where you can get weekly bonus episodes and exclusive goods sent to you just for joining. patreon.com/revolutionspermovie @revolutionspermvoie X, BlueSky: @revpermovie Theme by Eyelids \u0027My Caved In Mind\u0027 www.musicofeyelids.bandcamp.com Artwork by Jeff T. Owens https://linktr.ee/mymetalhand Click here to get EXCLUSIVE BONUS WEEKLY Revolutions Per Movie content on our Patreon Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-03-28T09:00:38Z",
      "duration": "00:54:11.2260000",
      "explicit": true,
      "spotifyId": "3CViEmWRRPcx4CP7CBlNSr",
      "appleId": 1000650709312,
      "subjects": [
        "The Source Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3CViEmWRRPcx4CP7CBlNSr",
        "apple": "https://podcasts.apple.com/podcast/the-source-family-w-jon-raymond/id1706022094?i=1000650709312"
      }
    }
  ]
}