{
  "id": "821f63b0-598c-4f85-bb3e-dcdf526d687a",
  "name": "Revolutionise Your Love Life",
  "spotifyId": "6cDM1bMTl4iSp9vWsFzziU",
  "appleId": 1499327006,
  "episodes": [
    {
      "id": "26023dc2-64f3-4f9c-9b21-689d317e8a09",
      "title": "97: Overcoming Attachment Trauma in Relationships: A Conversation with Lou Lackman",
      "description": "In this episode of Revolutionise Your Love Life, Heather speaks with therapist Lou Lachman about how early attachment experiences shape adult relationships and self-connection. Lou shares their history of rotating caregivers within a cult, how that fracture in attachment led to people-pleasing and self-erasure in love, and the practices that now support authentic relating. They discuss the fawn response, learning to speak needs without fear, parts work, and becoming your own “marriage arranger” so choices come from an adult, regulated place rather than from younger parts. Key takeaways: Early attachment informs both how we connect to others and how we connect to ourselves. Repairing self-attachment requires time, practice, and compassionate awareness. The fawn response looks like saying whatever keeps the peace. It prevents truth, blocks differentiation, and slowly erodes intimacy. Parts work helps identify the age and need behind a reaction. Lou’s Heart Holding practice meets that part with reassurance, which creates space for adult choice. Be your own marriage arranger. Choose partners who align with your values, help you feel larger and steadier, and can tolerate ordinary conflict. Healing is amplified in community. Small, facilitated circles provide co-regulation, shared courage, and faster integration. About Your Host: Heather has been working in mental and emotional health for over 30 years. First as an Art Psychotherapist then as a Counsellor and Couples Therapist. She now specialises in love and relationship coaching. Heather is a qualified Calling in “The One” and “Conscious Uncoupling” coach, having been trained and mentored by Katherine Woodward Thomas. In addition, she is a long-term accredited member of The British Association for Counselling and Psychotherapy, Health and Care Professions Council registered and a member of The British Association of Art About Lou Lachman Lou is accredited by the British Association for Counselling and Psychotherapy (BACP) and accredited by the EFT and Matrix Re-imprinting Academy. She first trained in Core Process Psychotherapy, a Buddhist Psychology based training. She has over 30 years of experience in counselling and psychotherapy, having worked with people in hospitals, doctor’s surgeries, agencies, prisons and private practice. She has also trained and practised as an addiction counsellor. They value their personal recovery from attachment trauma as a core credential alongside formal training. Lou calls their approach Embody Freedom, blending parts-informed practice with body-based healing. They facilitate intimate healing circles and one-to-one work. Lou has this great ebook resource for you here: https://energycounselling.co.uk/heart-holding-reassurance/ This podcast is brought to you by Boost and Bloom.",
      "release": "2026-01-11T07:00:00Z",
      "duration": "00:27:00.1440000",
      "explicit": false,
      "spotifyId": "6XMR72TLvKDtMlr0m8SAGl",
      "appleId": 1000744658101,
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6XMR72TLvKDtMlr0m8SAGl",
        "apple": "https://podcasts.apple.com/podcast/overcoming-attachment-trauma-in-relationships-a/id1499327006?i=1000744658101"
      }
    }
  ]
}