{
  "_ts": 0,
  "id": "ada539b1-e641-4753-80a7-2972eab71896",
  "name": "Richard Marsh",
  "youTubeChannelId": "UCMzuvxh09Pp7zNkVpQBhczg",
  "episodes": [
    {
      "id": "930cdbf5-5f80-43ab-80de-b4a057d673d4",
      "title": "Pete Perisin and Shelby Elias v. residents of Barrington IL. A PBCC public relations disaster!",
      "description": "Barrington. A $3 million quid pro quo?\nThe President and Vice-president of the South Barrington Park District Board of Commissioners are Pete Perisin and Shelby Elias. These two have been instrumental in pushing through the Plymouth Brethren “church” school and superstore deal, by fair means and foul, despite the glaring evidence that this would be detrimental to the community and to the Park District’s tax base.\nThe million dollar question is…why?\nI can tell you exactly why. Pete Perisin and Shelby Elias are both realtors.\nhttps://www.coldwellbankerhomes.com/.../peter.../aid_89123/\nhttps://www.compass.com/agents/2306278/\nTo understand the significance of this, I have to explain some of the extraordinary rules that the PBCC imposes on its members. The PBCC place great importance on living in close proximity to their Gospel Hall or “Church” – ideally within walking distance, but at the very most, within 10 miles.\nThe present Gospel Hall for the Chicago PBCC congregation is in Melrose Park, due south of O’Hare International Airport. The proposed new Gospel Hall is 27 miles away by road. The 10 mile radius catchment areas for the old and new hall have no overlap – so when the new hall is built, and the old hall closed - every single PBCC household will be moving to the Barrington area – and there are more than 60 households. With the need to both sell their old houses, and to buy new ones, that is 130 or more real estate transactions over the period of a year or two.\nThe brethren in any congregation will typically all be loyal customers of one or two realtors. That is because they have very specific housing requirements relating to their religious rules, and there is usually an informal “group buying” arrangement where the realtor will tip off the PBCC about suitable properties for homes or halls in exchange for the loyalty of the community. It would be extremely simple for PBCC elders Steve Johnstone and Dale Diener to ensure that Pete Perisin and Shelby Elias got the lion’s share of the brethren members\u0027 real estate business, in exchange for facilitating the purchase and rezoning of “Area N” at a remarkably cheap price.\nWhat would a deal like this be worth to our “volunteer” Commissioners, Perisin and Elias?\nBrethren do not live in cheap homes. They do not live in townhouses, or apartments. They like to be as far from their neighbors as possible, and nothing suits them better than a McMansion on at least an acre of ground. Their average home value is going to be at least $800,000.\nSo assuming 130 real estate transactions – 65 sales and 65 purchases, that is a total of $104 million. Taking a conservative realtor’s commission rate of 3% , our friends the President and Vice-President could benefit to the tune of $3,120,000.\nThe whole scheme is a realtor\u0027s wet dream. What other possible use for the land could bring 130 high value transactions in to their bank accounts?\nI would suggest that the lawyer for the “various residents of Barrington” brushes up on “Conflict of Interest” law.",
      "release": "2023-09-01T20:36:11Z",
      "duration": "00:01:57",
      "explicit": false,
      "youTubeId": "lXlO0099s94",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lXlO0099s94"
      }
    },
    {
      "id": "5b75b9ec-e119-4bce-8060-6c31d2ab2106",
      "title": "Barrington protest PBCC church and school plan.",
      "description": "The Plymouth Brethren Christian Church plan to build a 17,000sq ft church, plus a school and superstore in Barrington IL, a suburb of Chicago. here a former member of the PBCC explains exactly what a PBCC \u0022church\u0022 will look like, and exposes the PBCC representative Dale Diener\u0027s lie that the capacity of the hall will be only 1000 persons. We also get a tour inside a PBCC meeting hall and the reason for the mysterious sliding doors and outsize A/C  units is explained. \nWE go on to look at Bruce D Hales\u0027s ministry, and explain what \u00224 square feet per person\u0022 means in the context of a 17,000sq feet hall. We look at the \u0022circus tent\u0022 outside a Manitoba PBCC hall, and explain that with each giant \u0022city hall\u0022: the PBCC build, there will be several smaller \u0022local\u0022 halls required. \nWe look at how the PBCC regard their neighbours, and using quotes from their own printed literature, expose the two-faced way in which they seem to offer a friendly hand while despising and hating non-members as \u0022worldlies\u0022.\nPBCC Campus\u0026Co superstores like the one proposed usually contain a well stocked liquor store. Are the brethren really planning to put a liquor store and a school in the same building?\nWe look at how the Brethren rationalise and excuse using lies and deception to obtain what the church needs from the \u0022hostile\u0022 world, which it regards as satanic. \nAny community faced with the prospect of the Plymouth Brethren seeking planning permission for a \u0022Gospel Hall\u0022 needs to study this video carefully.\nNote 1. All ministry quotes are from Subject Index to the Ministry of B D Hales, Copyright Bible and Gospel trust 2014. \nNote 2. Correction: The  A/C units in the 17,000 sq ft room shown are not the size of a semi-trailer - they are about 8\u0027 x 27\u0027 - more the size of a  school bus.",
      "release": "2023-08-31T15:19:08Z",
      "duration": "00:21:15",
      "explicit": false,
      "youTubeId": "71ldXE0xcTY",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=71ldXE0xcTY"
      }
    },
    {
      "id": "a986d68f-7d8b-4be6-a6d4-3f671bcab9db",
      "title": "Barrington protest PBCC church and school plan.",
      "description": "The Plymouth Brethren Christian Church plan to build a 17,000sq ft church, plus a school and superstore in Barrington IL, a suburb of Chicago. here a former member of the PBCC explains exactly what a PBCC \u0022church\u0022 will look like, and exposes the PBCC representative Dale Diener\u0027s lie that the capacity of the hall will be only 1000 persons. We also get a tour inside a PBCC meeting hall and the reason for the mysterious sliding doors and outsize A/C  units is explained. \nWE go on to look at Bruce D Hales\u0027s ministry, and explain what \u00224 square feet per person\u0022 means in the context of a 17,000sq feet hall. We look at the \u0022circus tent\u0022 outside a Manitoba PBCC hall, and explain that with each giant \u0022city hall\u0022: the PBCC build, there will be several smaller \u0022local\u0022 halls required. \nWe look at how the PBCC regard their neighbours, and using quotes from their own printed literature, expose the two-faced way in which they seem to offer a friendly hand while despising and hating non-members as \u0022worldlies\u0022.\nPBCC Campus\u0026Co superstores like the one proposed usually contain a well stocked liquor store. Are the brethren really planning to put a liquor store and a school in the same building?\nWe look at how the Brethren rationalise and excuse using lies and deception to obtain what the church needs from the \u0022hostile\u0022 world, which it regards as satanic. \nAny community faced with the prospect of the Plymouth Brethren seeking planning permission for a \u0022Gospel Hall\u0022 needs to study this video carefully.\nNote 1. All ministry quotes are from Subject Index to the Ministry of B D Hales, Copyright Bible and Gospel trust 2014. \nNote 2. Correction: The  A/C units in the 17,000 sq ft room shown are not the size of a semi-trailer - they are about 8\u0027 x 27\u0027 - more the size of a  school bus.",
      "release": "2023-08-31T04:37:17Z",
      "duration": "00:21:08",
      "explicit": false,
      "youTubeId": "3XSd2TkZQng",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3XSd2TkZQng"
      }
    },
    {
      "id": "56bffe52-072e-414f-acd5-33c7c2bc12df",
      "title": "Plymouth Brethren Christian Church sex trafficking, pedophilia and torture on CTV news.",
      "description": "Plymouth Brethren Christian Church in Maple Creek, SK are in the news again over the horrific allegations of child sexual abuse, trafficking and torture laid against two of their senior members.",
      "release": "2023-05-31T13:08:18Z",
      "duration": "00:02:29",
      "explicit": false,
      "youTubeId": "DcL-fLbEPDo",
      "subjects": [
        "Plymouth Brethren Christian Church",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DcL-fLbEPDo"
      }
    },
    {
      "id": "46f3c55a-8c7d-45e8-9ee6-7ef686a452be",
      "title": "PBCC Gareth Hales called a \u0022modern-day pirate\u0022 in UK House of Parliament",
      "description": "Nick Smith MP calls Plymouth Brethren Christian Church leaders Gareth Hales and Charles Hales \u0022modern-day pirates\u0022 and \u0022profiteers\u0022 in his speech about Unispace and Sante Global. gareth and Charles Hales are sons of PBCC despotic leader Bruce D Hales.\nhttps://hansard.parliament.uk/Commons/2022-12-06/debates/CC966116-A7FF-4470-81EF-203E0C520A0E/GovernmentPPEContracts#contribution-2AD5A794-D3EE-46A2-8604-D0E8F32D0A2D",
      "release": "2023-01-17T16:06:08Z",
      "duration": "00:01:44",
      "explicit": false,
      "youTubeId": "7q6enDGfBds",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7q6enDGfBds"
      }
    },
    {
      "id": "487856cf-fee6-4818-bd43-432ac9a77950",
      "title": "Investigative Journalist Justin Ling speaks out about the Plymouth Brethren Christian Church (PBCC)",
      "description": "This piece largely concerns an Evangelical sect known as the Plymouth Brethren Christian Church it is a  particularly insular organization, it\u0027s not very big, maybe 50 000 members worldwide and it it rests on the theology that the rest of the world is wicked, only members of this church are good and pure and therefore they shouldn\u0027t associate with anybody outside the church, even other Evangelical denominations much less other religions or non-believers and that begets I think what has been alleged is cult-like behavior. They become increasingly insular, anybody who tries to leave gets excommunicated, denounced and what we\u0027ve seen in Australia, New Zealand and elsewhere is this practice of hiring private investigators to go after people who have left the church and those who have spoken out about it, and seemingly that\u0027s what happened here in Canada, allegedly that\u0027s what happened here.  This Wallace fellow was was hired by this semi-prominent lawyer I think working independently, a guy by the name of Gerald Chipeur (supposedly Pierre Poilievre\u0027s dad) and Chipeur hires him to go track down this one particular whistleblower who had left the church and and kind of rung the bell about some of these shady practices. Well over the course of of doing that contract Wallace has a falling out with Chipeur and with the church and some others and he actually goes to the guy he was supposed to be surveilling and said \u0022Hey listen, the church that has it out to get you, they want me to track you down, they want me to take your cell phone, they might even want me to kidnap you. I think you should be aware and maybe you want to skip town.\u0022 So this is all well supported by these documents and this is all some pretty crazy stuff. I mean you know this is kind of Scientology-like behavior, this is the sort of thing we should be aware of and alert to and worried about. This sort of behavior we should not be tolerating from from a religious sect in this country and it\u0027s worth  a fair bit of scrutiny.",
      "release": "2023-01-09T17:38:02Z",
      "duration": "00:02:26",
      "explicit": false,
      "youTubeId": "IKCFtQ_7vuM",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IKCFtQ_7vuM"
      }
    },
    {
      "id": "dc23a21b-00e4-4833-a33d-b70505873bff",
      "title": "Gareth Hales\u0027s Sante Group pandemic profiteering exposed in UK parliament at PMQ.",
      "description": "Gareth Hales\u0027s Sante Group pandemic profiteering exposed in UK parliament at PMQ. Lobbyist Mark Fullbrook helped  Plymouth Brethren Christian Church businesses gain £2.3 billion in pandemic PPE contracts under the corrupt Boris regime. Now he is the Prime Minister\u0027s Chief of Staff. Thank you Nick Smith, MP for Blaenau Gwent, for asking the question.\nGareth Hales and Charles Hales head up Sante Group. They are the sons of Bruce D Hales, the PBCC\u0027s autocratic dictator, prophet and profiteer.",
      "release": "2022-10-19T18:17:54Z",
      "duration": "00:00:38",
      "explicit": false,
      "youTubeId": "3aYqybFEVwc",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3aYqybFEVwc"
      }
    },
    {
      "id": "b36e0d43-c738-441b-a907-915915ccf1ac",
      "title": "Plymouth Brethren at Stephen Harper\u0027s victory speech 2011",
      "description": "Five prominent members of the Plymouth Brethren Christian Church were lined up on the front row VIP seats at Stephen Harper\u0027s victory speech in Calgary on the night of the 2011 election. They are Chuck Truan from Detroit MI, Roy Taylor from London, ON, Brad Mitchell from Langley, BC, Ron Barnes from Calgary, AB, now living in Knoxville TN and Ralph Mooney from Woodstock, ON.\nBrad Mitchel is the founder of Klondike Lubricants, for which the Klondike Papers were named. Chuck Truan and Brad Mitchell have worked closely with crooked Conservative lawyer Gerald Chipeur for many years stalking and harassing former PBCC members in order to silence them from speaking out about abuse within the cult. Brad Mitchell criminally obtained phone logs of Richard Marsh\u0027s wife and others using the Universal Business Team (UBT) access to telecoms carriers. \nAfter the speech, Harper walked to the edge of the stage and shook hands with each of the PBCC members, starting with Chuck, who is not even a Canadian resident or citizen.",
      "release": "2022-07-07T22:58:50Z",
      "duration": "00:00:29",
      "explicit": false,
      "youTubeId": "z9gzNQAtTxg",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=z9gzNQAtTxg"
      }
    },
    {
      "id": "f0fbc339-00d0-48f3-8d63-9a1bc664d032",
      "title": "Cheryl Hope speaks out on sex abuse in the Plymouth Brethren Christian Church",
      "description": "A very painful account by a survivor of over 7 years of pedophile sex abuse and trafficking in the Plymouth Brethren Christian Church in Maple Creek, Saskatchewan.",
      "release": "2022-06-30T18:14:52Z",
      "duration": "01:04:57",
      "explicit": false,
      "youTubeId": "BcXpusDAptQ",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BcXpusDAptQ"
      }
    },
    {
      "id": "85c561e3-b52b-4c91-901f-f2cc0582a507",
      "title": "Gerald Chipeur, described by David Wallace as the most dangerous man in Canada.",
      "description": "\u0022Big Government is evil, because government uses force, and so since government is evil, (a necessary evil, we have to accept that) let\u0027s keep it very small in case it gets out of hand and we have to kill it.\u0022\nClipped from the original interview here - https://www.youtube.com/watch?v=F8cU3934KaI\nGerald Chipeur, QC worked with Alan Hallman, and PBCC leaders Rod Diplock, Brad Mitchell and Mick Strange in an illegal attempt to assault Richard Marsh and to steal his computer.",
      "release": "2022-06-25T23:43:55Z",
      "duration": "00:00:16",
      "explicit": false,
      "youTubeId": "79PKFb69tkY",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=79PKFb69tkY"
      }
    },
    {
      "id": "b9094f44-4777-49af-873c-54e4427adc05",
      "title": "Full episode  \u0027Veracity  Breaking Brethren\u0027",
      "release": "2022-03-29T00:30:43Z",
      "duration": "00:43:23",
      "explicit": false,
      "youTubeId": "KvBoQ4ixQvM",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KvBoQ4ixQvM"
      }
    },
    {
      "id": "05c6fac6-5be0-4918-a912-0d1685566dd7",
      "title": "Full audio of PI call re UBT \u0026 PBCC abduction  Criminal act of BDH cult to silence me  #pbccleaks",
      "release": "2022-03-25T20:13:23Z",
      "duration": "00:16:56",
      "explicit": false,
      "youTubeId": "1DOu2YD6S0w",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1DOu2YD6S0w"
      }
    },
    {
      "id": "cbccef76-f256-4b1c-b3ea-e3196f05caef",
      "title": "PBCCKidnappingAttempt ia",
      "release": "2022-03-25T19:35:15Z",
      "duration": "00:09:54",
      "explicit": false,
      "youTubeId": "MhTE-fKe3T0",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MhTE-fKe3T0"
      }
    },
    {
      "id": "60728f9d-cae0-4b81-97c3-44e5182134dd",
      "title": "Unchristian1 ia",
      "description": "The media gets an angry and foul mouthed reception outside a PBCC Plymouth Brethren Christian Church meeting hall.",
      "release": "2022-03-25T16:04:59Z",
      "duration": "00:01:05",
      "explicit": false,
      "youTubeId": "uRRhfcGaiHY",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uRRhfcGaiHY"
      }
    },
    {
      "id": "8e7e08bb-bb8e-4943-bb03-f993de37b1a8",
      "title": "New Zealand MP David Parker on the Exclusive Brethren PBCC using private investigators - PBCC Leaks",
      "description": "#PBCC #UBT #exclusivebrethren #plymouthbrethrenchristianchurch #campusandco #oneschoolglobal #rapidreliefteam #mickstrange #bradmitchell #roddiplock #suzannerailton #klondikelubricants #universalbusinessteam #privateinvestigator #dougwatt",
      "release": "2021-04-29T15:21:43Z",
      "duration": "00:00:48",
      "explicit": false,
      "youTubeId": "YYC7yMz8gEY",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YYC7yMz8gEY"
      }
    },
    {
      "id": "e500af7c-1d57-46f4-a735-c7857ed40cc2",
      "title": "pbccleaks@protonmail.com",
      "description": "#pbcc #plymouthbrethrenchristianchurch #ubt #ubteam #universalbusinessteam #exclusivebrethren #rrt #rapidreliefteam #oneschool #brucedhales #brucehales #bdh #campusandco #pbccleaks #pbccmemes #mickstrange #roddiplock #bradmitchell #suzannerailton",
      "release": "2021-04-15T23:49:48Z",
      "duration": "00:00:53",
      "explicit": false,
      "youTubeId": "P56aERB_S_w",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P56aERB_S_w"
      }
    },
    {
      "id": "c5675a00-d389-485b-9660-0c3e127c5664",
      "title": "Downfall - The last words of Bruce D Hales",
      "description": "#pbcc #plymouthbrethrenchristianchurch #ubt #ubteam #universalbusinessteam #exclusivebrethren #rrt #rapidreliefteam #oneschool #brucedhales #brucehales #bdh #campusandco #pbccleaks #pbccmemes #mickstrange #roddiplock #bradmitchell #suzannerailton",
      "release": "2021-03-30T15:47:58Z",
      "duration": "00:07:14",
      "explicit": false,
      "youTubeId": "hU0O3Vqy3Ec",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hU0O3Vqy3Ec"
      }
    },
    {
      "id": "85f3b340-0ec6-4520-93ca-45555c6540aa",
      "title": "[SCHILLINGS] CAN\u0027T WIN...HERE IS WHY - for every item they take down WE WILL POST TWO MORE.",
      "description": "#PBCC #UBT #EXCLUSIVEBRETHREN #RRT #RODDIPLOCK #BRADMITCHELL #MICKSTRANGE #SUZANNERAILTON #CAMPUSANDCO #DAVIDWALLACE",
      "release": "2021-03-24T01:51:53Z",
      "duration": "00:00:30",
      "explicit": false,
      "youTubeId": "yxRdgbHv2ec",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yxRdgbHv2ec"
      }
    },
    {
      "id": "66e1d9f8-e207-466f-bdde-a631f23640db",
      "title": "The PBCC plan to abduct and silence a critic.",
      "release": "2021-03-24T01:45:48Z",
      "duration": "00:17:42",
      "explicit": false,
      "youTubeId": "z8RdXF6c8Rc",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=z8RdXF6c8Rc"
      }
    },
    {
      "id": "44838f18-bf35-4ca5-821f-e518782d13b0",
      "title": "The PBCC plan to abduct and silence an outspoken critic.",
      "description": "https://linktr.ee/pbcc.leaks​​\nDOWNLOAD TRANSCRIPT: http://bit.ly/kidnapbcc​\n#BRUCEHALES​ MINISTRY QUOTES: http://bit.ly/evilbdh​\nThe #PBCC​​ #UBT​​ #brucehales​​ in a frenzy of futile \u0022damage control\u0022 are trying to block our videos by making defamation complaints to youtube. \nMessage to the PBCC   - The content of these videos is a straight description of the #PBCC​​ by a private investigator that YOU HIRED TO KIDNAP ME.\nYou can\u0027t turn the clock back now, Bruce, even if you waste a whole year of \u0022Special Collections\u0022 trying.\n\nUBT manager Brad Mitchell and prominent PBCC businessman Keith Prince pay a Private Investigator $10,000/week to abduct ex PBCC member and outspoken critic Richard Marsh. Brad Mitchell is the leading \u0022elder\u0022 of ther Vancouver BC PBCC cpngregation and president of their $15,000,000 PBCC \u0022charitable fund\u0022. Keith Prince is the chairman of the Tillsonburg PBCC meeting hall \u0022charity\u0022.Brad Mitchell is President of Klondike Lubricants, Keith Prince is President of Tillsonburg Tube.\nThis is the culmination of 5 years of intense persecution of Richard Marsh, whose only crime is to speak out and expose fraud and corruption in a number of PBCC owned businesses connected with PBCC cult leader Bruce D Hales.\n#PBCC​ #campus​andco #ubt​ #rrt​ #oneschoolglobal​ #BDH​ #brucedhales​ #exclusivebrethren​ #bradmitchell​ #roddiplock​ #mickstrange​ #suzannerailton​ #klondikelubricants​ #controltek​ #allfastenersUSA",
      "release": "2021-03-19T01:06:56Z",
      "duration": "00:27:36",
      "explicit": false,
      "youTubeId": "0vIuGhk07w8",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0vIuGhk07w8"
      }
    },
    {
      "id": "fa39a133-b151-4119-a821-e3cfc66fb985",
      "title": "PBCC \u0022CHARITY\u0022 TRUSTEES HACKED MY FACEBOOK ACCOUNT IN ILLEGAL ATTEMPT TO SILENCE ME. #pbccleaks",
      "description": "#PBCCLEAKS   This screenshare video proves that a PBCC owned UK business, Granta Processors, hacked in to my personal Facebook account and changed the password. ALL THE DIRECTORS OF #GRANTAPROCESSORS ARE PBCC MEMBERS, AND CURRENT OR FORMER TRUSTEES OF #PBCC CHARITABLE TRUSTS. The attack occurred when I was publishing posts exposing multi million dollar fraud and corruption in another PBCC owned business, the directors of which are close friends of the Granta Directors. I cannot name the second business for legal reasons.\nThis hack gave the PBCC full access to all my FB messenger messages including months of personal correspondence with my fiancée. \nThis attack is utterly illegal, immoral and repugnant.\nThe attack was in September 2017. I have been under constant legal, and illegal harassment from the UBT and PBCC for 5 years now.",
      "release": "2021-03-02T13:35:51Z",
      "duration": "00:02:53",
      "explicit": false,
      "youTubeId": "ZnUq46dLpPg",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZnUq46dLpPg"
      }
    },
    {
      "id": "cccf5fa0-e9cd-4ebb-ad76-a2aa9a721d78",
      "title": "PBCC CULT OFFERS PRIVATE EYE BLANK CHEQUE TO ABDUCT EX MEMBER  150K FOR QUICK DELIVERY #pbccleaks",
      "description": "https://linktr.ee/pbcc.leaks​\nDOWNLOAD TRANSCRIPT: http://bit.ly/kidnapbcc\n#BRUCEHALES MINISTRY QUOTES: http://bit.ly/evilbdh\nThe #PBCC​ #UBT​ #brucehales​ in a frenzy of futile \u0022damage control\u0022 are trying to block our videos by making defamation complaints to youtube. \nMessage to the PBCC   - The content of these videos is a straight description of the #PBCC​ by a private investigator that YOU HIRED TO KIDNAP ME.\nYou can\u0027t turn the clock back now, Bruce, even if you waste a whole year of \u0022Special Collections\u0022 trying.\n\nUBT manager Brad Mitchell and prominent PBCC businessman Keith Prince pay a Private Investigator $10,000/week to abduct ex PBCC member and outspoken critic Richard Marsh. Brad Mitchell is the leading \u0022elder\u0022 of ther Vancouver BC PBCC cpngregation and president of their $15,000,000 PBCC \u0022charitable fund\u0022. Keith Prince is the chairman of the Tillsonburg PBCC meeting hall \u0022charity\u0022.Brad Mitchell is President of Klondike Lubricants, Keith Prince is President of Tillsonburg Tube.\nThis is the culmination of 5 years of intense persecution of Richard Marsh, whose only crime is to speak out and expose fraud and corruption in a number of PBCC owned businesses connected with PBCC cult leader Bruce D Hales.",
      "release": "2021-03-02T11:44:42Z",
      "duration": "00:09:54",
      "explicit": false,
      "youTubeId": "tUA9wYyvrBU",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tUA9wYyvrBU"
      }
    },
    {
      "id": "62a1bd5e-8658-416b-8dbc-c14123ae6874",
      "title": "Full audio of PI call re UBT \u0026 PBCC abduction. Criminal act of BDH cult to silence me. #pbccleaks",
      "description": "CONTENT BANNED IN CA  https://linktr.ee/pbccleaks\n DOWNLOAD TRANSCRIPT  https://www.dropbox.com/scl/fi/n5ztb3f3q0nlws93mgczb/04-Feb-2021-PI-call.docx?dl=0\u0026rlkey=pukcy34fdztp8eakurfiviso2\n#BRUCEHALES MURDEROUS MINISTRY QUOTES: https://www.dropbox.com/s/4r0w675780g0nt5/quotes.png?dl=0\n:#pbcc-leaks the full audio file of the call from #bradmitchell to Dr Kirat Singh. #UBT aka #UBteam manager #bradmitchell owner of #klondikelubricants has hired a #privateeye to #abduct or #kidnap #richardmarsh the #privateinvestigator is also funded by #keithprince of #tillsonbergtube both #keithprince and #bradmitchell are members of the #pbcc #plymouthbrethrenchristianchurch #exclusivebrethren which also run the #rrt and #campus\u0026co\nThe #PBCC  #UBT and #RRT are controlled by #Brucedhales aka #BDH",
      "release": "2021-02-26T06:31:45Z",
      "duration": "00:16:56",
      "explicit": false,
      "youTubeId": "6oYH43XH3H0",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6oYH43XH3H0"
      }
    }
  ]
}