{
  "id": "62d4d7d8-90b2-4c33-9c5a-380d4d1705f9",
  "name": "Vibing The Apocalypse",
  "spotifyId": "3xW0M2EQPydlNZicAkukN6",
  "appleId": 1725016667,
  "youTubeChannelId": "UCMgXYprs5DlpHZaAO81-NXA",
  "episodes": [
    {
      "id": "726bf863-0ee1-452a-a6cc-b2da2ddd604d",
      "title": "From Cult to Community: Redefining Identity and Belonging w/ Daniella Young",
      "description": "From Cult Childhood to Creative Healing: Daniela Young’s Journey and Insights\n\nIn this engaging video, host Fresh King Benjamin converses with Daniela Young, a former Children of God cult member and author of ’Uncultured’, delving into her unique upbringing and the challenging journey towards integrating into society after escaping the cult. They explore the dynamics of cult life, including coercive control and the impact on personal development, relationships, and planning for the future. Daniela shares her path of self-discovery, emphasizing the role of creative expression in overcoming her past and building a new identity. Touching on broader definitions of cult experiences and the complexities of redefining purpose outside of such environments, the conversation also incorporates humor and highlights the importance of self-care, community building, and living authentically. Daniela’s exceptional ’apocalypse skill’ is revealed, adding a quirky twist to the discussion. The video concludes by encouraging engagement with Daniela’s ongoing projects and social media initiatives.\n\n00:00 Outlandish Beginnings: A Dive into Cult Life\n00:45 From Child Exploitation to White House Performances\n01:27 Unveiling the True Cost of Cults\n01:55 Embracing the Apocalypse: Childhood in a Cult\n04:39 Navigating Life After the Cult\n07:58 Defining and Deconstructing Cult Dynamics\n26:31 The Journey of Self-Discovery and Expression\n35:00 Reclaiming Identity: From Cult Survivor to Multifaceted Individual\n43:30 Exploring Personal Freedom Through Fashion\n43:40 The Power of Clothing in Self-Expression and Healing\n46:31 Embracing Individuality: From Hair to Wear\n47:59 Breaking Down Appearance Control in Cults\n49:43 The Significance of Clothing and Accessories in Cults\n53:22 Confronting Cult Practices and Their Impact\n56:55 Child Exploitation and the Dark Side of Cults\n01:01:56 The Journey of Deconstruction and Finding Identity\n01:05:17 Cult Dynamics: Control, Exploitation, and the Quest for Power\n01:09:01 Rebuilding After the Cult: Embracing a New Mission\n01:17:21 The Importance of Community and Self in Healing\n01:23:20 Final Thoughts and Future Projects",
      "release": "2024-05-14T16:07:54Z",
      "duration": "01:24:49",
      "explicit": false,
      "spotifyId": "3QWNWivTDSNGHPCw4nOMZo",
      "appleId": 1000655570329,
      "youTubeId": "dhkZkEFZL-8",
      "subjects": [
        "Children Of God",
        "Self-Help",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QWNWivTDSNGHPCw4nOMZo",
        "apple": "https://podcasts.apple.com/podcast/from-cult-to-community-redefining-identity-and/id1725016667?i=1000655570329",
        "youtube": "https://www.youtube.com/watch?v=dhkZkEFZL-8"
      }
    }
  ]
}