{
  "id": "10306fc8-c97a-4554-8e3b-b4fd42746d10",
  "name": "Ringer Dish",
  "spotifyId": "5KfKr4ORhLv7Rj8a5mwsNU",
  "appleId": 1465286477,
  "episodes": [
    {
      "id": "ffa0aacb-2115-438e-8134-255b2938d333",
      "title": "‘Clipped,’ the ‘Traitors’ Season 3 Cast, and TLC\u0027s ‘The Baldwins’ Announcement | We’re Obsessed",
      "description": "First things first: Chelsea gives two updates on last week’s obsessions—her further research on the 7M cult and all the social media posts that have been made about it and the current state of J.Lo’s affairs (1:50). Then they get online and dive deep into the newly announced epic and strange Season 3 cast of ‘The Traitors’ (14:00). Plus, they get on their Hater’s Corner soapbox to denounce the dark-sided news from TLC that it has green-lit a reality show about Hilaria and Alec Baldwin and their seven children called ‘The Baldwins,’ which is sure not to be fun for the whole family (32:15). Then Jodi tries to convince Chelsea to watch ‘Godzilla Minus One,’ which surprisingly dropped on Netflix this weekend (43:00). Finally, they break down the first two episodes of FX’s soapy new series following the Donald Sterling Clippers saga, ‘Clipped’ (50:08), before sharing their personal obsessions of the week (1:08:00). Hosts: Jodi Walker and Chelsea Stark-Jones Producer: Sasha Ashall Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2024-06-07T10:00:00Z",
      "duration": "01:15:30.3640000",
      "explicit": false,
      "spotifyId": "1upELm6gqoDdlzn3V4XNdJ",
      "appleId": 1000658153036,
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1upELm6gqoDdlzn3V4XNdJ",
        "apple": "https://podcasts.apple.com/podcast/clipped-the-traitors-season-3-cast-and-tlcs/id1465286477?i=1000658153036"
      }
    },
    {
      "id": "b0f4d4ee-1041-4ccb-b452-77a2e6427d9c",
      "title": "The 7M TikTok Cult, Sterling K. Brown Possibly Shades JLo, and a Haters Corner | We’re Obsessed",
      "description": "Jodi and Chelsea cover our first piece of ‘We’re Obsessed’ news update ever to let you know that the Four Seasons Orlando Baby has finally made it to the Four Seasons Orlando (1:15). Then, they discuss what’s been popping off online, including Sterling K. Brown possibly shading Jennifer Lopez on the press tour for their new movie ‘Atlas’ (4:15) and ‘Girls’ legends Allison Williams and Ebon Moss-Bachrach reuniting on Vanity Fair’s YouTube channel (20:15). We unveil our very first Haters Corner with some vitriol directed at parents of nepo babies forcing them into performances they aren’t prepared for and Jerry Seinfeld showing his age by yapping about “back in my day” to anyone who’ll listen (30:12). And finally, Jodi and Chelsea dive deep into Netflix’s brand new true-crime cult documentary series ‘Dancing for the Devil: The 7M TikTok Cult’ (47:45), before sharing their personal obsessions for the week (1:08:40). Hosts: Jodi Walker and Chelsea Stark-Jones Producer: Sasha Ashall Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2024-05-31T10:00:00Z",
      "duration": "01:16:52.2840000",
      "explicit": false,
      "spotifyId": "0iAvhYXb0jEkTftg64FiFW",
      "appleId": 1000657394982,
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0iAvhYXb0jEkTftg64FiFW",
        "apple": "https://podcasts.apple.com/podcast/the-7m-tiktok-cult-sterling-k-brown-possibly-shades/id1465286477?i=1000657394982"
      }
    }
  ]
}