{
  "_ts": 0,
  "id": "b40978aa-7a27-4cc3-8c95-a859f0a676e4",
  "name": "RINGOTV Reactions",
  "youTubeChannelId": "UCnH77V7ycHZIo2C8eC68A9g",
  "episodes": [
    {
      "id": "65d9e6b9-beee-4319-a5d5-489c539c9155",
      "title": "Straitway Cult Members Daniel and Kristin Muir post bail $5,000 each | Did P.Diddy Dowell Pay?",
      "description": "Straitway Cult Members Daniel and Kristin Muir post bail $5,000 each | Did P.Diddy Dowell Pay?\n\nIn this video we address a Pastor who slandered my name with a vicious lie.  \n\nIn this video we share our commentary and criticism to teach and educate our community about the subject matter in the video title which cover news reporting, dating, relationships issues, REVIEWS and more for deep conversations to stimulate thought.\n\n_________________________________________\n\n\n► About me and my work:\n\nI’m RINGO aka RINGOTV Reactions formerly known BlackMaleAdviceTV on my older videos. I’m the Content Creator of the channel. I have over 17 years of experience on Youtube making content.  We provide the best commentary, criticism, educational reaction content, deep discussions about the topics you want to hear about. Our YouTube videos are very entertaining and educational with humor at times. We love to offer advice and make sense of things that are hard to understand for most people. We talk about dating, marriage, news stories, unsolved crimes, entertainment news and many more topics. My content is creative and unique due too the time and energy added to break things down for viewers to think by using my voice. I’m also a professional music producer and video editor. I’m all about Creativity and learning new things to be a better Creator. As you enter the classroom be sure to click the Like button, notification bell for ALL and subscribe today and leave a comment after viewing my video. Thanks for your support and viewership.\n\n_________________________________________\n\n\n►Support the channel:\n\nhttps://cash.app/$RINGOTVRAW\nhttps://www.patreon.com/BlackMaleAdviceTV\nhttps://www.paypal.com/paypalme/ringotvraw\n\n_________________________________________\n\n\n► Social Media: \n\nhttps://www.instagram.com/ringotvraw/\n\n\n► DISCLAIMER: \n\nMy Videos Are For Entertainment \u0026 Educational Purposes ONLY. Commentary in my videos are my thoughts and opinions and is alleged. All my video reactions are transformative in nature with my voice sharing my thoughts in either voice-overs or on camera speech. \n\n_________________________________________\n\n\n► Fair Use Act Disclaimer:\n \nCopyright Disclaimer under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. No copyright infringement intended. ALL RIGHTS BELONG TO THEIR RESPECTIVE OWNERS",
      "release": "2024-07-13T01:24:35Z",
      "duration": "01:27:32",
      "explicit": false,
      "youTubeId": "NlJtG-YVV3U",
      "subjects": [
        "Straitway Truth Ministry",
        "Black Hebrew Israelites"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NlJtG-YVV3U"
      }
    }
  ]
}