{
  "id": "fe200f9c-2356-4718-a29a-caaaf4762cca",
  "name": "Rion Cultastic",
  "youTubeChannelId": "UCA1o0f9ByyKn_JJIT8I0e3g",
  "episodes": [
    {
      "id": "91092609-e91b-49ca-9cef-adf6f28d0f9b",
      "title": "Man SHUNNED From His JW Father\u0026#39;s Memorial Service!",
      "description": "A recent Reddit post shared a heartfelt story about a son who wasn\u0027t invited to his father\u0027s memorial service by his grandmother. She explained that, due to recent events (likely directed at her disapproval of someone\u0027s behavior 🙄), he was only allowed to join via Zoom. It’s truly sad to see how sometimes Jehovah’s Witnesses seem to prioritize their religious community over family connections. In this case, the grandmother chose the governing body over her own grandson and granddaughter, which is really heartbreaking. #exjw #exvangelical #deconstruction #cultsurvivor #jehovahswitness #jehovahwitness #jehovahswitnesses #religioustrauma #deconversion #watchtower #governingbody #jehovahwitnesses #shunned #shun #disfellowshipped #disfellowship #shunning",
      "release": "2025-07-18T00:00:53Z",
      "duration": "00:13:25",
      "explicit": false,
      "youTubeId": "d3Ooj4DOGdU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d3Ooj4DOGdU"
      }
    },
    {
      "id": "1fb0bfde-6c1a-49bb-9d97-ffb6651da0ea",
      "title": "My Secret Life as a Jehovah\u0027s Witness: Cult Drop Out Ep 4",
      "description": "For years, I lived a double life, believing I could be responsible for others\u0027 eternal fate. Outwardly, I was a “good” Jehovah’s Witness, attending meetings, saying the right things (or at least trying to, playing the part). But inside, I was torn—doubting, drifting, pretending.\n\nThis episode of Cult Drop Out explores what it means to be caught between two worlds. Wanting to be your authentic self while also feeling like you owe something to Jehovah. Many people move past doubt and confusion to become PIMO—physically in, mentally out. It’s that gray area many of us get trapped in when we start questioning the doctrine but can’t leave without risking everything: family, community, even our sense of self.\n\nLiving in two worlds takes a toll. You learn to mask, to perform, to suppress. You become skilled at surviving, but at what cost? This is our one opportunity and we should be living, thriving, not planning to die. \n\n#exjw #jehovahswitnesses #jehovahswitness #jehovahwitness #jehovahwitnesses #indoctrination #cult #cultsurvivor #watchtower #governingbody #deconversion #deconstruction #exvangelical #exmo #spiritualabuse #disfellowshipped",
      "release": "2025-07-12T20:00:13Z",
      "duration": "00:36:23",
      "explicit": false,
      "youTubeId": "PVVejGwfOJ0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PVVejGwfOJ0"
      }
    },
    {
      "id": "795b4c57-24dc-45e8-ad9a-80282a17a7c3",
      "title": "From Apolitical Cult Member To Woke Leftist: Cult Drop Out Ep. 3",
      "description": "I wasn’t raised to think critically. I was raised to obey.\nIn this episode of Cult Drop Out, I talk about how being raised in a high-control religion like Jehovah’s Witnesses shaped my early political beliefs, or more accurately, suppressed them. I was taught to stay “neutral,” to avoid politics, to keep my head down and wait for God to fix everything. For instance, I was discouraged from participating in elections or even discussing political issues as a JW.\nBut the moment I started waking up from the cult, I began to question the teachings and the control. I started waking up everywhere else too, noticing the world around me with a new perspective, free from the constraints of the organization\u0027s beliefs.\nThis is the story of how I went from apolitical to aware. From silence to speaking up. And from blindly obedient to becoming radically intentional. It\u0027s a process that requires determination and self-reflection.\nIf you’ve ever found yourself shedding not just a religion, but an entire worldview, this one’s for you.\nI hope I can embolden you to share your trip around the sun with the rest of the world too. The more we unite our voices, the louder our call for freedom resounds ❤️\nIf you enjoy this video, check out episodes 1 and 2 of my #CultDropOut series.\n\n #ExJW #Deconstruction #WokeLeft #FaithDeconstruction #LeavingReligion #ApoliticalToWoke #watchtower #exvangelical #jehovahswitness #religioustrauma #jehovahswitnesses #cultsurvivor #cult \n#deconversion #christianity #evangelical",
      "release": "2025-07-07T21:00:34Z",
      "duration": "00:27:59",
      "explicit": false,
      "youTubeId": "N7Ci-_thkQY",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=N7Ci-_thkQY"
      }
    },
    {
      "id": "14af384b-890c-46cc-ad46-0bd4f82252ac",
      "title": "You Can’t Be a Good Parent and a Good Jehovahs Witness: Cult Drop Out Ep.2",
      "description": "In this episode of Cult Drop Out, I want to chat about something that really resonates with many of us: the experience of feeling like Jehovah\u0027s Witness parents prioritize their beliefs over their own kids.\n\nFrom the blood doctrine to avoiding birthdays, or the silence that comes with shunning, this episode is for anyone who has felt a sense of abandonment from those who should love them unconditionally.\n\nIf you’ve ever found yourself wondering, “How could they?”trust me, you’re not alone. \n\nThis video is not about placing blame; it’s about creating a space to acknowledge the grief, confusion, and anger that can arise, as well as those quiet moments of insight when you come to understand that they chose their beliefs over you.\n\nBut here’s “the good news” you can choose yourself. And maybe that’s where the healing truly begins. Let’s explore this journey together!\n#exjw #deconstruction #jehovahswitnesses #deconversion #cultsurvivor #cult #religioustrauma #jehovahswitness #jehovahwitness #jehovahwitnesses #exvangelical #exmo #skeptic #DeconstructionJourney #exjwsupport",
      "release": "2025-07-03T20:00:27Z",
      "duration": "00:38:41",
      "explicit": false,
      "youTubeId": "fHsGUCZOI24",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fHsGUCZOI24"
      }
    },
    {
      "id": "47265c5f-981d-4919-bd9e-9a0434cc5f51",
      "title": "This Series Might Get Me Disfellowshipped (Again): Cult Drop Out Ep. 1",
      "description": "\u0022Cult Drop Out\u0022 is the beginning of a new series where I talk openly, maybe even for the first time, about what it felt like to grow up in a high-control religion, to question everything, and to realize my doubts weren\u0027t a weakness. I was listening to my gut.\nI used to think I was broken and that something was wrong with me. I lack education, am socially awkward, and there\u0027s much about this world I\u0027ve yet to discover. But what if the system was designed to make you feel that way? \nIf you\u0027ve ever asked yourself, \u0022Is it just me?\u0022 you\u0027re not alone. You\u0027re welcome here. \nThis series is for those who have left the Jehovah\u0027s Witnesses ( #exJW\u0027s ), evangelical #Christianity ( #exvangelical ), are in the process of deconstructing their faith ( #deconstruction ), are skeptical about religious teachings ( #skeptics ), are struggling with doubts, and anyone who is trying to separate their faith from fear. I\u0027m not here to tell you what to believe. Just to share what it was like to stop accepting what no longer made sense.\n\n#deconstruction #jehovahswitnesses #jehovahwitness #christiannationalism #deconversion #religioustrauma #cultsurvivor #deconversion #jehovahswitness #watchtower #exvangelical",
      "release": "2025-06-30T21:30:05Z",
      "duration": "00:07:08",
      "explicit": false,
      "youTubeId": "G7TWCbZ-q1o",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=G7TWCbZ-q1o"
      }
    },
    {
      "id": "156703e9-004a-4623-bbdc-deeb6c317db5",
      "title": "I Left a Doomsday Cult and Now the Government Sounds Just Like Them!",
      "description": "I grew up believing the world would end any day. That governments would turn on religion, Police and Service members would assault us, morality would collapse, and only the righteous would survive the final test. Then I left the Jehovah’s Witnesses only to watch the same apocalyptic script start playing out in real life LOL😭\n\nThis isn’t fearmongering. This is Project 2025. This is Project ESTHER! These are real, published plans to reshape the U.S. government into a Christian nationalist machine. Christian Nationalists aim to purge dissent, crush protest, and weaponize scripture to justify authoritarian rule.\n\nFrom ICE raids to National Guard deployments, from surveillance crackdowns to the erasure of LGBTQIA2S\u002B rights, every piece of this puzzle looks disturbingly familiar to those of us who were raised in high-control, end-times religious groups.\n\nI’m not here to preach. I’m here to ask questions, expose systems, and reclaim the right to think freely...even when it’s uncomfortable. If you’ve ever left a cult, challenged your faith, or just want to push back against creeping theocracy, you’re in the right place.\n\n👉   Links\nhttps://www.project2025.observer/\nhttps://www.nokings.org/\n\n🕊️ Let’s build a world that doesn’t run on fear and obedience but on truth, consent, and collective power.\n\n#ExJW #TheocracyWatch #Project2025 #ChristianNationalism #CultRecovery #ReligiousTrauma #Armageddon #conservatIve #republican #jehovahwitness #jehovahswitnesses #jehovahswitness #atheist #agnostic #gnosis #trump #nokings #doomsday #christianzionism #zionist #projectEsther #antisemitism #cult",
      "release": "2025-06-12T21:00:34Z",
      "duration": "00:26:12",
      "explicit": false,
      "youTubeId": "QFxc_zVorrs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QFxc_zVorrs"
      }
    },
    {
      "id": "e526e5d8-c8ec-4437-8d70-eeb39428d076",
      "title": "Influencing for Jehovah On The Gram: Evangelical Rebranding on Social Media",
      "description": "Jehovah\u0027s Witnesses don\u0027t have to knock on your door when they can just post a selfie and knock on your algorithm! Some Jehovah’s Witnesses are getting scolded for posting selfies. Others are building entire platforms, pushing JW culture in soft, influencer packaging. In this video, we look at how the Watchtower uses images, influence, and double standards to spread its message without looking like a cult... even while silencing members who step out of line.\nPart Two coming soon! \n#exJW #JWDrama  #CultAesthetic#JWInfluencers#WatchtowerSociety#ReligiousInfluencers#DeconstructingFaith#HighControlGroup#CultsOnSocialMedia#JWOrg#SpiritualAbuse #influencer #Scandal",
      "release": "2025-05-23T20:30:06Z",
      "duration": "00:33:00",
      "explicit": false,
      "youTubeId": "gLEMeDYRCko",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gLEMeDYRCko"
      }
    },
    {
      "id": "4a2670da-5706-4af9-a982-3d17ff77ce63",
      "title": "Doctor Lets Mother Die Over Blood: The Watchtower’s Faith Before Life Policy",
      "description": "A mother in Nigeria has died after her Jehovah’s Witness doctor refused to give her a blood transfusion following a C-section. The doctor’s religious beliefs were put above a dying woman’s life, and now the world may finally listen to what we\u0027ve been saying for years!\n\nThis video may feel a bit dense, but trust me its worth staying with it. The language the use is very calculated, and it reveals a lot about who they are.\nWatchtowers\u0027 “No Blood” doctrine doesn\u0027t just endanger their own members; it’s now claiming the lives of people outside the religion, too.\n\nI\u0027m reviewing internal JW documents, including letters sent to elders and healthcare professionals, which reveal how secrecy, word-of-mouth instructions, and fear-based control are integral components of the system.\n\nTheocratic influence is growing around the world, and in the U.S., laws are being written to protect religious extremism at the cost of your rights, your health, and your life. When is enough enough, who\u0027s next?\nDo you see the writing on the wall? \n\n🔴 Stay tuned.\n🔍 We’re exposing the Watchtower.\n🩸 We’re talking about the cost of doctrine.\n✊ And we’re not staying silent.\n\n#JehovahsWitnesses\n#ExJW\n#WatchtowerExposed\n#ReligiousTrauma\n#NoBloodDoctrine\n#FaithVsMedicine\n#ReligiousExtremism\n#MedicalNegligence\n#WomensRights\n#BlackMaternalMortality\n#ReligiousControl\n#GoverningBodyExposed\n#TheocracyWatch\n#BloodTransfusion\n#HumanRightsAbuse\n\n\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5539807103811584",
      "release": "2025-05-15T16:34:58Z",
      "duration": "01:10:57",
      "explicit": false,
      "youTubeId": "pA6eYBbq1Cs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pA6eYBbq1Cs"
      }
    },
    {
      "id": "71795efc-2891-42eb-81ce-90372a140613",
      "title": "Jehovah’s Witness Doctor Let Her Patient Die - Here’s Why That Matters",
      "description": "A Jehovah\u0027s Witness doctor caused the death of her patient due to her strict religious beliefs. \nA young mother entered a hospital to give birth but never left after undergoing an operation called a C-section. Victoria Pairs began to hemorrhage. The treatment needed was straightforward. A blood transfusion could have saved the young mother\u0027s life, but her doctor refused for religious reasons.\n\nThis is the tragic story out of Port Harcourt, Nigeria, that should shake us all. A woman died because her doctor, a Jehovah’s Witness, chose doctrine over duty, and 4 children now do not have a mom \n💔\nAs a former Jehovah’s Witness, I feel like it\u0027s MY DUTY to break down what happened, why the Watchtower’s “no blood” policy is medically and ethically indefensible, and how this kind of religious extremism is creeping into policy here in the U.S.\n\nWith rising Christian nationalism and GOP-led efforts to legalize healthcare discrimination, we need to ask: How many more lives will be sacrificed on the altar of belief?\n\nWatch. Share. Speak up. Before this becomes your hospital visit.\n-Rion\n\n#ExJW #JehovahsWitness #ReligiousTrauma #ChristianNationalism #NoBloodPolicy #MedicalNeglect #MaternalMortality #TheocracyWatch #deconstruction #deconversion #watchtower #scandal",
      "release": "2025-05-13T21:00:06Z",
      "duration": "00:20:58",
      "explicit": false,
      "youTubeId": "NsBz_a0m860",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NsBz_a0m860"
      }
    },
    {
      "id": "b4facb78-851d-4d71-90b4-ba8bebe7ae85",
      "title": "How I Reclaimed My Voice After Life In The Jehovah’s Witness Cult",
      "description": "After spending a lifetime in a strict religion, I broke free from the identity they handed me and started untangling the beliefs that kept me stuck. Staying silent only shields those who still hold the power.  😔\n\nWalking away didn’t just mean ditching doctrines; it was like peeling off layers of programming wrapped around me since I was a kid.\n\nThis video dives into what it’s really like to leave a cult- the confusion, grief, vulnerability… and the strength that comes with reclaiming your voice. \n\nI discuss how groups like the Watchtower shape your thoughts, bury your instincts, and call it righteousness. I also reflect on the struggle of questioning everything I was ever told was “truth,” and how healing has been after that unraveling. \n#exjw #jworg #jehovahswitnesses #cult #watchtower #governingbody #exjehovahswitness #exjwmemes #religioustrauma #apostate #cultsurvivor #jwfacts #exjwhumor #disfellowshipped #xjw #kingdomhall #bestlifeever #exjws #jwabuse #jwconvention #deconstruction #igotout #jwcult #jworganization #exjwlife ￼\n|￣￣￣￣￣￣￣ |\n|  If you’re on     |\n|  your own          |\n|  journey out of  |\n|  a                         |\n|  high-control    |\n|  group, I hope  |\n|  this makes       |\n|  you feel seen.  |\n| ＿＿＿＿＿＿＿|\n(\\__/) ||\n(•ㅅ•) ||\n/ 　 づ\n\nTranscript for better optimization 😍❤️‍🔥\nAfter a lifetime inside a cult, I finally walked away from the beliefs that shaped me and the identity they gave me. What no one tells you is that leaving is just the beginning. You don’t just lose a religion. You lose your sense of self, your community, your family, and everything that once gave you a script to live by. That’s when the seams started to come apart. Because when you’ve been fully immersed, your thoughts aren’t fully your own. This is what deconstruction looks like for me. When Jehovah’s Witnesses say they study the Bible, what they really mean is they study the Watchtower’s interpretation of it. Study is done through pre-approved literature, carefully crafted, loaded with bias, and presented as fact. You’re not encouraged to seek truth. You’re trained to absorb what you’re given. You’re not gaining insight. You’re being steered. The Watchtower talks about “spiritual armor,” but that armor wasn’t protecting me — it was hiding me. It was a disguise I was expected to wear to blend in, obey quietly, and never make waves. It made me into someone loyal, passive, and unquestioning. Every belief I questioned loosened those threads. And once it started coming off, I felt exposed. Raw. Vulnerable. Disoriented. I found myself asking, “Is this really who I am… or just who I was trained to be?” As a woman, I was taught selflessness was godliness and obedience was a virtue. The men got authority. I got quiet approval. Looking back, I see what it really was: gendered obedience wrapped in religious language. That realization made me angry — at them, at the control, and at myself for believing it for so long. But that anger helped me set boundaries, speak up, and stop apologizing for being who I am. I used to think doubt meant failure. But when the system only allows one narrative, any independent thought feels like betrayal. The truth is, I wasn’t trying to walk away. I was just… thinking. Reading. Asking questions. And the whole thing started to collapse. The Watchtower doesn’t prove the Bible. The Bible doesn’t prove the Watchtower. They just point to each other in a closed loop. That realization didn’t bring peace — it brought grief, confusion, and rage. But that rage led to healing. Healing, for me, looks like trusting myself again, letting go of guilt around joy, and refusing to stay quiet when injustice hides behind a religious mask. Rebuilding hasn’t been easy. But it’s been real. And that’s why I speak up. Because organizations like the Watchtower thrive in silence. They’re wealthy, protected, and strategic. But what they’re guarding isn’t faith — it’s power. That’s why I’m loud. That’s why I speak out about cults, deconstruction, and religious trauma. Because your body, your mind, your voice — they’re sacred. When people say “just move on,” I wonder how they can ignore the harm still happening. I speak because I refuse to let the next generation grow up thinking control is love. And I’m just getting started. I’ll be making more videos — sharing my perspective on cults, deconstruction, and what it means to rebuild when the old life was built on fear. If you’re on that journey too, you’re not alone. We’re finding our voices again. And that’s sacred, too.",
      "release": "2025-04-20T16:01:21Z",
      "duration": "00:08:44",
      "explicit": false,
      "youTubeId": "z8oih14GDC8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=z8oih14GDC8"
      }
    },
    {
      "id": "bf2e1554-8dcd-4565-9b14-a8194c6298ac",
      "title": "Brainwashing Cartoons: Caleb wants to be a PIONEER! #exjw",
      "description": "You\u0027re watching the Cult Death Trap...a sweet little cartoon, or a cleverly disguised propaganda recruiting tool?\nIn this video, I react to a Jehovah’s Witness animation aimed at kids, supposedly encouraging them to “pioneer.” Caleb and Sophia cartoons are utilized for early indoctrination... beneath the bright colors and smiling faces is a carefully crafted pipeline of obedience, sacrifice, and lifelong servitude.\n\nI break down some of the language games they play,  and the subtle ways high-control groups shape children before they ever have a chance to ask real questions.\n\n🧠 Stick around for the worksheet at the end. Let’s say… I had some creative thoughts about what my pioneer career would have looked like😈\n🎥Jehovahs Witnesses, JW cartoon, Caleb and Sophia, JW indoctrination, cults and children, religious programming, exJW, pioneer training, Watchtower critique, JW kids, Jehovahs Witness review, high control groups, cult recruitment, childhood indoctrination, spiritual obedience, exJW commentary, JW pioneer, governing body, JW animation, deconstructionHere\u0027s a playlist you may like https://www.youtube.com/playlist?list=PLEVXA8xJXw-RophOgqL1uNR5H4lGfZd6a #MyBookOfBibleStories \n🎥 Want more breakdowns like this? Subscribe and join me as we unravel the tactics cults use to shape minds, especially the smallest ones.\n#ExJW #JehovahsWitnesses #CultTactics #doctrination #JWCartoon #Deconstruction #PioneerLife #ExJWReact #ChildhoodProgramming #Watchtower #pioneer Little enemies of god",
      "release": "2025-04-17T23:30:12Z",
      "duration": "00:13:59",
      "explicit": false,
      "youTubeId": "jwZ63_-trVI",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jwZ63_-trVI"
      }
    },
    {
      "id": "8eb4020e-2c4b-4883-a068-433a4e19946b",
      "title": "10 CULT Rules That Ruined Lives",
      "description": "Welcome to the Top 10 Worst Jehovah’s Witness Rules That Have Absolutely Ruined Lives.\n\nJehovah’s Witnesses love to say they have “the truth,” but what they have is a list of cult tactics disguised as religious doctrine. From tearing families apart with shunning to forcing people into life-or-death decisions over a blood transfusion, these rules have done a lot of harm.\nYou can join other free thinkers Mon- Friday at 9am EST on  ‪@TheDAMShow‬  with Chris ​⁠￼ ‪@DaranteLaMar‬  and myself.\nhttps://www.youtube.com/live/p6yW8JSuud0\n\nThis isn\u0027t just another quirky Christian denomination—it\u0027s a high-control religious group with extreme rules that have destroyed families, cost lives, and traumatized people for decades. From banning higher education to forbidding life-saving blood transfusions, these policies keep members trapped in an authoritarian system disguised as faith.\n\n In this video, we cover:\n How Jehovah’s Witnesses isolate members from friends, family, and the outside world\n Their history of failed doomsday predictions that left members financially and emotionally devastated\n The shocking truth about their sexual abuse coverups and \u0022Two Witness Rule\u0022 that protects predators\n How shunning (disfellowshipping) is psychological warfare disguised as “love”\n Why women in the JW organization are permanently second-class citizens\n\nThis isn’t about religion—it’s about control.\n\n Timestamps:\n00:00 - Intro\n:38 - #10 No Higher Education\n1:12 - #9 No Joyous Childhood Celebrations\n1:48 - #8 Isolation Tactics\n2:39 - #7 False Predictions of Armageddon\n3:35 - #6 The Subjugation of Women\n4:36 - #5 No Political or Social Activism\n5:40 - #4 Blood Transfusion Ban\n7:15 - #3 Sexual Abuse Coverups\n8:00 - #2 The \u0022Two Witness Rule\u0022\n9:39 - #1 Shunning (Disfellowshipping)\n\n Have you or someone you know been affected by Jehovah’s Witness teachings? Share your story in the comments.\n\n Subscribe for more deep dives into high-control religious groups and dangerous beliefs.\n\n#JehovahsWitnesses #ExJW #CultSurvivor #ReligiousTrauma #ExposingCults #WatchtowerLies #Disfellowshipping #Shunning #ExJWStories #HighControlReligion",
      "release": "2025-02-21T21:00:14Z",
      "duration": "00:13:34",
      "explicit": false,
      "youTubeId": "I4lhUofeGEc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I4lhUofeGEc"
      }
    },
    {
      "id": "a06eda50-278e-4103-9e97-859d41ce8efa",
      "title": "The Worldly Perspective wraps up Cult Literature discussion w/ JW brochure The Origins of Life",
      "description": "3 former fundies and that guy Tyler finish their discussion on Cult tactics in propagandist literature. \r\n#ExJW \r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5539807103811584",
      "release": "2024-09-26T22:40:26Z",
      "duration": "01:14:46",
      "explicit": false,
      "youTubeId": "FgNusIwT6z0",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Christian Fundamentalist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FgNusIwT6z0"
      }
    }
  ]
}