{
  "id": "2e9fd596-3326-4592-adc2-b986fe86c467",
  "name": "Ripollsworkshop Reads",
  "spotifyId": "74sJ9mPLuC2gH2pwCw9ZFM",
  "appleId": 1639744955,
  "episodes": [
    {
      "id": "ea083fb1-f9b5-42ff-8004-5fc7934bdf4f",
      "title": "Author Interview Sally Lotz",
      "description": "Author Bio Sally lives in Orlando, Florida, where she enjoys the local beaches, kayaking in the springs, visiting the local bookstores, and writing. She can often be found writing on her laptop at the local coffee shop or caring for her numerous plant babies. She loves to listen to true-crime podcasts and watch crime docu-series. Her children are all grown and live in Orlando and Denver. She is a writing coach, teaching business professionals to write a book in 30 days as well as a mentor. Sally is a member of SCBWI (Society of Children\u0027s Book Writers and Illustrators). She loves to teach people how to create with their words and loves to speak to groups about writing, growing up a Jehovah\u0027s Witness, or having ADHD. Sally grew up in the Jehovah\u0027s Witness cult and was able to leave at the age of sixteen. After years of recovery and self-discovery, she has been able to help other young people and adults who struggle with leaving and the aftermath. Connect with Sally Lotz Website Instagram Timestamps 00:15 Introduction 00:37 What are your books about? 2:31 What inspired you to write your books? 3:36 When writing your books, who were you thinking of when it comes to who your book is for? 5:30 How long have you been writing and what made you really start? 7:05 What is your schedule like when you are writing a book? 8:22 What do you need in your writing space to help you stay focused? 10:09 What type of books do you personally enjoy reading? 10:57 Are there any books or authors that inspired you to become an author? 12:02 What books did you grow up reading? Did you have an all-time favorite? 12:53 Now as an adult do you have any favorite authors or series? 14:08 What would you tell someone who just started reading again? 16:09 What sort of advice would you offer to someone just starting to write their own book? 17:52 Any additional comments? 18:52 Where is the best place for our listeners to connect with you? Links Support the Podcast https://www.buymeacoffee.com/ripollsworkshop Newsletter https://mailchi.mp/30a7be3e81ef/69wqrzezob Follow us Ripollsworkshop Reads Podcast Instagram https://instagram.com/ripollsworkshopreadspodcast?igshid=YmMyMTA2M2Y= Ripollsworkshop Reads Website https://www.ripollsworkshopreads.com/about-contact Ripollsworkshop Reads YouTube https://www.youtube.com/@ripollsworkshopreads Ripollsworkshop Reads Instagram https://www.instagram.com/ripollsworkshopreads Our Host Courtney Ripoll-McBride https://www.instagram.com/theripollsworkshop/ Music Created/Episode Mastered By: Patrick McBride https://www.instagram.com/patmcbride_bass",
      "release": "2024-08-07T09:00:00Z",
      "duration": "00:21:02.8570000",
      "explicit": true,
      "spotifyId": "7KtrGPkRjQJcrAjn9ZwasA",
      "appleId": 1000664577299,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KtrGPkRjQJcrAjn9ZwasA",
        "apple": "https://podcasts.apple.com/podcast/author-interview-sally-lotz/id1639744955?i=1000664577299"
      }
    }
  ]
}