{
  "id": "7b7b549e-06cf-4482-bc94-438b8c495899",
  "name": "Rock \u0027N\u0027 Roll Mysteries",
  "spotifyId": "31shmtgPYTyRzBRf14cdLv",
  "youTubeChannelId": "UCJTtfcqV9I9b1xVOXFk4vYQ",
  "episodes": [
    {
      "id": "573af91d-3f6e-4677-9e7e-373fd0d0ac7b",
      "title": "Surf, S*x Cults \u0026 Psychedelia - Sky Saxon\u0027s Dark Odyssey | Rock \u0027N\u0027 Roll Mysteries #41",
      "description": "Sky Saxon dropped off the map before the map even got to know him. But the truth about The Seeds\u0027 frontman\u0027s 1970s life is truly astounding. \n\nThe Source Family Documentary (affiliate) https://amzn.to/4hIJbGe\n\nWell, it\u0027s time to kick back, relax and get deep into another strange and mysterious musical life in this full-length music documentary. \n\nPATREON - I have a Patreon page up and running now, and if you sign up to the $5 \u0027Club Singer\u0027 tier, you get an exclusive weekly mini-episode on some marvellous aspect of rock music history, every Thursday! A one-month free trial is available, so why not have a look and see what you think https://www.patreon.com/c/rocknrollmysteries\n\nMEMBER\u0027S AREA - Alternatively, have a look at the Member\u0027s Area here by joining the channel. There are a few fun perks for those who do, including badges that appear by your name when you make a comment - and the badges evolve over time to a different music legend!\nhttps://www.youtube.com/channel/UCJTtfcqV9I9b1xVOXFk4vYQ/join\n\nMERCH - There\u0027s also Rock \u0027N\u0027 Roll Mysteries merch - Check out the full range with stars like Gram Parsons, Marianne Faithfull and Gene Vincent are already available, and new designs coming soon! Every shirt is 100% exclusive and designed in-house, and shipped by the fantastic folks at Fourthwall. Really great quality shirts too.\nhttps://rock-n-roll-mysteries-shop.fourthwall.com/\n\nHOLLYWOOD MYSTERIES - And of course, don\u0027t forget to subscribe to the sister channels, Hollywood Mysteries https://www.youtube.com/channel/UCJVuHlMvZG7AJ00e5KgB8qg\n\nAND\n\nSOCIETY MYSTERIES \nhttps://youtube.com/@societymysteries\n\nStay tuned for more Rock \u0027N\u0027 Roll!",
      "release": "2025-11-07T23:00:25Z",
      "duration": "00:33:47",
      "explicit": false,
      "spotifyId": "7988Vrb6gbgde1ioSYnPyB",
      "youTubeId": "LEHTbC88l6g",
      "subjects": [
        "The Source Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7988Vrb6gbgde1ioSYnPyB",
        "youtube": "https://www.youtube.com/watch?v=LEHTbC88l6g"
      }
    }
  ]
}