{
  "id": "89674518-92c8-4499-9c81-1f9e0981d3df",
  "name": "Rooted in Time Genealogical Services",
  "spotifyId": "0RviubzkVLFiAYAVQq94iu",
  "appleId": 1706672525,
  "episodes": [
    {
      "id": "f4b4c394-cc76-49a5-9e7a-bcfba11da211",
      "title": "Podcast 18: Jim Jones : Genealogy in Context ",
      "description": "Rooted in Time Hosts, Nicole and Melody, are back, and this time, we tackled a cult leader, Jim Jones. How does a boy from rural Indiana—remembered as a quiet, solitary child who adored animals and staged mock funerals in his backyard—become the architect of one of the deadliest cult tragedies in modern history? Could his genealogy, examined through the lens of mid to late 19th-century and early-20th-century social, economic, and cultural forces, reveal the roots of his transformation? This episode explores the complex interplay of nature, nurture, and circumstance in the life of Jim Jones, asking how family legacy, personal conviction, and historical context converged to shape the man whose vision of salvation ended in the mass death of more than 900 followers on November 18, 1978. Supplemental and reference materials are available at ⁠⁠⁠⁠⁠www.rootedintime.net⁠⁠⁠⁠⁠⁠. For more detailed information about the methodology and context, please read Blog 18. Please follow Rooted in Time Genealogy on Facebook and Instagram by following the handle rootedintimegen ⁠⁠⁠⁠⁠⁠https://www.instagram.com/rootedintimegen/⁠⁠⁠⁠⁠⁠⁠\u0026⁠⁠⁠⁠⁠⁠⁠ https://www.facebook.com/RootedInTimeGen⁠⁠⁠⁠⁠⁠⁠",
      "release": "2025-10-12T18:27:37Z",
      "duration": "01:30:14.5920000",
      "explicit": true,
      "spotifyId": "0XlAGWWOirOAvA0aQFmDQE",
      "appleId": 1000731397662,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0XlAGWWOirOAvA0aQFmDQE",
        "apple": "https://podcasts.apple.com/podcast/podcast-18-jim-jones-genealogy-in-context/id1706672525?i=1000731397662"
      }
    }
  ]
}