{
  "id": "15b44c0e-7acd-4ec6-8a7e-a96519f5061e",
  "name": "Rooted Wisconsin",
  "spotifyId": "54OkcmeGsoV8gV4AtKn9pa",
  "appleId": 1705914383,
  "youTubeChannelId": "UCPQgO9GOnrA0pHXaNfkrosw",
  "episodes": [
    {
      "id": "8ab99796-0b5d-4ce2-bf8a-f3c43186aeb7",
      "title": "Cult Abuse, Paper Towel Girls, Mind Control, and Manipulation",
      "description": "Check out the whole episode with @shifrahmorgan464 to hear about the CRAZY stories of abuse, mind control, and manipulation of a Wisconsin-based cult that STILL EXISTS TODAY.",
      "release": "2025-09-22T17:24:36Z",
      "duration": "00:07:05",
      "explicit": true,
      "youTubeId": "w0pfaH50w_M",
      "subjects": [
        "Samanta Roy Institute of Science and Technology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=w0pfaH50w_M"
      }
    },
    {
      "id": "e98a7c59-c6cc-4a17-9d41-5d751cbbc82b",
      "title": "Shifrah Morgan - Cult Stories, Abuse, Manipulation \u0026 Life After the Cult | Rooted Wisconsin | Ep#52",
      "description": "Born into a Wisconsin-based cult, Shifrah Morgan (and MANY others) endured a life of abuse, trauma, and manipulation until she was able to escape. The Shawano based group, known by several names including the \u0022Samanta Roy Institute of Science and Technology (SIST) and the \u0022Rama Cult\u0022, has left a wake of negative impact since being founded in the early 70\u0027s by a man formerly known as Rama Behera (he has changed his name several times over the years and is now thought to go by Avraham Cohen). \n\nIn this episode, Shifrah bravely details her personal story along with striking and unsettling first hand accounts of physical, mental, and sexual abuse, manipulation, and the inner workings of the cult. Children being locked in barrels, members punished by getting their heads shaved and spit on by the members, horrific sexual abuse, and punishment by cattle prod are just a few of the MANY stories that Shifrah details in our conversation. We also discuss her exit (abandoned by her biological family at 13 years old) from the cult and life afterward, including finding who she now calls her family after being banished, her military service, the death of her first husband, motherhood, business ownership, bass fishing, and more. \n\nI was, and still am, truly in awe of Shifrah\u0027s courage and strength. The poise she exhibited while sharing such personal and trauma-filled stories was nothing less than extraordinary. I see this as a testament to her amazing ability to persist and, against staggering odds, build a life she is happy to live. Shifrah\u0027s purpose for coming on the podcast was largely driven by the hope of bringing awareness to the situation. Please share this far and wide if you are as moved by her story as I was.\n\nCult information - https://en.wikipedia.org/wiki/Samanta_Roy_Institute_of_Science_and_Technology\n\nShifrah\u0027s TikTok - https://www.tiktok.com/@morganshifrah \n\nShifrah\u0027s Instagram - https://www.instagram.com/shifrah21/\n\nAs always,  HUGE shoutout to our sponsors at ‪@Karouser and Riverside Pizzeria of Green Bay. They keep these episodes coming. If you dig our stuff, please support them!\n\nhttps://karouser.com/\nhttps://www.riverside-pizzeria.com/",
      "release": "2025-09-01T10:01:35Z",
      "duration": "02:47:59",
      "explicit": false,
      "spotifyId": "1RP6gMJ1nxpuRlnTGGVmtw",
      "appleId": 1000724369779,
      "youTubeId": "qajMzq39IcE",
      "subjects": [
        "Samanta Roy Institute of Science and Technology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1RP6gMJ1nxpuRlnTGGVmtw",
        "apple": "https://podcasts.apple.com/podcast/shifrah-morgan-cult-stories-abuse-brainwashing-and/id1705914383?i=1000724369779",
        "youtube": "https://www.youtube.com/watch?v=qajMzq39IcE"
      }
    }
  ]
}