{
  "_ts": 0,
  "id": "79e19328-aab4-4e8b-923e-862b8b0c7871",
  "name": "Rooted Recovery Stories",
  "spotifyId": "6L8QcN3x809IdW2L40OkqL",
  "appleId": 1572095799,
  "youTubeChannelId": "UCXRP6seEyCcgHMqJifM4FUg",
  "episodes": [
    {
      "id": "3535b3d6-04a4-4500-aaad-b6398e805e3a",
      "title": "Faith Without Freedom (feat. Bethany Joy Lenz) | Rooted Recovery Stories Ep. 184",
      "description": "Bethany Joy Lenz opens up with host, Patrick Custer, in this powerful interview where they discuss untapped, dynamic perspectives into her life’s story. Bethany reflects on growing up in a conservative Christian household and discovering her passion for acting at a young age. She also shares her experience navigating the entertainment industry while being part of a high-demand religious group she now recognizes as a cult.\n\nAs they explore her experiences, Bethany opens up about the challenges of balancing fame during her time on One Tree Hill with the pressures of a controlling environment that blurred the lines between faith and manipulation. She shares deeply personal insights into the struggles of feeling disconnected from God, the weight of living up to others’ expectations, and the process of reclaiming her sense of self.\n\nThe conversation touches on themes of coercion, healing from shame, and the transformative power of self-discovery. Bethany’s story is an inspiring reminder of the freedom that comes with embracing authenticity and breaking free from the constraints of control.\n\nDon\u0027t forget to like, subscribe, and share your thoughts in the comments!\n\n\nWatch/Listen/Subscribe: ⁠⁠@rootedrecoverystories \nInsta: ⁠@rootedrecoverystories  \nTiktok: @patrickcusterproject  \nFacebook: https://www.facebook.com/RootedRecoveryStories/\nURL: ⁠https://www.rootedrecoverystories.com⁠\n\n__________________\n\nResources: \nInsta: ⁠@mentalhealthamerica  \nURL: https://⁠www.mhanational.org⁠ \n\nPromises Behavioral Health – Treatment for addiction, mental health/trauma: \nInsta: ⁠@promises_bh \nURL: ⁠https://www.promisesbehavioralhealth.com⁠ \n\nFollow Patrick Custer!\nInsta: @patrick_custer  \nTiktok: @patrickcusterproject  \n\nFollow Bethany Joy Lenz!\nInsta: @msbethanyjoylenz\n\nAbout Bethany Joy Lenz:\nBethany Joy Lenz is an accomplished and award-winning actress and director. She is also a singer, composer, librettist, author, producer, fine artist, and publisher who is most recognizable from her nine-year run on the TV drama One Tree Hill. She has been nominated for an Ambie award and featured in The New York Times, Variety, People and The Hollywood Reporter, among others. Lenz lives in Nashville with her daughter and their three dogs. \n\n\nProduced and Edited by \u0022The Cast Collective\u0022 in Nashville, TN!\nVisit us today at https://www.thecastcollective.com\nEmail: info@thecastcollective.com\nFollow The Cast Collective on Instagram \u0026 Twitter!\nInstagram: @TheCastCollective\nTwitter: @TheCastCollective\n\nKeywords: trauma, recovery, podcast, mental health, rooted recovery stories, mental health podcast, trauma podcast, anxiety podcast, recovery podcast, coping mechanisms, nashville, trauma, podcast, interview, addiction, alcohol abuse, family, sobriety, help, therapy",
      "release": "2025-01-09T13:00:57Z",
      "duration": "01:05:51",
      "explicit": false,
      "spotifyId": "2AT7KvR5tldPZQMRHmFWoO",
      "appleId": 1000683299542,
      "youTubeId": "cfdVqG6ys9s",
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AT7KvR5tldPZQMRHmFWoO",
        "apple": "https://podcasts.apple.com/podcast/faith-without-freedom-feat-bethany-joy-lenz-rooted/id1572095799?i=1000683299542",
        "youtube": "https://www.youtube.com/watch?v=cfdVqG6ys9s"
      }
    }
  ]
}