{
  "_ts": 0,
  "id": "d555da7e-e0c1-4367-9b00-3c61a0975b51",
  "name": "Rotten Mango",
  "spotifyId": "2DZwvzn6Z3xCFZrwZGDrbj",
  "appleId": 1517954480,
  "youTubeChannelId": "UC0JJtK3m8pwy6rVgnBz47Rw",
  "episodes": [
    {
      "id": "ae5a3d8a-4f44-4143-b200-7b6f757c2131",
      "title": "Huge K-pop Record Store Founder Alleged Link To Murderous Cult, Forcing Young Men To Call Her \u0022Baby\u0022",
      "description": "There was this rumor going around in the K-Pop world in 2016\n\nIf you want your favorite artist to do well – you have to buy their albums from two specific retailers…\n\nOne of those companies was called Synnara Records. \n\nAt their height, it is said they had a 30% share of the record market volume. They are one of the rare business success stories raking in millions of dollars. \n\nUntil you dig deeper. \n\nThe name Synarra means- New Nation.\n\nThe record company was founded by a woman who wanted to create a new nation for her followers. \n\nA woman who allegedly forced young healthy men to line up outside her door to wait for their golden chance to be SA’d by her. \n\nA woman who was tried for the torture and murder of a 5 year old baby. \n\nThis is the story of the Baby Garden cult - and how they made millions in the K-Pop industry without anyone knowing…\n\nThey’re still around to this day. \n\nFull Source Notes: rottenmangopodcast.com\n\nTo learn more about listener data and our privacy practices visit: https://www.audacyinc.com/privacy-policy\n\nLearn more about your ad choices. Visit https://podcastchoices.com/adchoices\n ",
      "release": "2024-09-25T19:58:20Z",
      "duration": "01:35:08",
      "explicit": false,
      "spotifyId": "0D0zTkELv9LuRS9DxnRhdV",
      "appleId": 1000669702539,
      "youTubeId": "EtV-RSvm9PI",
      "subjects": [
        "Baby Garden"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0D0zTkELv9LuRS9DxnRhdV",
        "apple": "https://podcasts.apple.com/podcast/391-huge-k-pop-record-store-founder-alleged-link-to/id1517954480?i=1000669702539",
        "youtube": "https://www.youtube.com/watch?v=EtV-RSvm9PI"
      }
    },
    {
      "id": "ca5af4fa-ad44-4a4b-ae5a-a559e2c9822b",
      "title": "#361: NYC Top “Escort” Service Catering To Rich Married Men Turned Out To Be College S*x Cult",
      "description": "The Department of Justice makes a very public statement—it feels more like a threat. “Please do not reproduce, share, or use this exhibit in any way. If you have downloaded this file, please delete it off your device.” The DOJ had accidentally leaked a file they previously moved to seal from the public. Not one thing, nor one name was redacted. The file in question - is the client list to one of the most high profile sex workers in all of Manhattan. Her revenue in just a few years was in the millions of dollars - her hourly rate was $1500. It’s safe to assume that this leaked, ’sealed’ file includes the names of NYC’s upper elite. High peorfile businessmen, millionaire-married couples, artists, restaurant tycoons, and lots and lots of rich married men. Some of the names were recognized to be high level executives at Apple, other major retailers, one wealthy hedge fund manager, one international diamond dealer, and a former NY Supreme Court Judge. But they hadn’t just been listed as clients for sex work. They had all been named as alleged clients of a sex trafficking business run by a college cult. 10 years prior, a man had walked onto an elite private school campus to visit his daughter, a sophomore at the university. The man, her father, ends up staying on campus, living in his daughter’s dorm, and quickly begins the process of grooming and brainwashing all of his daughter’s friends. The result was a decade long cult. Some of the friends turned cult members were ‘promoted’ to chauffeur or solder. Others into forced labor. His daughter’s friends would become his wives.’ And that left one, forced to turn to sex work. They all served one old, middle aged man. This is the case of Lawrence Ray and his decade long cult of college students and sex. Full Source Notes: rottenmangopodcast.com To learn more about listener data and our privacy practices visit: https://www.audacyinc.com/privacy-policy Learn more about your ad choices. Visit https://podcastchoices.com/adchoices",
      "release": "2024-05-26T15:34:37Z",
      "duration": "01:30:23.7510000",
      "explicit": false,
      "spotifyId": "0oEggSVnjdJFFCFs0cku4k",
      "appleId": 1000656804174,
      "youTubeId": "dGrb--1yz8Q",
      "subjects": [
        "Larry Ray",
        "Cult Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0oEggSVnjdJFFCFs0cku4k",
        "apple": "https://podcasts.apple.com/podcast/nyc-top-escort-service-catering-to-rich-married-men/id1517954480?i=1000656804174",
        "youtube": "https://www.youtube.com/watch?v=dGrb--1yz8Q"
      }
    },
    {
      "id": "e739f145-809b-4073-98b7-49348422f226",
      "title": "#360: Dad Moves Into Daughter’s College Dorm \u0026 Starts A Cult On Campus",
      "description": "“Hey, can my dad stay with us for a little while after he gets out of prison?” It was an odd request but Talia’s roommates felt like they couldn’t say no. Talia was a good friend, she always talked about wanting to become a lawyer and help people. She just had this tiny little quirk… She was obsessed with her dad. Even at parties - she would not stop talking about what an incredible man he was. He’s just going to stay in their dorms while he looks for a new place. What could possibly go wrong? When Larry Ray moves into Talia’s dorm - he slowly starts brainwashing all of Talia’s friends. Soon, he will be sleeping in Talia’s best friend’s room. Encouraging the students to all have intimate relations with each other… while he watches. This would be the start of his decade-long college cult. Full Source Notes: rottenmangopodcast.com To learn more about listener data and our privacy practices visit: https://www.audacyinc.com/privacy-policy Learn more about your ad choices. Visit https://podcastchoices.com/adchoices",
      "release": "2024-05-23T02:32:04Z",
      "duration": "01:43:35.6270000",
      "explicit": false,
      "spotifyId": "31XRjP4kxZdTtBiIcycZwX",
      "appleId": 1000656458793,
      "youTubeId": "xLTyIdlc1n8",
      "subjects": [
        "Larry Ray",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/31XRjP4kxZdTtBiIcycZwX",
        "apple": "https://podcasts.apple.com/podcast/dad-moves-into-daughters-college-dorm-starts-a-cult/id1517954480?i=1000656458793",
        "youtube": "https://www.youtube.com/watch?v=xLTyIdlc1n8"
      }
    },
    {
      "id": "5d76b909-c674-4558-94d2-d313be7cf29c",
      "title": "Disturbing Cult Leader That Likes To Play Surgeon \u0026 Mutilate All His Followers",
      "description": "There were things that fascinated him: surgery, polygamy, and torture. He decided the only way to have all 3 was if he started his own cult in the isolated woods of Canada.\n\nHe gathered 40 followers in a small cabin, convinced them that the apocalypse was coming and the only way they could be saved was if they followed his every word. His male followers’ private parts were cut off, teeth were pulled out with pliers, and they were creatively beaten on a daily basis.\n\nHe performed open stomach surgery on one of his wives without painkillers or anesthetic. He amputated another one of his wife’s arms without any painkillers just because he felt like it. And he kept all the spare body parts as evidence of torture in his little trophy shed.\n\nFull Source Notes: rottenmangopodcast.com\n\nTo learn more about listener data and our privacy practices visit: https://www.audacyinc.com/privacy-policy\n\nLearn more about your ad choices. Visit https://podcastchoices.com/adchoices\n ",
      "release": "2023-11-01T22:07:01Z",
      "duration": "01:41:23",
      "explicit": false,
      "spotifyId": "0u8D4HuswGQzx30PVbwiUg",
      "appleId": 1000632634264,
      "youTubeId": "p_fLfMzCgmc",
      "subjects": [
        "Ant Hill Kids"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0u8D4HuswGQzx30PVbwiUg",
        "apple": "https://podcasts.apple.com/podcast/disturbing-cult-leader-that-likes-to-play-surgeon-mutilate/id1517954480?i=1000632634264",
        "youtube": "https://www.youtube.com/watch?v=p_fLfMzCgmc"
      }
    },
    {
      "id": "ea242fe7-ff81-4f36-83a8-f56f1b3c029b",
      "title": "His 10,000 Brides - Korea’s Biggest Cult With Over 100k Members (The JMS Church)",
      "description": "Kim had heard the rumors of Pastor Jeong raping his female followers but he knew the devil was working hard to take down their Messiah.\n\nBut one day, while working in the JMS church post office - Kim stumbled upon a mysterious package. He opened it up to find a hard drive and hundreds of nude photos of women he recognized from the church.\n\nPhotos of women in various stages of undress. Videos of naked women screaming Pastor Jeong’s name, licking his picture, pleasuring themselves, and calling out for Pastor Jeong to come back to them…\n\nKim realized all the “devil’s lies” were nothing but the truth. Pastor Jeong had talked about “saving” 10,000 female souls. Now, he realized all he wanted to do was rape 10,000 women. Experts say Pastor Jeong would come very close.\n\nFull Source Notes: rottenmangopodcast.com\n\nTo learn more about listener data and our privacy practices visit: https://www.audacyinc.com/privacy-policy\n\nLearn more about your ad choices. Visit https://podcastchoices.com/adchoices\n ",
      "release": "2023-04-25T23:50:41Z",
      "duration": "01:54:10",
      "explicit": false,
      "spotifyId": "0dMpds5s08zAAUYKncFUUV",
      "appleId": 1000610295747,
      "youTubeId": "hvN61q6sLJY",
      "subjects": [
        "Providence"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dMpds5s08zAAUYKncFUUV",
        "apple": "https://podcasts.apple.com/podcast/koreas-biggest-sex-grooming-cult-with-over-100k/id1517954480?i=1000610295747",
        "youtube": "https://www.youtube.com/watch?v=hvN61q6sLJY"
      }
    }
  ]
}