{
  "id": "868e7542-ec2b-4acd-aca9-0ac3a4e2ddaf",
  "name": "Rotten Tomatoes Indie",
  "youTubeChannelId": "UCLyYEq4ODlw3OD9qhGqwimw",
  "episodes": [
    {
      "id": "cbc3793d-fb25-4e3e-ba57-e27cf055454d",
      "title": "My Scientology Movie CLIP - Casting Miscavige (2017) - Documentary",
      "description": "Directed by: John Dower\nMy Scientology Movie CLIP - Casting Miscavige (2017) - Documentary\n\n\u0022I find that the most inexplicable behavior is motivated by very relatable human impulses,\u0022 comments Louis Theroux as he heads to Los Angeles for his feature documentary, in collaboration with director John Dower and double Academy Award-winning producer Simon Chinn, exploring the Church of Scientology. Following a long fascination with the religion and with much experience in dealing with eccentric, unpalatable and unexpected human behavior, the beguilingly unassuming Theroux won\u0027t take no for an answer when his request to enter the Church\u0027s headquarters is turned down. Inspired by the Church\u0027s use of filming techniques, and aided by ex-members of the organization, Theroux uses actors to replay some incidents people claim they experienced as members in an attempt to better understand the way it operates. In a bizarre twist, it becomes clear that the Church is also making a film about Louis Theroux. Suffused with a good dose of humor and moments worthy of a Hollywood script, MY SCIENTOLOGY MOVIE is stranger than fiction.\n\nSubscribe to INDIE \u0026 FILM FESTIVALS: http://bit.ly/1wbkfYg\nSubscribe to TRAILERS: http://bit.ly/sxaw6h\nSubscribe to COMING SOON: http://bit.ly/H2vZUn\nWe\u0027re on SNAPCHAT: http://bit.ly/2cOzfcy\nLike us on FACEBOOK: http://bit.ly/1QyRMsE\nFollow us on TWITTER: http://bit.ly/1ghOWmt\n\nYou\u0027re quite the artsy one, aren\u0027t you? Fandango MOVIECLIPS FILM FESTIVALS \u0026 INDIE TRAILERS is the destination for...well, all things related to Film Festivals \u0026 Indie Films. If you want to keep up with the latest festival news, art house openings, indie movie content, film reviews, and so much more, then you have found the right channel.",
      "release": "2017-03-14T22:12:15Z",
      "duration": "00:01:06",
      "explicit": false,
      "youTubeId": "oo5O_SvmLgc",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oo5O_SvmLgc"
      }
    },
    {
      "id": "981e0c01-ad28-4cd7-a9d1-32c4fb3d5e18",
      "title": "Kidnapped For Christ Official Trailer 1 (2014) - Documentary HD",
      "description": "On Thursday, July 10th at 7:30pm ET/PT, SHOWTIME will premiere KIDNAPPED FOR CHRIST, a powerful, award-winning documentary that chronicles the shocking truth behind Escuela Caribe, a controversial Christian behavior modification program in the Dominican Republic for \u0022troubled\u0022 U.S. teenagers.  Initially hoping to document the positive effects a boarding school like this could have on struggling youth, evangelical filmmaker Kate Logan is granted unprecedented access and allowed to live on campus for the summer.  Once there, Logan\u0027s eyes are opened to the truth beneath the sunny façade of this remote reform school—kids being taken by force in the middle of the night, rumors of physical abuse, and staff imposing arbitrary and degrading punishments on the young students—and encounters students who change her life.\n \nIn the 85-minute documentary, Logan meets David, a 17-year-old honor student from Colorado, sent to the program shortly after coming out to his parents; Beth, a 15-year-old from Michigan suffering from debilitating panic attacks; and Tai, a 16-year-old Haitian-American girl from Boston experimenting with drugs to cope with childhood trauma.  With mounting evidence that this so-called \u0022therapeutic boarding school\u0022 is no more than a crude brainwashing camp, Logan is determined to help at least one student escape.  The struggles she faces to secure the child\u0027s freedom reveal just how far Escuela Caribe will go to prevent their students from leaving, becoming a journey that tests Logan\u0027s faith in ways she could never imagine.\n \nSpecial Jury Award Winner of the 2014 Nashville Film Festival and the Audience Award for Best Documentary Feature at 2014 Slamdance Film Festival, KIDNAPPED FOR CHRIST is executive produced by Lance Bass, Mike C. Manning and Tom DeSanto.  KIDNAPPED FOR CHRIST is presented by REDTHORN, in association with LOOK CLOSER MEDIA.",
      "release": "2014-07-07T17:49:15Z",
      "duration": "00:02:06",
      "explicit": false,
      "youTubeId": "1IfwaY-F4SM",
      "subjects": [
        "Troubled Teen Industry",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1IfwaY-F4SM"
      }
    }
  ]
}