{
  "_ts": 0,
  "id": "868e7542-ec2b-4acd-aca9-0ac3a4e2ddaf",
  "name": "Rotten Tomatoes Indie",
  "youTubeChannelId": "UCLyYEq4ODlw3OD9qhGqwimw",
  "episodes": [
    {
      "id": "cbc3793d-fb25-4e3e-ba57-e27cf055454d",
      "title": "My Scientology Movie CLIP - Casting Miscavige (2017) - Documentary",
      "description": "Directed by: John Dower\nMy Scientology Movie CLIP - Casting Miscavige (2017) - Documentary\n\n\u0022I find that the most inexplicable behavior is motivated by very relatable human impulses,\u0022 comments Louis Theroux as he heads to Los Angeles for his feature documentary, in collaboration with director John Dower and double Academy Award-winning producer Simon Chinn, exploring the Church of Scientology. Following a long fascination with the religion and with much experience in dealing with eccentric, unpalatable and unexpected human behavior, the beguilingly unassuming Theroux won\u0027t take no for an answer when his request to enter the Church\u0027s headquarters is turned down. Inspired by the Church\u0027s use of filming techniques, and aided by ex-members of the organization, Theroux uses actors to replay some incidents people claim they experienced as members in an attempt to better understand the way it operates. In a bizarre twist, it becomes clear that the Church is also making a film about Louis Theroux. Suffused with a good dose of humor and moments worthy of a Hollywood script, MY SCIENTOLOGY MOVIE is stranger than fiction.\n\nSubscribe to INDIE \u0026 FILM FESTIVALS: http://bit.ly/1wbkfYg\nSubscribe to TRAILERS: http://bit.ly/sxaw6h\nSubscribe to COMING SOON: http://bit.ly/H2vZUn\nWe\u0027re on SNAPCHAT: http://bit.ly/2cOzfcy\nLike us on FACEBOOK: http://bit.ly/1QyRMsE\nFollow us on TWITTER: http://bit.ly/1ghOWmt\n\nYou\u0027re quite the artsy one, aren\u0027t you? Fandango MOVIECLIPS FILM FESTIVALS \u0026 INDIE TRAILERS is the destination for...well, all things related to Film Festivals \u0026 Indie Films. If you want to keep up with the latest festival news, art house openings, indie movie content, film reviews, and so much more, then you have found the right channel.",
      "release": "2017-03-14T22:12:15Z",
      "duration": "00:01:06",
      "explicit": false,
      "youTubeId": "oo5O_SvmLgc",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oo5O_SvmLgc"
      }
    }
  ]
}