{
  "id": "d0732fa3-d55a-4b76-bbd0-f89a54369d85",
  "name": "ROYAL ADVANCED NET TV",
  "youTubeChannelId": "UCpAZgUrCk8Gb87odEaVqq3Q",
  "episodes": [
    {
      "id": "09e4e06d-eba8-46cb-b004-a19c58143d54",
      "title": "MACKENZIE SHAKAHOLA CASE",
      "description": "Mombasa High Court witnessed a tense session today before Lady Justice Diana Mochache as a key state witness in the high-profile Shakahola case challenged a report presented by the Director of Public Prosecutions (DPP). The case involves controversial cleric Paul Mackenzie and 30 co-accused.\n\n \n\nAnthony Wyclif, a state witness whose wife and five children were members of Mackenzie’s church, testified virtually and denied claims in the DPP report that one of his children had died. He said he had been in touch with his wife, who is currently at Shimo la Tewa, and confirmed that their children were safe and in custody.\n\n \n\nThe court had earlier been presented with a postmortem report of the purportedly deceased child, introduced by the DPP’s director, Jamie Yemi. However, Mackenzie’s lawyer, Lawrence Obonyo, opposed the report, arguing that it lacked a pathologist’s stamp and signature and contradicted the witness’s testimony.\n\n \n\nLady Justice Mochache ultimately quashed the postmortem report, ruling that it could not be admitted as evidence. Obonyo described the report as a “disputed document” that investigators attempted to introduce late in the trial without proper verification.\n\n \n\n“What you’re seeing here is an attempt to introduce a document at a very late stage claiming the death of someone, yet the witness clearly stated they had no knowledge of it,” Obonyo said outside court. He emphasized that the trial has faced repeated challenges from last-minute witnesses and sudden emergence of unverified documents, but expressed confidence that the truth would emerge once evidence is thoroughly examined.\n\n \n\nMeanwhile, defending the DNA analysis, DPP Director Jamie Yemi stated that an expert concluded there was a 99.99% probability that Anthony Wyclif and Ojai Millicent Awuor are the biological parents of the DNA profile obtained from the child’s body. Yemi clarified that witnesses are often asked only to confirm names on postmortem reports, rather than provide technical verification, and stressed that the court would now rely on the government chemist’s report.",
      "release": "2025-12-07T20:09:56Z",
      "duration": "00:13:00",
      "explicit": false,
      "youTubeId": "kxKOkVpZsz0",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kxKOkVpZsz0"
      }
    }
  ]
}