{
  "id": "18bf28c4-8853-4c31-81a7-1c6affa60b97",
  "name": "Royal Exclusive",
  "spotifyId": "2MGw68ydiczMrVllmWNxXv",
  "appleId": 1734442919,
  "youTubeChannelId": "UCN0ie1TZA8DHLgWThFCEl9Q",
  "youTubePlaylistId": "PLRINRDxwJdvPpBJEdTQE7h5bUDzLmBK1q",
  "episodes": [
    {
      "id": "dc4abf4b-1ce0-4332-9888-5fc54a9afe1b",
      "title": "Andrew\u0027s been caught out in a lie on a global scale - he\u0027s to blame for the Royals’ worst year EVER",
      "description": "2025 has been a turbulent year for the British Royal Family - with the historic removal of Andrew Mountbatten-Windsor\u0027s royal titles, Prince Harry\u0027s ongoing row over security in the UK, Meghan Markle\u0027s new brand and project launches and the health updates from King Charles and Princess Catherine. The Sun\u0027s Royal Editor Matt Wilkinson, alongside former press secretary to Queen Elizabeth II Ailsa Anderson and 5News\u0027 royal correspondent Simon Vigar look back at the biggest royal stories of the year and look ahead to what we can expect from the royals in 2026. 0:48 - Introduction: A Royal Year 1:36 - A Devastating, Sad, Yet Hopeful 2025 for the Royals 2:54 - The Disgrace of Andrew is the Overarching Story of the Year 3:29 - Why 2025 has been the Worst Year for the Royals 4:21 - Andrew\u0027s Epstein Scandal: An Existential Threat to the Monarchy 7:00 - Does 2025 Draw a Line Under The Andrew Saga? 8:26 - Prince Harry\u0027s Legal Battle For UK Armed Security: Could He Win? 10:21 - Why Should UK Taxpayers Pay For Harry\u0027s Security When He Chose to Leave? 12:55 - Will Harry Bring His Children Back to the UK in 2026? 13:14 - Meghan\u0027s Entrepreneurial Year: Is Her Cultural Relevancy Running Out? 16:00 - How Successful Will Meghan\u0027s Return to Acting Be? 18:51 - Campaign To Remove Duchess of Sussex\u0027s Title 19:32 - The Royals That Will Shine in 2026 21:19 - The King Completes More Engagements Than Any Other Royal 28:34 - Quickfire Questions Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-12-31T17:00:00Z",
      "duration": "00:31:37.4080000",
      "explicit": false,
      "spotifyId": "2zduysexGewxKQ3GGfzZFn",
      "appleId": 1000743333891,
      "youTubeId": "mB3ihoiB0Gk",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zduysexGewxKQ3GGfzZFn",
        "apple": "https://podcasts.apple.com/podcast/andrews-been-caught-out-in-a-lie-on-a-global/id1734442919?i=1000743333891",
        "youtube": "https://www.youtube.com/watch?v=mB3ihoiB0Gk"
      }
    },
    {
      "id": "db91d1a8-a819-4efc-bae0-9751165422af",
      "title": "Royals BANISHED Andrew to get ahead of Epstein Files - but there’s lots more to come out",
      "description": "We examine Prince Andrew’s ongoing Epstein scandal, described as a new “nightmare before Christmas,” as damaging revelations continue to surface and place renewed pressure on King Charles and Prince William. We also break down Prince Harry and Meghan Markle’s Archewell Philanthropies rebrand, exploring what the Sussex strategy signals for their public image, finances, and long-term relationship with the monarchy.\n\nPlus, we look at a rare feel-good royal moment as Prince George follows in the footsteps of Princess Diana and Prince William, volunteering at a homeless shelter during the Christmas period. From royal scandals to symbolic acts of service, this episode unpacks what it all means for the future of the British Royal Family in 2025.\n\nChapters:\n00:00 Prince Andrew Epstein Scandal Returns: Royal Crisis Before Christmas\n01:28 King Charles and Prince William Push Andrew Aside\n02:41 Sandringham Controversy: Epstein Claims and Royal Estates\n05:53 Prince William Body Language Signals Final Split\n08:12 Sarah Ferguson and Epstein Money Fallout\n09:44 Beatrice and Eugenie in a Slimmed-Down Monarchy\n12:44 Prince Andrew Loses Firearms Licence\n15:10 Harry and Meghan’s Archewell Rebrand Struggles\n23:25 Prince George and Princess Diana Legacy Link\n29:00 King Charles Christmas Message and Royal Traditions\n\nRoyal Exclusive is your place for all the latest Royal News. Join our team of Royal experts as they give you daily insights into the British Royal family and the latest drama with Prince Harry and Meghan Markle. \n\nSubscribe for more: https://www.youtube.com/channel/UCN0ie1TZA8DHLgWThFCEl9Q?sub_confirmation=1\n\nThe Sun brings you breaking news and in-depth analysis on the stories that matter most. \n\n►Read The Sun: https://bit.ly/3Tay1OY\n►Like The Sun on Facebook: https://www.facebook.com/RoyalFamilyTheSun/\n►Follow The Sun on TikTok: https://www.tiktok.com/@thesun\n►Subscribe to The Sun on Snapchat: https://www.snapchat.com/discover/The_Sun/1633225139\n\n#RoyalExclusive #RoyalNews",
      "release": "2025-12-24T17:00:47Z",
      "duration": "00:33:43",
      "explicit": false,
      "youTubeId": "QL5NGqh7Alo",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QL5NGqh7Alo"
      }
    },
    {
      "id": "1374e6bd-4095-497b-86cb-8cbcf208581e",
      "title": "Andrew has suffered the ULTIMATE humiliation but public may STILL bay for blood say royal experts",
      "description": "In this clip from The Sun\u0027s Royal Exclusive our experts examine the public\u0027s reaction to Andrew Mountbatten Windsor\u0027s fall from grace. \n\n00:00 - Andrew’s ultimate humiliation \n01:15 - Should Andrew still be 8th in line or succession?\n03:12 - The reaction from the public\n04:50 - Are there more allegations coming soon?\n06:50 - Are there too many distractions between working Royals and Andrew?\n\nRoyal Exclusive is your place for all the latest Royal News. Join our team of Royal experts as they give you daily insights into the British Royal family and the latest drama with Prince Harry and Meghan Markle. \n\nSubscribe for more: https://www.youtube.com/channel/UCN0ie1TZA8DHLgWThFCEl9Q?sub_confirmation=1\n\nThe Sun brings you breaking news and in-depth analysis on the stories that matter most. \n\n►Read The Sun: https://bit.ly/3Tay1OY\n►Like The Sun on Facebook: https://www.facebook.com/RoyalFamilyTheSun/\n►Follow The Sun on TikTok: https://www.tiktok.com/@thesun\n►Subscribe to The Sun on Snapchat: https://www.snapchat.com/discover/The_Sun/1633225139\n\n#RoyalExclusive #RoyalNews",
      "release": "2025-11-08T15:00:14Z",
      "duration": "00:08:40",
      "explicit": false,
      "youTubeId": "4f9ikGV7WyM",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4f9ikGV7WyM"
      }
    }
  ]
}