{
  "id": "4dbfbf08-6938-42b4-9d46-e784349f15c5",
  "name": "Runway Diaries",
  "youTubeChannelId": "UCohSZeQeOslUR96ajjhmx9A",
  "episodes": [
    {
      "id": "592c77ef-3b55-449e-ae04-f088762303aa",
      "title": "How A Supermodel Got Destroyed By A Cult: Ruslana Korshunova",
      "description": "How A Supermodel Got Destroyed By A Cult: Ruslana Korshunova\n\nShe had the looks, the fame, the life. Ruslana Korshunova lit up catwalks and Vogue covers, then plunged to her death from a Manhattan balcony. No note. No warning. Just a beautiful girl, gone at 20. Behind the glamour? A secretive group that promised healing but acted like a cult. This is how a supermodel got pulled in… and never came out.\n\nThis video features discussions on unverified information and speculative viewpoints sourced from the internet and various news outlets. Intended solely for educational and informational purposes, this content should not be regarded as confirmed facts or definitive truths. Our use of content complies with YouTube\u0027s Fair Use guidelines. According to Section 107 of the U.S. Copyright Act: \u0022Notwithstanding the provisions of sections 106 and 106A, the fair use of a copyrighted work, including reproduction in copies or phonorecords or by any other means specified by that section, for purposes such as criticism, comment, news reporting, teaching (including multiple copies for classroom use), scholarship, or research, is not an infringement of copyright.\u0022 While this video may contain copyrighted clips, images, or photographs not specifically authorized by the copyright holder(s), we believe in good faith that these materials are protected by federal law and the fair use doctrine. Runway Diaries does not aim to defame, slander, or discredit any individuals or organizations mentioned in this video. The information is presented to encourage thoughtful discussion and critical thinking among viewers. We explicitly do not condone or promote any violent actions described in this video; such mentions are solely to provide context and understand the implications of certain events historically or in current affairs.\n\nMore videos:\n\nhttps://youtu.be/nJtUn2l0vnQ?si=DRNIjck2jBYwexYa\n\nhttps://youtu.be/2lhoZZqYtHs?si=7e5UGiMZkQcka-j9",
      "release": "2025-07-07T17:45:02Z",
      "duration": "00:09:34",
      "explicit": false,
      "youTubeId": "TM5rFo1qFD0",
      "subjects": [
        "Lifespring"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TM5rFo1qFD0"
      }
    }
  ]
}