{
  "_ts": 0,
  "id": "160fc316-816a-4c27-9bca-f58746c00cbe",
  "name": "Ruth Wise",
  "youTubeChannelId": "UC6Kq4Oy-XSdO8olH6VFGbjA",
  "episodes": [
    {
      "id": "aeee2375-7843-4214-b108-969ddf83bb93",
      "title": "Reading some of my notes from the Young People’s Training in Taipei ‘87",
      "description": "I thought I’d share where I work, in the same small building where “the” church in LA, Hall 5,  meets… Seeing my dear brothers and Sisters in Christ with whom I haven’t felt welcome after my husband rejected me and spread lies about me… and less welcome now that I am speaking the truth about covered up sin. I also wanted to share some of my notes from the 1987 YP Training that I found in a box today…",
      "release": "2024-11-08T02:35:45Z",
      "duration": "00:12:37",
      "explicit": false,
      "youTubeId": "E6tE0AlpbqM",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E6tE0AlpbqM"
      }
    },
    {
      "id": "76c93ba9-99cd-4296-b467-434beb6ea985",
      "title": "So much more covered up sin in “The Lord’s Recovery” (Part 3)",
      "description": "I don\u0027t feel my job is done sharing Brother Don Hardy\u0027s words of much experience, observations, intense suffering, and hard-earned wisdom.  \n\nWe can and should learn from history.\n\nI will never feel I have done justice, probably, in expressing the long-concealed truth of rampant sin and abusive patterns in the leadership of \u0022The Lord\u0027s Recovery,\u0022 the Living Stream Ministry, and sadly, in many of the \u0022local churches\u0022 - that name being not a general reference to local churches, but to a particular group of believers who consider themselves the ONLY ones in each city meeting \u0022in oneness\u0022.....\n\nSo here is another attempt to share some of this dear brother\u0027s words, which he left for our learning. May his suffering (representing countless others\u0027 suffering in this group) and sharing of lessons learned not be in vain.",
      "release": "2024-11-07T05:09:26Z",
      "duration": "00:19:46",
      "explicit": false,
      "youTubeId": "tmpJM5zIQtM",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tmpJM5zIQtM"
      }
    },
    {
      "id": "03e169c1-e1e0-4145-a0a3-bb7c60e362ed",
      "title": "So much more covered up sin in “The Lord’s Recovery” (Part 2)",
      "description": "If I could do so efficiently, I would read more sections from Brother Don Hardy\u0027s fellowship, reports of his decades serving in the local church with Witness Lee, and of his being mistreated and lied about after confronting gross sexual sins of both Timothy Lee  and Philip Lee. \n\nThe church in Rosemead suffered the loss of a real shepherd when, with no explanation, Don and his family were no longer welcome there, decided by a committee of five; the true explanation would have been helpful for all to know: Don had seen Philip Lee committing an adulterous act in the Living Stream Ministry office, so Philip determined, and had the clout, to get rid of him. Don and his family had to move from the house they were renting - an \u0022LSM\u0022-owned house. His family was extensively damaged. And his story is one of so many similar stories, of lies and abuse of power destroying precious marriages and families.\n\nThere is far too much financial corruption, \u0022spiritual\u0022 coercion, dishonesty, and sexual impropriety to fit into a Youtube video, and some I, like Don Hardy and all the others, have a hard time even mentioning, it is so defiling.\n\nOne verse Brother Don left with us in these 172 pages is: \nCorinthians 11:18–19: “I hear that there are divisions among you. And I believe it in part, for there must be factions among you in order that those who are genuine among you may be recognized.”\n\nWho is genuine? Who is truthful? Who is not hiding evil secrets that have countless victims?\n\nI am one with all believers in Christ, who are one with Christ. But we are never meant to be one with sin and lies and abuse. Don says: \u0022Brother, please know that I am NOT against any ministry which came out o f WL\u0027s mouth, from GOD. I receive it (...same as I would from the pope, if he too spoke God\u0027s Words, or truth); but I will NOT be a part of WL\u0027s and now PL\u0027s SINS! Even as they do, we all need to repent of many unconfessed things.\u0022  May we all be in the Light, enjoying the Life, in Love.... Correct me if I am wrong, but THIS is being in \u0022the Stream\u0022 - the one ministry - the ministry of the Spirit, and being one with THIS ministry, we keep the oneness... of the Spirit. It was never about any certain man, other than Jesus only. \n\nI refer to this precious document in this video: truestoryofdivisionmaking.com/uploads/3/4/7/1/34712424/rosemeadtrueaccount_1.pdf\n\n#livingstreamministry \n#localchurch \n#donhardy\n#witnesslee",
      "release": "2024-11-06T03:54:55Z",
      "duration": "00:12:30",
      "explicit": false,
      "youTubeId": "mZa0TI5cb4I",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mZa0TI5cb4I"
      }
    },
    {
      "id": "7040548d-b2e4-4d9d-bb4f-bf3bebb065b6",
      "title": "So much more covered up sin in “The Lord’s Recovery” (Part 1)",
      "description": "Now I am sharing parts of 172 pages of emails from a dear, faithful servant of Christ who is now with his Master. This brother’s writing is full of love, light, life, and factfulness. I knew many of the facts contained in his emails, but am am still shocked, sickened and heartbroken having read of so much evil covered up in what I believed to be a pure group of Christ followers. Believers deserve to know that corruption pervades the history and present leadership of “The Lord’s Recovery.” We know a tree by its fruit, and when I experienced fruits of the flesh from my own husband, then from his parents, and then from elders and coworkers, I arrived at the realization that I was being presented fleshly acts, from a  whole tree that is full of sexual immorality and impurity, uncleanness, lustful pleasures, lasciviousness, idolatry, hatred, discord, jealousy, fits of rage, selfish ambition, dissensions, factions, envy, drunkenness, indulgence, and the like. Not reproving men - leaders in a Christian community no less - who practice and cover such things is sin. I cannot in good conscience call “The Lord’s Recovery” a group with a long history of covered up sins and lawlessness. We all make mistakes, but righteous people confess, repent, and repair relationships to restore peace with God and with fellow humans. Righteous people who may stray or fail admit the truth and turn from their wicked ways. But I am learning of so many decades of lies and corruption; I’m discovering that the personal tragic undoing of my marriage and the torture I and my adult children still are trying to survive are just samplings of the evil fruit of “this church’s” leadership, practices in direct opposition to God’s Word. More to come, sadly.",
      "release": "2024-11-05T07:13:02Z",
      "duration": "00:11:11",
      "explicit": false,
      "youTubeId": "_I_JInKOcXc",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_I_JInKOcXc"
      }
    },
    {
      "id": "8dbfe42c-2480-4456-9439-8859dff96744",
      "title": "“What Would You Say to my Teenage Daughter?”",
      "description": "A dear brother, who also grew up in the local churches like me, called me yesterday and today, and we had some very precious fellowship about our experiences in the church and in human life. He asked me what I would say to his daughter if she saw my videos, since he is hoping someday she will have a healthy church life. This is my short-version answer to her and to any young adult or teenager who might ask me about what I would recommend, related to the church.\n\nI would clarify or add to what I just recorded that under the point of genuineness - which should be the norm and which little children exemplify…. A church should be a place where everyone can be genuine and is welcomed as they really are, not having to mask things or hide their wounds or their sicknesses. Young adults, teenagers, and anyone else should never have to pretend in order to be accepted in a church. We hear that the church is a hospital. It would not serve a patient well if they were expected to be fine, and had to act like everything is okay with them in a hospital.\n\nI welcome anyone else to share from their experiences, what you would say to a young adult seeking a healthy church life.",
      "release": "2024-11-04T01:44:39Z",
      "duration": "00:05:18",
      "explicit": false,
      "youTubeId": "k7Rm8DIo--E",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k7Rm8DIo--E"
      }
    },
    {
      "id": "dd94238e-7688-4ea5-b614-ebb17e50049e",
      "title": "Conclusion of videos applying/commenting on/reading excerpts from a helpful book",
      "description": "This is the last of series of videos in which I share from a very timely book, so pertinent to the trauma I have experienced, and which I am still working through, in \u0022the local churces\u0022/\u0022the Lord\u0027s Recovery.\u0022  I hope Katelyn Beaty\u0027s book, \u0022Celebrities for Jesus: How Personas, Platforms, and Profits Are Hurting the Church\u0022 would help expose many wounds in Christ\u0027s Body and that there could be repentance and healing where needed. \n\nThis video shares a few highlights from the 3rd section of the book: \u0022The Way Up Is Down.\u0022 Thank you to my sister in Christ, Katelyn Beaty, for her focus on our need for ordinary faithfulness, and for expressing such faithfulness in writing this book.",
      "release": "2024-11-03T23:52:48Z",
      "duration": "00:11:15",
      "explicit": false,
      "youTubeId": "N-SwWK_UM7I",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=N-SwWK_UM7I"
      }
    },
    {
      "id": "b32da235-787f-44e6-81b7-8b144417e162",
      "title": "More Highlights- \u0026quot;Celebrities for Jesus: How Personas, Platforms, \u0026amp; Profits Are Hurting the Church”3",
      "description": "This is the third of 3 videos in which I share tidbits from the 2nd section (\u0022Three Temptations\u0022) of a book I find so pertinent to my and others\u0027 burden for the truth to be told and for there to be repentance and restoration in the church community of which I was a very active member for decades. I hope Katelyn Beaty\u0027s book, Celebrities for Jesus: How Personas, Platforms, and Profits Are Hurting the Church would help expose many wounds in Christ\u0027s Body and that there could be repentance and healing where needed. \n\nThis video specifically addresses subsections called “Chasing Platforms” and “Creating Persona”.",
      "release": "2024-11-03T22:31:25Z",
      "duration": "00:19:46",
      "explicit": false,
      "youTubeId": "F6Ay6xU-PuA",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F6Ay6xU-PuA"
      }
    },
    {
      "id": "8dd69222-5850-428e-9821-8932660ecfdd",
      "title": "More Highlights- \u0026quot;Celebrities for Jesus: How Personas, Platforms, \u0026amp; Profits Are Hurting the Church”2",
      "description": "This is the second of 3 videos in which I share tidbits from the 2nd section (\u0022Three Temptations\u0022) of a book I find so pertinent to my and others\u0027 burden for the truth to be told and for there to be repentance and restoration in the church community of which I was a very active member for decades. I hope Katelyn Beaty\u0027s book, Celebrities for Jesus: How Personas, Platforms, and Profits Are Hurting the Church would help expose many wounds in Christ\u0027s Body and that there could be repentance and healing where needed. This video specifically addresses a subsection called \u0022Abusing Power.\u0022",
      "release": "2024-11-03T22:26:48Z",
      "duration": "00:19:23",
      "explicit": false,
      "youTubeId": "ysP9r6j2nGs",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ysP9r6j2nGs"
      }
    },
    {
      "id": "99c7e42b-d8ec-4547-89d5-827dc996fc85",
      "title": "More Highlights- \u0026quot;Celebrities for Jesus: How Personas, Platforms, \u0026amp; Profits Are Hurting the Church\u0026quot;1",
      "description": "This is the first of 3 videos in which I share tidbits from the 2nd section (\u0022Three Temptations\u0022) of a book I find so pertinent to my and others\u0027 burden for the truth to be told and for their to be repentance and restoration in the church community of which I was a very active member for decades. I hope Katelyn Beaty\u0027s book, Celebrities for Jesus: How Personas, Platforms, and Profits Are Hurting the Church would help expose many wounds in Christ\u0027s Body and that there could be repentance and healing where needed.\n\nThis video specifically addresses a subsection called \u0022Abusing Power.\u0022",
      "release": "2024-11-03T22:10:05Z",
      "duration": "00:15:32",
      "explicit": false,
      "youTubeId": "fQpAX-_QffA",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fQpAX-_QffA"
      }
    },
    {
      "id": "cf0cbda3-873f-475b-bde0-586ebf2fb175",
      "title": "Help from \u0026quot;Celebrities for Jesus - How Personas, Platforms \u0026amp; Profits Are Hurting the Church\u0026quot; (1)",
      "description": "In this video I mainly read parts of the 1st section of this book, \u0022Celebrities for Jesus - How Personas, Platforms, \u0026 Profits Are Hurting the Church\u0022 by Katelyn Beaty (2022). The celebrity status of certain brothers/families has long troubled some close to me, and is, I believe, a main problem in the current (and historical) troubling situation in \u0022the church,\u0022 about which I have been speaking out. I mention in this video that Witness Lee and Philip Lee had such a dangerous and damaging celebrity status, but so do my father-in-law and my husband and many other highly regarded leading ones, in the same church community, to varying degrees, but to enough of a degree that what typical people would not get away with, they have, due to identification, \u0022love,\u0022 admiration, devotion... of many in public, while there is, behind closed doors, anger, abuse of power, cruel treatment of close family members, secrecy, giving in to temptation, and in some cases, addiction.\n\nI failed in this video to read aloud a paragraph (among many paragraphs) about Billy Graham, whom Beaty faithfully critiques regarding his celebrity status, but whose ministry was preserved due to a strict pact he made with his co-workers, the \u0022Modesto Manifesto,\u0022 to guard against common temptations. She writes (p. 38): \u0022Graham saw with prescient wisdom how intoxicating it would be for leaders to believe they are so important that they can evade accountability they need, even and perhaps especially when their work seems crucial for the kingdom. He saw that celebrity power\u0027s central lie is that an individual is important enough to be above the rules. He saw that celebrity so easily leads Christian leaders to use ministry to seek personal riches and thus defy the Bible\u0027s many warnings against greed and the love of money. He saw that celebrity causes many leaders to believe that they  can go it alone - that their individual ministries and platforms are more important and central than the  ordinary witness of local churches. And he saw that celebrity entices leaders to fudge the truth....\u0022\n\nSo applicable. Thank God for brothers who have cared, and who still care, for what went/goes on behind closed doors, even more than what is seen in public.",
      "release": "2024-11-02T05:39:38Z",
      "duration": "00:16:32",
      "explicit": false,
      "youTubeId": "7pr84h3_pYM",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7pr84h3_pYM"
      }
    },
    {
      "id": "e2a4e46a-f8f3-47dc-a52b-08732a20cdfb",
      "title": "A Corroborating Letter Written by Paul Kerr in Feb. 1990, Re: \u0026quot;Response to Recent Accusations\u0026quot;",
      "description": "Thanks to S.N., a faithful brother who has grieved the abuse of many of his brothers and sisters in \u0022the Lord\u0027s Recovery\u0022 for many years, and through his labor, not in vain in the Lord, has access to many primary sources that shed necessary light and truth regarding prolific sins committed and covered up, along with other violations of God\u0027s Word, by leaders in \u0022the local churches\u0022 for decades. Without these primary sources, trusting believers could be (and have been) more easily lied to and manipulated. We believers should not lie, nor protect lies, nor love lies  (Rev. 22:15). We love God, we love and obey His Word, we love our brothers without partiality, we abhor what is evil, and we rejoice in the truth.\n\nIn this video, I mainly read a letter written by brother Paul Kerr to K. Robichaux and R. Kangas in February 1990, just 2 months after the publication of the book \u0022A Response to Recent Accusations\u0022 - a defaming book aimed at belittling and tearing down a faithful, godly older brother\u0027s testimony to the flock under his care of why, after decades as a leading one, as a primary laborer with Witness Lee on the church hymnal and the Recovery Version of the New Testament, he needed to resign from the eldership in Anaheim. \n\nI am so thankful for all of those who spoke out and especially whose words are in print, who express the same desperate concerns I share, with a heart for the oneness of the unique Body of Christ, which \u0022Body\u0022 is NOT equivalent to those who identify as \u0022the Lord\u0027s Recovery\u0022/\u0022the local churches\u0022, not restricted to adherents of Witness Lee - but comprised of all genuine believers in Christ.  \n\nThe open letter by Paul Kerr can be viewed at: www.johningalls.com/ARTRA/PaulKerrOnTheBody.pdf\n\n#johningalls\n#localchurch \n#lordsrecovery \n#thelordsrecovery \n#thelocalchurch",
      "release": "2024-10-31T03:02:04Z",
      "duration": "00:15:48",
      "explicit": false,
      "youTubeId": "mJcqHK2wQ6g",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mJcqHK2wQ6g"
      }
    },
    {
      "id": "1042805e-7ab2-4683-926f-f40a6c07b5e4",
      "title": "A Public Plea to Ron K. and Kerry R. Related to \u0026quot;A Response to Recent Accusations\u0026quot;",
      "description": "Today I read the book \u0022A Response to Recent Accusations\u0022 by Ron Kangas and Kerry Robichaux (Living Stream Ministry, 1989), that, as usual, broke my heart. I want oneness and peace, and I believe so do countless of my brothers and sisters who have reached out for fellowship about deeply offensive and wounding practices, behaviors and words too common among leaders in \u0022the Lord\u0027s Recovery.\u0022 Others desiring peace and oneness have been driven away by the cruel abuse experienced or witnessed in the church, and never spoke out publicly. I know many. And, yes, I put quotes around \u0022the Lord\u0027s Recovery\u0022, because I don\u0027t believe my Lord would treat my brothers and sisters the way they have been and are being treated by many leaders in \u0022the\u0022 church, and anything abusive should never be called \u0022Recovery\u0022. So I ask you brothers, as you asked John Ingalls at the end of your book: \u0022We invite our brother[s] to treat this matter seriously and to take that proper biblical and human course of action that will produce genuine peace between [themselves] and the Body.\u0022 Many members of the Body have been and are extremely stumbled by the lack of accountability, the lack of righteousness, justice, and love toward ALL members - without partiality. Instead, there has been falsehood, gaslighting, mockery, sexual misconduct, financial corruption, defaming and despising of believers.... and I am asking that all of this get cleared up through repentance.",
      "release": "2024-10-30T01:09:54Z",
      "duration": "00:16:06",
      "explicit": false,
      "youTubeId": "dNLCt4z0ji8",
      "subjects": [
        "The Lord\u0027s Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dNLCt4z0ji8"
      }
    },
    {
      "id": "300630bc-197d-4015-a3d1-39eb5eb30817",
      "title": "Today’s LSM Radio Broadcast About God’s Government Being Just, Righteous and Fair",
      "description": "The most painful thing to me is loving God’s Word so much, but not seeing it obeyed or lived out - particularly by the teachers of the Word. We should practice what we preach (Matt. 23:3 “…they preach but do not practice.”) \n\nFor the record, for decades I truly saw Dick Taylor live what he spoke in this broadcast, loving and keeping the oneness. \n\nI’m appealing to all of God’s people, to judge righteously and fairly in any dispute, to care for one another, and not to have differing weights and measures. Rather, let’s have the same love, the same weights and measures for ALL believers. Partiality, favoritism and varied scales and love all divide the Body of Christ.\n\nLet’s keep the ONENESS by keeping, obeying and applying these words that God gave us for the sake of His testimony.",
      "release": "2024-10-29T05:44:33Z",
      "duration": "00:07:29",
      "explicit": false,
      "youTubeId": "IEzs8E2JZ4I",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IEzs8E2JZ4I"
      }
    },
    {
      "id": "bea6c2b4-ec63-4713-b15a-d378d46864a1",
      "title": "Addressing “Glaring Omissions in ‘The Fermentation of the Present Rebellion’” (Part 8)",
      "description": "This final video of this series covers 2 false claims in “The Fermentation of the Present Rebellion” - that John So couldn’t be trusted because he commended Brother Lee and his ministry in the spring of 1986 and then played an active role in rebelling against the ministry in October of 1986; and that there is not a hint of control of the Living Stream Ministry over any church.",
      "release": "2024-10-27T09:16:32Z",
      "duration": "00:16:43",
      "explicit": false,
      "youTubeId": "izD9RGErfIA",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=izD9RGErfIA"
      }
    },
    {
      "id": "a7db47c5-7e59-44b2-b40a-6f17081bf286",
      "title": "Addressing “Glaring Omissions in ‘The Fermentation of the Present Rebellion’” (Part 1)",
      "description": "This is the first of multiple videos, a series addressing the glaring omissions of truth from “The Fermentation of the Present Rebellion” - a book published by Living Stream Ministry in 1994. Four brothers who were faithful to God’s Word were publicly labeled as rebellious, and their characters were publicly smeared/assassinated, though their actual concerns about true and intolerable issues were never disclosed in this book. This video and all the videos in this series are based on the diligent work of Stephen Isitt who, for not agreeing that such false accusations be made of our brothers, and for bringing to light many important, relevant, necessary facts being covered up, has been publicly defamed, just as those brothers he has defended for over 20 years.",
      "release": "2024-10-27T09:08:49Z",
      "duration": "00:09:11",
      "explicit": false,
      "youTubeId": "h-SobQXmvgM",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h-SobQXmvgM"
      }
    },
    {
      "id": "cac0a60f-b427-4cab-8995-887b1f5874dd",
      "title": "Addressing “Glaring Omissions in ‘The Fermentation of the Present Rebellion’” (Part 3)",
      "description": "This video addresses the false claim that elders in “the Lord’s Recovery” conspired against Witness Lee and his ministry in the 1980s.",
      "release": "2024-10-27T09:08:43Z",
      "duration": "00:10:05",
      "explicit": false,
      "youTubeId": "a1TLe9Ifxd8",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=a1TLe9Ifxd8"
      }
    },
    {
      "id": "19cfb04e-a84d-409f-9840-1efbd9712122",
      "title": "Addressing “Glaring Omissions in ‘The Fermentation of the Present Rebellion’” (Part 4)",
      "description": "This video addresses the false claim in “The Fermentation of the Present Rebellion “ that leading brothers who expressed legitimate concerns (regarding matters that would surely stumble believers) were rebellious.",
      "release": "2024-10-27T09:08:35Z",
      "duration": "00:10:29",
      "explicit": false,
      "youTubeId": "2prbQ_Qq_dg",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2prbQ_Qq_dg"
      }
    },
    {
      "id": "5c626885-7b77-4a19-a9e2-9b49481d3d1f",
      "title": "Addressing “Glaring Omissions in ‘The Fermentation of the Present Rebellion’” (Part 6)",
      "description": "This video addresses the false accusations of brothers in “The Lord’s Recovery “ in the 1980s of rebellion, specifically bearing false witness of Bill Mallon convincing John Ingalls to dissent, and of John Ingalls (baselessly) saying the Fulltime Training in Taipei should be stopped. If someone says a program/training should be stopped, their reasons should be provided to the readers, because it would not make sense that this is simply out of “rebellion” coming from and aged and godly man.",
      "release": "2024-10-27T08:57:12Z",
      "duration": "00:14:35",
      "explicit": false,
      "youTubeId": "ZOjbhA4WJn8",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZOjbhA4WJn8"
      }
    },
    {
      "id": "cc63b9ef-6494-4a59-a7b0-8f8db5a6c397",
      "title": "Addressing “Glaring Omissions in ‘The Fermentation of the Present Rebellion’” (Part 7)",
      "description": "This video addresses false claims in “The Fermentation of the Present Rebellion “ that John Ingalls (baselessly) said.the manager of the Living Stream Ministry should be fired; that John Ingalls said the churches were being expected to be FOR the ministry; and that brothers changed after remarkably commending Witness Lee and his ministry.",
      "release": "2024-10-27T08:56:52Z",
      "duration": "00:12:03",
      "explicit": false,
      "youTubeId": "GpdQgrnNjIk",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GpdQgrnNjIk"
      }
    },
    {
      "id": "ce13f4a2-f14c-4570-bb94-2ccb5859e1ce",
      "title": "Addressing “Glaring Omissions in ‘The Fermentation of the Present Rebellion’” (Part 2)",
      "description": "This video addresses the false claim that “the fermentation of rebellion” began in Hong Kong and spread to Germany and then to the U.S. in “The Lord’s Recovery” in the 1980s.",
      "release": "2024-10-27T08:55:37Z",
      "duration": "00:13:02",
      "explicit": false,
      "youTubeId": "8z-8O-dTHrg",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8z-8O-dTHrg"
      }
    },
    {
      "id": "bad2fda5-dda7-465a-8884-adadbf98a7df",
      "title": "Addressing “Glaring Omissions in ‘The Fermentation of the Present Rebellion’” (Part 5)",
      "description": "This video addresses the false claim against responsible brothers of various churches, accused of conspiring in rebellion, that they were against the “new way” in “The Lord’s Recovery “ in the 1980s.",
      "release": "2024-10-27T08:55:12Z",
      "duration": "00:09:16",
      "explicit": false,
      "youTubeId": "I09L9iLRGDw",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I09L9iLRGDw"
      }
    },
    {
      "id": "51bc22f7-e058-4652-9a60-cde62e3baa3e",
      "title": "The Bible is being disobeyed in The Lord\u0026#39;s Recovery - A Serious Warning",
      "description": "During several days of not recording, I continued to blog (inconvenientruth.com), and felt this particular blog is critical, addressing a very serious matter of disobeying God\u0027s Word, and should be shared as broadly as possible.",
      "release": "2024-10-21T18:18:13Z",
      "duration": "00:19:19",
      "explicit": false,
      "youTubeId": "WQfdJ_GnMcU",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WQfdJ_GnMcU"
      }
    },
    {
      "id": "eb38a05a-ce07-4ed2-9710-5bd8998df417",
      "title": "My last video for now",
      "description": "I think I’ve discharged all that was pressing on my heart, that believers and even the public need to know when encountering “The Lord’s Recovery.” I was a very faithful member. I was an award -winning trainee (that’s another topic…). And I was the victim of multiple instances of abuse. \n\nI’ve been accused of waiting until the other “parties” died to speak out. I wasn’t ready to speak out and lose (nearly) everything until, due to my marital crisis and the lack of effective help from responsible ones, I lost my church community and nearly everything else anyway. \n\nSome of my abusers are still alive. I wrote them emails, pleading for fellowship and reconciliation. I’ve been lied about, lied to (and told when I point it out that I’m on the “wrong tree”), stonewalled, my personal female cycle discussed among elders and coworkers with my husband, falsely accused of various mental and emotional disorders… all because I tried to open up lines of communication, to get help, to fulfill my role as the counterpart of my husband in my home…. \n\nI failed in restoring my marriage, but I was forced to look at the bigger picture, and have found that my marriage is in microcosm of a much bigger system of error.\n\nMy email is ruthewise@gmail.com. \n\nIf I spoke publicly about you in any of my videos, please know you are in good company if you are a sinner who repents. You can join all of us who can pray Psalm. 51 together and mean it.\n\nIf you are living and living lies, I hope you’d be freed. \n\nIf you think that some are exempt from being accountable because of some position of authority, that’s a big part of the problem. We are all accountable for our sins and for what we witness. \n\nSilence is complicity.\n\nLove rejoices with the truth.",
      "release": "2024-10-17T04:18:08Z",
      "duration": "00:09:33",
      "explicit": false,
      "youTubeId": "eDpBeM4xuXY",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eDpBeM4xuXY"
      }
    },
    {
      "id": "cb7bec9f-3ca9-455e-8b50-2719ed0a9b05",
      "title": "A Pattern of Using “Godliness as a means to be wealthy” in “The Lord’s Recovery” (Part 2)",
      "description": "This video focuses on the continuation of corrupt financial practices that began in China with Watchman Nee. Churches in Taiwan and other countries in the Far East suffered similarly, and then the corruption continued in the United States. \n\nIt is a worthy endeavor to support Christian laborers, but there should be righteous handling of finances with transparency and accountability. Financial management and decisions should not be corrupt or illegal nor covered up by teachings related to covering brothers and submitting to deputy authority. \n\nSome in “the Lord’s Recovery” are excessively wealthy, while others are in dire poverty. Leading brothers typically enjoy significant salaries and comfortable lifestyles, with protection from any accountability under the teaching of “God’s government.” Sadly, the most wealthy in the church seem also to enjoy special treatment, in my observation. And the needy ones, who still hand everything over to the God they live and serve, are blessed if tree from the love of money, but are too often abused while being expected to submit to “authority.” \n\nAnd if Christians speak out, related to matters that provoke their conscience, or if it gets too painful and unsustainable for victims of spiritual, marital, and/or financial abuse, believers in this group may appeal to the legal process, and be driven into deep debt or bankruptcy, seeking justice. \n\n#witnesslee #lordsrecovery #thelocalchurch #localchurch #livingstreamministry #thelordsrecovery #religiousabuse #cultrecovery #loveofmoney",
      "release": "2024-10-16T18:01:50Z",
      "duration": "00:15:52",
      "explicit": false,
      "youTubeId": "c4BEZMfbdhY",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c4BEZMfbdhY"
      }
    },
    {
      "id": "cca49eaf-7bdb-4eb9-ad0a-dd685a0227cd",
      "title": "A Pattern of Using “Godliness as a means to be wealthy” in “The Lord’s Recovery” (Part 1)",
      "description": "In the “local church” there is a massive disparity of wealth, and those in leadership positions not only enjoy unaccountability due to the teachings about deputy authority, but they also enjoy financial stability due to the business operations that are far from transparent. \n\nThis is a pattern, beginning with Watchman Nee in China. In this video I try to share a small window into corrupt financial enterprises using believers’ money. Lack of transparency and accountability were - and still are - accepted only due to accepting of a teaching that we should never question God’s “deputy authority.” \n\nMany saints have been severely cheated and stumbled by the mishandling of unrighteous mammon. And this is still going on.",
      "release": "2024-10-16T17:43:19Z",
      "duration": "00:15:22",
      "explicit": false,
      "youTubeId": "MhNbePKXqW4",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MhNbePKXqW4"
      }
    },
    {
      "id": "15fa9645-4572-4256-8632-8c7d2cc23039",
      "title": "An example of elders in “the church” making false accusations and refusing to listen… to a young one",
      "description": "“Honestly I’d rather be punched in the face than just completely ignored,” my daughter texted me on July 5, 2021. She was being falsely accused by responsible ones in the church in Shoreline, and they refused to meet with her or respond to her… and refused to respond to me, as well, regarding a very serious matter.\n\nSuch scenarios are too common in “The Lord’s Recovery.” People are accused and are unwelcome to set any facts straight. They are sometimes excommunicated based on false accusations.\n\nThe content in this video is personal but not unique or exceptional. A pattern of ignoring and stonewalling church members who are suffering exacerbates their pain multiple times over. It’s cruel and not what any good shepherd would do to a lamb in need. \n\nOur young people especially are very vulnerable, as loneliness and isolation are extra dangerous for them.\n\nI sing a song in this video. I am not condoning the words…. I am admitting that I sang this many times to my children, and wishing that “the church” I had known most of my life was/could be  a safe place to those who, as little children, were consecrated to it.",
      "release": "2024-10-14T06:04:04Z",
      "duration": "00:13:23",
      "explicit": false,
      "youTubeId": "qIrKbtKYiZY",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qIrKbtKYiZY"
      }
    },
    {
      "id": "9f12ab7b-69c9-482e-96b9-7547f55c7af7",
      "title": "Are Questions Asked by Senior Coworkers in the Lord’s Recovery Merely Rhetorical?",
      "description": "In this video I share answers to very serious questions…. Answers that have existed for a long time now but seem to be ignored. One question relates to my marriage. Ignoring a wife’s answer is serious and painful on a more personal and family level but affects many. The other question relates to the global Lord’s Recovery movement, and affects countless Christians. Do the answers matter to those who ask the questions? If they matter, there should be appropriate responses. \n\n#witnesslee #lordsrecovery #localchurch #thelocalchurch #livingstreamministry #cultrecovery #bearingfalsewitness #religiousabuse #cultawareness #thelordsrecovery",
      "release": "2024-10-13T22:19:03Z",
      "duration": "00:14:00",
      "explicit": false,
      "youTubeId": "d5c5KndVR7c",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d5c5KndVR7c"
      }
    },
    {
      "id": "75c77ebc-50ff-4df8-865a-c192ea3a011f",
      "title": "My Personal Marriage Crisis Mirroring the Condition of “The Lord’s Recovery”",
      "description": "I have been in an intense marriage crisis for about 6 years. It has made me desperate. Every member of our nuclear family through these years has been trying to survive. I have come to realize that there are sadly many parallels between my marital crisis and the condition in the church community in which I was raised. We can’t be one when there is dishonesty and covered up sin. We can’t be one when the main response to pleas for help is the silent treatment. \n\nGod hates divorce, and Jesus prayed that we all may be one… In the light of the truth we have the unifying fellowship, and we confess all our sins and the blood cleanses us… I am pleading that the dishonesty would stop, repentance would be genuine, fellowship would be thorough, and the Lord’s prayer for oneness would be realized.",
      "release": "2024-10-13T06:56:23Z",
      "duration": "00:13:56",
      "explicit": false,
      "youTubeId": "PVv0u6aKV-Q",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PVv0u6aKV-Q"
      }
    },
    {
      "id": "320c2b91-34ab-41bd-a5c5-c15046a95a7a",
      "title": "Reflecting on Experiences in the Church in Seattle and on a couple documents",
      "description": "Leaving Seattle soon after a week-long visit here, while reflecting on various experiences I had while living here as a child, teenager, and for about 14 months more recently as an adult, and pondering many experiences, observations and written records of dear ones since that time, my heart is bursting with so much truth to speak in love, to anyone to whom such truth could be freeing.\n\nReading an article from CRI written in 1994 called “Turmoil in the Local Church” makes it clear that even “outsiders” were clear that the “root of the church’s grievance” was related to the failure to deal with Philip Lee’s sinful behavior. Their objective letter is corroborated by all the brothers labeled as “rebellious” in the book The Fermentation of the Present Rebellion. \n\nThat CRI article can be viewed at lcinfo.org/?page=writings/media/turmoil.\n\nYet in 1993 and again in 1996, elders in the church in Anaheim wrote letters of apology to Phillip Lee. These 9 brothers signed a letter stating that they “do not believe that the public declaration of those three brothers concerning Philip Lee was justified or proper.”\n\nI don’t know of any apology or repentance from Philip. But elders asked him for forgiveness. Did the elders feel to protect sheep being molested by Philip Lee? No one reached out to me for 30 years, though my name was mentioned by a witness as a victim. What is not proper about publicly reproving an elder after receiving reports from multiple witnesses? (1 Tim. 5:20 says,  “￼As for those who persist in sin, rebuke them￼ in the presence of all, so the rest may stand in fear.”) How is rebuking a serial sexual predator in a church not justifiable or proper? How is it “rebellious” to follow God’s Word?\n\nThe full apology letter can be found at blendedbody.com/Hongkong/CIA-Letter2PhilipLee.jpg.\n\n#lordsrecovery \n#witnesslee \n#localchurch \n#spiritualabuse\n#bearingfalsewitness",
      "release": "2024-10-12T07:51:44Z",
      "duration": "00:12:57",
      "explicit": false,
      "youTubeId": "6QQVheR3mrg",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6QQVheR3mrg"
      }
    },
    {
      "id": "ff188deb-5d1f-447d-8cae-4b800dd84c3d",
      "title": "MAJOR concerns expressed by brothers before being labeled as “rebellious” in “The Lord’s Recovery”",
      "description": "I was told in the 80’s that various responsible brothers in “The Lord’s Recovery” were rebellious. As I have looked into this allegation, it has actually become apparent that this is a blatant bearing of false witness against our brothers in a most damaging way. \n\nThis video is short, addressing just one letter from brothers in Europe who could no longer tolerate the sins being covered up by “the ministry” that became increasingly influential and irresponsible and abusive among churches during that time. \n\nSee the letter I read at blendedbody.com/HongKong/europeanchurchesdepart1989.pdf.\n\n#witnesslee \n#lordsrecovery \n#localchurch \n#cultawareness \n#cultrecovery \n#spiritualabuse\n#hidinghistory",
      "release": "2024-10-09T21:26:55Z",
      "duration": "00:06:20",
      "explicit": false,
      "youTubeId": "r9ReY2FVuSw",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=r9ReY2FVuSw"
      }
    },
    {
      "id": "15104408-4c83-4fad-acf3-3fca4c395cc8",
      "title": "Slander? Libel? Then Sue Me…? If Not… Repent…!?",
      "description": "I have spoken out about very serious matters in “the Lord’s Recovery,” the Living Stream Ministry, and “the” local churches.  My speaking is based on firsthand experiences and observations, as well as decades of corroborating records of faithful saints’ testimonies and attempts to address these offenses scripturally.\n\nEnough families have been destroyed due to dishonesty and abuse of power. Enough precious lives have been lost to hopelessness and suicide related to culty practices among sincere but misled believers.\n\nIf I am lying, that is defamation, libel, slander… all worthy of legal action. LSM has taken such legal action before against “opposers” and I welcome you to do the same with me, if I am not speaking the truth. \n\nIf I am speaking the truth, why wouldn’t we all repent of any sins, of covering up sins, of insisting on oneness with an organization for saints and local churches to be deemed “genuine”…. and for stumbling many believers? Why not repent thoroughly, and be revived?\n\n“Repent, then, and turn to God, so that your sins may be wiped out, that times of refreshing may come from the Lord” (Acts 3:19, NIV).\n\n❤️Ruth\n\n#livingstreamministry \n#witnesslee #localchurch",
      "release": "2024-10-06T17:23:36Z",
      "duration": "00:08:43",
      "explicit": false,
      "youTubeId": "gB0_6Dtdm60",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gB0_6Dtdm60"
      }
    },
    {
      "id": "a7f43780-b32b-4e5b-b3ac-2e78caec845a",
      "title": "Cruelty of Abusing (Deputy) Authority",
      "description": "Arriving at SeaTac and catching the Light Rail, my heart was saddened to watch a young man in the ground and being constrained by several deputy authorities. I trusted they had reasonable cause to treat my fellow human being that way.\n\nI know many brothers and sisters were, have been, and still are being spiritually treated that way, and worse, by fellow brothers and sisters who represent and enforce “God’s deputy authority.” They are treated that way for expressing their honest concerns about unconscionable treatment of their brothers and sisters. \n\nIf that young man were my brother, and if he were experiencing that treatment for speaking his concerns, I’d broadcast the video far and wide and appeal to people’s consciences to do all we can to not allow such maltreatment of our fellow slaves to continue.\n\nThat’s what I’m doing in my videos, as best as I can…\n\n(I apologize if the audio is bad; I’m on the light rail.)",
      "release": "2024-10-05T22:47:01Z",
      "duration": "00:02:15",
      "explicit": false,
      "youTubeId": "mLVyRuFcxNQ",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mLVyRuFcxNQ"
      }
    },
    {
      "id": "72fe18c3-7fe8-4404-9a15-ffd469c7317a",
      "title": "“Who Are My Brothers and Sisters and Mother?”",
      "description": "On my way to Seattle, thinking of my family of origin, and of Jesus’ care for His mother, as well as His words regarding who His mother and sisters and brothers are - those who do the will of His Father. Freshly searching the Word for the will of His Father would be good for all of us, I believe. I don’t believe that intimidation and threatening and controlling and abusing and ignoring and silencing our fellow believers is the will of our Father. \n\nWill record in Seattle as I am able.\n\nMuch love to all my brothers and sisters and mothers in Christ.",
      "release": "2024-10-05T19:00:04Z",
      "duration": "00:02:11",
      "explicit": false,
      "youTubeId": "z2Z5cMaT9Zo",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=z2Z5cMaT9Zo"
      }
    },
    {
      "id": "9f031d33-be1e-4d23-98c8-39cd525ab691",
      "title": "Shepherds, Don’t Lie… (Part 2, regarding John Ingalls)",
      "description": "Comparing Shepherdingwords.com with testimonies of many eyewitnesses and victims, and with my own experiences and observations, I am so heartbroken that “the coworkers in the Lord’s recovery in North America” would speak so dishonestly, largely by omission but also making many false accusations about saints, including John Ingalls. I do my best here to give a glimpse into false claims regarding our late brother, John Ingalls of whose portion we were robbed because his many attempts to clear up serious matters and keep a good conscience were ignored, misconstrued and mocked.\n\nPlease refer to shepherdingwords.com/were-max-rapoport-and-john-ingalls-forced-out/ and bibleread.online/all-books-by-Watchman-Nee-and-Witness-Lee/book-Speaking-the-Truth-in-Love-John-Ingalls-read-online/\nfor full context of excerpts I quote.",
      "release": "2024-10-05T01:56:33Z",
      "duration": "00:18:31",
      "explicit": false,
      "youTubeId": "uAPFtUArGDk",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uAPFtUArGDk"
      }
    },
    {
      "id": "fd44873b-e614-48c8-8a40-e4c4304de3cd",
      "title": "Shepherds, Don’t Lie to the Sheep! A response to shepherdingwords.com (1)",
      "description": "Preparing for a video I hope to record this evening, I came across words I had to respond to during my lunch break. To be continued.",
      "release": "2024-10-04T20:58:36Z",
      "duration": "00:12:15",
      "explicit": false,
      "youTubeId": "3tVh0aiZJ9Q",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3tVh0aiZJ9Q"
      }
    },
    {
      "id": "71e2a691-b59e-46e8-8d8c-9ba687a7b444",
      "title": "What’s my Point? What’s the Goal?",
      "description": "I recently read on a forum that my videos kind of all say the same thing, or something like that. Forgive me for any wordiness or repetition. \n\nWhat am I hoping for in posting these videos… so feeble and too repetitive and unimpressively simple? \n\nWhat have dozens of sincere, devout believers hoped for, who have raised awareness - or tried to- of patterns of sinning in “The Lord’s Recovery” and of the covering up of those sins?\n\nI have heard a highly respected (that in itself being problematic...)\u0022senior co-worker\u0022 mocking an older brother who  confronted Brother Lee about some of the gross sins being covered up.  The \u0022senior coworker\u0022  mimicked how that elderly brother said he had to \u0022deeeaal with his conscience\u0022 (lowering his voice very deeply like that faithful brother\u0027s voice) - making a joke about such a phrase and scorning the brother. Dealing with our conscience is not something to mock. It is essential to keep the oneness and for us to properly love one another - the new commandment, by  which all men know that we are Jesus\u0027 disciples.\n\nI hope these videos and my blog (inconvenientruth.com) would join with the voices of many other dear and faithful believers who have not been able to remain silent about intolerable and unreal with sins. Many voices were silenced. Many who’ve spoken out have been publicly shamed and lied about. Such ones face spiritual abuse. Many have lost precious friends and family members due to misrepresentation. \n\nBut silence is not an option once one’s conscience is provoked, when the Lord in us is turning over tables in what should be house of prayer, but has become a den of thieves (Matt. 21:13; Mark 11:17; Luke 19:46). \n\nThe goal of every single video and every single blog I post is “love, which comes from a pure heart and a good conscience and a sincere faith” (1 Tim. 1:5). \n\nTo have healthy love for one another, we need a pure heart and a good conscience and sincere faith. I learned as a little child how to take care of my conscience and it’s something that no believer should ever graduate from. \n\nI pray that any involved would humble ourselves and pray and seek God’s face and turn from our wicked ways, that God would hear and forgive and heal our land (2 Chron. 7:14).\n\n#localchurch \n#witnesslee \n#lordsrecovery \n#spiritualabuse\n#denofrobbers",
      "release": "2024-10-03T06:30:59Z",
      "duration": "00:09:42",
      "explicit": false,
      "youTubeId": "wTnPo2TSIM0",
      "subjects": [
        "The Lord\u0027s Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wTnPo2TSIM0"
      }
    },
    {
      "id": "19e9ae1e-fe9f-49ad-8605-ec434ba06b74",
      "title": "Sexual Immorality Reportedly Committed and Covered Up Throughout History of Lord’s Recovery",
      "description": "This is another painful and heavy video to record and post, but unless we deal with the pattern of sinning and covering up sins in “The Lord’s Recovery,” we are not honoring God’s Word. \n\nGod is not a respecter of persons, nor should we be.\n\nIn this video I review a book in a very brief way. The book is My Unforgettable Memories- Watchman Nee\u0026 Shanghai Local Church. The author was a young sister in the church with Watchman Nee. She did extensive research to verify her accounts, which include many eyewitness accounts and letters. There are many witnesses of gross sins committed by Watchman Nee throughout decades in China. The only reason anyone would refuse to believe this to be at least possible, refuse to hear multiple witnesses and refuse to address a long history of damaging practices, including a person being called a ”delegate [or deputy] authority” being unquestionable and unaccountable, is that we have made some leaders idols - not humans like the rest of us including King David who are not above sinning - and not above being rebuked and openly repenting. \n\nDon’t excommunicate me for speaking my concerns. I am deeply concerned partly because I am a direct victim of sexual immorality practiced and covered up in the Lords recovery, that has yet to be addressed by anyone in leadership, although several knew about it over 35 years ago. And I am aware of many more cases. And we should repent for idolizing anyone… even a “Minister of the Age.”",
      "release": "2024-10-01T04:53:16Z",
      "duration": "00:13:49",
      "explicit": false,
      "youTubeId": "alcSvJwenio",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=alcSvJwenio"
      }
    },
    {
      "id": "b02133fe-d0cf-4891-b821-fc8400153528",
      "title": "Golden Anniversary Video... for Mom... in Memory of Dad",
      "description": "Created December, 2017, 50 years after my parents were married, and 6 months after my dad went to be with the Lord.\n\nCapturing my dad\u0027s full life and my parents\u0027 precious marriage is a task that could never be adequately completed, so here is my feeble attempt. Forgive the faster-than-preferred pacing of pictures... I tried to fit too much in, probably. Feel free to rewatch, pause, share, enjoy, and above all, love. \u0022And over all these things put on love, which is the uniting bond of perfectness.\u0022 Colossians 3:14 \nWith love, on behalf of my Dad and Mom, Ruth",
      "release": "2024-09-30T05:14:33Z",
      "duration": "00:10:36",
      "explicit": false,
      "youTubeId": "01N7CQqA1mc",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=01N7CQqA1mc"
      }
    },
    {
      "id": "2f8bb9e5-ff2c-4b47-b7a9-3bbdb4057001",
      "title": "Please Don’t Shun, Lie About, and Exile Fellow Prophets",
      "description": "This video is a continuation from the video. I posted this morning about humans not being tape recorders. It is actually really, really serious to charge someone to be ones tape recorder, and to agree to be another person‘s tape recorder. We all should be profits for God, and direct contact with God, speaking God‘s word, from our fellowship with God, to God’s people. And we should not force away from any church community people who are speaking God‘s word. Being a tape recorder of a particular person should not be required in order to be in fellowship with one another.\n\n#witnesslee \n#livingstreamministry \n#localchurch\n#thelocalchurch\n#thelordsrecovery",
      "release": "2024-09-30T02:21:42Z",
      "duration": "00:10:59",
      "explicit": false,
      "youTubeId": "fxKVwg733Mk",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fxKVwg733Mk"
      }
    },
    {
      "id": "47ce0c19-36cc-486d-b82d-f0889d3a44fb",
      "title": "Humans Are Not Made as Tape Recorders",
      "description": "Many times in my 20’s, I heard Witness Lee say that we (especially elders and other leading ones) should just be his tape recorders, that they shouldn’t speak anything new - just what Witness Lee has said. In my youth this didn’t sound right. It sounded controlling, diminishing and limiting of all the members of the church, each with their precious portions and experiences and light from God’s Word. \n\nOne may reason such things away, justifying them by various verses like Paul saying to the Philippians that we should all speak the same thing. But he didn’t charge them to say only what he said. I’ve heard the exposition that Paul means we should all speak Christ - the multifaceted, unsearchable, measureless riches of Christ and goodness of God… and we need eternity for that. NOT as tape recorders but as those with a personal knowing and seeing of Christ and all the riches in God’s Word.\n\nTo have an attitude that we can only speak with another person, a leader, has spoken can very easily become culty - controlling, and totalitarian, etc.\n\nI am off to meet with believers, but thought I would post this for fellowship among anyone who wants to participate. Thank you.",
      "release": "2024-09-29T17:44:44Z",
      "duration": "00:04:53",
      "explicit": false,
      "youTubeId": "gVX6Nr-3LUQ",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gVX6Nr-3LUQ"
      }
    },
    {
      "id": "cc82090e-7d52-4424-a861-f58529da22a4",
      "title": "Noah - or the Emperor with “New Clothes”?",
      "release": "2024-09-28T23:37:13Z",
      "duration": "00:05:06",
      "explicit": false,
      "youTubeId": "5ZMNd1fZcj8",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5ZMNd1fZcj8"
      }
    },
    {
      "id": "ee92d01e-f4d9-46d2-ad7b-aa9b26039ca1",
      "title": "More examples of covering up rather than dealing with sins scripturally in “The Lord’s Recovery”",
      "description": "Without partiality and favoritism I feel to keep speaking out about multiple cases in which responsible ones in the Local Church and in “The Lord’s Recovery” did not deal properly with sins. These are not victimless sins. They damage the hearts and families of targets and victims. The damage can extend even for generations. The damage doesn’t disappear or heal with silence, but through applying God’s Word faithfully, which involves rebuking and reproving, in the case of leading ones, publicly, and they’re being repentance and forgiveness.\n\nThe practice in the Lords recovery has been to publicly rebuke people who speak out, and to quarantine them and label them as poisonous and negative. I am not poisonous or negative. I can’t tolerate these patterns in what is being called “The Lord’s Recovery.” Lives are being destroyed. \n\nBrothers, what is the motive of stank silent about these improprieties and sins? Is it because of partiality towards certain families? Is it because of financial gain that may be affected if people hold you accountable? \n\nWe live before the Lord. It is better to deal with offenses and sins in this age, while we are still on our way home to meet the Lord.\n\nI’d like to add, related the sexual abuse my daughter experienced from a son of Ben Phillips, Jr.:\n\n1) Brother Ben, when you made that appeal at your dad’s memorial for those who have “left” to “come back” - brother, if we left a particular gathering of believers because we weren’t safe, we weren’t protected by leaders, and we were ignored and/or shamed if we spoke out, how/why would we return to that environment? And I refuse to call such an environment “the” church…. Yes, the church in Corinth had problems, but hopefully they were dealt with properly and thoroughly by leaders. Eventually their testimony faded. Eventually the lampstand was removed from the church in Ephesus. You can have the right name but not be the reality of a church as a lampstand. \n\n2) I am not speaking about this matter to shame any minors in the church. They need care and shepherding and protection and guidance from the older ones. Both my daughter and this other young person, were suffering, deep depression and family-related pain. They found a lot of solace in being together and talking honestly together. But personal boundaries should always be honored. When my daughter asked for help, help could’ve been given, but her appeals were ignored.\n\n3) To Christy’s grandparents, Willie and Rosalind Wise, she opened to you about her being molested. You told her to not say anything about it, but to cover the family. You should have protected your granddaughter (or any other victim opening to you) - not the image of a high profile family. We should protect every victim of sexual violence, assault, and harassment, without partiality or favoritism.\n\nTo all, this is a PATTERN in “The Lord’s Recovery” and it is not sustainable. There needs to be proper rebuking and repenting and forgiveness and restoration in cases such as those I mention in this video. \n\n#thelocalchurch \n#lordsrecovery",
      "release": "2024-09-28T18:25:36Z",
      "duration": "00:08:11",
      "explicit": false,
      "youTubeId": "_amHbQxGddQ",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_amHbQxGddQ"
      }
    },
    {
      "id": "78241b75-6f50-48e5-8f9d-3f32c31a6ec7",
      "title": "A Serious Example of Covering Up Sins in \u0026quot;The Lord\u0026#39;s Recovery\u0026quot;, Stumbling Many",
      "description": "In this video, I speak out about a member of my spiritual family, who has not been shepherded properly to repent and to be restored to the fellowship, but rather his sins that have stumbled many, and his disappearance that grieves even more of us, are all covered up and \u0022not spoken about\u0022 (except in small circles). This is contrary to GOD\u0027S Word, which says, \u0022Do not entertain an accusation against an elder unless it is brought by two or three witnesses. But those elders who are sinning you are to reprove before everyone, so that the others may take warning.  I charge you, in the sight of God and Christ Jesus and the elect angels, to keep these instructions without partiality, and to do nothing out of favoritism\u0022 (I Tim. 5:19-21).\n\nI am just a \u0022little\u0022 (53-year-old) sister but I can\u0027t bear the lack of practicing what is in God\u0027s Word, in the name of \u0022covering brothers,\u0022 in \u0022The Lord\u0027s Recovery.\u0022 What about protecting endangered wives? What about comforting heart-broken children and grandchildren? What about loving one another enough to reprove publicly, for there to be public warning and public repentance and full forgiveness and restoration?\n\nThere should be no favoritism, no partiality. If you rebuke brothers publicly who are maintaining a clean conscience, speaking truthfully, but whose speaking may tarnish the reputation of an individual or an organization, but you are covering up gross sins of leading brothers, trying to hide the truth, that is partiality.\n\nAs long as I am alive, I won\u0027t stand by, but I will speak up and speak out the truth... the whole truth, and nothing but the truth, so help me God. We are ALL affected by lies in our communities and especially in the church (composed of ALL believers), including lies of ommission, and by the loss of the function of fellow members who fall into sin or are excommunicated for speaking up about sins that need to be dealt with scripturally.\n\nTo the brother I address, and to his family, I hope you receive my words in this public way only from my heart of love and my deep desire for restoration and for preservation of the Lord\u0027s testimony and genuine oneness, apart from sin, among ALL His believers, wherever and with whomever we may be practically meeting.\n\nLove finds no joy in unrighteousness but rejoices in the truth (1 Cor. 13:6).\n\n#lordsrecovery \n#thelocalchurch \n#witnesslee \n#cultrecovery",
      "release": "2024-09-28T01:00:30Z",
      "duration": "00:12:18",
      "explicit": false,
      "youTubeId": "MwM_3GHTKgg",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MwM_3GHTKgg"
      }
    },
    {
      "id": "fb23f5f0-8b9c-4207-996a-68bcbe46ecfc",
      "title": "Serious matters: Contradictions and conflict of interest",
      "description": "Believers shouldn\u0027t lie. We shouldn\u0027t say one thing and actually be doing the opposite.\n\nNo believer should be above any other believer. Our oneness should not depend on any special affiliation to one particular ministry and the exclusion of others\u0027 ministries.\n\nAnd we should not use godliness as a means for financial gain (1 Tim. 6:5).\n\nIf a church (\u0022THE church\u0022) is required to have/speak/read only \u0022one ministry,\u0022 based on one or two brothers\u0027 speaking, and a non-profit publishing company is very enmeshed with THE church, financially and practically, and that publishing company sells only those two brothers\u0027 writings, there is a huge incentive to silence anything that would cause serious, legitimate and scriptural concerns among followers regarding the publishing company, the churches, and especially leading ones including the \u0022commander\u0022 (Elders Training Book 7, 1986, bibleread.online/all-books-by-Watchman-Nee-and-Witness-Lee/book-elders-training-book-07-one-accord-for-the-lords-move-Witness-Lee-read-online/6/).\n\n[From that same Elders Training book just cited, here are 2 pertinent paragraphs I didn\u0027t read in the  video:\n\n\u0022Some saints came to me a number of times with reports concerning serious and even negative situations. They may have misunderstood my not responding to them with any kind of seriousness. I believe I did not respond in this way not only out of my patience and toleration but also because of the Lord’s wisdom. I feel that it is altogether wise to be patient. When the fruit of a particular tree is growing, the fruit itself will show what it is. When the fruit becomes ripe, it will fall from the tree. At this point, however, I do not feel that I should tolerate certain situations any longer, because enough damage has been done already. I do not like to see more damage done to the Lord’s recovery. I have no time, dear saints, to fool around with people any longer. Let us go to fight the battle. Who are the “us”? They are the ones who are desperate with no opinion.\n\nand...\n\u0022It is altogether not wise for you to remain in the recovery taking this ministry on the one hand and yet on the other hand to say something else. This is not wise. It is not profitable to yourself or to your future. You may say that you have a ministry, but this is not profitable to your ministry if you have one. You can never profit your ministry in the future in this way. Rather, you have dispensed your future in a cheap way. The wise way is to stay, without any opinion, with the recovery, which is unique.\u0022]\n\nIf there is abuse in THE church and/or in the Ministry office of the publication company, to remain \u0022faithful\u0022 in the church and \u0022faithful to the ministry\u0022  - or \u0022one with the ministry\u0022  - seems to require that you look the other way rather than confront and deal with stumbling sin. Such \u0022oneness\u0022 of \u0022the Body\u0022 is actually a loyalism to a corrupt system/organization with a financial conflict of interest. \n\nI don\u0027t do justice in this video (nor in any video)... but hopefully this is a start.\n\nAdd to this the fact that much money is brought in by the activities of the Living Stream Ministry that supports many \u0022faithful to the ministry.\u0022 What if such ones were to say, \u0022Sin is not acceptable. Sexual harrassment is illegal and should be dealt with seriously.\u0022 Would they lose their financial support? Would they be shunned?\n\nOh, wait, this happened. And such ones were labeled \u0022rebellious\u0022 and \u0022poisonous\u0022 and lied about and excommunicated (\u0022quarantined\u0022).\n\nWe were cheated from their ministry - which I believe each and every member of Christ\u0027s body has.\n\nOur oneness must not depend on oneness with anyone other than the Triune God. If it is, we are very likely in a cult.\n\n#witnesslee \n#lordsrecovery \n#thelocalchurch \n#cultrecovery",
      "release": "2024-09-27T02:47:58Z",
      "duration": "00:15:43",
      "explicit": false,
      "youTubeId": "c4fSkv5y_3s",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c4fSkv5y_3s"
      }
    },
    {
      "id": "6d4003dc-13b0-48e9-b0e5-76f49710a171",
      "title": "A public appeal for fellowship regarding publicly defamed brothers in “The Lord’s Recovery”",
      "description": "I’m just a little sister in God‘s family, but I can’t bear to see my brothers or sisters being excommunicated or quarantined, for reasons that have not been made clear. If such ones are seeking to cause division, living in gross sins, lying, or heretical, please let me know in the comments or by arranging a time for us to fellowship, with a witness present. And even if this were the case, aren\u0027t we supposed to seek one another\u0027s healing and restoration?\n\nIf dear believers (whistleblowers) are being ex-communicated or quarantined, can we know specifically why? If there is no reason other than tarnishing the image of a person or organization by speaking about genuine, legitimate concerns, can they please be restored to fellowship in the church community? \n\nI don’t believe to point out situations where sins (affecting and stumbling others) have been systematically covered up is a reason to quarantine or excommunicate any of us. I believe all who have spoken out and those still speaking out have risked very much because to not do so is complicity with such sins, and stumbling of others will continue until there is righteousness at the leadership level in any church community.",
      "release": "2024-09-23T01:53:46Z",
      "duration": "00:06:13",
      "explicit": false,
      "youTubeId": "j9y3KLSN74s",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j9y3KLSN74s"
      }
    },
    {
      "id": "528438ed-f285-45ec-856b-54fa40162401",
      "title": "Characteristics of Cults for Your Consideration",
      "description": "Dear viewers of this or any of my videos - Whether or not you are actually in a cult, sharing characteristics with cults should be concerning and should cause anyone to consider their ways. Very trained therapists I have had have said that minimally, I have been treated in cult-like ways over the years... and I know this to be true. I watched \u0022Scientology and Its Aftermath\u0022 with tears streaming down my face during some episodes, being able to identify with victims speaking out, or of whom others were speaking. As believers and as doers of God\u0027s Word, cult-like behaviors should not be characteristic of our practices.\n\nIn this video, I mainly read from a webpage of an international authority on cults, Janja Lalich (janjalalich.com/help/characteristics-associated-with-cults/).\n\nI also make a few feeble comments with a few examples of experiences, practices and observations that align to these characteristics, practiced in \u0022The Lord\u0027s Recovery\u0022/\u0022The Local Churches\u0022. If I said more, and I have a lot more to say, the video would get too long.\n\nFor many, including myself for many years, it is hard to hear these words until/unless you reach a point in your life where destructive treatment directed at you or at someone you love is no longer bearable... then in order to heal, you begin to face the facts and to think soberly and, yes, critically, about your community, your choices (or lack thereof), the consequences of your choices, and how all of that compares to the characteristics of cults.",
      "release": "2024-09-19T02:46:53Z",
      "duration": "00:14:26",
      "explicit": false,
      "youTubeId": "y1187Qhwm2Q",
      "subjects": [
        "The Lord\u0027s Recovery",
        "Scientology",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=y1187Qhwm2Q"
      }
    },
    {
      "id": "9c4394d3-1d40-43af-956c-624fa5f60163",
      "title": "A Response to \u0022Shepherding Words: Encountering Opposition\u0022",
      "description": "Dear fellow believers, if I and others are speaking the truth, because as lovers of God and of His church, we can no longer be silent , are we \u0022opposers\u0022? Believers doing all we can to fight for God\u0027s pure testimony are being smeared and silenced and stonewalled, accused of spreading unfounded rumors and false accusations. Maybe writers of this article are not considering me and other lovers of Jesus as such opposers - then wonderful! Please, let\u0027s meet and fellowship. I believe many like myself have been and are certainly \u0022misunderstood\u0022. The article I am addressing begins with the words, \u0022No one likes to be misunderstood...\u0022 referring to those \u0022in the Lord\u0027s Recovery\u0022. To the writers of this article, I address this video. Have you sought to accurately understand ones you have labeled as opposers? If not, perhaps THEY are being misunderstood? Perhaps they  are 100% open to understanding if in any way they have misunderstood anything or anyone. We believers can expect misunderstanding, but we should do our best to be at peace with ALL men, and should not tolerate immorality and gross sins, covered up with dishonesty and hypocrisy, in the context what is being called \u0022the church.\u0022 We should judge the sin, confess and repent of it, and love one another warmly, allowing no division.",
      "release": "2024-09-14T01:32:48Z",
      "duration": "00:11:20",
      "explicit": false,
      "youTubeId": "M9n6gId63-g",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=M9n6gId63-g"
      }
    },
    {
      "id": "0424c4f8-f4ff-4efc-bba8-dace5efb62b1",
      "title": "Mentioning names in \u0022The Lord\u0027s Recovery\u0022 to expose long-term covering up of gross sins",
      "description": "Some names must be mentioned to properly deal with the abuse that has been going on for decades in \u0022The Lord\u0027s Recovery.\u0022 I do my best to explain, in my experience and testimony, why I am mentioning names, knowing how \u0022dangerous\u0022 and audacious this is in this group - how smeared and shamed past witnesses have been who have done so.\n#thelordsrecovery \n#thelocalchurch \n#witnesslee \n#philliplee",
      "release": "2024-09-13T15:28:14Z",
      "duration": "00:06:14",
      "explicit": false,
      "youTubeId": "oC42CIuwPOg",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oC42CIuwPOg"
      }
    },
    {
      "id": "cbe41b9d-ea33-4fec-87fa-229f56c18787",
      "title": "Pervasive Abuse in \u0022The Lord\u0027s Recovery\u0022, Stumbling Many",
      "description": "Many who have spoken up about untenable abuse in \u0022The Lord\u0027s Recovery\u0022 have been shamed, silenced, and smeared, while gross sins are covered up, largely due to perpetrators\u0027 positions and/or their natural relationship to leading, responsible ones in \u0022The Lord\u0027s Recovery.\u0022 This is terribly stumbling, and even stumbling one little one is very serious. I am not sharing these things to spread any rumors, nor am I bearing false witness. If anyone accuses me of lying, they themselves are bearing false witness and shaming a victim of sexual assault at the hands of a son of Witness Lee.\n\n#lordsrecovery \n#witnesslee \n#religiousabuse \n#localchurch",
      "release": "2024-09-13T05:44:31Z",
      "duration": "00:14:15",
      "explicit": false,
      "youTubeId": "yRDInWP81Ek",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yRDInWP81Ek"
      }
    },
    {
      "id": "78dffa45-f144-4efb-af09-2353d6c37bc6",
      "title": "A Personal, Accurate, Response to recent \u0022Shepherding Words\u0022 in shepherdingwords.com.",
      "description": "I read recent \u0022shepherding words\u0022 stating that social media is being used to bear false witness and to spread unfounded rumors about \u0022The Lord\u0027s Recovery,\u0022 \u0022the Local Churches,\u0022 Witness Lee, etc. I felt to post this in response, to be very clear that anything I am reporting is both TRUE and founded on firsthand experience and/or primary sources. My motive is not simply to expose evil - which is scriptural. It is to address untenable and severely stumbling patterns of abuse that has no place in any Godly community.\n\n#thelordsrecovery \n#thelocalchurch\n#witnesslee \n#religiousabuse \n#inconvenientruth",
      "release": "2024-09-11T02:28:58Z",
      "duration": "00:10:59",
      "explicit": false,
      "youTubeId": "Jl6wdt3LLdQ",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Jl6wdt3LLdQ"
      }
    },
    {
      "id": "26a4663b-b37c-41b4-91fc-b58e2193b1bb",
      "title": "Admitting to yourself and to others the truth, the whole truth, and nothing but the truth",
      "description": "I understand that Jesus is THE truth… but that doesn’t mean in our daily life that whether we speak the truth or whether we lie doesn’t matter - after all, some say that ‘Good and Evil, truth and lies… are all on the same “tree” - ￼the Tree of Knowledge of Good and Evil, and we should just stay on the Tree of Life… if someone’s speaking makes you uncomfortable, then it must be the wrong tree, and that just leads to death…” Such attitudes and words ARE culty, - they prevent abuse from being exposed because no one is/should be comfortable hearing about abuse… ￼but evil should be exposed and victims/witnesses should be heard. Otherwise, dear ones will continue being stumbled. I posted this after watching https://m.youtube.com/watch?v=5DnzEM-6xmA\u0026pp=ygUcTG90ZCdzIHJlY292ZXJ5IGN1bHQgZXhwb3NlZA%3D%3D… Like this brother, I don’t like to be sharing these things, but there’s been too much damage to hide it or to let it continue without speaking up. That’s what any responsible community member should do if they are exposed to abuse.",
      "release": "2024-09-06T01:41:04Z",
      "duration": "00:14:57",
      "explicit": false,
      "youTubeId": "vaI8TqwbHXA",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vaI8TqwbHXA"
      }
    },
    {
      "id": "2dbbfbe9-d844-4dd1-9fe1-1d8691bdca26",
      "title": "2023 memories   HD 720p",
      "release": "2024-09-05T05:12:12Z",
      "duration": "00:04:03",
      "explicit": false,
      "youTubeId": "sWDsaSgRSeU",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sWDsaSgRSeU"
      }
    },
    {
      "id": "12511e88-c028-4f95-ad55-a1a6c46ed392",
      "title": "Abuse in \u0022The Lord\u0027s Recovery\u0022",
      "description": "I don\u0027t remember what I have already shared in past videos... it is too painful to watch myself, so I just post these and never re-watch them.  I am posting this in love for victims and for any who love your fellow humans and fellow believers. I am posting this in solidarity with all those who have been disorientingly hurt and potentially stumbled by a group whose leaders (not all - but TOO many leaders) cover up blantant and abhorrent sins, blame victims, hush witnesses, treat wives as dispensable and disposable... all while claiming to be \u0022The Lord\u0027s Recovery\u0022 and THE church. I couldn\u0027t survive without the church, and am being cared for in the church... just not by Christians who claim to be against division while tolerating all that divides, and who treat those who speak out as if they are the problem. Whistleblowers are NOT the problem. We are seeking to be part of the solution, a solution that cannot save the image of unrepentant perpetrators and complicit responsible ones.",
      "release": "2024-09-04T02:53:35Z",
      "duration": "00:11:59",
      "explicit": false,
      "youTubeId": "2XYqC57VUus",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2XYqC57VUus"
      }
    },
    {
      "id": "4efa0afe-b549-409b-8f71-16fc200a77c4",
      "title": "Why I Married My Husband, and Why I Am Sharing This",
      "description": "In the midst of crisis, I decided to open up about our family situation, because the effects aren\u0027t restricted to my life, my marriage, and my dear husband. Our children are intensively affected, and everyone who loves us are directly or indirectly affected. Not only so, but I heard in an audiobook I recently listened to that humans outsource our sanity (Jordan Peterson, Beyond Order). We can\u0027t remain sane without being heard by some.\nThank you for providing space, lending an ear, and allowing me to outsource my sanity in this difficult time. And thank you for your non-judgmental love.",
      "release": "2024-01-22T06:45:53Z",
      "duration": "00:11:43",
      "explicit": false,
      "youTubeId": "gmDZ7kiQN-c",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gmDZ7kiQN-c"
      }
    },
    {
      "id": "7ef59de9-4540-4d9f-884d-222fb48085b3",
      "title": "NOT \u0022Airing Dirty Laundry\u0022 - Speaking Out Against Unsafe and Abusive Patterns",
      "description": "In this video I muse on the cliche about airing ones dirty laundry as being cruel, dangerous and thought-terminating when misapplied to situations when abuse is being exposed or relationships and the well-being and safety of others are being threatened.",
      "release": "2024-01-22T06:44:06Z",
      "duration": "00:11:45",
      "explicit": false,
      "youTubeId": "DXlctl2NgwI",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DXlctl2NgwI"
      }
    },
    {
      "id": "f73d90a1-e4de-42e8-8662-a3c968c81a61",
      "title": "If this were my last recording, what I would want to say...",
      "description": "This video is a hypothetically \u0022last message\u0022 given to my children and any other viewer - recorded with love.",
      "release": "2024-01-21T04:36:34Z",
      "duration": "00:06:18",
      "explicit": false,
      "youTubeId": "rSc85M57LSw",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rSc85M57LSw"
      }
    },
    {
      "id": "7cd7ee8f-8eee-4456-90a0-3cd7567b98c0",
      "title": "Notes from Therapy (December 2018)",
      "description": "In this episode, I read notes that I took during another therapy session with a very dear and experienced therapist in Santa Monica. I was in Manigod, France, surrounded by the French Alps (the thumbnail photo was a common view through the window of where I was staying), and in total pain - just wanting to be with my husband and save our deteriorating relationship.",
      "release": "2024-01-15T22:06:25Z",
      "duration": "00:08:10",
      "explicit": false,
      "youTubeId": "KngacQ2HVnQ",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KngacQ2HVnQ"
      }
    },
    {
      "id": "8372821f-a6bf-4dd0-a78c-af789e6d214d",
      "title": "Notes from 2 therapy sessions with Vincent S.",
      "description": "Reviewing my journal compounds the present pain I am in. So I decided to share some of the helpful therapy I have received - though the notes are not perfect, perhaps something in them could help at least one viewer.... These notes  were taken in Manigod, France, where I was staying with my brother and his family in the Winter of 2018/19. Vincent and I had phone sessions; he is in Santa Monica, CA.",
      "release": "2024-01-15T22:00:11Z",
      "duration": "00:13:25",
      "explicit": false,
      "youTubeId": "hhsy-4qRJuM",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hhsy-4qRJuM"
      }
    },
    {
      "id": "175ee5f9-a472-4015-91b0-6f8c861f91c8",
      "title": "Moving Goal Posts: Notes from time with Ron on Feb. 21, 2019",
      "description": "I am coping with years of extreme emotional, psychological, financial, spiritual, and, (if severe neglect, rejection and abandonment in marriage qualify as physical abuse) physical abuse. To work through this, to share my experience, to \u0022tell the church\u0022, and to expose works of darkness, I will be posting videos - unedited and imperfect. They will be based on journal entries and on any current experiences. They are FACTUAL. I am accused of lying by those who don\u0027t want the truth exposed. There is NO lie in these videos; there is the honest mistake- I mispoke in this video; this was filmed on January 14, 2024, not the 13th.  \n\nThis video reflects on an appointment I had on February 21, 2019, with someone very well-respected in the church community in which I was raised and which was my most important circle  - until I was ostracized by my husband, his family, and eventually nearly everyone in that community to whom I turned for help.",
      "release": "2024-01-15T00:08:58Z",
      "duration": "00:10:23",
      "explicit": false,
      "youTubeId": "h40Otgxs_cc",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h40Otgxs_cc"
      }
    },
    {
      "id": "7bdd8a59-5b66-4bf3-8456-970f340d2ba4",
      "title": "InconvenientRuth Podcast - Introduction",
      "description": "This is a simple introduction to what I intend to be an ongoing series about my experiences of abuse and abusive patterns in my marriage, family, and Christian community, but also words and experiences of healing and of thriving - not only in spite of the past trauma, but even BECAUSE of it. \n\nIf you can relate this podcast, I want you to know you are not alone, and that God is near to the brokenhearted (Ps. 34:18). And with God near - more near than anything else, everything will be more than okay.",
      "release": "2024-01-14T23:32:38Z",
      "duration": "00:02:26",
      "explicit": false,
      "youTubeId": "BbpM6bvoW8I",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BbpM6bvoW8I"
      }
    },
    {
      "id": "c2e573d9-1f63-44cb-9ff9-a40923c29093",
      "title": "🐶Riley Day 2019 🐶 D6DAC9CA 9069 497F BA32 25E867C2D5C8",
      "release": "2019-08-05T22:50:58Z",
      "duration": "00:08:28",
      "explicit": false,
      "youTubeId": "7ChOSjXOnLk",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7ChOSjXOnLk"
      }
    },
    {
      "id": "eb4d55c0-9bd2-43ab-8984-a3b1bcf482e9",
      "title": "🐶Riley Day 2019 🐶",
      "release": "2019-08-05T21:25:17Z",
      "duration": "00:08:21",
      "explicit": false,
      "youTubeId": "cJUlBDCubFw",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cJUlBDCubFw"
      }
    },
    {
      "id": "3ffe7627-b972-413e-8a3a-64a4a07e969c",
      "title": "For Christy with Love",
      "description": "This is a slightly revised version... with a few more special ones included... Wish I could have featured every important person in Christy\u0027s life so far, but she is blessed with so many, and I am lacking pictures of some of you. Happy 18th birthday, dear Christy!!!",
      "release": "2019-06-14T05:23:20Z",
      "duration": "00:11:27",
      "explicit": false,
      "youTubeId": "C2xB1JUL9Mc",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=C2xB1JUL9Mc"
      }
    },
    {
      "id": "d6de916b-3dce-4f5d-bf52-8244b3049c3a",
      "title": "Christy",
      "release": "2019-05-17T03:49:50Z",
      "duration": "00:11:30",
      "explicit": false,
      "youTubeId": "zV1gKmGxzbc",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zV1gKmGxzbc"
      }
    }
  ]
}