{
  "_ts": 0,
  "id": "160fc316-816a-4c27-9bca-f58746c00cbe",
  "name": "Ruth Wise",
  "youTubeChannelId": "UC6Kq4Oy-XSdO8olH6VFGbjA",
  "episodes": [
    {
      "id": "ee92d01e-f4d9-46d2-ad7b-aa9b26039ca1",
      "title": "More examples of covering up rather than dealing with sins scripturally in “The Lord’s Recovery”",
      "description": "Without partiality and favoritism I feel to keep speaking out about multiple cases in which responsible ones in the Local Church and in “The Lord’s Recovery” did not deal properly with sins. These are not victimless sins. They damage the hearts and families of targets and victims. The damage can extend even for generations. The damage doesn’t disappear or heal with silence, but through applying God’s Word faithfully, which involves rebuking and reproving, in the case of leading ones, publicly, and they’re being repentance and forgiveness.\n\nThe practice in the Lords recovery has been to publicly rebuke people who speak out, and to quarantine them and label them as poisonous and negative. I am not poisonous or negative. I can’t tolerate these patterns in what is being called “The Lord’s Recovery.” Lives are being destroyed. \n\nBrothers, what is the motive of stank silent about these improprieties and sins? Is it because of partiality towards certain families? Is it because of financial gain that may be affected if people hold you accountable? \n\nWe live before the Lord. It is better to deal with offenses and sins in this age, while we are still on our way home to meet the Lord.\n\nI’d like to add, related the sexual abuse my daughter experienced from a son of Ben Phillips, Jr.:\n\n1) Brother Ben, when you made that appeal at your dad’s memorial for those who have “left” to “come back” - brother, if we left a particular gathering of believers because we weren’t safe, we weren’t protected by leaders, and we were ignored and/or shamed if we spoke out, how/why would we return to that environment? And I refuse to call such an environment “the” church…. Yes, the church in Corinth had problems, but hopefully they were dealt with properly and thoroughly by leaders. Eventually their testimony faded. Eventually the lampstand was removed from the church in Ephesus. You can have the right name but not be the reality of a church as a lampstand. \n\n2) I am not speaking about this matter to shame any minors in the church. They need care and shepherding and protection and guidance from the older ones. Both my daughter and this other young person, were suffering, deep depression and family-related pain. They found a lot of solace in being together and talking honestly together. But personal boundaries should always be honored. When my daughter asked for help, help could’ve been given, but her appeals were ignored.\n\n3) To Christy’s grandparents, Willie and Rosalind Wise, she opened to you about her being molested. You told her to not say anything about it, but to cover the family. You should have protected your granddaughter (or any other victim opening to you) - not the image of a high profile family. We should protect every victim of sexual violence, assault, and harassment, without partiality or favoritism.\n\nTo all, this is a PATTERN in “The Lord’s Recovery” and it is not sustainable. There needs to be proper rebuking and repenting and forgiveness and restoration in cases such as those I mention in this video. \n\n#thelocalchurch \n#lordsrecovery",
      "release": "2024-09-28T18:25:36Z",
      "duration": "00:08:11",
      "explicit": false,
      "youTubeId": "_amHbQxGddQ",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_amHbQxGddQ"
      }
    },
    {
      "id": "78241b75-6f50-48e5-8f9d-3f32c31a6ec7",
      "title": "A Serious Example of Covering Up Sins in \u0026quot;The Lord\u0026#39;s Recovery\u0026quot;, Stumbling Many",
      "description": "In this video, I speak out about a member of my spiritual family, who has not been shepherded properly to repent and to be restored to the fellowship, but rather his sins that have stumbled many, and his disappearance that grieves even more of us, are all covered up and \u0022not spoken about\u0022 (except in small circles). This is contrary to GOD\u0027S Word, which says, \u0022Do not entertain an accusation against an elder unless it is brought by two or three witnesses. But those elders who are sinning you are to reprove before everyone, so that the others may take warning.  I charge you, in the sight of God and Christ Jesus and the elect angels, to keep these instructions without partiality, and to do nothing out of favoritism\u0022 (I Tim. 5:19-21).\n\nI am just a \u0022little\u0022 (53-year-old) sister but I can\u0027t bear the lack of practicing what is in God\u0027s Word, in the name of \u0022covering brothers,\u0022 in \u0022The Lord\u0027s Recovery.\u0022 What about protecting endangered wives? What about comforting heart-broken children and grandchildren? What about loving one another enough to reprove publicly, for there to be public warning and public repentance and full forgiveness and restoration?\n\nThere should be no favoritism, no partiality. If you rebuke brothers publicly who are maintaining a clean conscience, speaking truthfully, but whose speaking may tarnish the reputation of an individual or an organization, but you are covering up gross sins of leading brothers, trying to hide the truth, that is partiality.\n\nAs long as I am alive, I won\u0027t stand by, but I will speak up and speak out the truth... the whole truth, and nothing but the truth, so help me God. We are ALL affected by lies in our communities and especially in the church (composed of ALL believers), including lies of ommission, and by the loss of the function of fellow members who fall into sin or are excommunicated for speaking up about sins that need to be dealt with scripturally.\n\nTo the brother I address, and to his family, I hope you receive my words in this public way only from my heart of love and my deep desire for restoration and for preservation of the Lord\u0027s testimony and genuine oneness, apart from sin, among ALL His believers, wherever and with whomever we may be practically meeting.\n\nLove finds no joy in unrighteousness but rejoices in the truth (1 Cor. 13:6).\n\n#lordsrecovery \n#thelocalchurch \n#witnesslee \n#cultrecovery",
      "release": "2024-09-28T01:00:30Z",
      "duration": "00:12:18",
      "explicit": false,
      "youTubeId": "MwM_3GHTKgg",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MwM_3GHTKgg"
      }
    },
    {
      "id": "fb23f5f0-8b9c-4207-996a-68bcbe46ecfc",
      "title": "Serious matters: Contradictions and conflict of interest",
      "description": "Believers shouldn\u0027t lie. We shouldn\u0027t say one thing and actually be doing the opposite.\n\nNo believer should be above any other believer. Our oneness should not depend on any special affiliation to one particular ministry and the exclusion of others\u0027 ministries.\n\nAnd we should not use godliness as a means for financial gain (1 Tim. 6:5).\n\nIf a church (\u0022THE church\u0022) is required to have/speak/read only \u0022one ministry,\u0022 based on one or two brothers\u0027 speaking, and a non-profit publishing company is very enmeshed with THE church, financially and practically, and that publishing company sells only those two brothers\u0027 writings, there is a huge incentive to silence anything that would cause serious, legitimate and scriptural concerns among followers regarding the publishing company, the churches, and especially leading ones including the \u0022commander\u0022 (Elders Training Book 7, 1986, bibleread.online/all-books-by-Watchman-Nee-and-Witness-Lee/book-elders-training-book-07-one-accord-for-the-lords-move-Witness-Lee-read-online/6/).\n\n[From that same Elders Training book just cited, here are 2 pertinent paragraphs I didn\u0027t read in the  video:\n\n\u0022Some saints came to me a number of times with reports concerning serious and even negative situations. They may have misunderstood my not responding to them with any kind of seriousness. I believe I did not respond in this way not only out of my patience and toleration but also because of the Lord’s wisdom. I feel that it is altogether wise to be patient. When the fruit of a particular tree is growing, the fruit itself will show what it is. When the fruit becomes ripe, it will fall from the tree. At this point, however, I do not feel that I should tolerate certain situations any longer, because enough damage has been done already. I do not like to see more damage done to the Lord’s recovery. I have no time, dear saints, to fool around with people any longer. Let us go to fight the battle. Who are the “us”? They are the ones who are desperate with no opinion.\n\nand...\n\u0022It is altogether not wise for you to remain in the recovery taking this ministry on the one hand and yet on the other hand to say something else. This is not wise. It is not profitable to yourself or to your future. You may say that you have a ministry, but this is not profitable to your ministry if you have one. You can never profit your ministry in the future in this way. Rather, you have dispensed your future in a cheap way. The wise way is to stay, without any opinion, with the recovery, which is unique.\u0022]\n\nIf there is abuse in THE church and/or in the Ministry office of the publication company, to remain \u0022faithful\u0022 in the church and \u0022faithful to the ministry\u0022  - or \u0022one with the ministry\u0022  - seems to require that you look the other way rather than confront and deal with stumbling sin. Such \u0022oneness\u0022 of \u0022the Body\u0022 is actually a loyalism to a corrupt system/organization with a financial conflict of interest. \n\nI don\u0027t do justice in this video (nor in any video)... but hopefully this is a start.\n\nAdd to this the fact that much money is brought in by the activities of the Living Stream Ministry that supports many \u0022faithful to the ministry.\u0022 What if such ones were to say, \u0022Sin is not acceptable. Sexual harrassment is illegal and should be dealt with seriously.\u0022 Would they lose their financial support? Would they be shunned?\n\nOh, wait, this happened. And such ones were labeled \u0022rebellious\u0022 and \u0022poisonous\u0022 and lied about and excommunicated (\u0022quarantined\u0022).\n\nWe were cheated from their ministry - which I believe each and every member of Christ\u0027s body has.\n\nOur oneness must not depend on oneness with anyone other than the Triune God. If it is, we are very likely in a cult.\n\n#witnesslee \n#lordsrecovery \n#thelocalchurch \n#cultrecovery",
      "release": "2024-09-27T02:47:58Z",
      "duration": "00:15:43",
      "explicit": false,
      "youTubeId": "c4fSkv5y_3s",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c4fSkv5y_3s"
      }
    },
    {
      "id": "6d4003dc-13b0-48e9-b0e5-76f49710a171",
      "title": "A public appeal for fellowship regarding publicly defamed brothers in “The Lord’s Recovery”",
      "description": "I’m just a little sister in God‘s family, but I can’t bear to see my brothers or sisters being excommunicated or quarantined, for reasons that have not been made clear. If such ones are seeking to cause division, living in gross sins, lying, or heretical, please let me know in the comments or by arranging a time for us to fellowship, with a witness present. And even if this were the case, aren\u0027t we supposed to seek one another\u0027s healing and restoration?\n\nIf dear believers (whistleblowers) are being ex-communicated or quarantined, can we know specifically why? If there is no reason other than tarnishing the image of a person or organization by speaking about genuine, legitimate concerns, can they please be restored to fellowship in the church community? \n\nI don’t believe to point out situations where sins (affecting and stumbling others) have been systematically covered up is a reason to quarantine or excommunicate any of us. I believe all who have spoken out and those still speaking out have risked very much because to not do so is complicity with such sins, and stumbling of others will continue until there is righteousness at the leadership level in any church community.",
      "release": "2024-09-23T01:53:46Z",
      "duration": "00:06:13",
      "explicit": false,
      "youTubeId": "j9y3KLSN74s",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j9y3KLSN74s"
      }
    },
    {
      "id": "528438ed-f285-45ec-856b-54fa40162401",
      "title": "Characteristics of Cults for Your Consideration",
      "description": "Dear viewers of this or any of my videos - Whether or not you are actually in a cult, sharing characteristics with cults should be concerning and should cause anyone to consider their ways. Very trained therapists I have had have said that minimally, I have been treated in cult-like ways over the years... and I know this to be true. I watched \u0022Scientology and Its Aftermath\u0022 with tears streaming down my face during some episodes, being able to identify with victims speaking out, or of whom others were speaking. As believers and as doers of God\u0027s Word, cult-like behaviors should not be characteristic of our practices.\n\nIn this video, I mainly read from a webpage of an international authority on cults, Janja Lalich (janjalalich.com/help/characteristics-associated-with-cults/).\n\nI also make a few feeble comments with a few examples of experiences, practices and observations that align to these characteristics, practiced in \u0022The Lord\u0027s Recovery\u0022/\u0022The Local Churches\u0022. If I said more, and I have a lot more to say, the video would get too long.\n\nFor many, including myself for many years, it is hard to hear these words until/unless you reach a point in your life where destructive treatment directed at you or at someone you love is no longer bearable... then in order to heal, you begin to face the facts and to think soberly and, yes, critically, about your community, your choices (or lack thereof), the consequences of your choices, and how all of that compares to the characteristics of cults.",
      "release": "2024-09-19T02:46:53Z",
      "duration": "00:14:26",
      "explicit": false,
      "youTubeId": "y1187Qhwm2Q",
      "subjects": [
        "The Lord\u0027s Recovery",
        "Scientology",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=y1187Qhwm2Q"
      }
    },
    {
      "id": "9c4394d3-1d40-43af-956c-624fa5f60163",
      "title": "A Response to \u0022Shepherding Words: Encountering Opposition\u0022",
      "description": "Dear fellow believers, if I and others are speaking the truth, because as lovers of God and of His church, we can no longer be silent , are we \u0022opposers\u0022? Believers doing all we can to fight for God\u0027s pure testimony are being smeared and silenced and stonewalled, accused of spreading unfounded rumors and false accusations. Maybe writers of this article are not considering me and other lovers of Jesus as such opposers - then wonderful! Please, let\u0027s meet and fellowship. I believe many like myself have been and are certainly \u0022misunderstood\u0022. The article I am addressing begins with the words, \u0022No one likes to be misunderstood...\u0022 referring to those \u0022in the Lord\u0027s Recovery\u0022. To the writers of this article, I address this video. Have you sought to accurately understand ones you have labeled as opposers? If not, perhaps THEY are being misunderstood? Perhaps they  are 100% open to understanding if in any way they have misunderstood anything or anyone. We believers can expect misunderstanding, but we should do our best to be at peace with ALL men, and should not tolerate immorality and gross sins, covered up with dishonesty and hypocrisy, in the context what is being called \u0022the church.\u0022 We should judge the sin, confess and repent of it, and love one another warmly, allowing no division.",
      "release": "2024-09-14T01:32:48Z",
      "duration": "00:11:20",
      "explicit": false,
      "youTubeId": "M9n6gId63-g",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=M9n6gId63-g"
      }
    },
    {
      "id": "0424c4f8-f4ff-4efc-bba8-dace5efb62b1",
      "title": "Mentioning names in \u0022The Lord\u0027s Recovery\u0022 to expose long-term covering up of gross sins",
      "description": "Some names must be mentioned to properly deal with the abuse that has been going on for decades in \u0022The Lord\u0027s Recovery.\u0022 I do my best to explain, in my experience and testimony, why I am mentioning names, knowing how \u0022dangerous\u0022 and audacious this is in this group - how smeared and shamed past witnesses have been who have done so.\n#thelordsrecovery \n#thelocalchurch \n#witnesslee \n#philliplee",
      "release": "2024-09-13T15:28:14Z",
      "duration": "00:06:14",
      "explicit": false,
      "youTubeId": "oC42CIuwPOg",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oC42CIuwPOg"
      }
    },
    {
      "id": "cbe41b9d-ea33-4fec-87fa-229f56c18787",
      "title": "Pervasive Abuse in \u0022The Lord\u0027s Recovery\u0022, Stumbling Many",
      "description": "Many who have spoken up about untenable abuse in \u0022The Lord\u0027s Recovery\u0022 have been shamed, silenced, and smeared, while gross sins are covered up, largely due to perpetrators\u0027 positions and/or their natural relationship to leading, responsible ones in \u0022The Lord\u0027s Recovery.\u0022 This is terribly stumbling, and even stumbling one little one is very serious. I am not sharing these things to spread any rumors, nor am I bearing false witness. If anyone accuses me of lying, they themselves are bearing false witness and shaming a victim of sexual assault at the hands of a son of Witness Lee.\n\n#lordsrecovery \n#witnesslee \n#religiousabuse \n#localchurch",
      "release": "2024-09-13T05:44:31Z",
      "duration": "00:14:15",
      "explicit": false,
      "youTubeId": "yRDInWP81Ek",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yRDInWP81Ek"
      }
    },
    {
      "id": "78dffa45-f144-4efb-af09-2353d6c37bc6",
      "title": "A Personal, Accurate, Response to recent \u0022Shepherding Words\u0022 in shepherdingwords.com.",
      "description": "I read recent \u0022shepherding words\u0022 stating that social media is being used to bear false witness and to spread unfounded rumors about \u0022The Lord\u0027s Recovery,\u0022 \u0022the Local Churches,\u0022 Witness Lee, etc. I felt to post this in response, to be very clear that anything I am reporting is both TRUE and founded on firsthand experience and/or primary sources. My motive is not simply to expose evil - which is scriptural. It is to address untenable and severely stumbling patterns of abuse that has no place in any Godly community.\n\n#thelordsrecovery \n#thelocalchurch\n#witnesslee \n#religiousabuse \n#inconvenientruth",
      "release": "2024-09-11T02:28:58Z",
      "duration": "00:10:59",
      "explicit": false,
      "youTubeId": "Jl6wdt3LLdQ",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Jl6wdt3LLdQ"
      }
    },
    {
      "id": "26a4663b-b37c-41b4-91fc-b58e2193b1bb",
      "title": "Admitting to yourself and to others the truth, the whole truth, and nothing but the truth",
      "description": "I understand that Jesus is THE truth… but that doesn’t mean in our daily life that whether we speak the truth or whether we lie doesn’t matter - after all, some say that ‘Good and Evil, truth and lies… are all on the same “tree” - ￼the Tree of Knowledge of Good and Evil, and we should just stay on the Tree of Life… if someone’s speaking makes you uncomfortable, then it must be the wrong tree, and that just leads to death…” Such attitudes and words ARE culty, - they prevent abuse from being exposed because no one is/should be comfortable hearing about abuse… ￼but evil should be exposed and victims/witnesses should be heard. Otherwise, dear ones will continue being stumbled. I posted this after watching https://m.youtube.com/watch?v=5DnzEM-6xmA\u0026pp=ygUcTG90ZCdzIHJlY292ZXJ5IGN1bHQgZXhwb3NlZA%3D%3D… Like this brother, I don’t like to be sharing these things, but there’s been too much damage to hide it or to let it continue without speaking up. That’s what any responsible community member should do if they are exposed to abuse.",
      "release": "2024-09-06T01:41:04Z",
      "duration": "00:14:57",
      "explicit": false,
      "youTubeId": "vaI8TqwbHXA",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vaI8TqwbHXA"
      }
    },
    {
      "id": "2dbbfbe9-d844-4dd1-9fe1-1d8691bdca26",
      "title": "2023 memories   HD 720p",
      "release": "2024-09-05T05:12:12Z",
      "duration": "00:04:03",
      "explicit": false,
      "youTubeId": "sWDsaSgRSeU",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sWDsaSgRSeU"
      }
    },
    {
      "id": "12511e88-c028-4f95-ad55-a1a6c46ed392",
      "title": "Abuse in \u0022The Lord\u0027s Recovery\u0022",
      "description": "I don\u0027t remember what I have already shared in past videos... it is too painful to watch myself, so I just post these and never re-watch them.  I am posting this in love for victims and for any who love your fellow humans and fellow believers. I am posting this in solidarity with all those who have been disorientingly hurt and potentially stumbled by a group whose leaders (not all - but TOO many leaders) cover up blantant and abhorrent sins, blame victims, hush witnesses, treat wives as dispensable and disposable... all while claiming to be \u0022The Lord\u0027s Recovery\u0022 and THE church. I couldn\u0027t survive without the church, and am being cared for in the church... just not by Christians who claim to be against division while tolerating all that divides, and who treat those who speak out as if they are the problem. Whistleblowers are NOT the problem. We are seeking to be part of the solution, a solution that cannot save the image of unrepentant perpetrators and complicit responsible ones.",
      "release": "2024-09-04T02:53:35Z",
      "duration": "00:11:59",
      "explicit": false,
      "youTubeId": "2XYqC57VUus",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2XYqC57VUus"
      }
    },
    {
      "id": "4efa0afe-b549-409b-8f71-16fc200a77c4",
      "title": "Why I Married My Husband, and Why I Am Sharing This",
      "description": "In the midst of crisis, I decided to open up about our family situation, because the effects aren\u0027t restricted to my life, my marriage, and my dear husband. Our children are intensively affected, and everyone who loves us are directly or indirectly affected. Not only so, but I heard in an audiobook I recently listened to that humans outsource our sanity (Jordan Peterson, Beyond Order). We can\u0027t remain sane without being heard by some.\nThank you for providing space, lending an ear, and allowing me to outsource my sanity in this difficult time. And thank you for your non-judgmental love.",
      "release": "2024-01-22T06:45:53Z",
      "duration": "00:11:43",
      "explicit": false,
      "youTubeId": "gmDZ7kiQN-c",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gmDZ7kiQN-c"
      }
    },
    {
      "id": "7ef59de9-4540-4d9f-884d-222fb48085b3",
      "title": "NOT \u0022Airing Dirty Laundry\u0022 - Speaking Out Against Unsafe and Abusive Patterns",
      "description": "In this video I muse on the cliche about airing ones dirty laundry as being cruel, dangerous and thought-terminating when misapplied to situations when abuse is being exposed or relationships and the well-being and safety of others are being threatened.",
      "release": "2024-01-22T06:44:06Z",
      "duration": "00:11:45",
      "explicit": false,
      "youTubeId": "DXlctl2NgwI",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DXlctl2NgwI"
      }
    },
    {
      "id": "f73d90a1-e4de-42e8-8662-a3c968c81a61",
      "title": "If this were my last recording, what I would want to say...",
      "description": "This video is a hypothetically \u0022last message\u0022 given to my children and any other viewer - recorded with love.",
      "release": "2024-01-21T04:36:34Z",
      "duration": "00:06:18",
      "explicit": false,
      "youTubeId": "rSc85M57LSw",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rSc85M57LSw"
      }
    },
    {
      "id": "7cd7ee8f-8eee-4456-90a0-3cd7567b98c0",
      "title": "Notes from Therapy (December 2018)",
      "description": "In this episode, I read notes that I took during another therapy session with a very dear and experienced therapist in Santa Monica. I was in Manigod, France, surrounded by the French Alps (the thumbnail photo was a common view through the window of where I was staying), and in total pain - just wanting to be with my husband and save our deteriorating relationship.",
      "release": "2024-01-15T22:06:25Z",
      "duration": "00:08:10",
      "explicit": false,
      "youTubeId": "KngacQ2HVnQ",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KngacQ2HVnQ"
      }
    },
    {
      "id": "8372821f-a6bf-4dd0-a78c-af789e6d214d",
      "title": "Notes from 2 therapy sessions with Vincent S.",
      "description": "Reviewing my journal compounds the present pain I am in. So I decided to share some of the helpful therapy I have received - though the notes are not perfect, perhaps something in them could help at least one viewer.... These notes  were taken in Manigod, France, where I was staying with my brother and his family in the Winter of 2018/19. Vincent and I had phone sessions; he is in Santa Monica, CA.",
      "release": "2024-01-15T22:00:11Z",
      "duration": "00:13:25",
      "explicit": false,
      "youTubeId": "hhsy-4qRJuM",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hhsy-4qRJuM"
      }
    },
    {
      "id": "175ee5f9-a472-4015-91b0-6f8c861f91c8",
      "title": "Moving Goal Posts: Notes from time with Ron on Feb. 21, 2019",
      "description": "I am coping with years of extreme emotional, psychological, financial, spiritual, and, (if severe neglect, rejection and abandonment in marriage qualify as physical abuse) physical abuse. To work through this, to share my experience, to \u0022tell the church\u0022, and to expose works of darkness, I will be posting videos - unedited and imperfect. They will be based on journal entries and on any current experiences. They are FACTUAL. I am accused of lying by those who don\u0027t want the truth exposed. There is NO lie in these videos; there is the honest mistake- I mispoke in this video; this was filmed on January 14, 2024, not the 13th.  \n\nThis video reflects on an appointment I had on February 21, 2019, with someone very well-respected in the church community in which I was raised and which was my most important circle  - until I was ostracized by my husband, his family, and eventually nearly everyone in that community to whom I turned for help.",
      "release": "2024-01-15T00:08:58Z",
      "duration": "00:10:23",
      "explicit": false,
      "youTubeId": "h40Otgxs_cc",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h40Otgxs_cc"
      }
    },
    {
      "id": "7bdd8a59-5b66-4bf3-8456-970f340d2ba4",
      "title": "InconvenientRuth Podcast - Introduction",
      "description": "This is a simple introduction to what I intend to be an ongoing series about my experiences of abuse and abusive patterns in my marriage, family, and Christian community, but also words and experiences of healing and of thriving - not only in spite of the past trauma, but even BECAUSE of it. \n\nIf you can relate this podcast, I want you to know you are not alone, and that God is near to the brokenhearted (Ps. 34:18). And with God near - more near than anything else, everything will be more than okay.",
      "release": "2024-01-14T23:32:38Z",
      "duration": "00:02:26",
      "explicit": false,
      "youTubeId": "BbpM6bvoW8I",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BbpM6bvoW8I"
      }
    },
    {
      "id": "c2e573d9-1f63-44cb-9ff9-a40923c29093",
      "title": "🐶Riley Day 2019 🐶 D6DAC9CA 9069 497F BA32 25E867C2D5C8",
      "release": "2019-08-05T22:50:58Z",
      "duration": "00:08:28",
      "explicit": false,
      "youTubeId": "7ChOSjXOnLk",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7ChOSjXOnLk"
      }
    },
    {
      "id": "eb4d55c0-9bd2-43ab-8984-a3b1bcf482e9",
      "title": "🐶Riley Day 2019 🐶",
      "release": "2019-08-05T21:25:17Z",
      "duration": "00:08:21",
      "explicit": false,
      "youTubeId": "cJUlBDCubFw",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cJUlBDCubFw"
      }
    },
    {
      "id": "3ffe7627-b972-413e-8a3a-64a4a07e969c",
      "title": "For Christy with Love",
      "description": "This is a slightly revised version... with a few more special ones included... Wish I could have featured every important person in Christy\u0027s life so far, but she is blessed with so many, and I am lacking pictures of some of you. Happy 18th birthday, dear Christy!!!",
      "release": "2019-06-14T05:23:20Z",
      "duration": "00:11:27",
      "explicit": false,
      "youTubeId": "C2xB1JUL9Mc",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=C2xB1JUL9Mc"
      }
    },
    {
      "id": "d6de916b-3dce-4f5d-bf52-8244b3049c3a",
      "title": "Christy",
      "release": "2019-05-17T03:49:50Z",
      "duration": "00:11:30",
      "explicit": false,
      "youTubeId": "zV1gKmGxzbc",
      "subjects": [
        "The Lord\u0027s Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zV1gKmGxzbc"
      }
    }
  ]
}