{
  "id": "7d92f42e-30ef-4372-9ae3-c09852397147",
  "name": "Ruthless TV",
  "youTubeChannelId": "UCYp2CCWwggopuV7if7Udy9w",
  "episodes": [
    {
      "id": "32092261-f473-4517-8c82-21872702254d",
      "title": "Ruthless Season 5 | MY LIFE with a Cult Leader | Malaki Z. York  of Nuwaubian Nation (PART 3 OF 3)",
      "description": "In this video, I deliver commentary on Tyler Perry\u0027s Ruthless, Season 5 as it relates to the Nuwaibian Nation and it\u0027s leader Malachi York. The video features Ana, a survivor of the community, who sat down to share her story in this chilling interview. \n\nIf you missed the Ruthless episodes, no worries, I give a full rundown of the show scene by scene to keep you in the loop in my Ruthless Season 4 Playlist\r\nhttps://www.youtube.com/watch?v=fJzJcwQrPOs\u0026list=PL1lwE3M2OyWZhfxh2jqcv9JB4fMcsSu1t\n\r\nTyler Perry has a cult??.....well kind of. Of all the Tyler Perry shows, Ruthless is one of my favorites.  Ruthless is a spin-off of The Oval that chronicles the life of Ruth Truesdale, who kidnaps her daughter and they go live on the Rakadushi compound. Tyler Perry creatively wove in their storyline to have it break out into its own series, most of which I’m sure is filmed at Tyler Perry Studios in Atlanta. \r\n\r\nDid you know that Tyler Perry enlisted an actor from the show to perform the Ruthless theme song?  Yes, the theme song is performed by Anthony Bless who plays Malcolm on the show.  Just a little Ruthless trivia for ya there:) \r\n\r\nThe cast of Ruthless: Matt Cedeno, Melissa L. Williams, Yvonne Senat Jones, Lenny Thomas, Blue Kimble, Nirine Brown, Bobbi Baker, Lyne Odums, Anthony Bless, Jaime Callica, Stephanie Charles, Stevie Baggs, Jr. Alise Willis, Nadege August, Jeremey Palko, Robert Craighead and more. \r\n\r\nS U B S C R I B E\r\nhttp://bit.ly/3cn1HTo\r\n\r\nS O C I A L  M E D I A \r\nFollow me on IG: @ruthlesstvfans\r\nJoin Tyler Perry\u0027s Ruthless Fans Facebook Group:https://www.facebook.com/groups/tprfn/\r\n\r\nC O N T A C T\r\nEmail: ruthlesstvonline@gmail.com\r\nGeneral inquiries: ruthlesstvonline@gmail.com",
      "release": "2024-05-13T22:56:37Z",
      "duration": "00:22:21",
      "explicit": false,
      "youTubeId": "QJRyE2Np3Sk",
      "subjects": [
        "Nuwaubian Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QJRyE2Np3Sk"
      }
    }
  ]
}