{
  "id": "35841934-78a8-45fd-94b8-6e7c7f72d968",
  "name": "Sam Howson",
  "youTubeChannelId": "UC1h4BV4psp35jmtQol5fZYQ",
  "episodes": [
    {
      "id": "85941058-440b-4f09-a16f-99e772336742",
      "title": "How to Avoid a Cult-Like Church in Britain \u0026 America With Dr. Dougie Marks Pt. 2",
      "description": "I wanted to create a toolkit of how to spot a narcissist in charismatic evangelical churches. We reviewed my counselling session and then I wanted to speak with Dr Dougie Marks about bad leaders, the wider system, why people cover up abuse and maybe how we can do this better.\n\nDr Dougie Marks is a Health Psychologist, CBT Practitioner and Lecturer in Behavioural Sciences. His work spans the areas of teaching, research, consultancy and clinical practice.\n\n00:00 Recap on my CBT counselling session\n02:23 How a therapist approaches an individual \n03:04 Five Factor Personality Model \n11:46 Where do abusive leaders fit? \n19:36 Can we understand the narcissist? \n21:12 John Smyth \u0026 Evangelicalism\n22:38 The Dark Triad \n26:39 How to spot the bad guy - and why people cover up abuse\n39:42 How to avoid a church cult - Summary \n40:19 Why do people cover up abuse?\n47:43 The biggest trauma occurs \n\nConnect with Dougie here: https://uk.linkedin.com/in/dr-dougie-marks-407a2030\n\nWe discuss the Church of England and how Archbishops cover up abuse, how church leaders can be abusive in the first place. We also talk about how to spot a  Church leader who is bad news and how to spot a toxic church, even the one you might be attending.\n\nPlease seek help if this challenges you or upsets you. We cover big issues.\n\n**\nPlease do get in touch as all the emails I receive are incredibly encouraging. Sorry for the missing camera angle - the focus was well off so it\u0027s just one camera for this video - sorry.",
      "release": "2024-12-23T11:12:07Z",
      "duration": "00:52:30",
      "explicit": false,
      "youTubeId": "X9oePyNsXOI",
      "subjects": [
        "Church Of England",
        "Cult Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=X9oePyNsXOI"
      }
    },
    {
      "id": "9c9c43ff-d31e-4af0-9520-c50b5500840f",
      "title": "Unpacking Religious Trauma, Abuse, the Church, different faiths and what\u0027s coming up",
      "description": "I\u0027m going to be unpacking Religious Trauma, Abuse, the Church, different faiths over the next few weeks .\n\nHere\u0027s a quick update about what\u0027s coming up, why I\u0027m doing this and why I need you.\n\nNavel-gazing becomes pretty boring pretty quickly - so I\u0027m meeting loads of really interesting people and planning interviews all over the place, learning about them and their stories.\n\nThis channel is about learning from the past and looking to the future, whilst hopefully enjoying the present. Please Subscribe!",
      "release": "2024-12-15T10:50:09Z",
      "duration": "00:03:51",
      "explicit": false,
      "youTubeId": "u4igG3cKXGI",
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u4igG3cKXGI"
      }
    },
    {
      "id": "9f1c97a7-41ab-43b5-bffd-5a82a9ca8330",
      "title": "Justin Welby looked more like a politician than a priest - and thank you!",
      "description": "I\u0027ve been overwhelmed this weekend by everyone\u0027s response to the videos I\u0027ve made. I wanted to make a video that was vaguely more exciting than just looking at my \u0027boat race\u0027, so I thought I\u0027d take you on my local dog walking route.\n\nLike so many, I\u0027ve been so disappointed by how the C of E has dealt with the confirmed abuse cases and continues to respond appallingly. My little experience with Soul Survivor started me on this road, but since speaking with people involved with the abusers Fletcher and Smyth - I cannot even begin to recognise how self serving the Church of England has become. I still cannot understand why Justin Welby cannot simply put videos out himself with his comms team rather than speak to Channel 4 and behave more like a trust-losing politician than a loving and serving leader of the church... it really should be that simple!",
      "release": "2024-11-11T14:53:32Z",
      "duration": "00:06:04",
      "explicit": false,
      "youTubeId": "72qncnF1ONo",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=72qncnF1ONo"
      }
    },
    {
      "id": "af3683b0-7550-4d4e-9c6e-3002a7484492",
      "title": "Adult Grooming: A Disease within the Evangelical Church",
      "description": "As I continue to think about my church experience and speak with others who\u0027ve been victim to abusers, cult-like churches and very destructive environments, I wondered if the \u0027safe\u0027 evangelicals in the Church of England actually has built a culture of adult grooming.\n\nI\u0027d love to hear what you think, but once again, this video is the result of a bunch of conversations with lots of very lovely people.\n\nMy aim to make a documentary about some of these subtle nuances have been put to bed as I don\u0027t believe there is the audience but I do think YouTube is worth continuing with. Please get in touch if you\u0027d like to be involved at mascotfilms.com\n\nWhat is the future for Evangelicals?\nEvangelicals in the US\nEvangelicals and Trump?\nEvangelicals right politics\nEvangelicals and the USA\nEvangelicalism Future?",
      "release": "2024-11-04T12:35:22Z",
      "duration": "00:11:16",
      "explicit": false,
      "youTubeId": "uriU63Sr_Y4",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uriU63Sr_Y4"
      }
    },
    {
      "id": "c488bdaf-7ad3-42fb-9155-c27f68c291cd",
      "title": "Christianity: Soul Survivor Church, Charismatic Evangelical hurts people Rant",
      "description": "It has been 13 months since I learned that I wasn\u0027t the only person that had an odd experience as a fee paying gap year student at Soul Survivor with Mike Pilavachi 25 years ago. \n\nAfter speaking with countless victims of abuse from churches and christian organisations, those involved haven\u0027t wanted to speak with me. \n\nI\u0027m moving from looking at Soul Survivor to the entire Evangelical Charismatic and Church of England  ( C of E) that threw a veil over the abuse those with responsibility were aware of.",
      "release": "2024-05-02T14:32:11Z",
      "duration": "00:04:16",
      "explicit": false,
      "youTubeId": "UsC6GvCLM_8",
      "subjects": [
        "Evangelicalism",
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UsC6GvCLM_8"
      }
    },
    {
      "id": "5235dbf0-7999-46a5-b1d3-3274a0eff334",
      "title": "Mike Pilavachi, Soul Survivor, the C of E and it\u0027s \u0027retirement-village\u0027 like impact on the world",
      "description": "Those who don\u0027t speak about past failings are part of the problem.\nSoul Survivor, Mike Pilavachi and the larger church will get along just fine with it\u0027s \u0027retirement-village\u0027 like impact on the world as all those involved remain silent and cowardly. \n\nThe Church of England ( Cof E ) and the Anglican Church.",
      "release": "2023-09-22T17:09:36Z",
      "duration": "00:03:33",
      "explicit": false,
      "youTubeId": "Hc9cHOXTDGA",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Hc9cHOXTDGA"
      }
    },
    {
      "id": "a0f59759-a9c8-4150-a99e-1b6523f54067",
      "title": "Soul Survivor [rant] conversation and how we got it so wrong",
      "description": "Ongoing thoughts around Soul Survivor, Mike Pilavachi and how the church has got it so wrong.\n\nSorry I forgot to grade it and uploaded it in low quality. Rushed it.",
      "release": "2023-06-12T19:44:10Z",
      "duration": "00:06:48",
      "explicit": false,
      "youTubeId": "Fey0AAsCTfU",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Fey0AAsCTfU"
      }
    },
    {
      "id": "f69305af-f693-455b-a358-fd238b5c4ecf",
      "title": "Soul Survivor Fallout - Freedom",
      "description": "Soul Survivor, Mike Pilavachi and my response. \nPlease find more at Twitter @samhowson",
      "release": "2023-06-12T14:38:04Z",
      "duration": "00:02:35",
      "explicit": false,
      "youTubeId": "rie52-IhFik",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rie52-IhFik"
      }
    },
    {
      "id": "d16b083e-3476-43bd-9e7c-a07b0810aa7c",
      "title": "Mike Pilavachi \u0026 Soul Survivor Experience",
      "description": "Mike Pilavachi and Soul Survivor experience.\n\nWe\u0027re making a documentary - please get in touch if you\u0027ve been personally affected by Pilavachi.\n\nmascotfilms.com",
      "release": "2023-05-25T13:47:24Z",
      "duration": "00:04:25",
      "explicit": false,
      "youTubeId": "7JzLvWlEFf0",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7JzLvWlEFf0"
      }
    }
  ]
}