{
  "id": "0a605353-636f-4c00-a877-18c654aa53f7",
  "name": "Sarah Stephanie Landry",
  "youTubeChannelId": "UCY6_zUajG2jsIfghOB_YNkA",
  "youTubePlaylistId": "PL7ZZcihngN-x2IW_FVVaaFTlczwBpFOVv",
  "episodes": [
    {
      "id": "1cea1ebb-0022-4805-b670-861a4ad8245a",
      "title": "Criminalize Coercive Control and Free Cult Victims, One and All. A Talk with Chris Shelton",
      "description": "A conersation about mind control, and the sick ways in which predators prey on those of us most vulnerable, and least likely to put up a resistance. Chris Shelton, renowned atheist and critical thinker, breaks down the importance of activating the centres of the brain, (which, thanks to Mayim Bialik, I know to be called the striatal neuro circuitry,) that are rewarded by doing the right thing at all costs, rather than the socially convenient and easy thing to which we are conditioned.",
      "release": "2024-05-24T22:24:45Z",
      "duration": "01:34:45",
      "explicit": false,
      "youTubeId": "HevK1N2hSIo",
      "subjects": [
        "Legislation",
        "Nithyananda",
        "Scientology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HevK1N2hSIo"
      }
    },
    {
      "id": "076686b5-0d28-4200-8326-01a8d3d26eba",
      "title": "\u0022The gurukul kids were beaten.\u0022 Talking to Sofija about Her Time in the Nithyananda Cult",
      "description": "Thanks for tuning in to today\u0027s video. If I seem a little unprepared for the interview, it\u0027s because I was! Prior to filming, due to a funny little miscommunication, I thought Sofija was going to interview me for her channel! (Oops!) This was conducted basically blind, without my knowing anything about her prior to this Zoom call. If there\u0027s anything more you\u0027d like to know, from Sofija or myself, please let us know in a comment.\n\nI continue to publish content like this out of contempt for the Bidadi and Ramnagara police, through whom I attempted to file an FIR against the child abuse in the Nithyananda cult. They refused, and instead, allowed Nithyananda to bribe them, through the lawyer, via Achalananda Swami. This is not acceptable in my world. We have enough witnesses and direct victims now willing to speak; Interpol, FBI, CIA and all affected world police will soon zero in on the murderer, rapist, absconded fraud who dares to call himself Nithyananda, whom I call instead Mithyananda, delusional temporary silliness, not bliss.",
      "release": "2024-05-05T00:54:49Z",
      "duration": "01:14:10",
      "explicit": false,
      "youTubeId": "c9b9JoGBJpo",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c9b9JoGBJpo"
      }
    },
    {
      "id": "f33eeadf-faa9-4b7f-9915-e7a78a94693f",
      "title": "Whistleblowers are Not Demons! An Interview with Tyler Blackwell about Regaining Life After the Cult",
      "description": "Hi, and thanks for tuning in to todays video. In the cult of Nithyananda, Tyler was known as Sri Nithya Parantapananda. He\u0027s now back to reality and opened up about everything from the  restrictive conditions we lived in the aadheenam, to how even while living in the outside world, being surrendered to and following the fear-mongering instructions of Nithyananda was repressive.\n\nIf you\u0027d like to support my work (thanks!) I\u0027m on Patreon and Etsy:\n\nMy handmade jewelry:\nhttp://www.etsy.com/shop/TheArtofGems\n\nMy handmade journals and craft supplies:\nhttp://www.etsy.com/shop/ArtofGemsStationery\n\nPatreon:\nhttps://www.patreon.com/SarahStephanieLandry\n\nBook a Tarot Reading:\nhttps://www.wisio.com/Sarah_Stephanie_Landry",
      "release": "2022-06-17T23:57:46Z",
      "duration": "02:36:40",
      "explicit": false,
      "youTubeId": "-7E_w_sm7PA",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-7E_w_sm7PA"
      }
    },
    {
      "id": "d15b6c5c-070a-4de3-aeb9-2a8c87b8524c",
      "title": "My Daughter Joined a Cult: Exposing the Crimes of the Fraud Who Calls Himself Nithyananda",
      "description": "Hi, and thanks for tuning in! I\u0027m so impressed with the 3 part docuseries VICE India made about the fake \u0022guru\u0022 I\u0027ve been exposing online, that I felt compelled to make a video about it. If you have Discovery\u002B, definitely watch, under the category of true crime.\n\nYou can support my work in a few ways: through Patreon or by buying something pretty made by yours truly in my Etsy shop:\n\nEtsy Jewelry: http://www.etsy.com/shop/TheArtofGems\nEtsy Stationery: http://www.etsy.com/shop/ArtofGemsStationery\nPatreon: https://www.patreon.com/SarahStephanieLandry",
      "release": "2022-06-11T19:16:25Z",
      "duration": "00:24:14",
      "explicit": false,
      "youTubeId": "Kjt_UVNGD4M",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Kjt_UVNGD4M"
      }
    },
    {
      "id": "f0eb013b-ef86-4591-9827-f4abf7a03aaa",
      "title": "SHOCKING New Information About the Fraud Who Calls Himself \u0022Nithyananda\u0022 Revealed on Twitter!",
      "description": "Hi, and thanks for tuning in. If you have personally experienced the abuse in the cult of Nithyananda (or any other criminal organization) please report to your local authorities, and if you\u0027re in the USA, to the FBI or human trafficking watch groups. The forced labour, sex crimes including sextortion and child porn, as well as murders perpetrated by this fraud and his mafia cult need to stop. Thank you to all who are supportive of my work as a whistleblower, and the other brave victims who have come forward to tell the truth.\n\nThe Twitter accounts I recommend following, in no particular order, are:\nMine: @Sarah_S_Landry\nLanie\u0027s: @OviyaEscaped\nAnonymous escapees:\n@sby_steve\n@yeskapvelociti\n@EscapedNithyan1\n\nYou can help support my work in many ways. (Thank you in advance!) \n\nCheck out my Etsy jewelry:\nhttp://www.etsy.com/shop/TheArtofGems\n\nSupport my videos (including tarot readings, crystal healing and art videos) on Patreon:\nhttps://www.patreon.com/SarahStephanieLandry\n\nCheck out my stationery, handmade journal and craft shop:\nhttp://www.etsy.com/shop/ArtofGemsStationery\n\nBook a Tarot reading:\nhttps://www.wisio.com/Sarah_Stephanie_Landry",
      "release": "2022-05-24T04:22:44Z",
      "duration": "00:42:48",
      "explicit": false,
      "youTubeId": "U-ygdgBL1H0",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=U-ygdgBL1H0"
      }
    },
    {
      "id": "455e6e4d-568e-4b69-9763-30f0e99648a5",
      "title": "\u0022JUST MOVE ON WITH YOUR LIFE\u0022 is the WORST Advice to Give a Cult Survivor!",
      "description": "Hi, and thanks for tuning in! As a survivor of cult abuse and religious trauma by the fraud who calls himself \u0022Nithyananda,\u0022 I\u0027m often hit with comments like, \u0022Why don\u0027t you just move on with your life?\u0022 and \u0022Don\u0027t you know it\u0027s not healthy to dwell on your negative experiences.\u0022 This video is an answer to those who swallowed the toxic positivity pill, and are now trying to convince others to suppress their emotions, and enable criminals to keep hurting others.\n\nIf you appreciate this video and my others, consider supporting my channel on Patreon! It unlocks private content shared only there, printable art drawn and painted by me, and some mystical stuff like Tarot readings. https://www.patreon.com/SarahStephanieLandry\n\nThe jewelry I wear in this video, and my other pieces, are in my etsy shop! http://www.etsy.com/shop/TheArtofGems",
      "release": "2022-04-09T19:23:28Z",
      "duration": "01:23:32",
      "explicit": false,
      "youTubeId": "riZYsf-M-pQ",
      "subjects": [
        "Nithyananda",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=riZYsf-M-pQ"
      }
    },
    {
      "id": "899a20ff-3557-4cc5-b5b4-2bf08ae252a0",
      "title": "Debunking the Sex Swami: How Nithyananda Breaks ALL FIVE of His \u0022Sanyas Vows\u0022",
      "description": "Satya, Aparigraha, Asteya, Ahimsa and Brahmacharia... The fraud who calls himself \u0022Nithyananda\u0022 demands his sanyasis live up to these five vows when they take the \u0022sanyas\u0022 initiation into his monastic order. They translate to meaning Truthfulness, Renunciation, Non-Stealing, Non-Violence and Celibacy. Despite proclaiming himself to be a sanyasi, the fraud flagrantly breaks them ALL. In this video, I break down his hypocrisy with specific examples for each.\n\nIf you\u0027re enjoying my videos and want to support my work, consider becoming a patron on Patreon! You\u0027ll access exclusive content, include extended monthly readings, downloadable art drawn by me, an interactive inbox (that I actually check, unlike my other social medias) for private messaging and more. https://www.patreon.com/creator-home\n\nIf you like my jewelry, thanks! I made it! Request a custom order for something like the statement necklace I made here, or browse my collection. All the gems are natural, and it\u0027s my favourite way to support my \u0022real\u0022 (though unpaid!) job of exposing this cult. http://www.etsy.com/shop/TheArtofGems\n\nThe experts I recommended in this (and other!) cult exposure videos are Dr. Steven Hassan and Dr. Janja Lalich. Their work is empowering and comforting to anyone coming out of a high control group, like the one I escaped, or an abusive workplace or relationship.",
      "release": "2022-03-22T07:29:17Z",
      "duration": "01:13:10",
      "explicit": false,
      "youTubeId": "04si9B2I2es",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=04si9B2I2es"
      }
    },
    {
      "id": "5b2c0de4-a394-4909-8d60-c649d33fedcc",
      "title": "CULT RED FLAGS (Based on My Experience with the Fraud \u0022Nithyananda\u0022)",
      "description": "Hi and thanks for tuning in! I hope you\u0027re not actually in a cult, but if you are or feel you might be, don\u0027t worry, there\u0027s help available! The experts I mentioned in the video are linked below, and have helped many people escape toxic, high control groups like NXIVM, Scientology and more. \n\nThe podcast interview will be up by next week on The Order of Chaos channel. I\u0027ll put a link here as soon as it\u0027s available, or follow me on Twitter where I\u0027ll post the link, as well as share regular Nithyananda cult updates: https://twitter.com/Sarah_S_Landry\n\nDr. Steven Hassan, Cult Recovery and  Deprogramming expert who create the BITE Model to recognize mind control. (When a leader and / or group control your Behaviour, Information, Thoughts and Emotions.) He was recruited into the Moonies, which he was rescued and deprogrammed from, launching his decades long pursuit to help others do the same.  https://freedomofmind.com\n\nDr. Janja Lalich, another leading expert in recovery from cult abuse and trauma imbued by charismatic, authoritarian figures and groups. She got out of a feminist political cult, and has since established herself as a leader in the psychological community with expertise in all kinds of abusive sects. https://janjalalich.com/about/\n\nDr. Rachel Bernstein, a wonderful therapist who specializes in cult abuse and deprogramming.  She famously appeared in both Scientology and the Aftermath as a cult expert, and Seduced, the story of India Oxenberg\u0027s escape from NXIVM. https://rachelbernsteintherapy.com/index.html\n\nIf you like what I do, consider supporting my work over on Patreon! It\u0027s more new-agey with Tarot content, art printables and stuff, but I\u0027ll occasionally delve into cult stuff there, too: https://www.patreon.com/SarahStephanieLandry\n\nAnd last but not least, if you like my jewelry-thanks! I made it! Available here: http://www.etsy.com/shop/TheArtofGems",
      "release": "2022-03-17T05:18:19Z",
      "duration": "00:41:50",
      "explicit": false,
      "youTubeId": "FUn_QsTEGjU",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FUn_QsTEGjU"
      }
    },
    {
      "id": "ea6036dc-a37c-402b-9b58-6e76e2a080fe",
      "title": "Getting Her Power Back! Ivana Shares her Experience with the Fraud who Calls Himself \u0022Nithyananda\u0022",
      "description": "Thanks for tuning in! If you\u0027re watching this and feel ready to leave a controlling group, help is available. I highly recommend the book Mind Control Manual, as well as looking up Dr. Steven Hassan\u0027s \u0022BITE Model.\u0022 Also, reach out to doctors, psychologists and others who have gone through what you\u0027re going through. The community is extremely supportive and just waiting to welcome you back to reality. Ivana has deleted all of her social media, but asked me to pass on the message that she is happy to talk to anyone who left or is leaving Nithyananda sangha. If you DM me in Instagram, I\u0027ll pass your contact details to her.\n\nIf you\u0027d like to support the work I\u0027m doing, I\u0027d greatly appreciate it! You can buy me a coffee! (AKA- help pay my internet bill!) \nhttps://ko-fi.com/sarahstephanie\n\nOr,  if you\u0027d like a more personal connection,  join me on Patreon! (Heads up, though- it\u0027s more mystical over there, focusing on Tarot and Oracle, channeled art and crystal healing.) https://www.patreon.com/SarahStephanieLandry\n\nOr- check out the jewelry I make and sell on Etsy! http://www.etsy.com/shop/TheArtofGems",
      "release": "2022-02-20T04:11:12Z",
      "duration": "03:00:17",
      "explicit": false,
      "youTubeId": "eBktggo9KuY",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eBktggo9KuY"
      }
    },
    {
      "id": "231e039c-c80c-4ebb-ae90-f343cea5e3f7",
      "title": "Escaping Nithyananda: Lanie Talks About the Cult, Following the Fraud to Ecuador and Getting Out",
      "description": "In this interview, my friend Lanie, who was \u0022Ma Nithya Oviyananda,\u0022 shares her story of getting recruited into the Nithyananda cult, ignoring her intuition when she felt creeped out by the fraud \u0022guru,\u0022 and paying a huge fee for a program in India, becoming convinced she had to sell her house and move there, and what happened next... including a harrowing journey through South America with the absconded guru\u0027s entourage, cleaning up his mess in Ecuador, getting held captive in Trinidad, then finally breaking free.\n\nFor Dr. Steven Hassan\u0027s book and information about freeing yourself from mind control, please visit https://freedomofmind.com/cult-mind-control/bite-model/",
      "release": "2021-06-16T20:33:11Z",
      "duration": "03:45:33",
      "explicit": false,
      "youTubeId": "wP9wfC8p8iY",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wP9wfC8p8iY"
      }
    },
    {
      "id": "4b29f472-1323-4d87-8d74-b1c5fee880eb",
      "title": "What is True Spirituality with Steven Hodge, Whistleblower and Former Member of the Nithyananda Cult",
      "description": "In this video, I interview my good friend Steven Hodge, whom I met in India back when I was an avowed Hindu nun in the cult of Nithyananda. Steven was there to attend a $15,000 program, which quickly left him disillusioned. Expecting guidance from the \u0022master,\u0022 it was a bait and switch, and kids from the \u0022nithyananda gurukul\u0022 were put in charge of the participants. This created the perfect scene for Steven to interact with them one on one and realize something wasn\u0027t right in their residential school. In this discussion, he shares his views about enlightenment, spirituality and what\u0027s going wrong in the world of the fraud who calls himself Nithyananda. Next time we talk, we\u0027ll get into some specifics about the exact mind control methods used during the program he attended, and how he was able to wake others up and out of their brainwashed state.\n\nThe channel Steven started to help expose the cult can be seen here: https://www.youtube.com/channel/UCkc95HdB6XmnVW1xH9MiJ1A",
      "release": "2021-06-02T03:36:25Z",
      "duration": "01:17:12",
      "explicit": false,
      "youTubeId": "XN91LTHZnvs",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XN91LTHZnvs"
      }
    },
    {
      "id": "fd886fde-3929-4584-8ba2-7af81d4fd77e",
      "title": "Life After Nithyananda: Talking with Jordan about Moving On, Overcoming Attacks and Speaking Out!",
      "description": "Thanks for tuning in! Jordan and I were once followers of the fraud \u0022guru\u0022 who calls himself \u0022nithyananda.\u0022 It\u0027s been over a year since we last spoke about the abuse we experienced in his highly controlling cultic group, and in that time, we\u0027ve both been hit with ridiculous false accusations and slander by people who we once considered friends. What more have we learned since then? And why do we feel like now, it\u0027s more critical than ever to keep exposing the fraudster? Watch and see.",
      "release": "2021-05-03T02:58:35Z",
      "duration": "01:48:30",
      "explicit": false,
      "youTubeId": "e0fMxk4hn1o",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e0fMxk4hn1o"
      }
    },
    {
      "id": "b6730db5-3f60-45a6-a0aa-02f04d8114d0",
      "title": "Nithyananda Ordered Me to Attack Teal Swan: Abstract Watercolor Painting \u0026 SPIRITUAL DRAMA Storytime",
      "description": "A few years ago, when I was a devoted follower of a fake guru, he instructed me (and three of my friends) to research Teal Swan, and make videos exposing her for plagiarism. His exact words were, \u0022Make your video 80% facts, 20% personal attack.\u0022 As a dutiful disciple, I did what he told me to do. In this video, I share the back story of how I got caught up with the fraud in the first place, why I started my own YouTube channel, and what my research revealed about Teal. Am I sorry that I went after her? Well... I\u0027m more sorry I ever followed the fraud who calls himself Nithyananda in the first place. \n\nWhile sharing this story, I show my latest abstract watercolour painting, at 6x the speed. Apparently, I should have probably only sped it up to triple speed, because, well, I had more sh*t to say, lol. \n\nIf you liked this video, please Like, Subscribe and hit the notification bell!\n\nMy Patreon page is: https://www.patreon.com/SarahStephanieLandry\nMy Etsy store is: http://www.etsy.com/shop/TheArtofGems\n\nAnd the channel I mentioned towards the end of the video is Andey Fellowes, a former follower of Teal Swan who now makes videos about critical thinking and against getting swept up in new age manipulations: https://www.youtube.com/user/AndeyTheFellowes",
      "release": "2020-05-03T01:21:40Z",
      "duration": "00:57:38",
      "explicit": false,
      "youTubeId": "UVLcFJOyC3c",
      "subjects": [
        "Nithyananda",
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UVLcFJOyC3c"
      }
    },
    {
      "id": "9733c8da-a2bf-401b-bb3c-fed36b9e3a06",
      "title": "Interview with Jordan Lozada about the Abuse He Experienced and Witnessed in the NITHYANANDA CULT",
      "description": "After 8 months out of the cult, Jordan Lozada, who many knew as \u0022Sri Nithya Dhatananda Maharaj\u0022 is speaking out about the sexual abuse he endured by the fraud guru called \u0022Nithyananda,\u0022 as well as the child abuse he witnessed in the cult and more.\n\nThe ebook we mention that helped us both deprogram from the cult brainwashing can be found here: https://www.decision-making-confidence.com/mind-control-manual.html\n\nThe jewelry I\u0027m wearing can be found in my Etsy shop. Mention this video, and I\u0027ll include TWO surprise free gifts with purchase: http://www.etst.com/shop/TheArtofGems\n\nThe scriptural references Jordan made about the fraudulent guru are described in depth here: https://www.youtube.com/watch?v=f0Z9xMihKwg\u0026t=864s\n\nMy Patreon account is here. Thanks to those who support! This makes it possible for me to keep devoting time to these videos, and I post regular exclusive updates there: https://www.patreon.com/SarahStephanieLandry",
      "release": "2020-02-07T19:38:48Z",
      "duration": "01:50:39",
      "explicit": false,
      "youTubeId": "U8EsnY4BQ8o",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=U8EsnY4BQ8o"
      }
    },
    {
      "id": "98e19403-943a-43f0-b965-f8e53abbf34b",
      "title": "PROOF - Nithyananda Fabricated The Story of Having Been Coronated by Sri Sathya Sai Baba as \u0022AVATAR\u0022",
      "description": "Find Out Why Nithyananda\u0027s Team Removed an incriminating page of PROOF of Fraud from his Kailaasa.org website. Find proof that he is NOT an \u0022Avatar\u0022 In this video.",
      "release": "2019-12-16T02:14:22Z",
      "duration": "00:06:33",
      "explicit": false,
      "youTubeId": "a_ACb9OstoA",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=a_ACb9OstoA"
      }
    },
    {
      "id": "dcd3378a-ede8-4fb3-b2ac-d34529fa7688",
      "title": "Leaving the Nithyananda Cult with Former \u0022Brahmacharini\u0022 (female monk) Maritza",
      "description": "Check out Maritza\u0027s art and inspirational content on her Instagram @eternaldivinebeing \n\nAnd while you\u0027re at it, here\u0027s my Etsy shop: http://www.etsy.com/shop/TheArtOfGems (mention the video and get a free Herkimer Diamond and a free piece of Obsidian!)",
      "release": "2019-12-16T01:25:26Z",
      "duration": "01:16:26",
      "explicit": false,
      "youTubeId": "t7Y5hRL7PxY",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=t7Y5hRL7PxY"
      }
    },
    {
      "id": "381466e1-89cd-45e3-b11c-9d5a09230d90",
      "title": "Massive Embarrassment For Sonia, Wanted Votes From Sex Offender? | The Debate With Arnab Goswami",
      "description": "Republic TV is India\u0027s no.1 English news channel since its launch. It is your one-stop destination for all the live news updates from India and around the world. Republic TV makes news accessible for you at your convenience, at all times and across devices. At Republic we keep you updated with up-to-the-minute news on politics, sports, entertainment, lifestyle, gadgets and much more. \n\nWe believe in Breaking the story and Breaking the Silence. But most importantly, for us ‘You Are Republic, We Are Your Voice.’\n\nAlso, Watch ► \nRepublic TV Live News Updates ►http://bit.ly/RepublicTVLiveNews\nThe Debate With Arnab Goswami ► http://bit.ly/TheDebateWithArnabGoswami\nPatriot With Major Gaurav Arya ► http://bit.ly/PatriotFullEpisodes\nExclusive Sunday Debate With Arnab Goswami ► http://bit.ly/SundayDebate\nCheckmate With Major Gaurav Arya (Retd.) ► https://bit.ly/3EtPj0s\nThe Grand Strategy With Maj Gen G.D Bakshi (Retd) ► https://bit.ly/3EPZ6xF\nR.Explained ► https://bit.ly/3sOLT5K\nR.Uninterrupted ► https://bit.ly/34isZdh\n\nYou can stay connected with Republic TV on -\n\nFacebook - https://www.facebook.com/RepublicWorld\nTwitter - https://twitter.com/republic\nWebsite - https://www.republicworld.com\nInstagram: https://www.instagram.com/republicworld\n\n#republictv #republicworld #republictvlive #englishnews #news #arnabgoswami #arnabgoswamilive #arnabdebates #nationwantstoknow",
      "release": "2019-11-23T21:13:56Z",
      "duration": "00:40:41",
      "explicit": false,
      "youTubeId": "rgaH5JBwseg",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rgaH5JBwseg"
      }
    },
    {
      "id": "f0dcd0c4-a928-4863-86eb-44db2aea5545",
      "title": "Nithyananda WARNING - dangers of NITHYANANDA criminal activities including rape, murder, child abuse",
      "release": "2019-11-14T19:14:54Z",
      "duration": "00:24:31",
      "explicit": false,
      "youTubeId": "vcvYAF218jo",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vcvYAF218jo"
      }
    },
    {
      "id": "7c7c3d6f-481e-4a5c-a981-4c4ab681ec25",
      "title": "OUT of the CULT: Federico Shares His Experiences of Black Magic and Forced Labour with Nithyananda",
      "description": "Check out Federico\u0027s videos on his channel: https://www.youtube.com/user/FedericoMichel\n\nThe group  video mentioned in our interview is here:\nhttps://www.youtube.com/watch?v=N3SYG0wNfHk\u0026feature=youtu.be\u0026fbclid=IwAR3EbaVxt0_jD5cerGH349_7MlLewi_SiwdV3fF85rpQ3BEHQxUKUUbwmnQ",
      "release": "2019-11-08T22:47:38Z",
      "duration": "01:40:28",
      "explicit": false,
      "youTubeId": "HXGVTPGJS-I",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HXGVTPGJS-I"
      }
    },
    {
      "id": "a197ce3e-eca0-4732-b697-8afab9998a1f",
      "title": "Escaping the Cult of Nithyananda: Marion Braun Opens Up about Being Brainwashed",
      "description": "In this video, Marion Braun speaks for the first time about how she got ensnared in the Nithyananda Cult, how her time with the false master nearly destroyed her family and cost her life savings, and finally, how she got out.",
      "release": "2019-11-04T07:00:03Z",
      "duration": "01:43:37",
      "explicit": false,
      "youTubeId": "rmzjW-vkC2Y",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rmzjW-vkC2Y"
      }
    },
    {
      "id": "cbdf876e-3300-4e3f-8ee0-323b43cb95b9",
      "title": "Brainwashed by Nithyananda   \u0022WHAT THE FUCK\u0022 is the INDIAN  GOV doing to stop this  EVIL GANGSTER ?",
      "description": "Video from Sarah Landry ....Nithya as a SEX PREDATOR\nhttps://www.youtube.com/watch?v=nQKFCDuIuNg\u0026lc=z23zdztrxqndzfkhm04t1aokg4cktsxi440tvx0hgq34bk0h00410.1570590411992282\nhttps://www.youtube.com/watch?v=nQKFCDuIuNg\u0026lc=z23zdztrxqndzfkhm04t1aokg4cktsxi440tvx0hgq34bk0h00410.1570590411992282\nSARAH INTERVIEWS WITH RON MISCAVIGE  PART 1 \nhttps://www.youtube.com/watch?v=qt2kUSHPxnw\nSARAH INTERVIEWS WITH RON MISCAVIGE  PART 2\nhttps://www.youtube.com/watch?v=_I0HsfSSOR8",
      "release": "2019-11-03T03:45:08Z",
      "duration": "00:13:21",
      "explicit": false,
      "youTubeId": "q5ZSSewTZwk",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=q5ZSSewTZwk"
      }
    },
    {
      "id": "5fe6f57b-4adb-4296-9e6a-07955b992aba",
      "title": "Ex-Devotee Attempts To Rescue His Children From The Nithyananda Cult Compound in Gujarat",
      "description": "Find Out Just How Simple It Is To Get Your Kids Out Of The Nithyananda Cult Organization. Why is Stockholm Syndrome Extremely Dangerous?",
      "release": "2019-11-03T01:58:37Z",
      "duration": "00:16:54",
      "explicit": false,
      "youTubeId": "E0trDHFedBI",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E0trDHFedBI"
      }
    },
    {
      "id": "870fe175-85da-4138-be52-e0c5c4c5b075",
      "title": "Brainwashed by Nithyananda: (Response Video and how I almost fell into this spiritual cult trap)",
      "description": "Sharing my journey with Nithyandanda as I almost fell into this trap back in 2017 for a couple of months. THankfully my discernment heightened and was able to see it for what it truly was and couldn\u0027t manifest the funds to get to Inner Awakening!!\n\nStay discerning and thanks to Sarah and all the BRAVE souls out there speaking out and sharing their truth!\n\n#Nithyananda #cults #discernment",
      "release": "2019-11-02T23:40:45Z",
      "duration": "00:16:38",
      "explicit": false,
      "youTubeId": "T3iD4O4G-zk",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T3iD4O4G-zk"
      }
    },
    {
      "id": "f6264888-a6eb-4a29-b5ee-707208fa8666",
      "title": "Nityananda Rape Case - Aarthi Rao\u0027s English Interview - Suvarna News",
      "description": "SUVARNA NEWS 24X7 - http://www.suvarnanews.tv",
      "release": "2019-11-02T23:38:58Z",
      "duration": "00:23:58",
      "explicit": false,
      "youTubeId": "UdxrDH0iKxQ",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UdxrDH0iKxQ"
      }
    },
    {
      "id": "3aead96b-b90c-4263-91c8-68b9fb89ad87",
      "title": "Nithyananda has bizarre mental breakdown over cult accusation",
      "description": "Are these the words of an enlightened guru or saint? Should we compare this guy to Shiva or Jesus? Should we pay $15,000 USD for him to open our third eye? \n\nSneaking into his ashram\nhttps://youtu.be/t9QVn--acOw\n\nSarahs Video - Nithyananda Cult Q\u0026A: Is the guru a Sexual Predator? Is he violent?\nhttps://www.youtube.com/watch?v=nQKFCDuIuNg\n\nYou can read his public meltdown on his verified Facebook page\nhttps://www.facebook.com/photo.php?fbid=1418126968342298\u0026set=pcb.1418130291675299\u0026type=3\u0026theater\n\n*IN HINDU TRADITION, THERE ARE DIFFERENT LEVELS OF LOGIC. THE WESTERN LOGIC KNOWS ONLY LENGTH, BREADTH, DEPTH - THREE DIMENSIONS OF LIFE. IN HINDU TRADITION, WE KNOW MULTI-DIMENSIONS. SO, OUR LOGIC IS ALSO VERY EVOLVED TO EXPLAIN MULTIDIMENSIONAL REALITY. SANKHYA IS MULTIDIMENSIONAL LOGIC. NYAAYA IS VERTICAL TIME ZONE LOGIC. VAISHESHIKA IS HIGHER TIME ZONE, HIGHER SPACE, HIGHER DIMENSIONS LOGIC\n\n\n*ALL THESE TROLLS, THE WAY THEY PUT THE VIOLENT COMMENTS, THESE FELLOW SHOULD BE CALLED AS VIOLENT MASTURBATORS. WHEN A PERSON IS NOT ABLE TO SEXUALLY CONTROL HIMSELF, HOW THEY MASTURBATE, SOMEONE WHEN THEY ARE NOT ABLE TO CONTROL THEIR ANGER, THEY DO THIS VIOLENT VOMITING MASTURBATING. IN THEIR ANGER AND VIOLENCE, THEY DON’T KNOW WHAT TO DO, THEY TYPE COMMENTS AND COLLAPSE!\n\n*THE TROLLS SHOULD KNOW, NEITHER THE CELEBRITIES THEY USE FOR SEXUAL MASTURBATION NOR VIOLENT MASTURBATION ARE GOING TO BE AFFECTED, THEY ARE GOING TO BE PART OF HISTORY. BUT YOU ARE NOT GOING TO BE PART OF HISTORY. YOU ARE JUST GOING TO MASTURBATE AND DIE. SO STOP THIS STUPIDITY. DO SOMETHING USEFUL FOR YOURSELF AND TO THE WORLD.\n\n\n\n*I AM READING OUT THE COSMIC SOFTWARE. A COMMON MAN CAN NEVER UNDERSTAND THE COMPUTER SOFTWARE, BUT IT WORKS, SO YOU JUST HAVE TO FOLLOW. SAME WAY, A COMMON MAN DOES NOT HAVE TO UNDERSTAND WHAT NITHYANANDA SPEAKS, BUT IT WORKS. SO YOU HAVE TO FOLLOW, IF YOU WANT IT. YOU CANNOT SAY, “I DON’T KNOW HOW TO READ THE SOFTWARE, SO ALL THESE ARE LIES” FOOLS!\n\n\n\n*THE GURUKUL WITHSTOOD SO MANY VARIETIES OF ATTACKS: FATHER EDWARD THOMAS, THE RACISTS CALLING US CULT, THEN MEDIA ATTACK, THEN LAWFARE TRYING TO SHUT IT DOWN THRU COURT CASES, THEN CHILD ABUSE FALSE ACCUSATION, THEN SOME GANG TRYING TO BE PART OF THE GURUKUL…. NEGOTIATING WITH ME, “IF MY STRATEGY IS APPLIED, THE GURUKUL IS RIGHT, OTHERWISE I WILL TRY TO PULL IT DOWN.” I HAVE SPECIAL WORDS FOR THEM. DASH, DASH, DASH… FILL IT!\n\n*I HAVE SEEN ALL KINDS OF BLACKMAILERS, ALL KINDS OF EXPLOITERS, ALL KINDS OF THUGS, ROWDIES, THIEVES…FORTUNATELY, PARAMASHIVA’S, PARASHAKTI’S GRACE, MAHAKALABHAIRAVA AND MAHAKALI ARE PROTECTING ME AND THE GURUKUL. THAT IS WHY IT IS FLOURISHING ALL OVER THE WORLD.\n\n\n*NOBODY CAN DESTROY HINDUISM BY CALLING HINDUISM “CULT”. NEITHER HINDUISM IS CULT NOR NITHYANANDA SANGHA IS CULT. NITHYANANDA SANGHA IS HINDUISM. HINDUISM IS THE LEGITIMATE OLDEST RELIGION.\n\n*I AM HAPPY EXTERNAL THUGS AND INTERNAL THUGS HAVE LEFT AND THE SANGHA IS FREE TO EXPAND. IT IS TIME WE START THE SINCERE ENRICHING AND CAUSING.",
      "release": "2019-11-02T23:38:21Z",
      "duration": "00:15:53",
      "explicit": false,
      "youTubeId": "1jKfz3T99D0",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1jKfz3T99D0"
      }
    },
    {
      "id": "cf382341-ed30-4c5d-9b17-f2e5c0ab5539",
      "title": "Nithyananda Cult Exposed | Part 2",
      "description": "Nithyananda Cult Exposed | Part 2 • Here is part 2 of my in depth story of  surviving the Nithyananda cult I got caught up in for three and half years! Please, if you ever heard about this guru, this is a very dangerous cult. Stay away, this is a warning. He has destroyed many lives! I am finally in the right space to speak up against this cult leader. \n\nI am calling on all light workers, my hindu brothers and sisters, yogi\u0027s, christian friends, my muslim brothers \u0026 sisters, even my atheist friends and all my family. Please send your prayers, hold space, warn your friends and send love and light to all who are still brainwashed and trapped in this cult for their safe return and for the children who took beatings, we also pray for their safety. \n\nWe are dealing with a tyrant who has been getting away with many atrocities. This is a serious matter. Please spread this far and wide. This organisation is nasty, if anyone speak up against them they fabricate many lies to discredit and even go as far as death threats. So please be careful and help me warn as many as possible so we can put an end to this now once and for all. \n\nThis has to stop! \n\nhttps://youtu.be/nQKFCDuIuNg\n\nhttps://youtu.be/XsnxFh1orY4",
      "release": "2019-11-02T23:38:03Z",
      "duration": "00:25:55",
      "explicit": false,
      "youTubeId": "v3FNHIlPCIA",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=v3FNHIlPCIA"
      }
    },
    {
      "id": "4068edeb-9159-4fe9-9129-1987bfbdf058",
      "title": "Nithyananda Cult Exposed | Part 1",
      "description": "Nithyananda Cult Exposed | Part 1 • Here is part 1 of my in depth story of  surviving the Nithyananda cult I got caught up in for three and half years! Please, if you ever heard about this guru, this is a very dangerous cult. Stay away, this is a warning. He has destroyed many lives! I am finally in the right space to speak up against this cult leader. \n\nI am calling on all light workers, my hindu brothers and sisters, yogi\u0027s, christian friends, my muslim brothers \u0026 sisters, even my atheist friends and all my family. Please send your prayers, hold space, warn your friends and send love and light to all who are still brainwashed and trapped in this cult for their safe return and for the children who took beatings, we also pray for their safety. \n\nWe are dealing with a tyrant who has been getting away with many atrocities. This is a serious matter. Please spread this far and wide. This organisation is nasty, if anyone speak up against them they fabricate many lies to discredit and even go as far as death threats. So please be careful and help me warn as many as possible so we can put an end to this now once and for all. \n\nThis has to stop! \n\nhttps://youtu.be/nQKFCDuIuNg\n\nhttps://youtu.be/XsnxFh1orY4",
      "release": "2019-11-02T23:37:51Z",
      "duration": "00:34:00",
      "explicit": false,
      "youTubeId": "qQ5AM1WxIKE",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qQ5AM1WxIKE"
      }
    },
    {
      "id": "22090903-f746-4461-963c-2a7a778d6967",
      "title": "Nithyananda Cult Q\u0026A: Is the guru a Sexual Predator? Is he violent? Are materialized diamonds real?",
      "description": "Thank you for tuning in. In this video, I honestly answer questions about Nithyananda\u0027s sexual abuse for the first time, plus, address comments left about his cult regarding child abuse, violence, fake materialization, money scams and more. (To see screen shots of all the comments mentioned, check out my Facebook post.)",
      "release": "2019-11-02T23:36:39Z",
      "duration": "00:51:11",
      "explicit": false,
      "youTubeId": "nQKFCDuIuNg",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nQKFCDuIuNg"
      }
    },
    {
      "id": "05716350-dbcb-479f-a4eb-bdaa2869cb32",
      "title": "Deeper Analysis of Cult Leader Nithyananda Love Bombing",
      "description": "In this unlisted video, I go into deeper detail of all the messages sent to me in early March of 2018 when I was going to drop out of the cult of Nithyananda. This is a two day chat in which he successfully pulled me back in to his cult through guilting me, by referring to himself as an \u0022orphan,\u0022 by promising me grandiose positions and telling me he thought I would be \u0022the first enlightened face\u0022 of his sangha, and that he wanted to make me \u0022mahamandaleshwar.\u0022 This is typical behaviour from a narcissist trying to manipulate someone into their web.",
      "release": "2019-11-02T23:36:21Z",
      "duration": "00:35:48",
      "explicit": false,
      "youTubeId": "_UVIm7DEWNI",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_UVIm7DEWNI"
      }
    },
    {
      "id": "1b5b9ce3-739d-4c1b-b64d-2bbf15be46c5",
      "title": "Taking her Life Back: Joanna Spent 14 Years \u0026 $130,000 on Nithyananda, Now She\u0027s Speaking Out!",
      "description": "When I met Joanna, her name was Ma Nithyananda Geetapriya, and she was the yoga teacher at his Life Bliss Centre in Vancouver. This is her first interview since leaving his organization, and in it, she shares the story of how she fell into his trap, what it was like living as his devotee for 14 years, despite her family\u0027s lack of desire to join, how she got out, and what she\u0027s discovered since leaving.",
      "release": "2019-11-02T23:35:55Z",
      "duration": "01:53:55",
      "explicit": false,
      "youTubeId": "HCcm2SBCBJs",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HCcm2SBCBJs"
      }
    },
    {
      "id": "31d687f1-9265-489f-bd4b-0b330173f019",
      "title": "Sneaking into the Nithyananda cult in India",
      "description": "After hearing about the third eye awakenings and child abuse happening by Nithyananda, I was intrigued to see what was actually going on in the ashram in Bangalore, India! I went to visit the ashram but they wouldn’t let me in! I tried telling them I had a friend there but they only let me go behind the gate.\n\n\nMy experience here -\nThe man at the gate and people behind the gate were very respectful and treated me nicely. The man behind the gate did not accept our bribe and instead called the main office, whom let me inside. This is no way a reflection or attack on their character or practice. I actually feel bad for including them in the video but also want to share my experience authentically. This is simply my blunt opinion about the ashram, it\u0027s supernatural claims and courses. \n\n\nVIDEOS - \nSarah\u0027s video about child abuse and her time in the \u0027cult\u0027\nhttps://www.youtube.com/watch?v=XsnxFh1orY4\n\nThird eye catch\nhttps://youtu.be/9hdAfDrJN8I\n\nNithyanada devotees give abuses for abusing \nhttps://www.youtube.com/watch?v=dRW3YD496Dw\n\nMORE INFO\nhttps://nithyananda-cult.blogspot.com/2019/09/sarah-landry-starts-to-squeal-against.html#comment-form_5376076632412181707\n\nVishuddha Das master meditation in a week book\nhttps://www.amazon.in/Vishuddha-Das/e/B07HNX5N8C?ref_=dbs_p_ebk_r00_abau_000000\n\nUSE MY AIRBNB LINK FOR A $40 CREDIT!\nhttp://www.airbnb.com/c/dakotaw246\n\nUSE MY BOOKING.COM LINK FOR $25 CREDIT\nhttps://www.booking.com/s/32_8/6452dff7\n\nPLEASE SUPPORT THESE VIDEOS WHILE IM TRAVELING AND BUY A SHIRT\nUse code \u0022APLACEFORHUMANS\u0022 for 10% off\nhttp://www.stayhappystayweird.com\n\nFOLLOW ME -\nhttp://www.instagram.com/dakotawint\nhttp://www.twitter.com/dakotawint\nhttp://www.facebook.com/dakotawint",
      "release": "2019-11-02T23:35:13Z",
      "duration": "00:33:20",
      "explicit": false,
      "youTubeId": "t9QVn--acOw",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=t9QVn--acOw"
      }
    },
    {
      "id": "c58b0038-2a1d-4336-a0a4-e1ae9582d3c7",
      "title": "Nithyananda Cult Talk: Ex-Leader Shares Her Experiences of Verbal Abuse, Sleep Deprivation and More",
      "description": "My dear friend was once called Ma Nithya Priyaswarupananda by the cult leader Nithyananda. He made her the head of his organization\u0027s Slovakian branch, and she oversaw many other countries as well. While with the cult, she experienced mental, emotional and physical abuse that led to total burnout. She\u0027s now vibrant and happy, and ready to speak out.\n\nIf you have been hurt by the Nithyananda Cult, you\u0027re welcome to join the Facebook group Nithyananda Cult Survivors Official.",
      "release": "2019-11-02T23:34:54Z",
      "duration": "01:30:03",
      "explicit": false,
      "youTubeId": "iDv78FRPoy0",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iDv78FRPoy0"
      }
    },
    {
      "id": "0ae46373-1e49-4845-a152-478c1c0ca1c2",
      "title": "Nithyananda Cult Exposed: Emperor of Lies and Deceit",
      "release": "2019-11-02T23:34:37Z",
      "duration": "00:09:48",
      "explicit": false,
      "youTubeId": "TsilTlYDzoA",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TsilTlYDzoA"
      }
    },
    {
      "id": "859d2e13-3134-4bb1-8a2d-f04f78d8bc76",
      "title": "Nithyananda Cult Exposed: Interview with ex- adheenavasi Ana Arechiga | Part 3 [Jai Kali Ma]",
      "description": "Character assassination for speaking publicly about the truth of who he really is. \n\nEDIT: I have to apologize I got the part wrong about Lenin going to jail for false rape allegation. It was in fact Vinay Baradwaj one of the original whistle blowers who went to jail for three years for false rape charges by Sadashivapriya. It happened while he was in the U.S.A.",
      "release": "2019-11-02T23:33:57Z",
      "duration": "00:34:22",
      "explicit": false,
      "youTubeId": "RzGVzdom9YI",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RzGVzdom9YI"
      }
    },
    {
      "id": "38dea897-a9d7-4911-b9e9-37e5e20faa11",
      "title": "Nithyananda Cult Exposed: Interview with ex-adheenavasi Ana Arechiga | Part 2",
      "description": "In part 2 of this interview: Exposing Nithyananda\u0027s cyber relationship with Parvati Shakthikananda.",
      "release": "2019-11-02T23:33:44Z",
      "duration": "00:47:10",
      "explicit": false,
      "youTubeId": "TwvZbxHne4c",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TwvZbxHne4c"
      }
    },
    {
      "id": "da181f48-5476-4312-ba21-0e848287cca0",
      "title": "Nithyananda Cult Exposed: Interview with ex-adheenavasi Ana Arechiga | Part 1",
      "description": "Ex-adheenavasi (resident of the ashram) Ana Arechiga met and joined this cult only to find out the bitter truth of Nithy\u0027s false personification of Lord Shiva.",
      "release": "2019-11-02T23:33:32Z",
      "duration": "00:48:31",
      "explicit": false,
      "youTubeId": "1EAJ6zTjV08",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1EAJ6zTjV08"
      }
    },
    {
      "id": "793ca1b1-33f1-4076-9cea-5653f919665f",
      "title": "Leaving the Nithyananda Cult w/ Sarah Landry Part 3: Life After Scientology",
      "description": "\u0022Ron Miscavige Life After Scientology\u0022 will explore Ron\u0027s time with the Church of Scientology and expose information that the Church does not want you to know. \n\nPlease support my Patreon: https://www.patreon.com/itmuststop\n\nVisit my website: https://www.therealronmiscavige.com/\n\nPurchase my album: https://www.therealronmiscavige.com/news-media-blog/\n\nTwitter: https://twitter.com/MiscavigeRon\n\nFacebook  page: https://www.facebook.com/therealronmiscavige/",
      "release": "2019-11-02T23:33:06Z",
      "duration": "00:57:23",
      "explicit": false,
      "youTubeId": "8JLbQVg2KGw",
      "subjects": [
        "Scientology",
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8JLbQVg2KGw"
      }
    },
    {
      "id": "4e7cdc66-e07c-4684-a486-91decbe2ca2d",
      "title": "Leaving the Nithyananda Cult w/ Sarah Landry Part 2: Life After Scientology",
      "description": "\u0022Ron Miscavige Life After Scientology\u0022 will explore Ron\u0027s time with the Church of Scientology and expose information that the Church does not want you to know. \n\nPlease support my Patreon: https://www.patreon.com/itmuststop\n\nVisit my website: https://www.therealronmiscavige.com/\n\nPurchase my album: https://www.therealronmiscavige.com/news-media-blog/\n\nTwitter: https://twitter.com/MiscavigeRon\n\nFacebook  page: https://www.facebook.com/therealronmiscavige/",
      "release": "2019-11-02T23:32:57Z",
      "duration": "00:43:21",
      "explicit": false,
      "youTubeId": "_I0HsfSSOR8",
      "subjects": [
        "Scientology",
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_I0HsfSSOR8"
      }
    },
    {
      "id": "78e9a69d-15fe-492a-ba35-c2688b246a04",
      "title": "Leaving the Nithyananda Cult w/ Sarah Landry Part 1: Life After Scientology",
      "description": "\u0022Ron Miscavige Life After Scientology\u0022 will explore Ron\u0027s time with the Church of Scientology and expose information that the Church does not want you to know. \n\nPlease support my Patreon: https://www.patreon.com/itmuststop\n\nVisit my website: https://www.therealronmiscavige.com/\n\nPurchase my album: https://www.therealronmiscavige.com/news-media-blog/\n\nTwitter: https://twitter.com/MiscavigeRon\n\nFacebook  page: https://www.facebook.com/therealronmiscavige/",
      "release": "2019-11-02T23:32:45Z",
      "duration": "00:49:17",
      "explicit": false,
      "youTubeId": "qt2kUSHPxnw",
      "subjects": [
        "Scientology",
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qt2kUSHPxnw"
      }
    },
    {
      "id": "fcd73567-7f51-4540-bd15-7f20efe5e417",
      "title": "Sensibly Speaking Podcast #216 Part 2: Sarah Landry and the Cult of Nithyananada",
      "description": "This week I have a special two-part extended length podcast. Sarah Landry, a former member and spokesperson for the Nithyananda Dhyanapeetam, a religious organisation founded by Nithyananda and which she was involved with for 9 years. Her story is at once a cautionary tale about how people can be lured into cults and a testimonial of how fanatical people can become as a result. \n#Nithyananda #SarahLandry #ChrisShelton\n\nCurated Care Crates link: http://igg.me/at/CuratedCareCrates\n\nThe Great Courses Plus link: http://thegreatcoursesplus.com/critical\n\nAll show notes, quotes and sources are at http://sensiblyspeaking.com\n\nAMAZON ASSOCIATES STORE\nhttps://www.amazon.com/shop/chrisshelton\n\nSHOP FOR CRITICAL MERCHANDISE\nhttp://shop.spreadshirt.com/chrisshelton\n\nMy book, Scientology: A to Xenu, is available here:\nPaperback: https://goo.gl/yYIl2t\nKindle edition: http://goo.gl/K51ySi\nAudio edition: http://goo.gl/1yvlYS\n\nSubscribe to my podcast at http://sensiblyspeaking.com or on iTunes at https://goo.gl/1QDUHS\n\nPlease consider supporting this channel and helping me to offer more and better content. \nPatreon: http://patreon.com/chrisshelton\nClick the blue Support button here: https://goo.gl/vHgSoE\nClick the PayPal button here: https://goo.gl/A4coS4",
      "release": "2019-11-02T23:30:33Z",
      "duration": "02:16:58",
      "explicit": false,
      "youTubeId": "ForK_5CeKnU",
      "subjects": [
        "Nithyananda",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ForK_5CeKnU"
      }
    },
    {
      "id": "c857fb26-49b6-4dda-b020-8b686455d41a",
      "title": "Sensibly Speaking Podcast #216 Part 1: Sarah Landry on the Cult of Nithyananda",
      "description": "This week I have a special two-part extended length podcast. Sarah Landry, a former member and spokesperson for the Nithyananda Dhyanapeetam, a religious organisation founded by Nithyananda and which she was involved with for 9 years. Her story is at once a cautionary tale about how people can be lured into cults and a testimonial of how fanatical people can become as a result. \n#Nithyananda #SarahLandry #ChrisShelton\n\nCurated Care Crates link: http://igg.me/at/CuratedCareCrates\n\nThe Great Courses Plus link: http://thegreatcoursesplus.com/critical\n\nAll show notes, quotes and sources are at http://sensiblyspeaking.com\n\nAMAZON ASSOCIATES STORE\nhttps://www.amazon.com/shop/chrisshelton\n\nSHOP FOR CRITICAL MERCHANDISE\nhttp://shop.spreadshirt.com/chrisshelton\n\nMy book, Scientology: A to Xenu, is available here:\nPaperback: https://goo.gl/yYIl2t\nKindle edition: http://goo.gl/K51ySi\nAudio edition: http://goo.gl/1yvlYS\n\nSubscribe to my podcast at http://sensiblyspeaking.com or on iTunes at https://goo.gl/1QDUHS\n\nPlease consider supporting this channel and helping me to offer more and better content. \nPatreon: http://patreon.com/chrisshelton\nClick the blue Support button here: https://goo.gl/vHgSoE\nClick the PayPal button here: https://goo.gl/A4coS4",
      "release": "2019-11-02T23:29:39Z",
      "duration": "02:33:30",
      "explicit": false,
      "youTubeId": "XEVhhoc1b30",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XEVhhoc1b30"
      }
    },
    {
      "id": "7919a9a2-5201-4f62-b24a-d5f0edc00fc3",
      "title": "Brainwashed by Nithyananda; Now I\u0027m Speaking Out About his DANGEROUS CULT!",
      "description": "Lessons learned. Please don\u0027t fall into the same trap I did.\n\nIf you have been abused by this guru or his cult, details to file a charge are given on this blog site. The creator of the blog can also be reached through the contact details to offer support and guidance to victims: https://nithyananda-cult.blogspot.com/2019/09/sarah-landry-starts-to-squeal-against.html#comment-form_5376076632412181707\n\nAnother online resource offering resources and court documents that expose the cult\u0027s charges of racketeering, and the rape case the guru has fled India to avoid, is a Facebook group called Nithyananda Cult or Culture. The blog makes some incendiary judgements about me and the role I played as the cult recruiter, but the facts they lay out about Nithyananda should not be ignored: https://www.facebook.com/NithyanandaCultOrCulture/\n\nMost importantly, please do your own research into this cult, which matches the same characteristics as Scientology and NXIVM, and please don\u0027t fall into the trap of the false master before he leads everyone into a Jonestown style worst case scenario.\n\nThank you for your time, and I\u0027m sorry for the terrible role I played in recruiting people there while under the influence of mind control.",
      "release": "2019-09-17T00:49:06Z",
      "duration": "00:29:22",
      "explicit": false,
      "youTubeId": "XsnxFh1orY4",
      "subjects": [
        "Nithyananda"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XsnxFh1orY4"
      }
    }
  ]
}