{
  "id": "2384a087-6e51-4146-bfde-969a8a194963",
  "name": "Sarah Jean",
  "youTubeChannelId": "UCPgAzS0_iVzwkPRe5P0xuCw",
  "episodes": [
    {
      "id": "04a03de3-289c-4c06-99a9-f0e2d7d9f7d9",
      "title": "Ex-Amway Rep EXPOSES company for being a CULT! | ANTI-MLM",
      "description": "Want to see more of Lavender\u0027s videos? Here\u0027s her YouTube channel!\nhttps://www.youtube.com/@UCv13CqFAQgb51OUqHKp2RKg \n\nI create these videos for entertainment and educational purposes! Please DO NOT ever reach out to, or contact any person featured in my videos. Their content is being used as an EXAMPLE of the manipulation and brainwashing that happens within the MLM industry. I DO NOT condone online bullying or harassment whatsoever. Everything in this video is strictly OPINION based on observation and personal experience within the Multi-Level Marketing industry. I am not a lawyer, nor am I giving legal advice.\n\nGet connected to me!\n\n👉🏼Instagram: www.instagram.com/queensarahjean\n\n⭐️Submit your own MLM WTF story: \nYou can email me your own MLM story- please be clear if you’d like to stay anonymous! (Make sure to proofread, and add punctuation so I can read your story clearly.)\n📧 therealsarahjean1@gmail.com\n\nSubmit wild MLM business practices you’ve witnessed:\nFacebook posts, reels, TikTok’s- ANYTHING! If you’ve seen something an MLMer has shared on social media, and you’d like me to do commentary on it- you can send me an email and attach the media!\n📧therealsarahjean1@gmail.com\n\n\nCopyright Disclaimer: - Under section 107 of the copyright Act 1976, allowance is made for FAIR USE for purpose such a as criticism, comment, news reporting, teaching, scholarship and research. Fair use is a use permitted by copyright statues that might otherwise be infringing. Non- Profit, educational or personal use tips the balance in favor of FAIR USE.",
      "release": "2025-04-25T17:00:06Z",
      "duration": "00:53:27",
      "explicit": false,
      "youTubeId": "3Op0smrLORI",
      "subjects": [
        "Amway",
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3Op0smrLORI"
      }
    }
  ]
}