{
  "id": "08fde667-ac1b-41b4-863a-bbeabac64b45",
  "name": "Saturday Magazine",
  "spotifyId": "5tOqjKu0LCnUX9BTi1lvar",
  "appleId": 285926933,
  "episodes": [
    {
      "id": "afaaf8f4-7c02-4852-b6a2-ffa9b90cc153",
      "title": "Saturday 24th, August, 2024:  Van Badham, journalist and playwright Werewolf, Melbourne Fringe Festival",
      "description": "Fiona and Macca talk to Van Badham, journalist and playwright Werewolf, Melbourne Fringe Festival Van wrote this play after her undercover investigative work into Australia’s neonazi/cooker underground as she researched her book on Internet Conspiracy Cults. She became fascinated by the concept of “fusion paranoia”, when people in a crisis of identity can not only switch their political alignment, but radicalise it to a dangerous extreme. Theatre powerhouses Van Badham and Gary Abrahams (Yentl) are collaborating on this new Melbourne Fringe commission about a naive young idealist who wants to gain traction as a political activist, allowing him to fall prey to a sophisticated right-wing fascist. Using 80’s horror film tropes, the work offers contemporary social commentary on the clash between the left and the far right, in a playful and humorous way. Van wrote this play after her undercover investigative work into Australia’s Neo Nazi/cooker underground as she researched her book on Internet Conspiracy Cults. She became fascinated by the concept of “fusion paranoia”, when people in a crisis of identity can not only switch their political alignment, but radicalise it to a dangerous extreme. ‘Werewolf’ is a gripping political thriller and black-comedy set in contemporary Melbourne. An alt-right tour is arriving in the city, and while government and media figures struggle to understand its impact, both local Neo-Nazis and young left radicals anticipate bloody confrontation with some excitement. As the city grapples with the democratic implications of threats posed, a volatile situation spins out of control. As the think-tankers and thought leaders try to contain the chaos through traditional channels like the media, frustrated and idealistic young leftist, Nathan, wanders into the dark world of his enemy; the charismatic fascist, Stevie. When a cascade of personal crises leaves Nathan isolated and resentful, he accepts Stevie’s invitation to visit his “retreat” in the woods. Here, Nathan encounters the horrific reality of a “white power” wolf cult, as well as a shocking transformation that will result in violence, and death. Traversing live TV to community halls, public campuses to private bedrooms, the story tracks the sophisticated and manipulative strategies of the modern far-right as they meet the naïve tactics of the modern hard left. Through the lens of old Hollywood horror, ‘Werewolf’ explores the contagious nature of extremist thought and the lurking threat it poses to democracy The post Saturday 24th, August, 2024: Van Badham, journalist and playwright Werewolf, Melbourne Fringe Festival appeared first on Saturday Magazine .",
      "release": "2024-08-25T07:41:04Z",
      "duration": "00:16:57.5220000",
      "explicit": false,
      "spotifyId": "0AJHbk4IU4xGdLFjrpxsop",
      "appleId": 1000666514391,
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0AJHbk4IU4xGdLFjrpxsop",
        "apple": "https://podcasts.apple.com/podcast/saturday-24th-august-2024-van-badham-journalist-and/id285926933?i=1000666514391"
      }
    }
  ]
}