{
  "id": "ba9d90c5-e1f1-4476-bbc0-aa210f910554",
  "name": "Saturn Soul",
  "youTubeChannelId": "UCZH3rQsJ--cBuDmJF3xSxZw",
  "episodes": [
    {
      "id": "0eb3ff68-1ef5-4934-bdc3-b1c18209a15e",
      "title": "The Most Sadistic Cult in American History",
      "description": "In 1981, a seemingly ordinary group of men in Chicago concealed a darkness that would shock the city. Bound by twisted beliefs and unrelenting cruelty, their actions left behind a trail of fear, grief, and unanswered questions that still linger today.\n\nNEW VIDEOS Every Second Tuesday @ 7PM EST\n\nMain Channel:\n► https://www.youtube.com/@LetsReadPodcast  \n► Patreon (Early Access): https://www.patreon.com/letsread \n\nListen to the Podcast:\n► Spotify: https://spoti.fi/2o7wgnc\n► Apple Podcasts: https://apple.co/2Mwumv6\n\n\nFollow Me:\n► https://www.instagram.com/letsread.official/\n\n\nProduction: https://www.youtube.com/@inekt \u0026 https://www.instagram.com/nicolebrgr\nWritten by: https://samridingwrites.substack.com/\n\n\nThis channel is dedicated to exploring the darkest corners of true crime and the most fascinating, untold moments in history. From chilling unsolved mysteries and infamous criminal cases to forgotten historical events and conspiracies buried by time, Saturn Soul dives deep into stories that shock, disturb, and captivate.\n\nHere, you’ll uncover True Crime Stories about serial killers, cold cases, cults, disappearances, and high-profile investigations — alongside Historical Documentaries about lost civilizations, cover-ups, forbidden archaeology, and world-changing events that history books overlook.\n\nIf you\u0027re a fan of creators like Wendigoon, Barely Sociable, Matt Orchard, Dark Docs, or Coffeehouse Crime, \u0026 Mr. Ballen, Saturn Soul is for you.",
      "release": "2025-09-09T23:00:09Z",
      "duration": "00:11:35",
      "explicit": false,
      "youTubeId": "9YOsEmsbqvI",
      "subjects": [
        "Ripper Crew"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9YOsEmsbqvI"
      }
    }
  ]
}