{
  "id": "3430880d-195b-49f4-be6d-37ebb2abd3e5",
  "name": "Savage Lovecast",
  "spotifyId": "55uEQazfxxZQTH2JOTg1KZ",
  "appleId": 201376301,
  "episodes": [
    {
      "id": "8a579f71-9dc7-4382-bbea-25aa3b06e338",
      "title": "Savage Lovecast Episode 1001",
      "description": "Happy New Year, and a very happy Feast of the Ass to you and yours. In honor of the holiday, our first caller asks if he should keep a cup of mouthwash handy for when he moves from ass-eating to pussy-eating. A man wants strategies on how to talk his sister out of circumcising her newborn son. On the Magnum, Dan chats with Ellen Huet, a plucky, investigative journalist who uncovered an exploitative sex cult that revolves around female orgasm. Her book EMPIRE OF ORGASM about OneTaste, a sexual wellness company is amazing, and she and Dan had a LOT to talk about. And, a poly woman wonders if when making introductions, she should reveal the poly status of two friends, so they know they are all “in the lifestyle.” Q@Savage.Love 206-302-2064 This episode is brought to you by Squarespace. They make it easy to build a website or blog. Give it a whirl at Squarespace.com/Savage and if you want to buy it, use the code Savage for a 10% off your first purchase. This episode is brought to you by Beducated, the leading platform for pleasure-based sex education for adults. Go to Beducated.com and use the code SAVAGE for 50% a yearly pass. This episode is brought to you by Bubs Naturals: Collagen peptides for joint health \u0026 mobility, healthy hair skin and nails, and gym recovery. Right now, to get 20% off, go BubsNaturals.com and use code Savage. Dan Savage is a sex-advice columnist, podcaster, author, and creator of the It Gets Better Project. From ethical non-monogamy to unethical non-monogamy, cuckolding to crossdressing and with a dose of progressive politics, Dan Savage is a cultural force for sex positivity, when we most need it.",
      "release": "2026-01-06T12:00:00Z",
      "duration": "00:58:39.5820000",
      "explicit": true,
      "spotifyId": "2Rqh23w1RlvPazpaVXF6aw",
      "appleId": 1000743962405,
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Rqh23w1RlvPazpaVXF6aw",
        "apple": "https://podcasts.apple.com/podcast/1000/id201376301?i=1000743962405"
      }
    }
  ]
}