{
  "id": "9bbb1023-51a5-4b64-a9f5-8e4a48d47dc9",
  "name": "Save The Garden",
  "youTubeChannelId": "UClTmsDUX0MV_iI4B_c--2qA",
  "episodes": [
    {
      "id": "913caf7c-8e74-4a2f-8647-f0af422fd89b",
      "title": "Scientology’s Lobbying Exposed",
      "description": "In this episode, Brooks Gibbs breaks down the latest twist in the fight to save South Garden Avenue from being handed over to Scientology.\n\nSave The Garden exists for one clear purpose: to stop private organizations—like Scientology—from quietly acquiring downtown public streets without voter approval. City Council can be influenced by political pressure and lobbying, but the people cannot.\n\nThis week’s discovery:\nA Clearwater City Councilmember, David Albritton, was lobbied by Scientology and pushed into seeking legal advice from the Florida Attorney General—an office closely tied to Scientology donors.\n\nMeanwhile, Councilmember Ryan Cotton—Albritton’s son-in-law—defended the move, despite clear concerns from the Mayor, Vice Mayor Lina Teixeira, and Councilman Mike Mannino.\n\nThis video highlights:\n• How Scientology uses political donations and lobbying to gain influence\n• Why South Garden Avenue is at the center of this battle\n• The major conflict of interest on the City Council\n• Why voter approval—not City Council—must decide the fate of public streets\n• How Clearwater citizens can take back control through the petition initiative\n\nClearwater deserves transparency. Clearwater deserves accountability.\nAnd Clearwater deserves the right to vote on public street giveaways.\n\n👉 Sign the petition in person today.\nFind your nearest signing location at https://SaveTheGarden.org\n\nLet’s change the law and protect our downtown—together.\n\n#SaveTheGarden #Clearwater #Scientology #LocalNews #CivicAction #FloridaPolitics #ProtectClearwater #BrooksGibbs #RightToPetition #GovernmentTransparency",
      "release": "2025-11-22T17:30:16Z",
      "duration": "00:06:41",
      "explicit": false,
      "youTubeId": "e2CK3H6AjEw",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e2CK3H6AjEw"
      }
    },
    {
      "id": "6cc63423-a3b4-4281-8d86-314340143329",
      "title": "Save The Garden | Episode 4: Project Normandy",
      "description": "🚨 EPISODE 4: PROJECT NORMANDY — Scientology’s Secret Plot to Take Clearwater 🚨\n👉 WATCH NOW. SHARE EVERYWHERE.\nVisit https://SaveTheGarden.org\n to sign the petition.\n\nFor over 50 years, Clearwater’s struggle with Scientology has never been about religion — it’s been about real estate.\n\nIn this episode, Clearwater resident Brooks Gibbs exposes PROJECT NORMANDY — a covert operation personally written by L. Ron Hubbard to infiltrate, control, and ultimately own Clearwater, Florida. Hubbard’s secret memos detailed plans to “distinguish friends from enemies” and “handle as needed” in order to establish total area control.\n\nWhen the FBI raided Scientology headquarters in 1977 — the largest raid in Bureau history — agents uncovered 48,000 pages of secret operations, blackmail plots, and land-grab strategies. Eleven Scientology leaders, including Hubbard’s wife, went to prison for espionage and conspiracy.\n\nYet the plan never stopped.\nToday, Scientology and its shell companies own over 200 buildings across 100 acres in downtown Clearwater — worth over a billion dollars. Now, they’re trying to take our public streets, starting with South Garden Avenue.\n\n💪 Save the Garden isn’t fighting against a religion — we’re standing up to a 50-year covert real estate scheme designed to control our city.\n\nThousands of Clearwater citizens have already signed our petition to stop this takeover. If you haven’t yet—please join us.\n🖊️ One minute. One signature. One more shield for our streets.\n\nBut our movement faces pressure:\nFake names. Police calls. Investigations. Legal roadblocks.\nAll designed to silence ordinary citizens who simply want to protect public land.\n\nDespite it all, our volunteers continue walking neighborhoods, talking with residents, and defending the people’s right to petition their government — a right enshrined in the Constitution.\n\n📢 Together, we are reminding City Hall that government belongs to the people, not to a billion-dollar organization with a 50-year plan to dominate our town.\n\n✅ TAKE ACTION:\n1️⃣ Sign the petition at SaveTheGarden.org\n\n2️⃣ Encourage 5 friends to sign too\n3️⃣ Click “Message the Councilmembers” on our site and tell them: We stand with Save The Garden.\n\n💚 Your voice matters. Your city matters.\n#SaveTheGarden #ProjectNormandy #Clearwater #Scientology  #FBI #TrueCrime #ClearwaterFlorida",
      "release": "2025-11-07T21:29:20Z",
      "duration": "00:13:24",
      "explicit": false,
      "youTubeId": "uYv-cXigCQU",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uYv-cXigCQU"
      }
    },
    {
      "id": "2d6f041a-8433-483f-9761-b999a9af0a9b",
      "title": "Podcast: Pastor Willy Rice Endorses #SaveTheGarden",
      "description": "In this powerful episode, Pastor Willy Rice of Calvary Baptist Church in Clearwater shares his heartfelt endorsement of the #SaveTheGarden initiative. With clarity and conviction, Pastor Rice addresses the pressing decision facing the City Council: whether to sell a historic public street to the Organization of Scientology or preserve it for a public memorial garden honoring Clearwater’s original families and diverse heritage.\n\nPastor Willy offers a faith-driven, community-focused perspective on why this moment matters—not just for the city’s future, but for its soul. Tune in for an inspiring conversation about legacy, truth, and the power of public spaces to bring people together.\n\n🔔 Don’t forget to like, comment, and subscribe to support this mission.\n🌳 Learn more: SaveTheGarden.org\n#SaveTheGarden #Clearwater #WillyRice #Scientology #FaithAndCivicDuty #BiblicalCitizenship",
      "release": "2025-05-08T00:05:05Z",
      "duration": "00:29:25",
      "explicit": false,
      "youTubeId": "lVn6TAk4iEo",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lVn6TAk4iEo"
      }
    }
  ]
}