{
  "_ts": 0,
  "id": "dac6da83-1d9c-43d1-a9dd-2b75281db6f4",
  "name": "SBS Insight",
  "youTubeChannelId": "UCLhvidUffW8vSUclD7kfrGg",
  "episodes": [
    {
      "id": "c91a33b4-f457-4435-8c2f-7904a6d970a9",
      "title": "I needed to join her, otherwise the world would end | SBS Insight",
      "description": "Insight delves into the enduring allure of cults and similar groups, questioning whether more should be done to shield people from their influence. Shannon, who acknowledges qualities of a cult leader in herself, provides her perspective. Othniel recounts his immersion in a Bible study group in Australia, where intense scripture study caused him to abandon his university education. Andy, Othniel\u0027s friend, recounts his efforts to help him escape. Sandra shares her struggles as her daughter becomes involved in a cult, abandoning her job and education. Shona recounts her experiences working for a marketing firm that promoted extreme weight loss among employees, leading her to therapy for anorexia. Maddy draws parallels between her former beauty pageant experiences and cult dynamics. Muareen reflects on her positive experiences in Alcoholics Anonymous, likening it to a \u0022good cult.\u0022 Sam describes his departure from a church due to its cult-like pressures and discriminatory views. Carlie shares her legal victory after being sued by a former cult leader for defamation. Esther discusses her activism against abuse within a healing clinic, highlighting challenges in seeking justice. Laura shares her journey leaving as a fifth-generation member.\n\nInsight airs Tuesdays at 8:30pm on SBS:  http://www.sbs.com.au/news/insight​\n\nSUBSCRIBE: https://bit.ly/3txZoUN\n\nInsight, hosted by Kumi Taguchi, is Australia\u0027s leading forum for powerful first-person stories offering a unique perspective on the way we live.\n\nInsight first went to air in 1995 and has since been a mainstay of SBS current affairs programming. The team doesn\u0027t shy away from taboo topics: from polygamy, to brain implants, to the secrets revealed on the deathbed. \n\nDo you want to be part of the discussion and join an Insight record? Insight aims to include a range of backgrounds, ages, and perspectives in our studio audience. If you want to be involved, register here: https://bit.ly/3vQlO7T\n\nVisit our website: https://www.sbs.com.au/news/insight/​\nCatch up on full episodes: https://www.sbs.com.au/ondemand/program/insight\nLike us on Facebook: https://www.facebook.com/InsightSBS​\nFollow us on Twitter: https://twitter.com/insightSBS\nFollow us on Instagram: https://www.instagram.com/insightsbs/\n\nNetwork Terms \u0026 Conditions: https://www.sbs.com.au/terms\nPrivacy Policy: https://www.sbs.com.au/privacy\nFeedback or complaints: https://www.sbs.com.au/complaints",
      "release": "2024-05-01T10:00:33Z",
      "duration": "00:50:25",
      "explicit": false,
      "youTubeId": "XKlh0nBOVto",
      "subjects": [
        "Shincheonji Church of Jesus",
        "Alcoholics Anonymous",
        "Multi-Level Marketing",
        "Cult Psychology",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XKlh0nBOVto"
      }
    }
  ]
}