{
  "id": "285cf8a1-4d5b-49ec-830b-f6d14141c9d2",
  "name": "Scarcity Studios",
  "youTubeChannelId": "UC1XI4TFW_nEY4IFfTxUUkCg",
  "episodes": [
    {
      "id": "d25d32b1-345e-40a2-b7e6-73f55a1fb21c",
      "title": "Anti Gov group jailed for storming court and trying to kidnap Essex Coroner",
      "description": "•reupload : Mark Christopher has been jailed for 7 years after the attempted to kidnap the Coroner for Essex On 20 April 2023, the group entered Seax House in Chelmsford in the early afternoon, interrupted a live inquest and demanded to know where HM Coroner Lincoln Brookes was, saying that they were shutting the court down.\n\nThe group were wearing high visibility jackets, body worn cameras and carrying handcuffs.\n\nAfter learning that the HM Senior Essex Coroner was not in the building, the group intimidated a sitting Coroner in the court, used violence and claimed to know where she and her staff lived. This caused significant distress to the coroner in court and her staff who feared they may be kidnapped and assaulted given the possession of the handcuffs and threats made.\n\nAfter an alarm was sounded, police officers quickly arrived at the building and were confronted by Kishon Christopher who repeatedly told them his group were “shutting the court down”. Enquiries revealed that they belonged to an Organised Pseudo legal Commercial Argument (OPCA) Group called the Federal Postal Court Judges.\n\nGroups such as these, similar to Sovereign Citizen movements, do not respect the law of the land and see themselves as a ‘court of the people’ who claim extraordinary authority.\n\nSuch groups have rules that mimic the structure and language of “conventional” law.\n\nThis “pseudo law” superficially appears to be law, but uses unusual language, seals, and letter to confuse recipients.\n\nThis particular group also believed that they have power of arrest and previously discussed corporal punishment.\n\nThey were arrested close to another court, in Southend. Searches were conducted at their home addresses where officers found items indicating that they were planning on causing harm to Mr Brookes.\n\nThey were charged with multiple offences including conspiracy to commit false imprisonment. Mark Christopher, 59, was described as the “self-appointed leader” who went by the title of Chief Judge of England and All Dominions.\n\nMatthew Martin, 47, was a sheriff and coroner, Sean Harper, 38, was a sheriff, and his wife, Shiza Harper, 45, was a postal inspector for the group, the judge said, with all three “qualified by” Christopher.\n\nThe judge said Christopher “lay at the very heart of these offences” as he jailed him for seven years. He said Martin and the Harpers “were prepared to commit offences while doing his bidding” and jailed them for 30 months each.\n\nThe Essex area coroner Michelle Brown told an earlier trial that the group came into her courtroom. She said the leader, Christopher, “kept demanding that I find and get Mr Brookes”.\n\nBrookes told the earlier trial that he received a series of “very bizarre” letters in 2022 and then emails in April 2023 stating that “corporal punishment may be administered”. He described the emails, which claimed to be warrants “for seizure of goods and persons”, as “troubling” and “upsetting”.\n\nIn a victim impact statement read out in court by Walker on Monday, he said: “I regularly have nightmares about the incident and the suspects attending my home.”\n\nBrookes said he had had “initial trauma therapy” and was now “hyper-vigilant about the safety of my family and myself”.\n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UC1XI4TFW_nEY4IFfTxUUkCg/join",
      "release": "2024-11-06T13:11:51Z",
      "duration": "00:36:54",
      "explicit": false,
      "youTubeId": "f8P0NPgibbA",
      "subjects": [
        "Federal Postal Court"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f8P0NPgibbA"
      }
    }
  ]
}