{
  "id": "ee95ae6c-24b5-42ec-a9d9-e69e508985ae",
  "name": "Scott Markus Ghost Stories",
  "youTubeChannelId": "UC0dxqKaGOGAjDNfVRvStWSQ",
  "episodes": [
    {
      "id": "5926456a-7ae7-4b00-83ab-c3d9abf83823",
      "title": "FSS (podcast) Rick Alan Ross on How Cults Work, \u0026 How to Get Out - Deprogramming, NXIVM, Waco \u0026 more",
      "description": "The majority of our members are storytellers, but you know I always really love our inductees who are researchers, documentarians and investigative journalists.  We are very excited to induct a new member who is one of the absolute foremost experts about a shady element of society.  The work he does cannot be overstated for its value, in both rescuing people and, like this episode, even just getting the word out and raising awareness.  He has worked closely with both the Branch Davidians and the FBI during the standoff in Waco, Texas in the ‘90s and much more recently, with survivors of the NXIVM cult.  You can check out his massive resource, the Cult Education Institute, free and open to the public, at CultEducation.com and you can pick up his comprehensive book, “Cults Inside Out: How People Get In and Can Get Out.”  And as we induct a new member, it is a good time to point out that you are free to leave at any time, there is no punishment for leaving and I, personally, lack the charisma to be considered a charismatic leader.  We welcome the newest member of the Fantastic Story Society, Mr. Rick Alan Ross! \n\n0:00 - Intro: Why We’re doing an episode on Cults\n2:11 - Why do we find cult stories interesting?\n4:50 - Cults are close to pretty much everyone\n9:57 - Inductee: Rick Alan Ross (interview start)\n11:34 - Defining a Cult, 3 core elements\n13:45 - Are there non-destructive cults? Arcosanti, AZ \u0026 Paolo Soleri\n16:18 - Range of destructive cults\n18:18 - Cult exit costs (FLDS, Children of God, Scientology)\n20:30 - Deprogramming cult members\n23:18 - Do people ever try to self-deprogram themselves?\n24:35 - Mark Vicente, getting out of NXIVM\n28:00 - How to cults still exist in the Internet age? (NXIVM, Landmark)\n31:10 - Risks of Rick\u0027s work (Scientology, Rama Behera, SIST, NXIVM)\n32:30 - Internet \u0026 social media \u002B cults\n34:11 - Political Groups as cults (QAnon, Isis, Taliban, Symbionese Liberation Army)\n37:20 - Is Trump a cult leader?\n40:30 - Rajneeshpuram, Ma Sheela \u0026 Bhagwan Shree Rajneesh / Osho\n43:10 - Keith Raniere, Allison Mack, Nancy Salzman \u0026 India \u0026 Catherine Oxenberg\n52:50 - Best cult movie \u0026 why: Mary Marcy May Marlene\n54:44 - Consulting on Far Cry 5 \u0026 Inspirations (David Koresh, Church Universal \u0026 Triumphant, Paul Schäfer Schneider, Colonia Dignidad)\n58:00 - Mistakes in cult movies (Satanic cults, Rosemary\u0027s Baby)\n1:04:10 - WACO - Working with the Branch Davidians \u0026 the FBI\n1:08:57 - ATF \u0026 FBI mistakes in Waco\n1:17:20 - Heaven\u0027s Gate \u0026 Marshall Applewhite \u002B Aum Shinrikyo\n1:23:00 - Cult Education Institute \u0026 helpful message boards\n\nShare this video: https://youtu.be/cZow_nGohig\n\nWhat is WhatsYourGhostStory.com \u0026 Who is Scott Markus?\nWhatsYourGhostStory.com is a community for sharing ghost stories, your own stories and historical information since it launched in 1999.  Author and Filmmaker Scott Markus has written the book Voices from the Chicago Grave and released the paranormal documentaries \u0022The Hidden Truth?\u0022 about the paranormal investigation into the La Crosse Drownings and the 1999 documentary \u0022Voices from the Grave,\u0022 which is about the most haunted locations in the Chicago area.  He annually speaks at paranormal conferences across America and also travels from coast-to-coast, visiting haunted sites.  \n\nFollow us \u0026 be part of the community by subscribing (ring that bell!) and hang with us on social media:\nFacebook:  https://www.facebook.com/WhatsYourGhostStory/\nInstagram:  https://www.instagram.com/whatsyourghoststory/\nTumblr: https://whatsyourghoststory.tumblr.com/\nTwitter: https://twitter.com/scottmarkus\n\u0026 Find our podcast here: https://www.facebook.com/FantasticStorySociety/",
      "release": "2023-05-08T23:54:34Z",
      "duration": "01:25:23",
      "explicit": false,
      "youTubeId": "cZow_nGohig",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cZow_nGohig"
      }
    }
  ]
}