{
  "id": "98254418-e1ff-49b8-a579-9abe8217f5c8",
  "name": "Scripps News",
  "youTubeChannelId": "UCTln5ss6h6L_xNfMeujfPbg",
  "episodes": [
    {
      "id": "ec31d326-4ad8-4282-8113-33037fbc0fff",
      "title": "New Mexico investigating claims of burials near Epstein\u0027s former ranch",
      "description": "The New Mexico Department of Justice is investigating public land near what was once Jeffrey Epstein’s Zorro Ranch after a newly released email alleged that two foreign girls were buried there.\n\nLast week, New Mexico Public Lands Commissioner Stephanie Garcia Richard said she requested the probe following a 2019 email from an alleged former Epstein staffer. The email claimed two girls were killed and buried on public land leased near the ranch, about 30 miles southeast of Santa Fe.\n\nThe redacted email was part of recently released documents from the U.S. Department of Justice (DOJ investigation into Epstein. The deaths were allegedly at the direction of Epstein and Ghislaine Maxwell, who is serving a 20-year federal prison sentence for sex trafficking.\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-02-19T22:10:54Z",
      "duration": "00:04:02",
      "explicit": false,
      "youTubeId": "qdZ4Fffv4qU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qdZ4Fffv4qU"
      }
    },
    {
      "id": "608f0c61-7d89-4c56-acb8-4176a1c8a5a4",
      "title": "Trump responds to Prince Andrew arrest over Epstein ties",
      "description": "President Donald Trump took questions aboard Air Force One after reports that Prince Andrew was arrested in London in connection with Jeffrey Epstein. Trump said the situation is “very sad” for the royal family and emphasized that he has been “totally exonerated” in matters related to Epstein.\n\nThe president also addressed rising tensions with Iran, saying a deal must be reached within 10 to 15 days or it would be “unfortunate” for Tehran. \n\nIn addition, Trump responded to comments from former President Barack Obama about aliens. He also briefly weighed in on questions surrounding the disappearance of Nancy Guthrie.\n\nHere’s what the president said during the exchange.\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-02-19T20:55:26Z",
      "duration": "00:03:50",
      "explicit": false,
      "youTubeId": "8d_NBnfSpaM",
      "subjects": [
        "Human Trafficking",
        "_America",
        "_London"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8d_NBnfSpaM"
      }
    },
    {
      "id": "7a02981b-4878-47b5-b0b6-6feaeabfaad5",
      "title": "Did billionaire Les Wexner fund Epstein? Democrats hold deposition",
      "description": "House Democrats questioned billionaire Leslie Wexner as part of their investigation into convicted sex offender Jeffrey Epstein.\n\nWexner, the former CEO of Victoria’s Secret’s parent company, sought to minimize his relationship with Epstein, Democrats said during a break in the deposition.\n\n\u0022We should be very clear that there would be no Epstein island, there would be no Epstein plane, there would be no money to traffic women and girls,\u0022 Rep. Robert Garcia said. \u0022Mr. Epstein would not be the wealthy man he was without the support of Les Wexner.\u0022\n\nDemocrats said they are aware of approximately $1 billion in Wexner’s wealth that was transferred to Epstein.\n\n\u0022It\u0027s important to know that Mr. Wexner appears to be unaware of much of the money that he claims that was given over to Mr. Epstein,\u0022 Garcia said. \u0022In fact, it\u0027s interesting that Mr. Wexner has already begun to clarify, in his mind, that somehow he and Mr. Epstein weren\u0027t even friends.\u0022\n\nGarcia also said Wexner, 88, traveled on Epstein’s plane and visited his island.\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-02-18T20:32:24Z",
      "duration": "00:06:32",
      "explicit": false,
      "youTubeId": "3INaOV_9NX0",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3INaOV_9NX0"
      }
    },
    {
      "id": "2631a45e-8c12-46fb-ae01-c8b26c8aa00b",
      "title": "Today: The harrowing diary of an Epstein victim and the money made from detaining immigrants",
      "description": "Today as it Happened on Monday, February 16, 2026:\n\nA diary written by a young girl details graphic accounts of abuse involving convicted sex offender Jeffrey Epstein.\n\nThe handwritten pages describe trauma she says she endured.\n\nDozens of diary pages that were made public in the release of Epstein-related investigative materials focus on what the girl describes as repeated abuse, including multiple pregnancies. She provides detailed accounts of childbirth with Ghislaine Maxwell allegedly in the room and of a baby, born alive, being taken away.\n\nThe first year of President Trump\u0027s push to arrest and deport undocumented immigrants was a financial boon for two companies that own and operate private detention centers.\n\nCoreCivic and The GEO Group both reported their year-end earnings for 2025.\n\nEach company reported seeing a boost in revenue of more than 13 percent, both making more than $2 billion.\n\nGEO Group\u0027s executive chairman George Zoley called 2025 the \u0022most successful year for new business wins in our company\u0027s history.\u0022\n\nThe two companies opened nine new detention centers across the country under contracts with ICE, adding thousands more beds able to hold arrested immigrants who are awaiting deportation hearings.\n\nAnd the FBI late last week told Minnesota investigators it would not share any information or evidence related to the shooting death of Alex Pretti, who died in Minneapolis in January.\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-02-17T02:15:01Z",
      "duration": "00:43:01",
      "explicit": false,
      "youTubeId": "SWvizWRqsLo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SWvizWRqsLo"
      }
    },
    {
      "id": "8185cacd-0812-44f6-b11f-ea2b9ffbbcae",
      "title": "\u0027I’m beyond broken\u0027: Diary in Epstein files details abuse girl says she endured",
      "description": "Newly released pages from the Epstein files include a diary written by a young girl describing repeated abuse, pregnancies and trauma she says she endured while around Jeffrey Epstein.\n\nThe handwritten entries, which include poems, sonograms and graduation mementos, offer a disturbing look at what she describes as years of suffering.\n\nScripps News examines the diary pages and the broader questions they raise about investigations tied to the Epstein case.",
      "release": "2026-02-16T21:56:30Z",
      "duration": "00:05:21",
      "explicit": false,
      "youTubeId": "sAX6RlvybmU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sAX6RlvybmU"
      }
    },
    {
      "id": "893d3875-5b98-448f-be13-a91cdc2dc92a",
      "title": "Today: Were girls buried by Jeffrey Epstein’s Zorro Ranch?",
      "description": "A top New Mexico official is calling for an investigation into public land near Jeffrey Epstein’s Zorro Ranch after a newly released email alleged that two foreign girls were buried there.\n\nLand Commissioner Stephanie Garcia Richard said she requested an investigation after learning about a 2019 email included in recently released Epstein-related documents. The email, sent to a conservative radio host, claimed that two girls were buried on public land leased near the ranch. The act was allegedly done at the direction of Epstein and Ghislaine Maxwell, who is serving a 20-year federal prison sentence for sex trafficking.\n\n“There was a very disturbing allegation that came out that could potentially be linked to state land,” Garcia Richard said. “Because I am the manager of that land. I’m the elected steward of that land and what occurs there and what the land is used for is of utmost interest and importance to us at the State Land Office.”",
      "release": "2026-02-14T02:30:31Z",
      "duration": "00:43:01",
      "explicit": false,
      "youTubeId": "OAqNC0s9KWg",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OAqNC0s9KWg"
      }
    },
    {
      "id": "402d5061-661e-41ad-bfec-0d3200efb3e1",
      "title": "Bondi Refuses to Apologize to Epstein Survivors in Heated Hearing on Capitol Hill",
      "description": "During a tense House Judiciary Committee hearing, Rep. Pramila Jayapal (D-Wash.) demanded that Attorney General Pam Bondi apologize to survivors of Jeffrey Epstein present in the audience. \n\nBondi said, \u0022I\u0027m not going to get in the gutter for her theatrics.\u0022\n\nJayapal also asked the survivors to raise their hands if they had not met with the Department of Justice—every single one did. \n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-02-11T16:18:43Z",
      "duration": "00:03:24",
      "explicit": false,
      "youTubeId": "NfLVTHYCvOY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NfLVTHYCvOY"
      }
    },
    {
      "id": "1975b8f8-c3e6-43f2-942c-5ce62c19d1cf",
      "title": "Ghislaine Maxwell pleads the Fifth, seeks clemency from President Trump",
      "description": "Ghislaine Maxwell refused to answer questions during a deposition before the House Oversight Committee, invoking her Fifth Amendment right amid an ongoing congressional investigation tied to Jeffrey Epstein.\n\nMaxwell’s attorney said she is remaining silent due to a pending habeas petition, adding that she would be willing to testify if granted clemency by President Donald Trump. Maxwell is currently serving a 20-year federal prison sentence following her 2021 sex trafficking conviction.\n\nCommittee leaders say the investigation will continue without Maxwell’s testimony, with several individuals linked to Epstein expected to appear in the weeks ahead.\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-02-09T16:55:11Z",
      "duration": "00:06:02",
      "explicit": false,
      "youTubeId": "8l1MhexZu_w",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8l1MhexZu_w"
      }
    },
    {
      "id": "b5a51e2d-5996-497a-a5ce-602afcf09255",
      "title": "Epstein survivor says she thinks ICE actions are to steer people away from release of all the files",
      "description": "Lisa Phillips, a survivor of Jeffrey Epstein\u0027s crimes and advocate for other survivors, said she is losing faith in the justice system since the Epstein files have still not been released in their entirety -- and there\u0027s no update in sight. \n\n\u0022They\u0027ve never been worried about the victims,\u0022 said Phillips. She said the stuff they have released feels like a joke. \n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-01-29T21:06:50Z",
      "duration": "00:08:53",
      "explicit": false,
      "youTubeId": "011Ce1bUXp4",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=011Ce1bUXp4"
      }
    },
    {
      "id": "0d9c8496-26f9-4ecf-85cd-78124493bd66",
      "title": "Comer threatens contempt as Clintons reject subpoenas in Epstein investigation",
      "description": "House Oversight Chairman James Comer responds after former President Bill Clinton and former Secretary of State Hillary Clinton declined to appear for testimony requested by the committee.\n\nThe Clintons’ attorneys argue the subpoenas tied to the Jeffrey Epstein investigation are invalid and legally unenforceable, saying they have already provided all relevant information in writing. Comer has threatened potential contempt proceedings, setting up a possible legal confrontation between Congress and the former officeholders.\n\nIn this video, Comer addresses the committee’s next steps and responds to the Clintons’ refusal to testify.\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-01-13T16:56:36Z",
      "duration": "00:02:38",
      "explicit": false,
      "youTubeId": "LJkOwWkJDK4",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LJkOwWkJDK4"
      }
    },
    {
      "id": "04837d3d-9050-4f35-98ee-22a3a0b8ff8d",
      "title": "Epstein survivors demand answers after DOJ misses full file release deadline",
      "description": "After the U.S. Department of Justice (DOJ) failed to fully comply with a law to release all files related to its investigation into convicted sex offender Jeffrey Epstein, a group of his survivors on Monday accused the agency of legal violations and are demanding accountability.\n\nThe DOJ faced a Friday deadline to release its massive cache of records related to the federal investigation into Epstein and his associates. However, the release sparked widespread outrage after only a portion of the documents were made public — many of which were heavily redacted.\n\nA group of 19 women, including two who chose to remain anonymous, said Monday that there is no excuse for the delay.\n\n\u0022The public received a fraction of the files, and what we received was riddled with abnormal and extreme redactions with no explanation,\u0022 the group said in a statement obtained by Scripps News. \u0022At the same time, numerous victim identities were left unredacted, causing real and immediate harm. No financial documents were released. Grand jury minutes, though approved by a federal judge for release, were fully blacked out – not the scattered redactions that might be expected to protect victim names, but 119 full pages blacked out. We are told that there are hundreds of thousands of pages of documents still unreleased. These are clear-cut violations of an unambiguous law.\u0022\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2025-12-22T20:01:50Z",
      "duration": "00:02:41",
      "explicit": false,
      "youTubeId": "Kgc5ONFhetY",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Kgc5ONFhetY"
      }
    },
    {
      "id": "804f79f4-51b2-48c6-aff2-4439e321ea1b",
      "title": "A victim reacts to the newly released Epstein investigation files",
      "description": "Files from the federal investigation into sex offender Jeffrey Epstein released Friday include photos, court documents, taped interviews and other materials.\n\nThe hundreds of thousands of documents released on Friday show many of Epstein\u0027s victims, whose images and other details have been heavily redacted for their protection. Some documents show hand-written testimony describing victims\u0027 interaction with Epstein.\n\nWhile the DOJ has not yet released all of the investigation files it is legally required to, at least one victim says she is vindicated.\n\nMaria Farmer reported Epstein and Ghislaine Maxwell\u0027s activities to the FBI in 1996 — a fact that Friday\u0027s release confirmed.\n\nFarmer issued a statement following the release of the files:\n\n\u0022I\u0027m crying for two reasons: I want everyone to know that I\u0027m shedding tears of joy for myself, but also tears of sorrow for all of the other victims that the FBI failed.\u0022\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2025-12-20T00:56:22Z",
      "duration": "00:04:56",
      "explicit": false,
      "youTubeId": "itziNiFSPL4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=itziNiFSPL4"
      }
    }
  ]
}