{
  "id": "98254418-e1ff-49b8-a579-9abe8217f5c8",
  "name": "Scripps News",
  "youTubeChannelId": "UCTln5ss6h6L_xNfMeujfPbg",
  "episodes": [
    {
      "id": "0d9c8496-26f9-4ecf-85cd-78124493bd66",
      "title": "Comer threatens contempt as Clintons reject subpoenas in Epstein investigation",
      "description": "House Oversight Chairman James Comer responds after former President Bill Clinton and former Secretary of State Hillary Clinton declined to appear for testimony requested by the committee.\n\nThe Clintons’ attorneys argue the subpoenas tied to the Jeffrey Epstein investigation are invalid and legally unenforceable, saying they have already provided all relevant information in writing. Comer has threatened potential contempt proceedings, setting up a possible legal confrontation between Congress and the former officeholders.\n\nIn this video, Comer addresses the committee’s next steps and responds to the Clintons’ refusal to testify.\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-01-13T16:56:36Z",
      "duration": "00:02:38",
      "explicit": false,
      "youTubeId": "LJkOwWkJDK4",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LJkOwWkJDK4"
      }
    },
    {
      "id": "04837d3d-9050-4f35-98ee-22a3a0b8ff8d",
      "title": "Epstein survivors demand answers after DOJ misses full file release deadline",
      "description": "After the U.S. Department of Justice (DOJ) failed to fully comply with a law to release all files related to its investigation into convicted sex offender Jeffrey Epstein, a group of his survivors on Monday accused the agency of legal violations and are demanding accountability.\n\nThe DOJ faced a Friday deadline to release its massive cache of records related to the federal investigation into Epstein and his associates. However, the release sparked widespread outrage after only a portion of the documents were made public — many of which were heavily redacted.\n\nA group of 19 women, including two who chose to remain anonymous, said Monday that there is no excuse for the delay.\n\n\u0022The public received a fraction of the files, and what we received was riddled with abnormal and extreme redactions with no explanation,\u0022 the group said in a statement obtained by Scripps News. \u0022At the same time, numerous victim identities were left unredacted, causing real and immediate harm. No financial documents were released. Grand jury minutes, though approved by a federal judge for release, were fully blacked out – not the scattered redactions that might be expected to protect victim names, but 119 full pages blacked out. We are told that there are hundreds of thousands of pages of documents still unreleased. These are clear-cut violations of an unambiguous law.\u0022\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2025-12-22T20:01:50Z",
      "duration": "00:02:41",
      "explicit": false,
      "youTubeId": "Kgc5ONFhetY",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Kgc5ONFhetY"
      }
    },
    {
      "id": "804f79f4-51b2-48c6-aff2-4439e321ea1b",
      "title": "A victim reacts to the newly released Epstein investigation files",
      "description": "Files from the federal investigation into sex offender Jeffrey Epstein released Friday include photos, court documents, taped interviews and other materials.\n\nThe hundreds of thousands of documents released on Friday show many of Epstein\u0027s victims, whose images and other details have been heavily redacted for their protection. Some documents show hand-written testimony describing victims\u0027 interaction with Epstein.\n\nWhile the DOJ has not yet released all of the investigation files it is legally required to, at least one victim says she is vindicated.\n\nMaria Farmer reported Epstein and Ghislaine Maxwell\u0027s activities to the FBI in 1996 — a fact that Friday\u0027s release confirmed.\n\nFarmer issued a statement following the release of the files:\n\n\u0022I\u0027m crying for two reasons: I want everyone to know that I\u0027m shedding tears of joy for myself, but also tears of sorrow for all of the other victims that the FBI failed.\u0022\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2025-12-20T00:56:22Z",
      "duration": "00:04:56",
      "explicit": false,
      "youTubeId": "itziNiFSPL4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=itziNiFSPL4"
      }
    }
  ]
}