{
  "id": "98254418-e1ff-49b8-a579-9abe8217f5c8",
  "name": "Scripps News",
  "youTubeChannelId": "UCTln5ss6h6L_xNfMeujfPbg",
  "episodes": [
    {
      "id": "893d3875-5b98-448f-be13-a91cdc2dc92a",
      "title": "Today: Were girls buried by Jeffrey Epstein’s Zorro Ranch?",
      "description": "A top New Mexico official is calling for an investigation into public land near Jeffrey Epstein’s Zorro Ranch after a newly released email alleged that two foreign girls were buried there.\n\nLand Commissioner Stephanie Garcia Richard said she requested an investigation after learning about a 2019 email included in recently released Epstein-related documents. The email, sent to a conservative radio host, claimed that two girls were buried on public land leased near the ranch. The act was allegedly done at the direction of Epstein and Ghislaine Maxwell, who is serving a 20-year federal prison sentence for sex trafficking.\n\n“There was a very disturbing allegation that came out that could potentially be linked to state land,” Garcia Richard said. “Because I am the manager of that land. I’m the elected steward of that land and what occurs there and what the land is used for is of utmost interest and importance to us at the State Land Office.”",
      "release": "2026-02-14T02:30:31Z",
      "duration": "00:43:01",
      "explicit": false,
      "youTubeId": "OAqNC0s9KWg",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OAqNC0s9KWg"
      }
    },
    {
      "id": "402d5061-661e-41ad-bfec-0d3200efb3e1",
      "title": "Bondi Refuses to Apologize to Epstein Survivors in Heated Hearing on Capitol Hill",
      "description": "During a tense House Judiciary Committee hearing, Rep. Pramila Jayapal (D-Wash.) demanded that Attorney General Pam Bondi apologize to survivors of Jeffrey Epstein present in the audience. \n\nBondi said, \u0022I\u0027m not going to get in the gutter for her theatrics.\u0022\n\nJayapal also asked the survivors to raise their hands if they had not met with the Department of Justice—every single one did. \n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-02-11T16:18:43Z",
      "duration": "00:03:24",
      "explicit": false,
      "youTubeId": "NfLVTHYCvOY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NfLVTHYCvOY"
      }
    },
    {
      "id": "1975b8f8-c3e6-43f2-942c-5ce62c19d1cf",
      "title": "Ghislaine Maxwell pleads the Fifth, seeks clemency from President Trump",
      "description": "Ghislaine Maxwell refused to answer questions during a deposition before the House Oversight Committee, invoking her Fifth Amendment right amid an ongoing congressional investigation tied to Jeffrey Epstein.\n\nMaxwell’s attorney said she is remaining silent due to a pending habeas petition, adding that she would be willing to testify if granted clemency by President Donald Trump. Maxwell is currently serving a 20-year federal prison sentence following her 2021 sex trafficking conviction.\n\nCommittee leaders say the investigation will continue without Maxwell’s testimony, with several individuals linked to Epstein expected to appear in the weeks ahead.\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-02-09T16:55:11Z",
      "duration": "00:06:02",
      "explicit": false,
      "youTubeId": "8l1MhexZu_w",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8l1MhexZu_w"
      }
    },
    {
      "id": "b5a51e2d-5996-497a-a5ce-602afcf09255",
      "title": "Epstein survivor says she thinks ICE actions are to steer people away from release of all the files",
      "description": "Lisa Phillips, a survivor of Jeffrey Epstein\u0027s crimes and advocate for other survivors, said she is losing faith in the justice system since the Epstein files have still not been released in their entirety -- and there\u0027s no update in sight. \n\n\u0022They\u0027ve never been worried about the victims,\u0022 said Phillips. She said the stuff they have released feels like a joke. \n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-01-29T21:06:50Z",
      "duration": "00:08:53",
      "explicit": false,
      "youTubeId": "011Ce1bUXp4",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=011Ce1bUXp4"
      }
    },
    {
      "id": "0d9c8496-26f9-4ecf-85cd-78124493bd66",
      "title": "Comer threatens contempt as Clintons reject subpoenas in Epstein investigation",
      "description": "House Oversight Chairman James Comer responds after former President Bill Clinton and former Secretary of State Hillary Clinton declined to appear for testimony requested by the committee.\n\nThe Clintons’ attorneys argue the subpoenas tied to the Jeffrey Epstein investigation are invalid and legally unenforceable, saying they have already provided all relevant information in writing. Comer has threatened potential contempt proceedings, setting up a possible legal confrontation between Congress and the former officeholders.\n\nIn this video, Comer addresses the committee’s next steps and responds to the Clintons’ refusal to testify.\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2026-01-13T16:56:36Z",
      "duration": "00:02:38",
      "explicit": false,
      "youTubeId": "LJkOwWkJDK4",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LJkOwWkJDK4"
      }
    },
    {
      "id": "04837d3d-9050-4f35-98ee-22a3a0b8ff8d",
      "title": "Epstein survivors demand answers after DOJ misses full file release deadline",
      "description": "After the U.S. Department of Justice (DOJ) failed to fully comply with a law to release all files related to its investigation into convicted sex offender Jeffrey Epstein, a group of his survivors on Monday accused the agency of legal violations and are demanding accountability.\n\nThe DOJ faced a Friday deadline to release its massive cache of records related to the federal investigation into Epstein and his associates. However, the release sparked widespread outrage after only a portion of the documents were made public — many of which were heavily redacted.\n\nA group of 19 women, including two who chose to remain anonymous, said Monday that there is no excuse for the delay.\n\n\u0022The public received a fraction of the files, and what we received was riddled with abnormal and extreme redactions with no explanation,\u0022 the group said in a statement obtained by Scripps News. \u0022At the same time, numerous victim identities were left unredacted, causing real and immediate harm. No financial documents were released. Grand jury minutes, though approved by a federal judge for release, were fully blacked out – not the scattered redactions that might be expected to protect victim names, but 119 full pages blacked out. We are told that there are hundreds of thousands of pages of documents still unreleased. These are clear-cut violations of an unambiguous law.\u0022\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2025-12-22T20:01:50Z",
      "duration": "00:02:41",
      "explicit": false,
      "youTubeId": "Kgc5ONFhetY",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Kgc5ONFhetY"
      }
    },
    {
      "id": "804f79f4-51b2-48c6-aff2-4439e321ea1b",
      "title": "A victim reacts to the newly released Epstein investigation files",
      "description": "Files from the federal investigation into sex offender Jeffrey Epstein released Friday include photos, court documents, taped interviews and other materials.\n\nThe hundreds of thousands of documents released on Friday show many of Epstein\u0027s victims, whose images and other details have been heavily redacted for their protection. Some documents show hand-written testimony describing victims\u0027 interaction with Epstein.\n\nWhile the DOJ has not yet released all of the investigation files it is legally required to, at least one victim says she is vindicated.\n\nMaria Farmer reported Epstein and Ghislaine Maxwell\u0027s activities to the FBI in 1996 — a fact that Friday\u0027s release confirmed.\n\nFarmer issued a statement following the release of the files:\n\n\u0022I\u0027m crying for two reasons: I want everyone to know that I\u0027m shedding tears of joy for myself, but also tears of sorrow for all of the other victims that the FBI failed.\u0022\n\n-------------------------------------\n\nJoin our newsletter at https://bit.ly/2q1tepr\nFollow us on Facebook: https://www.facebook.com/scrippsnews/\nFollow us on Twitter: https://www.twitter.com/scrippsnews\nFollow us on Instagram: https://www.instagram.com/scrippsnews/\nFollow us on TikTok: https://www.tiktok.com/@scrippsnews",
      "release": "2025-12-20T00:56:22Z",
      "duration": "00:04:56",
      "explicit": false,
      "youTubeId": "itziNiFSPL4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=itziNiFSPL4"
      }
    }
  ]
}