{
  "id": "3e1b70c7-c6ff-444b-83e1-5db6326271c3",
  "name": "Secrets We Keep",
  "spotifyId": "0wJt0WHQ3Cv7a4Z7sY3QSG",
  "appleId": 1699106866,
  "episodes": [
    {
      "id": "113d3a65-c857-48a0-8379-b6f80de27f5a",
      "title": "Should I Spit? - Episode 3 - Eternal Families",
      "description": "In this episode of Should I spit?, Claire discovers how the Church of Jesus Christ of Latter-day Saints is inextricably linked with the history of genetics and genealogy, through the church’s doctrines and rituals. Michael is shocked to learn that he was identified through a blood sample his father donated at his local church.  Michael’s DNA doesn’t match and is cleared by police, however, he is shaken and wants answers. He can’t understand how the police linked him and his family to Angie’s murder. Michael is approached by a journalist who discovers the Idaho Falls Police had quietly been using a new forensic identification technique called Familial Searching. Using this method, police found Michael based on DNA information stored in a publicly-available genealogy database owned by Ancestry.com.\n Lifeline 13 11 14\n Beyond Blue 1300 22 4636\nSee omnystudio.com/listener for privacy information.",
      "release": "2025-02-03T16:10:00Z",
      "duration": "00:45:17",
      "explicit": false,
      "spotifyId": "4knIW1WB5u0fIdRF0VseTS",
      "appleId": 1000697924634,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4knIW1WB5u0fIdRF0VseTS",
        "apple": "https://podcasts.apple.com/podcast/should-i-spit-episode-3-eternal-families/id1699106866?i=1000697924634"
      }
    },
    {
      "id": "5eb2f8fb-2040-4809-b19f-8aac8d188c58",
      "title": "Pray Harder - Bonus - An update",
      "description": "Richard gives an update on Todd Hubers plea hearing and shares two more important stories from women who grew up in the Revival Church movement. Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14; 1800 Respect 1800 737 732 Looking for what to listen to next? Try Crime In Focus: Killer Charm , the story of how a grandmother from suburban Queensland orchestrated the murder of her ex-partner. See omnystudio.com/listener for privacy information.",
      "release": "2024-12-19T23:00:00Z",
      "duration": "00:34:12.1790000",
      "explicit": true,
      "spotifyId": "1R93vbkqoZgU30kNd2dOuD",
      "appleId": 1000681037123,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1R93vbkqoZgU30kNd2dOuD",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-bonus-an-update/id1699106866?i=1000681037123"
      }
    },
    {
      "id": "a352b5df-3413-46d4-831e-47f653b0fae2",
      "title": "Pray Harder – Episode 9 - Love and Reckoning",
      "description": "Someone Richard wasn’t sure would ever talk to him is ready to speak. The church is rocked by the news of Pastor Noel’s death, and questions remain about whether new leadership will create change, or continue with the status quo. Richard returns to ex-members of the GRC, who have found support in each other and their families after the isolation of leaving the church. They’ve discovered the antidote to the GRC’s abuse of power and violence. It’s love. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14; 1800 Respect 1800 737 732 See omnystudio.com/listener for privacy information.",
      "release": "2024-12-14T18:55:00Z",
      "duration": "00:46:30.6870000",
      "explicit": true,
      "spotifyId": "2qx909t6fn65kWumrx028N",
      "appleId": 1000680377421,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qx909t6fn65kWumrx028N",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-episode-9-love-and-reckoning/id1699106866?i=1000680377421"
      }
    },
    {
      "id": "f73709e4-7387-430d-9ee1-b4a1d1f6bac2",
      "title": "Pray Harder – Episode 8 - Rebellion",
      "description": "Rumours abound of how Pastor Noel Hollins has used his finances to erase controversies in his church. Richard Baker’s investigation into how the Geelong Revival Centre maintains a tax-free charity status and where it uses its funds takes him to war-torn Sierra Leone. And former GRC Pastor Steve Mills finally goes head to head with Noel Hollins when he tries to protect members of the church. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14 See omnystudio.com/listener for privacy information.",
      "release": "2024-12-14T18:50:00Z",
      "duration": "00:39:44.1170000",
      "explicit": true,
      "spotifyId": "3rjKoGASk2lmK0QUzssxDQ",
      "appleId": 1000680377563,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3rjKoGASk2lmK0QUzssxDQ",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-episode-8-rebellion/id1699106866?i=1000680377563"
      }
    },
    {
      "id": "9b842d58-7da7-44cd-b167-62e02922e1ed",
      "title": "Pray Harder – Episode 7 - Good Soldiers",
      "description": "In the Geelong Revival Centre, men are responsible for the entire family’s salvation. If the father does something wrong, his wife and children are at risk of going to hell. We hear from men who have defied the church’s expectations, despite the threat of physical punishment in this life,and eternal punishment in the next. But those who comply also pay a terrible price for their obedience. And Richard is one step closer to understanding Pastor Noel Hollins, when he sees a missed call on his phone. Richard calls the Pastor back, and this time he answers. Please note this episode contains adult themes including descriptions of violence and homophobia, as well as discussions regarding suicide, and harmful drug and alcohol use. Listener discretion is advised. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14 See omnystudio.com/listener for privacy information.",
      "release": "2024-12-14T18:45:00Z",
      "duration": "00:41:24.7930000",
      "explicit": true,
      "spotifyId": "76EnxQIFi1uRLuGkDqa7ad",
      "appleId": 1000680377537,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/76EnxQIFi1uRLuGkDqa7ad",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-episode-7-good-soldiers/id1699106866?i=1000680377537"
      }
    },
    {
      "id": "35d5fa22-d5e0-467a-8014-c8f9567d2907",
      "title": "Pray Harder – Episode 6 - A Spiritual Problem",
      "description": "As a pastor in the church, Steve Mills watched on horrified as church members shunned or delayed medical care because of Pastor Noel Hollins relentless attacks on science and medicine. When someone is diagnosed with an illness, they are told it is only through prayer—not conventional medicine—that they will be saved. And when people die of treatable illnesses, those left grieving are told they should\u0027ve “prayed harder”. From the pulpit Pastor Noel’s teachings empower men in the church to interfere in the private health affairs of others— with sometimes tragic results. Steve Mills realises he must challenge Pastor Noel directly. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14 See omnystudio.com/listener for privacy information.",
      "release": "2024-12-07T17:35:00Z",
      "duration": "00:40:12.4860000",
      "explicit": true,
      "spotifyId": "037YfDV7CmadVhziDqDs8B",
      "appleId": 1000679588020,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/037YfDV7CmadVhziDqDs8B",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-episode-6-a-spiritual-problem/id1699106866?i=1000679588020"
      }
    },
    {
      "id": "bc73ecbc-e5ac-4e54-b165-0bc2b6aaf441",
      "title": "Pray Harder – Episode 5 - A Proverbs 31 Woman",
      "description": "The Geelong Revival Centre wants the women in its church to be straight out of Proverbs 31 in the Bible: virtuous, god-fearing, and dedicating her life to her husband and family— and to expect very little in return. Unmarried women can’t approach men to date, and they can’t marry without the Pastor’s permission. Those who are seen to fail as virtuous women find themselves interrogated and watched by members of the church. Men are also punished for their transgressions. But women carry the stain. Meanwhile, former GRC Pastor Steve Mills suggests one way Richard can secure Noel’s attention. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14 See omnystudio.com/listener for privacy information.",
      "release": "2024-12-07T17:30:00Z",
      "duration": "00:41:26.2820000",
      "explicit": true,
      "spotifyId": "3H0DhpepWEkA01Pp9mKfSb",
      "appleId": 1000679587770,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3H0DhpepWEkA01Pp9mKfSb",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-episode-5-a-proverbs-31-woman/id1699106866?i=1000679587770"
      }
    },
    {
      "id": "599fcbfc-f14a-4de9-a63f-22b95e26f4e3",
      "title": "Pray Harder – Episode 4 - You Were Never a Teenager Were You Pastor Hollins?",
      "description": "Inside the Geelong Revival Centre teenagers live a double life. They’re given zero freedoms, like small children, but they’re expected to live an adult life of religious devotion while still growing up. Pastor Noel Hollins is at war with the internet, pop music, and socialising outside of the church. He labels them as dangerous, but ex-church members say real dangers lie inside the GRC. Richard Baker uncovers the fallout from growing up inside the GRC, including stories of social ostracism, deep psychological trauma and distressing allegations by abuse victims, who say the church tried to silence them. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14 See omnystudio.com/listener for privacy information.",
      "release": "2024-12-07T17:25:00Z",
      "duration": "00:51:41.7010000",
      "explicit": true,
      "spotifyId": "2BlWfNRu10PiiB8bWQNF3Y",
      "appleId": 1000679587769,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2BlWfNRu10PiiB8bWQNF3Y",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-episode-4-you-were-never-a-teenager/id1699106866?i=1000679587769"
      }
    },
    {
      "id": "8161b1b9-611b-4f2e-b7a6-4344994a9f5a",
      "title": "Pray Harder – Episode 3 - The Lost Tribe",
      "description": "How did Noel Hollins become the leader of the Geelong Revival Centre? A surprising rebellion is hidden in the history of his long and authoritarian rule. Richard Baker unearths Noel’s beginnings and explores some of the stranger beliefs the church preaches, including about Pyramids and the British Royal Family’s connection to Geelong. Even some of the most loyal members of the GRC find themselves questioning the church— with repercussions. Richard realises that if he really wants to understand Pastor Noel, he needs to find a way to speak to him personally. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14 See omnystudio.com/listener for privacy information.",
      "release": "2024-11-30T18:25:00Z",
      "duration": "00:42:18.5790000",
      "explicit": true,
      "spotifyId": "3fS1DimWLnmcuE1ljF3uW4",
      "appleId": 1000678730850,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3fS1DimWLnmcuE1ljF3uW4",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-episode-3-the-lost-tribe/id1699106866?i=1000678730850"
      }
    },
    {
      "id": "ecdea105-37e1-4910-af89-e80727d51f90",
      "title": "Pray Harder – Episode 2 - I’ll Give You Something to Cry About",
      "description": "In the beachside town of Geelong, most kids look forward to endless summer days, while children in the Geelong Revival Centre wait for the end of days. GRC kids are told they’re always being watched. By their parents, their Pastor, and their God. They expect this constant surveillance, and the threat of violence if they step out of line. Insider recordings of GRC leader Pastor Noel Hollins reveal how he promoted corporal punishment for children, and we learn how church parents were pressured to enforce these rules on their own kids. Outspoken defectors of the GRC confide in journalist Richard Baker, he hears how from Pastor Noel’s pulpit, children learn to receive the Holy Spirit to keep the devil at bay. And what happens in the church, stays in the church. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14 See omnystudio.com/listener for privacy information.",
      "release": "2024-11-30T18:20:00Z",
      "duration": "00:34:51.4670000",
      "explicit": true,
      "spotifyId": "5qoies8c26GozohnIM7VDI",
      "appleId": 1000678730963,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qoies8c26GozohnIM7VDI",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-episode-2-ill-give-you-something-to-cry-about/id1699106866?i=1000678730963"
      }
    },
    {
      "id": "2f92b53a-bed8-45fe-9351-c53e6f8f2853",
      "title": "Pray Harder – Episode 1 – Noel\u0027s War",
      "description": "A story too big to ignore is drawing journalist Richard Baker back to his home town of Geelong. The chosen people of a strict Pentecostal church claim to have seen miracles happen, and expect to be among the few saved when Armageddon comes. But for some, the Geelong Revival Centre has brought the opposite of salvation. Ex-members are speaking out about the pain, control, and heartbreak they’ve endured under the rule of Pastor Noel Hollins, the leader of the church for the past 50 years. Richard meets some of these brave ex-members, many who are speaking out for the first time, as they share what it’s like to grow up in the GRC. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC Do you know more? Get in touch secretswekeep@sca.com.au Lifeline 13 11 14 See omnystudio.com/listener for privacy information.",
      "release": "2024-11-30T18:15:00Z",
      "duration": "00:37:09.5510000",
      "explicit": true,
      "spotifyId": "1dSEBWGni0Jh5bpjyau6N2",
      "appleId": 1000678730938,
      "subjects": [
        "Geelong Revival Centre",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dSEBWGni0Jh5bpjyau6N2",
        "apple": "https://podcasts.apple.com/podcast/pray-harder-episode-1-noels-war/id1699106866?i=1000678730938"
      }
    },
    {
      "id": "bf9e38a0-0948-4517-acfb-c39d47a09359",
      "title": "Introducing Pray Harder",
      "description": "The end of the world is coming for members of a Geelong Church. It’s been looming for over 50 years. And only the chosen few will be saved. Follow investigative journalist Richard Baker as he returns to his home town to investigate one of Australia’s most hardline Pentecostal churches and the man who led it. This series goes deep inside the secretive group and the disturbing doctrine of Pastor Noel Hollins. Richard Baker has received hundreds of hours of audio recordings that reveal the inner teachings of the doomsday group. He speaks to ex-members who have managed to escape, many who are sharing their stories for the first time. They speak of a brutal place where men must be obeyed, children must be punished and the solution to every problem is to pray harder. This special LiSTNR nine part investigation uncovers how an Australian church, with charity status, has impacted the lives of vulnerable people for generations - without repercussions. Until now. Listen to the full series now on LiSTNR https://play.listnr.com/podcast/secrets-we-keep Episode 1 available everywhere December 1. The interviews in this series were recorded during Pastor Noel Hollins leadership of the Geelong Revival Centre. During production, Pastor Noel died. The experiences and allegations raised do not relate to the current leadership of the GRC See omnystudio.com/listener for privacy information.",
      "release": "2024-11-21T18:40:00Z",
      "duration": "00:03:48.9370000",
      "explicit": false,
      "spotifyId": "4X7fIxeZatksK93oSu50t6",
      "appleId": 1000677811160,
      "subjects": [
        "Geelong Revival Centre",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4X7fIxeZatksK93oSu50t6",
        "apple": "https://podcasts.apple.com/podcast/introducing-pray-harder/id1699106866?i=1000677811160"
      }
    }
  ]
}