{
  "id": "9b889ca4-c26d-405d-9372-7bf96d54b28e",
  "name": "Sectes et géopolitique",
  "spotifyId": "2fxqLLGYvMTP0UOLkVzJvH",
  "episodes": [
    {
      "id": "463cdce7-b17f-4055-9f54-f7943017e157",
      "title": "La mafia des apologistes des sectes. Huitième chapitre : double vérité et noble mensonge",
      "description": "Ces épisode examinent le mouvement Tradition, Famille et Propriété (TFP), le décrivant comme une entité de droite catholique partageant des similitudes avec le fascisme tout en aspirant aux idéaux pré-révolutionnaires. L\u0027article met en évidence sa vision élitiste et anti-égalitaire, son mépris pour les classes populaires et une prédilection pour le luxe. Il explore également les liens du TFP avec les néoconservateurs américains, leur tactique d\u0027entrisme dans les médias et la politique, et leur collaboration avec des organisations similaires. Enfin, le texte aborde la philosophie de la \u0022double vérité et du noble mensonge\u0022, potentiellement influencée par Leo Strauss et Platon, comme explication possible de la position du CESNUR, un organisme issu de ce milieu, en faveur de la liberté religieuse, y compris pour des groupes éloignés du catholicisme traditionnel, dans le cadre d\u0027un projet contre-révolutionnaire et anti-laïc.",
      "release": "2025-05-17T00:00:00",
      "duration": "00:07:14.2590000",
      "explicit": false,
      "spotifyId": "3qppGfN8ZC7sdsubUF6PiD",
      "subjects": [
        "Cult Apologists"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3qppGfN8ZC7sdsubUF6PiD"
      }
    },
    {
      "id": "606d2614-f344-4382-98de-09fa5d2656c8",
      "title": "La mafia des apologistes des sectes. Septième chapitre : le groupe de Thèbes, extrême droite, sectes et renseignements",
      "description": "Cet extrait révèle l\u0027existence du Groupe de Thèbes, une organisation ésotérique fondée en 1990, unissant des figures aux parcours surprenants, allant d\u0027un catholique traditionaliste à un ancien terroriste et des extrémistes de droite. Le texte met en évidence des chevauchements de membres entre ce groupe et le CESNUR (Centre d\u0027Études des Nouvelles Religions), une organisation présentée comme une plateforme de défense des sectes. Il suggère des liens potentiels entre ces groupes, l\u0027extrême droite et les services de renseignement, notamment à travers la figure de Jean-François Mayer. L\u0027ensemble brosse un tableau complexe d\u0027alliances inattendues et d\u0027agendas cachés au sein du monde ésotérique et académique.",
      "release": "2025-05-16T00:00:00",
      "duration": "00:06:06.3870000",
      "explicit": false,
      "spotifyId": "1UVr2U2BiaIo1IeJLi7IIh",
      "subjects": [
        "Cult Apologists"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1UVr2U2BiaIo1IeJLi7IIh"
      }
    },
    {
      "id": "cff439ea-e374-4344-b5a5-aa269e8ac13f",
      "title": "La Mafia des Apologistes des Sectes: Sixième chapitre : Deux cultes chinois, le CESNUR et le soft power",
      "description": "L\u0027 épisode examine deux groupes religieux chinois persécutés en Chine, le Falun Gong et l\u0027Église du Dieu Tout-Puissant, et l\u0027influence de leurs organisations médiatiques respectives en Occident. Il met en évidence comment The Epoch Times, lié au Falun Gong, est devenu un acteur majeur de la désinformation de droite, notamment aux États-Unis, malgré son financement flou et les démêlés judiciaires de ses dirigeants. Parallèlement, il explore comment Bitter Winter, une publication liée au CESNUR et défendant les deux groupes, est devenue une source d\u0027information clé pour le Département d\u0027État américain sur la liberté religieuse en Chine, soulevant des questions sur son indépendance et ses sources. Le texte souligne également les liens entre ces groupes et diverses figures politiques et organisations occidentales, et le rôle joué par des controverses et des accusations de complot. Enfin, il met en lumière les préoccupations concernant la fiabilité des informations provenant de ces sources, y compris celles utilisées par des entités officielles.",
      "release": "2025-05-12T00:00:00",
      "duration": "00:20:23.6680000",
      "explicit": false,
      "spotifyId": "12Z9L6RZpDDr1mFofjR9si",
      "subjects": [
        "Cult Apologists",
        "Falun Gong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/12Z9L6RZpDDr1mFofjR9si"
      }
    },
    {
      "id": "f9e98b1c-a88f-4333-b082-ff90b846c9c8",
      "title": "La Mafia des Apologistes des Sectes. Cinquième chapitre : le réseau libertaire",
      "description": "L\u0027épisode explore la théorie de l\u0027économie religieuse, qui considère la religion comme un marché où différentes confessions sont en concurrence pour les adhérents, soutenant qu\u0027une plus grande concurrence mène à une plus grande participation religieuse et favorise les formes de foi les plus exigeantes et fondamentalistes. Il établit des parallèles avec le libertarisme, en particulier le paléolibertarisme, qui défend la liberté individuelle et un État minimal, même pour les choix considérés comme répréhensibles. L\u0027article révèle ensuite les liens entre le monde des apologies de cultes, le conservatisme chrétien agressif et les réseaux financiers de droite ultra-libérale aux États-Unis, démontrant comment ces groupes collaborent et financent des organisations à l\u0027étranger pour promouvoir leurs idéologies, y compris la défense de la liberté religieuse comme moyen d\u0027affaiblir la laïcité. Enfin, il met en lumière les connections surprenantes entre ces réseaux et des personnalités associées à la Russie, suggérant des alignements idéologiques inattendus malgré les tensions géopolitiques.",
      "release": "2025-05-11T00:00:00",
      "duration": "00:07:49.5530000",
      "explicit": false,
      "spotifyId": "6zPBnWdVLI0e69JbbE9QQ0",
      "subjects": [
        "Cult Apologists"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6zPBnWdVLI0e69JbbE9QQ0"
      }
    },
    {
      "id": "35813ca0-9015-4903-8ab0-02ab2007810e",
      "title": "La Mafia des Apologistes des Sectes. quatrième chapitre : attaque contre la laïcité",
      "description": "Cet épisode examine l\u0027influence politique et les liens entre les nouveaux mouvements religieux, souvent qualifiés de « sectes », et les figures politiques, notamment au Japon et aux États-Unis. Il met en lumière les connections historiques et continues entre la Église de l\u0027Unification et le Parti Libéral Démocrate japonais, suite à l\u0027assassinat de Shinzo Abe par un homme affirmant vouloir punir l\u0027organisation pour avoir ruiné sa famille. Le texte critique également le rôle d\u0027organisations comme le CESNUR et la Commission américaine sur la liberté religieuse internationale (USCIRF), suggérant qu\u0027elles défendent de manière préjudicielle ces groupes, même face à de graves accusations, et que l\u0027USCIRF est utilisée pour attaquer les pays laïcs européens. L\u0027article cite des exemples de personnalités controversées au sein de l\u0027USCIRF.",
      "release": "2025-05-08T00:00:00",
      "duration": "00:06:39.7770000",
      "explicit": false,
      "spotifyId": "196PdUMsEwMuVyBcDs99GU",
      "subjects": [
        "Cult Apologists",
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/196PdUMsEwMuVyBcDs99GU"
      }
    },
    {
      "id": "3fbb7f70-ca02-4b70-bdc6-62ed181b6312",
      "title": "La Mafia des Apologistes des sectes. Troisiéme Chapitre: le CESNUR",
      "description": "Cet épisode examinele traditionnalisme catholique radical et son lien avec la violence politique et les réseaux d\u0027influence. Ils abordent notamment la figure d\u0027Yves Guérin-Sérac, fondateur d\u0027Aginter Presse, une organisation secrète impliquée dans le terrorisme de droite et liée aux services de renseignement occidentaux, malgré sa religiosité fervente. Les sources retracent les origines de cette mouvance dans l\u0027Organisation Armée Secrète (OAS) et ses liens avec des penseurs comme Jean Ousset et Plinio Correa de Oliveira, qui combattaient la \u0022subversion\u0022 ou la \u0022révolution\u0022 moderne. Enfin, elles analysent comment cette idéologie a évolué et s\u0027est associée au néoconservatisme américain, notamment à travers le CESNUR, un centre d\u0027étude des nouvelles religions dirigé par Massimo Introvigne, présenté comme un outil de lutte contre la laïcité sous couvert de défense de la liberté religieuse.",
      "release": "2025-05-07T00:00:00",
      "duration": "00:07:37.2930000",
      "explicit": false,
      "spotifyId": "7EZRsPbvkdjEdGGGEhqYO6",
      "subjects": [
        "Cult Apologists"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7EZRsPbvkdjEdGGGEhqYO6"
      }
    },
    {
      "id": "7eaaa26d-096b-4b95-8645-ba39a00ae9d7",
      "title": "La Mafia des Apologetes des Cultes. Deuxième chapitre : La Scientologie et le réseau des apologistes des sectes",
      "description": "Analyse des liens entre Scientology et des organisations de défense de la liberté religieuse, et de leur stratégie pour \u0022neutraliser\u0022 les critiques.",
      "release": "2025-05-05T00:00:00",
      "duration": "00:07:12.9120000",
      "explicit": false,
      "spotifyId": "7AhpXqRTV8l89vo8DtQS9K",
      "subjects": [
        "Cult Apologists",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7AhpXqRTV8l89vo8DtQS9K"
      }
    },
    {
      "id": "35a83baa-79bc-4a06-83cd-32acb4bee691",
      "title": "La Mafia des Apologistes des Cultes. Premier chapitre : des choses drôles",
      "description": "Ce podcast offre une analyse critique d\u0027une organisation appelée European Federation for Freedom of Belief (FOB) et de ses associés, suggérant des liens étroits avec la Scientologie et d\u0027autres groupes controversés. L\u0027auteur décrit comment son travail a été attaqué par FOB et des individus affiliés, y compris par des allégations grotesques. Le texte met en évidence les structures complexes et parfois opaques des entités associées à ces groupes, utilisant des informations sur des sociétés, des adresses et des connexions interpersonnelles. Il critique également l\u0027utilisation de tactiques diffamatoires et la diffusion de fausses informations par ces organisations et leurs publications. Enfin, il illustre par des photographies les apparentes coordinations et collaborations entre des représentants de la Scientologie et les dirigeants des organisations défendant la \u0022liberté religieuse\u0022.",
      "release": "2025-05-03T00:00:00",
      "duration": "00:08:20.4590000",
      "explicit": false,
      "spotifyId": "7fRQmZKhmUna97duf0voHx",
      "subjects": [
        "Cult Apologists",
        "Scientology",
        "Connexions",
        "School of Philosophy and Economic Science"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7fRQmZKhmUna97duf0voHx"
      }
    }
  ]
}