{
  "id": "cb63c145-7285-4d64-8b14-e506c129dfc5",
  "name": "Secular Agenda",
  "appleId": 1629581072,
  "episodes": [
    {
      "id": "a464bd6c-c7f1-4e80-85d1-0b54ab0ceee4",
      "title": "Supporting survivors of cults and high-demand groups",
      "description": "This episode highlights the psychological impacts and other harms experienced in religious cults and high-demand religious groups, and discusses the supports cult survivors need on their path to recovery. \nThe episode features an interview with Maria Esguerra (2:03), a psychologist and director of the Olive Leaf Network Australia, which is dedicated to supporting former members of high-demand religious groups.\nMaria is a survivor of the Children of God cult – now known as the Family International. \nMaria co-authored a submission to the Victorian parliamentary inquiry examining recruitment methods and impacts of cults and organised fringe groups.\nThe Legislative Assembly Legal and Social Issues Committee’s inquiry is currently conducting hearings and plans to report its findings by 30 September next year. Visit the committee website here.\nIn September this year, the committee released the results of a questionnaire conducted as part of its inquiry. Of 317 responses, 95 per cent of people reported psychological harm, while 85 per cent reported personal restrictions and 52 per cent physical harm. Read about the questionnaire here.\nWarning: this interview includes discussion of sexual abuse.\nThe Rationalist Society of Australia is actively lobbying and advocating for coercive control laws to apply to cults and high-demand groups. Follow our campaign here.\nThe podcast is hosted by Si Gladman, Executive Director of the Rationalist Society of Australia. To support the work of the Rationalist Society of Australia, become a member or make a donation on our website.\nThe theme music of The Secular Agenda podcast is called \u0027Curiosity\u0027, and it\u0027s by Shimmer.",
      "release": "2025-10-19T02:38:17Z",
      "duration": "00:41:33",
      "explicit": false,
      "appleId": 1000732478578,
      "subjects": [
        "Children Of God",
        "Cult Psychology",
        "Psychology",
        "Cult Recovery",
        "Legislation"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/supporting-survivors-of-cults-and-high-demand-groups/id1629581072?i=1000732478578"
      }
    },
    {
      "id": "3965ca33-8fd8-4aac-86e7-3a0a7e3424a3",
      "title": "The Victorian inquiry examining coercive control in cult groups",
      "description": "This episode highlights a new parliamentary inquiry in Victoria examining cults and organised fringe groups,  the methods used to recruit and control their members, and the impacts of coercive control. The episode features an interview with Lara Kaput (02:10), a former member of the Jehovah’s Witnesses who became a whistleblower. For a number of years, Lara dedicated herself to advocacy work with the group known as Say Sorry. She has recently stepped down from Say Sorry but continues to advocate for governments to address abuses in cult groups.\nThe Legislative Assembly Legal and Social Issues Committee’s inquiry is currently open for submissions, closing at the end of July 2025. Submissions can be made via the committee\u0027s website. Visit it here.\nThe Rationalist Society of Australia is advocating for states and territories to extend coercive control laws to cover cults and high-demand religious groups. Follow our campaign here.\nIn early April this year, The Age featured a report by Richard Baker about the establishment of the committee inquiry. Read here.\nIn May, SBS featured a report by Aleisha Orr about the inquiry and included comments from a support group for ex-cult members about its hopes that the inquiry will raise awareness about harms and drive change. Read here.\nIn May, the Australian Christian Lobby’s Michelle Pearse warned that the Victorian parliamentary committee inquiry into cults and their coercive practices could impact the “Christian church” and restrict freedom of religion. Read here.\nThe Secular Agenda podcast is hosted by Si Gladman, Executive Director of the Rationalist Society of Australia. To support the work of the Rationalist Society of Australia, become a member or make a donation on our website.\nThe theme music of the podcast is called \u0027Curiosity\u0027, and it\u0027s by Shimmer.",
      "release": "2025-06-19T07:38:29Z",
      "duration": "00:34:39",
      "explicit": false,
      "appleId": 1000713538791,
      "subjects": [
        "Legislation",
        "Cult Psychology",
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/the-victorian-inquiry-examining-coercive-control-in/id1629581072?i=1000713538791"
      }
    }
  ]
}