{
  "_ts": 0,
  "id": "c964873a-7083-4f8f-b047-17fea1d1e971",
  "name": "Seek Safely",
  "spotifyId": "6DfJSUo2AqS7s5AMu1Ke8b",
  "appleId": 1647275899,
  "episodes": [
    {
      "id": "6b092240-18df-4ff1-a3e1-3e6484c0be3a",
      "title": "Discovering the Dysfunction in Self-help",
      "description": "In this episode, Dr. Doyle and Jean return to the underlying discussion of the self-help industry and the flaws within it that drive SEEK Safely’s mission. It was after Kirby Brown’s death at the 2009 Spiritual Warrior retreat that the Brown family discovered some of the rot at the core of this multi-billion dollar industry. This drove the family to found SEEK Safely, recognizing that the impulse to seek is not the issue—it’s the unethical, unregulated self-help providers that are the issue and the source of potential harm. Empowering and protecting seekers has always been, and remains, SEEK’s ultimate goal. Show Notes: To Read: Positive Imaging by Norman Vincent Peale Tragedy in Sedona by Connie Joy Cult Education Institute , website of Rick Alan Ross Stanley Milgram Authority experiments To Watch: School House Rock: How a Bill Becomes a Law Learn more about SEEK Safely on our website Follow SEEK on Instagram , Twitter , and Facebook Follow Dr. Glenn on Instagram , Twitter , and Facebook Read the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny Brown Donate to support SEEK’s mission To Contact SEEK email info@seeksafely.org",
      "release": "2024-10-21T22:00:00Z",
      "duration": "00:57:48.9040000",
      "explicit": false,
      "spotifyId": "79ystPy27i13ZpE48pLCtS",
      "appleId": 1000673915495,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/79ystPy27i13ZpE48pLCtS",
        "apple": "https://podcasts.apple.com/podcast/discovering-the-dysfunction-in-self-help/id1647275899?i=1000673915495"
      }
    },
    {
      "id": "6a217d36-acb3-40a4-b647-f06ee417108a",
      "title": "Following up with Anne Peterson, Author of \u0022Is This a Cult\u0022",
      "description": "Previously on the Podcast , Anne Peterson introduced her new memoir, \u0022Is This A Cult?\u0022 about her many years of involvement with Landmark. Anne joins the podcast again to discuss the response to her memoir, including a flood of messages from other ex-Landmarkians saying \u0022same here!\u0022 Anne also shares what she\u0027s learned since her book launch that has given her even more clarity about her own experience and what needs to happen going forward to create a more ethical self-help industry. SEEK is excited to share that Anne is launching the Safe Practitioners Workshop, an 8-session program for self-help practitioners and consumers, designed around the tenets of the SEEK Safely Promise. Sign up for one or all sessions here . The Workshop starts June 5th. Listen for more on what Anne sees as the SEEK Safely Movement. Mentioned on the Episode: To Read: \u0022Is This a Cult: Confronting the Line between Transformation and Exploitation\u0022 To Listen: Previous Episode with Anne about her Memoir Anne on A Little Bit Culty To Watch: The Program To Learn: ilumn8.life The SEEK Safely Promise Learn more about SEEK Safely on our website Follow SEEK on Instagram , Twitter , and Facebook Follow Dr. Glenn on Instagram , Twitter , and Facebook Read the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny Brown Donate to support SEEK’s mission To Contact SEEK email info@seeksafely.org",
      "release": "2024-05-27T08:00:00Z",
      "duration": "01:20:03.6310000",
      "explicit": false,
      "spotifyId": "0yG3rfw3rEvFfgA8ZwZ4j3",
      "appleId": 1000656879791,
      "subjects": [
        "Self-Help",
        "Landmark"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0yG3rfw3rEvFfgA8ZwZ4j3",
        "apple": "https://podcasts.apple.com/podcast/following-up-with-anne-peterson-author-of-is-this-a-cult/id1647275899?i=1000656879791"
      }
    },
    {
      "id": "24264a02-108b-4eee-aad0-48e631d0aa30",
      "title": "SEEK Safely Podcast (Taylor Edition) with Brit Barkholtz (Part 1)",
      "description": "Brit Barkholtz is a licensed clinical social worker specializing in trauma and eating disorders, active in the Twitter therapist community as The Caffeinated Therapist . Brit shares her take on MLMs, self-help exploiting trauma, “culty” stuff, and Taylor Swift as a tool of trauma recovery. This episode is Part 1 of 2. To Read: Brit’s thoughts on The Tortured Poet’s Department on HuffPo PESI To Listen To: SEEK Podcast Episode on MLMs SEEK Pod Episode on Trauma Taylor Swift, The Tortured Poet’s Department Learn more about SEEK Safely on our website Follow SEEK on Instagram , Twitter , and Facebook Follow Dr. Glenn on Instagram , Twitter , and Facebook Read the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny Brown Donate to support SEEK’s mission To Contact SEEK email info@seeksafely.org",
      "release": "2024-05-06T00:00:00",
      "duration": "00:46:01.9520000",
      "explicit": false,
      "spotifyId": "3ABgFx0XIcUoGpNnXPm3Up",
      "subjects": [
        "Multi-Level Marketing",
        "Self-Help",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ABgFx0XIcUoGpNnXPm3Up"
      }
    },
    {
      "id": "29b19f18-bd13-43fd-aa0a-7cb19c6f4a13",
      "title": "Bypassing–Spiritual and Otherwise–in Self-help",
      "description": "Bypassing is, essentially, avoidance. It\u0027s something we all do from time to time as a response to something unpleasant in our lives. But sometimes bypassing can cause us to go too far, putting off challenge for later that we\u0027d be better off dealing with now. And sometimes in the self-help world, bypassing is either encouraged or deeply embedded in the thought system being pushed. Dr. Glenn highlights how spiritual bypassing, emotional bypassing, and reality bypassing are all especially dangerous for trauma survivors. Have a listen so you can be prepared to recognize bypassing and know whether or not it\u0027s a potential red flag situation. On another note, special thank you to everyone who donated to Dr. Glenn\u0027s birthday fundraiser to benefit SEEK! We are always so grateful for the support! To Read: “The Road Less Traveled” by M. Scott Peck “Is This a Cult” by Anne L. Peterson https://isthisacultbook.com About EMDR Therapy About Somatic Therapy “Waking the Tiger” by Peter Levine To Listen To: SEEK Safely Podcast Interview with Anne Peterson Part 1 , Part 2 The Deep End by Jennings Brown Learn more about SEEK Safely on our website Follow SEEK on Instagram , Twitter , and Facebook Follow Dr. Glenn on Instagram , Twitter , and Facebook Read the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny Brown Donate to support SEEK’s mission To Contact SEEK email info@seeksafely.org",
      "release": "2024-04-01T08:00:00Z",
      "duration": "01:03:04.1500000",
      "explicit": false,
      "spotifyId": "2kiKryLu1UIGk7sNsxl9Cs",
      "appleId": 1000651047095,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2kiKryLu1UIGk7sNsxl9Cs",
        "apple": "https://podcasts.apple.com/podcast/bypassing-spiritual-and-otherwise-in-self-help/id1647275899?i=1000651047095"
      }
    },
    {
      "id": "0305d5f8-4e02-43fc-9e51-fd1a3418e893",
      "title": "Part 2: “Is This A Cult?” – Anne Peterson\u0027s New Memoir about Her Time with Landmark Education \u0026 the Infamous Werner Erhard",
      "description": "Continuing our conversation with Anne Peterson, who has decades of involvement with Landmark, one of the original large-group awareness training (LGAT) companies, including experience producing a breakthrough leadership program developed for Landmark\u0027s founder, Werner Erhard. She tells her story in her memoir, “ Is This A Cult: Confronting the Line Between Transformation and Exploitation .” This episode is Part 2 of 2. Listen to Part 1 if you haven’t already! To Read: https://isthisacultbook.com iLumn8.life , Anne’s safer self-help platform Rick Alan Ross “ Outrageous Betrayal ” by Steven Pressman The SEEK Safely Promise “ This Sweet Life ” by Ginny and Jean Brown About LGATs To Watch: I Am Not Your Guru To Listen: Anne’s First Interview on the SEEK Safely Podcast Learn more about SEEK Safely on our website",
      "release": "2024-03-18T08:00:00Z",
      "duration": "01:04:03.0820000",
      "explicit": false,
      "spotifyId": "6l8tjNobY8SvsCjCIdQDz5",
      "appleId": 1000649549549,
      "subjects": [
        "Landmark",
        "Erhard Seminars Training"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6l8tjNobY8SvsCjCIdQDz5",
        "apple": "https://podcasts.apple.com/podcast/part-2-is-this-a-cult-anne-petersons-new-memoir/id1647275899?i=1000649549549"
      }
    },
    {
      "id": "237a268f-d01d-4609-90d9-3f59dbd2ff55",
      "title": "“Is This A Cult?” – Anne Peterson\u0027s New Memoir about Her Time with Landmark Education \u0026 the Infamous Werner Erhard",
      "description": "Anne Peterson has decades of involvement with Landmark, one of the original large-group awareness training (LGAT) companies, including experience producing a breakthrough leadership program developed for Landmark\u0027s founder, Werner Erhard. Millions (3.5 million, according to Landmark\u0027s press packet) have passed through its trademark Landmark Forum training, many of them having positive experiences. But after her many years of working with Landmark as a facilitator and program producer, Anne began to see some of the cracks under the surface, particularly with its very guru-y founder, Werner Erhard (aka Jack Rosenberg). Anne is now telling her story–and in the process, raising many red flags for other seekers of personal growth–in her memoir, “ Is This A Cult: Confronting the Line Between Transformation and Exploitation .” This episode is Part 1 of 2. To Read: https://isthisacultbook.com Rick Alan Ross “ Outrageous Betrayal ” by Steven Pressman “ The Program ” by Toni Natale The SEEK Safely Promise “ This Sweet Life ” by Ginny and Jean Brown About LGATs To Watch: I Am Not Your Guru To Listen: Anne’s First Interview on the SEEK Safely Podcast Guru Podcast Learn more about SEEK Safely on our website",
      "release": "2024-03-11T08:00:00Z",
      "duration": "00:58:42.5330000",
      "explicit": false,
      "spotifyId": "1sJPUskLmLgxDtpRTgLDc4",
      "appleId": 1000648734855,
      "subjects": [
        "Landmark",
        "Erhard Seminars Training"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1sJPUskLmLgxDtpRTgLDc4",
        "apple": "https://podcasts.apple.com/podcast/is-this-a-cult-anne-petersons-new-memoir-about-her/id1647275899?i=1000648734855"
      }
    },
    {
      "id": "4259da35-6563-47eb-93ca-7998e4daba3e",
      "title": "Self-help Books that Arent\u0027s Self-help Books with Guest Dr. Christine Whelan",
      "description": "Our resident self-help geeks, Dr. Doyle and Dr. Christine Whelan, along with Jean, talk about self-help books that aren’t self-help books—that is, books that were not written to be self-help books but have been adopted into self-help culture, or society at large, as self-helpy how-to life manuals. Some are about other aspects of mental health and wellness, some are memoir or autobiography, some are straight-up fiction, but somehow they either took on a self-help life of their own, or have been readily adopted by the self-help industry, or launched the author into the self-helpisphere. The rest of the notes are just links. So. Many. Links. To Read: The Bible by God(?)Atlas Shrugged by Ayn RandThe 7 Habits of Highly Effective People by Stephen R. CoveyAutobiography of Benjamin FranklinHow to Win Friends and Influence People by Dale CarnegieThe Power of Positive Thinking by Norman Vincent PealeThe Power of Purpose by Richard J. LeiderSelf-esteem by Nathaniel BrandenThe Greatest Salesman in the World by Og BrandinoThe Alchemist by Paul CoelhoTo Kill a Mockingbird by Harper LeeSapiens: A Brief History of Humankind by Yuval Noah HarariGuns, Germs, and Steel by Jared DiamondEat, Pray, Love by Elizabeth GilbertThe Art of the Deal by Tony Schwartz and Donald TrumpI’m Ok; You’re Ok by Thomas HarrisThe Meditations by Marcus AureliusThe Art of War by Sun TzuThe Prince by Niccolo Machiavelli Get the links to the rest of the books we mention on our website...",
      "release": "2024-02-05T09:00:00Z",
      "duration": "01:07:34.0210000",
      "explicit": false,
      "spotifyId": "1OoBEkj9oRsyb2o1JLrucg",
      "appleId": 1000644187903,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1OoBEkj9oRsyb2o1JLrucg",
        "apple": "https://podcasts.apple.com/podcast/self-help-books-that-arents-self-help-books-with-guest/id1647275899?i=1000644187903"
      }
    },
    {
      "id": "31bb5be2-42b2-4ca5-b1d0-ac6271ed427c",
      "title": "BINGO! We’ve got another Self-help Cult with Twin Flames Universe",
      "description": "Glenn and Jean tackle the cosmic matchmaking self-help group/cult, Twin Flames Universe. Much has already been written and said about this fascinating/terrifying group. But on the SEEK Safely Podcast, the focus is on what this Twin Flames phenomenon says about self-help, and what it illuminates about why and how people get into self-help groups that turn out to be cults. Also Mentioned in this Episode: To Read: Unlimited Power by Tony RobbinsMen are From Mars, Women are From Venus by John GrayThe 5 Love Languages by Gary ChapmanTo Watch: Escaping Twin Flames Docuseries on NetfliXDesperately Seeking Soulmate: Escaping Twin Flames Universe Docuseries on PrimeTo Listen To:A Little Bit Culty Episode with Alice Hines about Twin Flames UniverseA Little Bit Culty Episode with Kelly Griffin about Twin Flames UniverseLearn more about SEEK Safely on our websiteFollow SEEK on Instagram, Twitter, and FacebookFollow Dr. Glenn on Instagram, Twitter, and FacebookRead the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny Brown",
      "release": "2024-01-01T17:00:00Z",
      "duration": "00:54:06.6280000",
      "explicit": false,
      "spotifyId": "5m99CAjQvJaVa4zUNMMiEN",
      "appleId": 1000640247376,
      "subjects": [
        "Twin Flames Universe",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5m99CAjQvJaVa4zUNMMiEN",
        "apple": "https://podcasts.apple.com/podcast/bingo-weve-got-another-self-help-cult-with-twin-flames/id1647275899?i=1000640247376"
      }
    },
    {
      "id": "59dae3e1-f542-44c6-a790-b02e07752ab8",
      "title": "You Cannot Miss This Opportunity to Talk about MLMs!",
      "description": "Jean and Glenn have an amazing opportunity to share with you! That’s right, we’re talking all about multi-level marketing! Why is the self-help podcast talking about MLMs? In this episode, the discussion specifically highlights the links and parallels between self-help and MLMs:how they share similar tactics to pull people in the similar types of people that are targeted by MLMs and self-helphow they use self-help tropes like the Law of Attraction to condition/gaslight their victims sales associatesthe shared history between self-help and MLMsthe familiar faces from the self-help industry that cross over into the MLM industryIndeed, the ways in which MLMs operate and even the way the whole industry is shaped is very similar to the self-help industry. So before you sign up to an MLM ~or~ a self-help program, learn about some of the ways these “opportunities” might not live up to their promises. Quoted in the episode:from American Beauty: “In order to be successful, one must project an image of success at all times.”Also mentioned in this Episode:LuLaRich docu-series on Amazon PrimeJohn Oliver’s MLM segmentRobert L. Fitzpatrick, expert on home-based businessesThe Office clipSteven Hassan’s BITE Model Penn and Teller Bullshit “Easy Money” episodeLearn more about SEEK Safely on our websiteFollow SEEK on Instagram, Twitter, and FacebookFollow Dr. Glenn on Instagram, Twitter, and FacebookRead the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny BrownDonate to support SEEK’s missionTo Contact SEEK email info@seeksafely.org",
      "release": "2023-05-01T00:00:00",
      "duration": "01:05:37.0180000",
      "explicit": false,
      "spotifyId": "4sEbchDzeaAes92i7VyHgd",
      "appleId": 1000611282727,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4sEbchDzeaAes92i7VyHgd",
        "apple": "https://podcasts.apple.com/podcast/you-cannot-miss-this-opportunity-to-talk-about-mlms/id1647275899?i=1000611282727"
      }
    },
    {
      "id": "6013a8f1-dc70-43d9-80f3-fd5dd6c09aec",
      "title": "Glenn and Jean Spoil ‘The Secret’",
      "description": "Despite its name, the Law of Attraction will come to you in your self-help journey, whether you’ve asked for it or not. It’s a big part of SEEK’s story, given that James Arthur Ray’s rise to fame came from his involvement with the self-help phenomenon of the early 2000’s, “The Secret.”Jean and Dr. Glenn Patrick Doyle break down this enduring “law” in self-help thinking–where and when the concept has popped up in self-help history, as well as more broadly in philosophy, literature, and religious thought.They cover what’s good in the concept, how it shifts around in popular conversation, and where it goes off the rails and can become more damaging.Quotes mentioned:“The greatest discovery of my generation is that a human being can alter his life by altering his attitude.”William James“Men at some time are masters of their fates: The fault, dear Brutus, is not in our stars, But in ourselves, that we are underlings. Might you become master of your fate through choice—no matter what the stars say?”William Shakespeare in “Julius Caesar”Learn more about SEEK Safely on our websiteFollow SEEK on Instagram, Twitter, and FacebookFollow Dr. Glenn on Instagram, Twitter, and FacebookRead the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny BrownDonate to support SEEK’s missionTo Contact SEEK email info@seeksafely.orgAlso mentioned in this episode:Eva Collins Interview on the SEEK Safely Podcast“Creative Visualization” by Shakti Gawain “The Power of Positive Thinking” Normal Vincent Peale“The Science of Mind” by Earnest Holmes“Agnes Collard’s Marriage of the Minds” in by Rachel Aviv in The New YorkerThe New Thought movementMartin Seligman and positive psychology“The Secret” by Rhonda Byrne",
      "release": "2023-04-17T00:00:00",
      "duration": "01:00:13.1000000",
      "explicit": false,
      "spotifyId": "2zJKjkKJj5S7kRfB8EPFcw",
      "appleId": 1000609261307,
      "subjects": [
        "Self-Help",
        "Psychology",
        "James Arthur Ray"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zJKjkKJj5S7kRfB8EPFcw",
        "apple": "https://podcasts.apple.com/podcast/glenn-and-jean-spoil-the-secret/id1647275899?i=1000609261307"
      }
    },
    {
      "id": "9e13cbeb-ec75-4a5c-973e-a09a9ecc61b3",
      "title": "Surviving Cultic Abuse with Jennifer French (Part 2)",
      "description": "Jennifer French is a counselor with a Master’s in Psychology of coercive control who focuses on helping victims of cultic abuse. She got into the field after her own experience with a cult group. She is also the creator and host of the Project Hope podcast.In this second episode of two, Jean and Jennifer discuss this new era of cults, and Dr. Doyle pops in to share his thoughts!They chat about: The implications of social media for cult activityLegislation as the next phase of the fight against abusive self-help and cult abuseAdvice for seekers to stay safe when seeking self-improvementBrowse Jennifer’s WebsiteListen to the Project Hope PodcastAlso Mentioned: Red Flag EducationSEEK’s Self-help Consumer Protection bill in NY StateLearn more about SEEK Safely on their websiteFollow SEEK on Instagram, Twitter, and FacebookFollow Dr. Glenn on Instagram, Twitter, and FacebookRead the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny Brown Donate to support SEEK’s missionTo Contact SEEK email info@seeksafely.org",
      "release": "2022-11-21T00:00:00",
      "duration": "00:51:25.4000000",
      "explicit": false,
      "spotifyId": "35V4xmdIZBRyhwI80gbTa4",
      "appleId": 1000586930953,
      "subjects": [
        "Self-Help",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/35V4xmdIZBRyhwI80gbTa4",
        "apple": "https://podcasts.apple.com/podcast/surviving-cultic-abuse-with-jennifer-french-part-2/id1647275899?i=1000586930953"
      }
    },
    {
      "id": "3d7f12a4-5f69-4eb6-ba32-039655a4de8c",
      "title": "Surviving Cultic Abuse with Jennifer French (Part 1)",
      "description": "Jennifer French is a psychologist who focuses on helping victims of cultic abuse. She got into the field after her own experience with a cult group. She is also the creator and host of the Project Hope podcast.In this first episode of two, Jean and Jennifer discuss Jennifer’s experience and how it led her to undertake a Masters degree in Psychology of coercive control. They chat about: how and why people get into abusive groups\u0022cult hopping”why Jennifer signed the SEEK Safely Promise and how she implements it in her workhow seekers can reclaim their own self-improvement experience, rather than giving the power over to a teacher, group, or programWatch for Episode 2, where Jennifer and Jean discuss what’s happening in the new era of cults, with high control groups, wellness in social media, etc.Browse Jennifer’s WebsiteListen to the Project Hope PodcastLearn about the SEEK Safely Promise_____Also Mentioned: Gillie Jenkinson, psychologist Red Flag EducationAlleged Abuses of Yogi Bhajan“Enlighten Us” CNN documentary_____Learn more about SEEK Safely on their websiteFollow SEEK on Instagram, Twitter, and FacebookFollow Dr. Glenn on Instagram, Twitter, and FacebookRead the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny Brown Donate to support SEEK’s missionTo Contact SEEK email info@seeksafely.org",
      "release": "2022-11-14T00:00:00",
      "duration": "00:47:39.6500000",
      "explicit": false,
      "spotifyId": "6aMXFNfOn2Krt49huAkE4p",
      "appleId": 1000586082335,
      "subjects": [
        "Self-Help",
        "3HO",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6aMXFNfOn2Krt49huAkE4p",
        "apple": "https://podcasts.apple.com/podcast/surviving-cultic-abuse-with-jennifer-french-part-1/id1647275899?i=1000586082335"
      }
    },
    {
      "id": "9417f49f-a941-4ede-a135-9388861529ef",
      "title": "Jean and Dr. Glenn Dissect Episodes 1 \u0026 2 of The Vow, Season 2",
      "description": "Dr. Glenn and Jean share their thoughts about the first two episodes from Season Two of “The Vow,\u0022 HBO’s docu-series detailing the public downfall of the cult NXIVM. The NXIVM story has been a big part of our collective education about cults. But on its surface, NXIVM was just another self-help organization offering leadership development courses to thousands of people throughout North America.SEEK has followed and shared the NXIVM story for many reasons: as another example of the type of “worst-case scenarios” that can happen to self-help consumersunderstanding how coercive control plays out in abusive self-improvement organizationsobserving how the legal system handles these types of crimes perpetrated by “self-improvement” organizations and leadersSeason Two of “The Vow” continues on HBO.Also Mentioned in this Episode: The Program by Toni NatalieAbout NLP from WikipediaDon’t Call it a Cult by Sarah BermanA Little Bit Culty podcast by Sarah Edmondson and Nippy Ames, NXIVM whistleblowersSEEK’s Self-Help Consumer Protection Bill in NY StateEscaping NXIVM Podcast by CBCSeduced on Starz Links:Learn more about SEEK Safely on their websiteFollow SEEK on Instagram, Twitter, and FacebookFollow Dr. Glenn on Instagram, Twitter, and FacebookRead the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny BrownDonate to support SEEK’s missionTo Contact SEEK email info@seeksafely.org",
      "release": "2022-11-07T00:00:00",
      "duration": "00:55:07.1280000",
      "explicit": false,
      "spotifyId": "1yKFsBQtXczNSNp8X2mIRy",
      "appleId": 1000585302549,
      "subjects": [
        "NXIVM",
        "Self-Help",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1yKFsBQtXczNSNp8X2mIRy",
        "apple": "https://podcasts.apple.com/podcast/jean-and-dr-glenn-dissect-episodes-1-2-of-the-vow-season-2/id1647275899?i=1000585302549"
      }
    },
    {
      "id": "3c5a908c-9792-46d5-8d2f-aff2d07fc1a9",
      "title": "Part 2: Pushing Back against Unethical Coaching, Wellness, \u0026 Self-help with Eva Collins",
      "description": "Dr. Glenn and Jean chat with Eva Collins about her experience in the self-help/online coaching/wellness world, why she left her coaching business, and what it has been like pushing back against unethical practices and teachers in these industries. About Eva Collins:Eva is the creator of the Instagram account and podcast called \u0022why don\u0027t you say something.”After 20 years in the spiritual, self help, and yoga world and 8 years working as an online coach, she started to see so many issues in the industry and made an account speaking up about it.She realized some of the things she was learning and teaching around spirituality and online business, were harmful and unethical and weren\u0027t a match for her or her values anymore. She quit her coaching business a year and a half ago and now works at a community health care center, and creates content bringing awareness to the harms of the industry.She has trainings in Reiki, mediumship, NLP coaching, is a certified Holistic Health Coach, and 750 HR register yoga teacher, certified angel therapy practitioner, has years of training and mentorship in online marketing and is a certified Trauma of Money facilitator.Follow Eva on Instagram: @whydontyousaysomethingListen to her podcastSEEK Safely Roundtable conversation about CoachingLearn more about SEEK Safely on their websiteFollow SEEK on Instagram, Twitter, and FacebookFollow Dr. Glenn on Instagram, Twitter, and FacebookRead the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny BrownDonate to support SEEK’s missionTo Contact SEEK email info@seeksafely.org",
      "release": "2022-10-31T00:00:00",
      "duration": "00:54:29.0150000",
      "explicit": false,
      "spotifyId": "4NeAyvFgAd79usYyh69g5r",
      "appleId": 1000584469874,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4NeAyvFgAd79usYyh69g5r",
        "apple": "https://podcasts.apple.com/podcast/part-2-pushing-back-against-unethical-coaching-wellness/id1647275899?i=1000584469874"
      }
    },
    {
      "id": "cb1b7135-092e-41d6-9702-c21bf50a9f0e",
      "title": "Part 1: Pushing Back against Unethical Coaching, Wellness, \u0026 Self-help with Eva Collins",
      "description": "Dr. Glenn and Jean chat with Eva Collins about her experience in the self-help/online coaching/wellness world, why she left her coaching business, and what it has been like pushing back against unethical practices and teachers in these industries. About Eva Collins:Eva is the creator of the Instagram account and podcast called \u0022why don\u0027t you say something.”After 20 years in the spiritual, self help, and yoga world and 8 years working as an online coach, she started to see so many issues in the industry and made an account speaking up about it.She realized some of the things she was learning and teaching around spirituality and online business, were harmful and unethical and weren\u0027t a match for her or her values anymore. She quit her coaching business a year and a half ago and now works at a community health care center, and creates content bringing awareness to the harms of the industry.She has trainings in Reiki, mediumship, NLP coaching, is a certified Holistic Health Coach, and 750 HR register yoga teacher, certified angel therapy practitioner, has years of training and mentorship in online marketing and is a certified Trauma of Money facilitator.Follow Eva on Instagram: @whydontyousaysomethingListen to her podcastLearn more about SEEK Safely on their websiteFollow SEEK on Instagram, Twitter, and FacebookFollow Dr. Glenn on Instagram, Twitter, and FacebookRead the memoir “This Sweet Life: how we lived after Kirby died” by Jean and her mom, Ginny BrownDonate to support SEEK’s missionTo Contact SEEK email info@seeksafely.org",
      "release": "2022-10-24T00:00:00",
      "duration": "00:41:58.3860000",
      "explicit": false,
      "spotifyId": "0IXsaTnsjGnNgDJBfuCMgE",
      "appleId": 1000583661213,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0IXsaTnsjGnNgDJBfuCMgE",
        "apple": "https://podcasts.apple.com/podcast/part-1-pushing-back-against-unethical-coaching-wellness/id1647275899?i=1000583661213"
      }
    }
  ]
}