{
  "id": "4fa4a342-4e2a-4ba1-8883-44e593a895a5",
  "name": "Serial Crime",
  "youTubeChannelId": "UCuXTUX_Rxhz-APzQn0v_Ffg",
  "episodes": [
    {
      "id": "48611fb9-83da-43ea-aaa8-33f26d320b34",
      "title": "⚠️ The Mummified Cult Leader: The Tragic Story of Love Has Won 🚩",
      "description": "In April 2021, authorities in rural Colorado entered a home to find a horrific scene: the mummified remains of 45-year-old Amy Carlson, wrapped in a sleeping bag and decorated with Christmas lights and glitter. To her followers, she wasn\u0027t dead—she had simply \u0022ascended.\u0022\n\nWho was Amy Carlson, and how did a former McDonald\u0027s manager transform into \u0022Mother God,\u0022 the leader of the internet cult Love Has Won?\n\nIn this true crime deep dive, we trace the strange and tragic timeline of the Love Has Won cult. From Amy’s origins in small-town Texas to her descent into online spirituality, 5D consciousness, and conspiracy theories. We explore the disturbing reality behind the \u0022Galactic Federation of Light,\u0022 the abusive control exercised over her followers, and the livestreamed deterioration that led to her preventable death.\n\nThis is the story of how a search for enlightenment ended in a decorated corpse and a group too deep in denial to save their leader.\n\nIn this video:\n\nThe discovery of Amy Carlson’s body.\n\nThe origins of \u0022Mother God\u0022 and \u0022Father God.\u0022\n\nLife inside the Love Has Won house: Sleep deprivation and starvation.\n\nThe theology: Reincarnation, Aliens, and QAnon connections.\n\nThe tragic final days and the \u0022Ascension\u0022 delusion.\n\n#LoveHasWon #AmyCarlson #MotherGod #TrueCrime #CultDocumentary #Cults #Investigation",
      "release": "2026-01-16T23:00:48Z",
      "duration": "00:11:13",
      "explicit": false,
      "youTubeId": "_kwoxLYTpLw",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_kwoxLYTpLw"
      }
    },
    {
      "id": "109b7dc2-2d88-4a89-bf89-184ee5585f5a",
      "title": "Inside the Children of the Azure Dawn: The Secret Cult You’ve Never Heard Of",
      "description": "Full Documentary: Inside the Children of the Azure Dawn — a hidden American cult that operated in secrecy for nearly two decades.\n\nIn this investigative deep dive, we uncover the real story behind the Children of the Azure Dawn, one of the most obscure and disturbing cults to emerge in the late 20th century. From their quiet beginnings as a spiritual commune to their rise under charismatic leader Jonas Abraxas, this documentary exposes the group’s hidden rituals, manipulation tactics, abuses, and the dramatic downfall that ended their movement.\n\nFor years, the Children of the Azure Dawn stayed out of the public eye—until former members and investigators revealed the truth. Through detailed research, survivor accounts, and historical context, this video explores how the cult formed, how it controlled its members, and what ultimately brought it down.\n\n🔎 In this documentary, we cover:\n– The origins of the Children of the Azure Dawn\n– The rise of its prophetic leader, Jonas Abraxas\n– Isolation, mind control, and daily life inside the cult\n– Abuse, manipulation, and forbidden practices\n– The whistleblowers who escaped\n– The police raid, investigations, and collapse of the sect\n– What happened to members after the cult dissolved\n\nThis documentary is created for viewers interested in true crime, cults, psychology, mind control, and unexplored American history. If you’re a fan of channels like MrBallen, Soft White Underbelly, Vice, or Free Documentary, you’ll find this story gripping, eerie, and unforgettable.\n\n⚠️ Viewer Discretion: This video discusses themes related to abuse, manipulation, and cult activity.\n\n✨ If you enjoyed this documentary, please LIKE, SUBSCRIBE, and COMMENT your thoughts.\nIt helps support the channel and allows us to create more in-depth true crime and cult investigations.",
      "release": "2025-11-23T01:30:32Z",
      "duration": "00:46:17",
      "explicit": false,
      "youTubeId": "UWrXnf3urHc",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UWrXnf3urHc"
      }
    },
    {
      "id": "9c3af07d-cf33-45b5-8889-c45039a35b31",
      "title": "Inside the Alleged Cult: SBSI\u0027s Dark Secrets",
      "description": "Inside the Alleged Cult: SBSI\u0027s Dark Secrets\nWhat happens when faith, fear, and power collide? In this chilling exposé, we dive into the mysterious world of the Socorro Bayanihan Services Inc. (SBSI) — an organization accused by many of operating like a secretive cult. From disturbing testimonies to claims of manipulation and control, this is a story that’s as shocking as it is real.\n\n🕵️‍♀️ In this video, we explore:\n\nThe origins of SBSI and its charismatic founder\n\nAllegations of abuse, forced labor, and psychological control\n\nFirst-hand survivor stories that will leave you stunned\n\nThe ongoing investigations and where the case stands today\n\n⚠️ This is more than a religious group — it’s a tale of power, secrecy, and those brave enough to speak out.\n\n💬 Have you heard of SBSI before? Let us know your thoughts in the comments.\n\n📌 Don’t forget to like, subscribe, and hit the bell for more eye-opening documentaries on cults, power structures, and hidden truths.\n\n#SBSI #CultDocumentary #InsideTheCult #TrueCrime #Cults #DarkSecrets #Exposed #InvestigativeDocumentary",
      "release": "2025-04-17T01:00:06Z",
      "duration": "00:28:17",
      "explicit": false,
      "youTubeId": "elE9Ix40m_M",
      "subjects": [
        "Socorro Bayanihan Services"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=elE9Ix40m_M"
      }
    },
    {
      "id": "e9f70291-c944-4f99-b814-5aee6ba333ae",
      "title": "The Tragic Tale of \u0027Nueva Luz de Dios\u0027: A Cult\u0027s Dark Path",
      "description": "In this gripping video, we delve into the harrowing story of the \u0022Nueva Luz de Dios\u0022 cult, which brought unimaginable horror to the remote indigenous community of Alto Terrón, Panama, in January 2020. Discover how this sect transformed from benign religious activities to ritualistic killings, resulting in the brutal deaths of seven innocent villagers, including a pregnant woman and her five children. We explore the socio-economic and cultural factors that fostered such extremism, shedding light on the conditions of isolation and neglect within the Ngäbe-Buglé region. Join us as we uncover the tragic aftermath, the subsequent legal actions, and the ongoing fight against extremist ideologies in marginalized communities. Like and share this video to raise awareness!  \n\n#NuevaLuzDeDios #Cult #AltoTerrón #Panama #ReligiousExtremism #Documentary\nOUTLINE:\n00:00:00\nThe Unimaginable Horror\n\n00:01:52\nEmergence of \u0027Nueva Luz de Dios\u0027\n\n00:06:26\nThe January 2020 Ritual Massacre\n\n00:10:46\nThe Police Operation and Challenges\n\n00:12:27\nLegal Accountability\n\n00:12:53\nIsolation and Vulnerability\n\n00:17:38\nAftermath and Impact\n\n00:20:15\nLessons from El Terrón",
      "release": "2025-04-14T01:00:26Z",
      "duration": "00:22:30",
      "explicit": false,
      "youTubeId": "0hn90MYE6nc",
      "subjects": [
        "New Light of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0hn90MYE6nc"
      }
    }
  ]
}