{
  "id": "39dac97c-c7fb-4bc3-9ce1-1e9ac281fa9e",
  "name": "Seriously Mysterious",
  "spotifyId": "4YVmoNnPzps4cNM61yk2wA",
  "appleId": 1526484648,
  "episodes": [
    {
      "id": "18050ceb-ac95-4fb7-85ba-22819795b2f1",
      "title": "Where is Celina Mays?",
      "description": "WARNING: Mention of possible child harm. Please listen at your own discretion, and if you need help free resources are available. National Sexual Assault Hotline RAINN -Call: 800-656-HOPE (4673) or visit: https://www.rainn.org/ Mental Health Hotline: 800-662- HELP(4357) or text 988 or visit https://www.samhsa.gov/ Celina Mays was only 12 years when she went missing. Her life had changed significantly in the months leading up to her disappearance, with Celina finding herself in the home of a woman some call a cult leader. Did Celina runaway or did something more sinister happen? This episode written by The Certified Roarikle and John Lordan, produced by LordanArts . Meet John in Person: CrimeCon 2024 - Nashville, TN - May 31 - June 2 Save 10% on a standard pass using code LORDANARTS https://www.crimecon.com/CC24 True Crime and Paranormal Podcast Festival - Denver, CO - July 12-14 Save 15% with code LORDAN https://www.truecrimepodcastfestival.com This is not intended to act as a means of proving or disproving anything related to the investigation or potential charges associated to the investigation. It is a conversation about the current known facts and theories being discussed. Please do not contact people you are suspicious of or attempt to harass, threaten or intimidate them in any way. Do not release information that can be used to do the same, or join in attacks being conducted by others. Everyone directly or indirectly referred to is innocent until proven guilty in a court of law.",
      "release": "2024-05-21T12:53:52Z",
      "duration": "00:20:44.1600000",
      "explicit": false,
      "spotifyId": "4G1AXl8Sa8m7lC1u1PqO9x",
      "appleId": 1000656267386,
      "subjects": [
        "Gospel of Christ Ministries"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4G1AXl8Sa8m7lC1u1PqO9x",
        "apple": "https://podcasts.apple.com/podcast/where-is-celina-mays/id1526484648?i=1000656267386"
      }
    }
  ]
}