{
  "_ts": 0,
  "id": "f3f09f85-6370-4983-8c42-f1494b633aff",
  "name": "Serving Cult",
  "spotifyId": "2rON1hyRfE96NSgGWO16c9",
  "appleId": 1630652128,
  "episodes": [
    {
      "id": "a0479794-eae7-4131-95a8-96420b74a490",
      "title": "56. The Deep End: The Hilton Has Holy Water",
      "description": "And now we’re waterboarding people and fake channeling spirits, are we? Welcome back to another episode of Serving Cult! This week we are continuing to dissect the doc, The Deep End ; it just gets weirder. Prepare for the weirdest role-play you\u0027ve ever seen, where asking a polite question might get you \u0022inhabited\u0022 by a spirit. Molly the investigator steals the show and should be in every cult doc—she spots all the red flags. Oh, and any time Juliana expresses empathy, it\u0027s a problem. Is it the Teal Swan cult or the Jedi order? You decide. One thing\u0027s for sure—you’re not ready for this level of fame, and neither is she. Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website",
      "release": "2024-06-06T05:00:00Z",
      "duration": "00:52:41.6570000",
      "explicit": false,
      "spotifyId": "22uz8sd51VltNKVla6xe3k",
      "appleId": 1000658008354,
      "subjects": [
        "Teal Swan",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22uz8sd51VltNKVla6xe3k",
        "apple": "https://podcasts.apple.com/podcast/56-the-deep-end-the-hilton-has-holy-water/id1630652128?i=1000658008354"
      }
    },
    {
      "id": "7d86a328-a943-4b99-8fbc-6bb5711fae75",
      "title": "55. The Deep End: I Was So Washed",
      "description": "Trigger Warning: This episode discusses topics including emotional manipulation, psychological abuse, and suicidal ideation. Listener discretion is advised. We couldn\u0027t resist diving back into The Deep End for another episode of Serving Cult. This time, we\u0027re continuing to unravel the chaotic universe of Teal Swan—spiritual guru aka raging narcissist. Teal is furious about her haters and thinks they’re the ones stopping her from making more money and not her awful bedside manner. With ambitions to build the biggest company ever, she\u0027s got a crazy-eyed determination that\u0027s equally terrifying and somewhat impressive. From manipulating retreat attendees to hiring a tennis coach, Teal uses her sociopathic tendencies with Patrick Bateman-like precision to reel in followers. Join us as we talk about our aspirations to become like the grandma private investigator sporting a Rolodex and how we could be cult consultants if we really wanted to! Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-05-30T05:00:00Z",
      "duration": "01:03:03.7000000",
      "explicit": false,
      "spotifyId": "1ljSDdsk0svv4M8DNwklHt",
      "appleId": 1000657251484,
      "subjects": [
        "Psychology",
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ljSDdsk0svv4M8DNwklHt",
        "apple": "https://podcasts.apple.com/podcast/55-the-deep-end-i-was-so-washed/id1630652128?i=1000657251484"
      }
    },
    {
      "id": "fb8283f5-d141-41dc-ae39-ff95797e5ee4",
      "title": "54. The Deep End: Trauma Dumping Retreat",
      "description": "Because we just can\u0027t stay away, we\u0027re back with another episode of Serving Cult, and this time we\u0027re diving into The Deep End . Meet Teal Swan, the YouTube sensation, spiritual guru, and, well, raging narcissist. Get ready as we plunge into a world where spiritual leaders go full cult, ticking off our cult bingo card: white people doing weird shit, kumbaya singing circles, and, of course, bare feet galore. Join us as we dissect this new cult docuseries, complete with Trent\u0027s angry rants that start almost immediately! Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-05-23T06:48:00Z",
      "duration": "00:56:49.4830000",
      "explicit": false,
      "spotifyId": "4DJE9G5zGzkdMuzebUHMB8",
      "appleId": 1000656478179,
      "subjects": [
        "Psychology",
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4DJE9G5zGzkdMuzebUHMB8",
        "apple": "https://podcasts.apple.com/podcast/54-the-deep-end-trauma-dumping-retreat/id1630652128?i=1000656478179"
      }
    },
    {
      "id": "04fc62fd-ed80-4ff4-b6c7-d48b357a3cb5",
      "title": "53. Brandy Hellville: Where Are Your Parents?",
      "description": "This week, we\u0027re taking a different approach to the podcast and bringing you an episode that is simply…random. In this episode, Elizabeth and Taylor dive into the darkly glitzy world of Brandy Hellville: The Cult of Fast Fashion . Think unsupervised teenagers in short shorts as a breeding ground for eating disorders. Also, Meri Brown from *Sister Wives* is apparently leveling up from reality star to cult leader? We’re just as baffled but totally here for the tea. Meanwhile, Elizabeth has joined the cult of... dollhouses? Yes, you heard right. It’s endearing and slightly creepy all at once. So join us for a catch-up chat with Elizabeth and Taylor. It\u0027s like hanging out with your two besties who always have the weirdest updates. And oh, did we drop the news about Dan Schneider suing *Quiet on Set*? Yeah, it’s a wild ride this week! Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-05-16T05:00:00Z",
      "duration": "00:38:27.2400000",
      "explicit": false,
      "spotifyId": "23wg7NklNWnEBDifZlxlQe",
      "appleId": 1000655756381,
      "subjects": [
        "Psychology",
        "Apostolic United Brethren"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23wg7NklNWnEBDifZlxlQe",
        "apple": "https://podcasts.apple.com/podcast/53-brandy-hellville-where-are-your-parents/id1630652128?i=1000655756381"
      }
    },
    {
      "id": "0535f1a8-c7e7-4dd5-9f3e-cf07f3d3fea1",
      "title": "52. Quiet on Set: Dan Schneider is a Cult Leader (Allegedly)",
      "description": "Hey there, cult lovers! This week, we\u0027re switching gears a bit for our devoted cult following. Before we dive into our usual podcast review antics, we\u0027re taking a detour to discuss something intriguingly adjacent to cultish behavior: \u0027 Quiet on Set \u0027, a docuseries shining a light on the dark underbelly of beloved Nickelodeon shows from back in the late 90s and early 2000s. Get ready for a wild ride as we unpack everything from Drake Bell\u0027s rollercoaster journey to the troubling patterns of unhealed trauma to the mystery of Amanda Bynes\u0027 current whereabouts, and the puzzling absence of lawsuits against Dan Schneider. Oh and did we mention we\u0027ll be veering off into a Sister Wives tangent? Buckle up as we dish out some shocking and devastating revelations about the recent happenings on that front. Trigger warning: Our discussion might stir up some uncomfortable feelings, especially for those sensitive to topics like child abuse and toxicity in the entertainment industry. So, if you need to take a breather or skip this episode, no hard feelings. Your mental well-being comes first, always. Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: Pop Culture Happy Hour Podcast The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-05-09T05:00:00Z",
      "duration": "00:48:23.3040000",
      "explicit": false,
      "spotifyId": "4YKpRlnsOILwTuJeckfrVq",
      "appleId": 1000655012692,
      "subjects": [
        "Psychology",
        "Apostolic United Brethren"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4YKpRlnsOILwTuJeckfrVq",
        "apple": "https://podcasts.apple.com/podcast/52-quiet-on-set-dan-schneider-is-a-cult-leader-allegedly/id1630652128?i=1000655012692"
      }
    },
    {
      "id": "ade54e4d-2d15-4067-92d8-00d29eea4dca",
      "title": "51. The Synanon Fix: Chuck\u0027s Giving Donald Trump Energy",
      "description": "Strap in for the wild finale of our deep dive into The Synanon Fix , where things go from quirky rehab commune to full-blown, “What the hell is even happening?” territory. Our fearless investigative reporter has all the juicy details. As we wrap up this saga, it\u0027s clear Synanon was more soap opera than utopia. Join us for this rollercoaster ride through one of history’s most insane cult catastrophes and remember—just because someone builds a “paradise”, doesn\u0027t mean you should move in! Subscribe on all the usual podcast spots and get your fix of history’s wildest cults so that you don’t join one! Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: The Only Moral Abortion is My Abortion The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-05-02T05:00:00Z",
      "duration": "00:42:24.4930000",
      "explicit": false,
      "spotifyId": "4kvaHW1WcSO3jPM14qkkpO",
      "appleId": 1000654250741,
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4kvaHW1WcSO3jPM14qkkpO",
        "apple": "https://podcasts.apple.com/podcast/51-the-synanon-fix-chucks-giving-donald-trump-energy/id1630652128?i=1000654250741"
      }
    },
    {
      "id": "07d95421-7c63-4e8c-890f-518f9c1748a1",
      "title": "50. The Synanon Fix: Chuck Invents the Biggest Loser",
      "description": "This week\u0027s recap of The Synanon Fix kicks things off with a bang—a fatathon complete with a marching band. Yep, you heard that right, a fatathon. And trust us, that\u0027s just the beginning. And just when you think it can\u0027t get any weirder, we drop the bombshell—it\u0027s an eating disorder cult. Yeah, let that sink in. Join us as we peel back the layers of control and chaos of the Synanon Fix ! Grab your snacks, this one\u0027s gonna be a wild ride. Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-04-27T14:41:00Z",
      "duration": "00:54:34.9200000",
      "explicit": false,
      "spotifyId": "2qoidOvjPLLV5mJlTyYR9R",
      "appleId": 1000653767247,
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qoidOvjPLLV5mJlTyYR9R",
        "apple": "https://podcasts.apple.com/podcast/50-the-synanon-fix-chuck-invents-the-biggest-loser/id1630652128?i=1000653767247"
      }
    },
    {
      "id": "bf5acd1d-a6f6-45ab-941e-4453f3546f72",
      "title": "49. The Synanon Fix: Sex Room Sticker Charts",
      "description": "This week we are continuing our dive into the new cult docu-series called, The Synanon Fix . In episode two, we leave behind heroin addicts and are in full-on cult mode with gentle silent raves, women shaving their heads in the name of feminism, and something called “the sex room.” This new cult series checks all the boxes on the cult bingo card as Chuck, the cult leader, introduces more restrictions as he makes more money. Oh, and Taylor is NO longer sold! Join us on this adventure to understand why 2-year-old babies are hiking in our review of episode two of Synanon Fix. Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-04-18T05:00:00Z",
      "duration": "01:04:42.8110000",
      "explicit": false,
      "spotifyId": "0DV9yjWMx2BJVI0jgXkh7i",
      "appleId": 1000652811662,
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0DV9yjWMx2BJVI0jgXkh7i",
        "apple": "https://podcasts.apple.com/podcast/49-the-synanon-fix-sex-room-sticker-charts/id1630652128?i=1000652811662"
      }
    },
    {
      "id": "f249a604-ea7f-4163-8e20-a8f58e7e80be",
      "title": "The Synanon Fix: The Greatest Breakthrough Since Freud",
      "description": "Here come the Dopefiends! This week we are leaving behind the Duggars and diving into heroine addicts with a new cult docu-series called, The Synanon Fix . In this new series, we are introduced to Chuck, an alcoholic who believed that Alcoholics Anonymous just wasn’t enough, so he started a rehab center for recovering drug addicts…with a catch. From well-dressed dop-fiends screaming profanities at each other to Lucille Ball hanging out at the Santa Monica rehab beach house, this new cult series is unlike any other we’ve reviewed so far because honestly, we’re kind of sold. Join us on this adventure to complete our Cult bingo cards with this new wild cult series! Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-04-11T05:00:00Z",
      "duration": "00:57:01.2650000",
      "explicit": false,
      "spotifyId": "7leUDq7m3jGqHnDMBPYhv3",
      "appleId": 1000652105226,
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7leUDq7m3jGqHnDMBPYhv3",
        "apple": "https://podcasts.apple.com/podcast/the-synanon-fix-the-greatest-breakthrough-since-freud/id1630652128?i=1000652105226"
      }
    },
    {
      "id": "c737931d-7f62-4aad-b2a4-a193b25369eb",
      "title": "47. Shiny Happy People: My Little Pony is the Antichrist",
      "description": "In this episode, we review the final episode of the docuseries, Shiny Happy People . We dive into more charges against Joshua Duggar, Jim Bob Duggar’s oldest son, and his being caught with child pornography. We eventually see some change as women begin to speak out about the abuse happening at IBS and people begin to leave! Join us as we talk about how the speaker of the house, Mike Johnson, uses his son as an accountability partner not to watch porn, watch Bob Duggar lose in his race for the senate by a landslide, and discover that the Smurfs actually perform witchcraft?? Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides science-backed education and practical real-world tools ESSENTIAL for healing trauma! Click Here to Join Additional Resources: Counting the Cost by Jill Duggar The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-04-04T10:57:00Z",
      "duration": "00:54:38.3000000",
      "explicit": false,
      "spotifyId": "5tcvcVlyvH2BZESXTy580I",
      "appleId": 1000651416070,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tcvcVlyvH2BZESXTy580I",
        "apple": "https://podcasts.apple.com/podcast/47-shiny-happy-people-my-little-pony-is-the-antichrist/id1630652128?i=1000651416070"
      }
    },
    {
      "id": "59746ee1-0e85-4633-b7e2-4295e0720401",
      "title": "46. Shiny Happy People: Care Bears Serving Humanistic Principles",
      "description": "Trigger Warning: We talk about child sexual abuse in this episode. If that is triggering for you we recommend skipping this episode and joining us next Thursday for another new episode! This episode is anything but shiny and happy as we continue the traumatic experience that is watching and reviewing Shiny Happy People . Just when we thought it couldn’t get any worse, we uncover even more disturbing information about Bill Gothard and the abuse he would inflict on young children. Join us as we talk about the new laws Bill Gothard put in place to silence anyone who would speak out about his abuse, locking children in prayer rooms for days at a time, why the Cabbage Patch Kids actually are a cult, and naked people on reality TV?? Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides you with science-backed education and practical real-world tools that are ESSENTIAL for healing trauma! Click Here to Join Additional Resources: Counting the Cost by Jill Duggar The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-03-28T05:00:00Z",
      "duration": "00:51:50.2050000",
      "explicit": false,
      "spotifyId": "29DHIUjGtrnndpXcsQqLs3",
      "appleId": 1000650690721,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/29DHIUjGtrnndpXcsQqLs3",
        "apple": "https://podcasts.apple.com/podcast/46-shiny-happy-people-care-bears-serving-humanistic/id1630652128?i=1000650690721"
      }
    },
    {
      "id": "88ba0e80-d9d2-46d0-b7d9-c6d1bfc72e7c",
      "title": "45. Shiny Happy People: Which Toys Do I Burn",
      "description": "Welcome back, cult lovers! In this episode, we are exploring more of Shiny Happy People . This cult docuseries will have you convinced that toys are demonic and women shouldn’t be treated as people…well we hope you are not actually convinced! In this part three, we talk more about how Jim Bob Duggar exploited his daughters for money, why IBLP should NOT be compared to real boot camp training, and how Cocomelon is actually demonic according to the internet. Join us for an episode full of tangents that will have you googling the “have your kids kidnapped” brochure! Imagine overcoming trauma with ease and support! Join the Trauma Book Club , a monthly membership that provides you with science-backed education and practical real-world tools that are ESSENTIAL for healing trauma! Click Here to Join Additional Resources: Counting the Cost by Jill Duggar The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-03-21T05:00:00Z",
      "duration": "00:51:54.5930000",
      "explicit": false,
      "spotifyId": "16fg0aR0hz7XSRHwLZMEpe",
      "appleId": 1000649955933,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/16fg0aR0hz7XSRHwLZMEpe",
        "apple": "https://podcasts.apple.com/podcast/45-shiny-happy-people-which-toys-do-i-burn/id1630652128?i=1000649955933"
      }
    },
    {
      "id": "4ca851b8-3bd7-4c2c-83a0-ff707bc24a6f",
      "title": "44. Shiny Happy People: Doomed From the Beginning",
      "description": "Welcome to another episode of Serving Cult! We’re back talking about the Duggars again and it just keeps getting worse. In this episode, we continue to dissect the new docuseries, Shiny Happy People . This week, we focus on Josh Duggar, the eldest of the Duggar children, and uncover some of the scandals he\u0027s involved this. This episode is not for the faint of heart, as we touch on child victims being forced to share lies for the camera to an inside look at life as a parentified child. Join us as Trent goes on his usual angry rant about yet more disgusting cult behavior! Trigger Warning: We talk about child sexual abuse in this episode. If that is triggering for you we recommend skipping this episode and joining us next Thursday for another new episode! Imagine overcoming trauma with ease and support! Come Join the The Trauma Book: Book Club , a monthly membership that provides you with science-backed education and practical real-world tools that are ESSENTIAL for healing trauma! Click Here to Join Additional Resources: Counting the Cost by Jill Duggar The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join the Trauma Book Club Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-03-14T09:50:00Z",
      "duration": "01:00:20.3530000",
      "explicit": false,
      "spotifyId": "29bvUsqXgJ0miRpFieAMhE",
      "appleId": 1000649178235,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/29bvUsqXgJ0miRpFieAMhE",
        "apple": "https://podcasts.apple.com/podcast/44-shiny-happy-people-doomed-from-the-beginning/id1630652128?i=1000649178235"
      }
    },
    {
      "id": "ee051d89-0282-4dfa-9007-d5f79cda6d1f",
      "title": "43. Shiny Happy People: Go Forth and Multiply",
      "description": "Today, we delve into the often controversial world of reality TV and conservative ideologies as we dissect the new docuseries, Shiny Happy People . Join us as we unpack the representation of gender roles in the popular show, \u002219 Kids and Counting.\u0022 In this episode, we put the spotlight on the Duggar family, touching on the inherent discrepancies of public figures who preach one thing yet practice another. We\u0027ll explore the motives and consequences of their ideals, and even take a peek into the teachings of the male dominion in familial structures. So, buckle up and prepare for an episode packed with intense critique, enlightening insights, and Taylor Swift quotes. Additional Resources: Combating Mind Control by Steven Hassan The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-03-07T06:00:00Z",
      "duration": "00:37:32.7610000",
      "explicit": false,
      "spotifyId": "4eVTRgzCoG7JEmbZLEdBRR",
      "appleId": 1000648312607,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4eVTRgzCoG7JEmbZLEdBRR",
        "apple": "https://podcasts.apple.com/podcast/43-shiny-happy-people-go-forth-and-multiply/id1630652128?i=1000648312607"
      }
    },
    {
      "id": "fc7e9e25-2391-43cb-b679-2d50258b85db",
      "title": "42. Twin Flames: Religious Cults For Tax Cuts",
      "description": "Welcome back to another episode of Serving Cult! This week, we explore the last episode of, Escaping Twin Flames , and after this docuseries, we are indeed ready to escape! This last episode takes an even weirder turn as Jeff transitions the cult from a spiritual to a religious organization in the name of tax cuts, forces cult members to get gender-changing surgeries, and tries to brainwash his followers into thinking this is not a cult (when it obviously is). Tune in to hear how the cult is still active and how cults are still growing! It is estimated there are around 10,000 cults in the United States currently. Giveaway! Because we are SO happy to be back doing the podcast, we decided to do a special giveaway! Now you can win Elizabeth’s Irreverent Grief Guide AND Irreverent Trust Guide for FREE! How to enter the giveaway: Leave a 5-star rating and review for the Serving Cult podcast on whatever platform you listen on. Screenshot the rating and review and DM it to Elizabeth on Instagram ! Wait to find out if you win on March 1st! Additional Resources: The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-02-29T06:00:00Z",
      "duration": "00:41:33.0980000",
      "explicit": false,
      "spotifyId": "2AdhiZSVexc23IFrwFZgGo",
      "appleId": 1000647490820,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AdhiZSVexc23IFrwFZgGo",
        "apple": "https://podcasts.apple.com/podcast/42-twin-flames-religious-cults-for-tax-cuts/id1630652128?i=1000647490820"
      }
    },
    {
      "id": "7007a14c-068a-4a5a-aecc-a983387935e9",
      "title": "41. Twin Flames: Judas Was an Energy Leak",
      "description": "Welcome back to Serving Cult! In this episode, we dive deeper into this new cult documentary series called Escaping Twin Flames. This second episode takes us away from match making and finding true love and brings us into a whole new world of MAP, which is all about finding your life\u0027s true purpose. Jeff has become the self-proclaimed Jesus Christ, everyones gained 70 pounds, and an the army gets involved? Listen into to understand (or try to understand) that chaos that is Escaping Twin Flames. Giveaway! Because we are SO happy to be back doing the podcast, we decided to do a special giveaway! Now you have a chance to win Elizabeth’s Irreverent Grief Guide AND Irreverent Trust Guide for FREE! How to enter the giveaway: Leave a 5-star rating and review for the Serving Cult podcast on whatever platform you listen on. Screenshot the rating and review and DM it to Elizabeth on Instagram ! Wait to find out if you win at the end of February! Additional Resources: Combating Mind Control by Steven Hassan The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-02-22T08:52:00Z",
      "duration": "00:49:27.7840000",
      "explicit": false,
      "spotifyId": "4Azyxs3qd6sCeaQRql2c66",
      "appleId": 1000646395587,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Azyxs3qd6sCeaQRql2c66",
        "apple": "https://podcasts.apple.com/podcast/41-twin-flames-judas-was-an-energy-leak/id1630652128?i=1000646395587"
      }
    },
    {
      "id": "2dc089b9-b0a3-49ec-8de8-a76a77f74781",
      "title": "40. Twin Flames: The Mirror Exercise Gone Wrong",
      "description": "In this episode, we venture into a new cult documentary series called Escaping Twin Flames. This series begs the question, would you pay 10 million dollars to find your twin flame? Well, some people would! In this breakdown of the first episode of Escaping Twin Flames, we meet Jeff and Shaleia, the original twin flames “power couple” who have convinced their followers that they can help them find their twin flame…in exchange for a bit of cash. Listen in to find out what happens when those who are desperately in search of love are exploited for financial gain. From mind control tactics to misusing helpful tools such as the mirror exercise, this cult doc is a behind-the-scenes look at what abusing psychological tools looks like in action! Giveaway! Because we are SO happy to be back doing the podcast, we decided to do a special giveaway! Now you have a chance to win Elizabeth’s Irreverent Grief Guide AND Irreverent Trust Guide for FREE! How to enter the giveaway: Leave a 5-star rating and review for the Serving Cult podcast on whatever platform you listen on. Screenshot the rating and review and DM it to Elizabeth on Instagram ! Wait to find out if you win on February 24th! Additional Resources: Combating Mind Control by Steven Hassan The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram",
      "release": "2024-02-15T06:46:00Z",
      "duration": "01:19:59.3700000",
      "explicit": false,
      "spotifyId": "7nDvH4WMP030xGNbpakF8B",
      "appleId": 1000645415552,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7nDvH4WMP030xGNbpakF8B",
        "apple": "https://podcasts.apple.com/podcast/40-twin-flames-the-mirror-exercise-gone-wrong/id1630652128?i=1000645415552"
      }
    },
    {
      "id": "b568043b-0e03-4a44-9ba1-84755f96b566",
      "title": "3. Love Has Won: Mother God Goes on Dr. Phil",
      "description": "Welcome back to another episode of Serving Cult, where we mock cult leaders one cult doc at a time and learn the lessons so we don’t accidentally join one. On this third episode of season three, we are diving into...Love Has Won: The Cult of Mother God. On this final episode of the cult doc series, Love Has Won, we discover why love has in fact not won. In this final episode, Amy Carlson aka mother god goes from the Hawaiian Goddess of Fire Volcanoes to having her decaying body being driven across state lines! Yeah, we know A LOT is happening. Join us as we uncover why mother god got ran out of Hawaii, how Amy ended up on Dr. Phil, and how all the money began to mysteriously disappear...    Come hang out with me on TikTok and Instagram or join my Secret Membership to continue doing our trauma work together!   Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram   Additional Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership  Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall    ",
      "release": "2024-02-08T08:00:00Z",
      "duration": "00:50:06.1580000",
      "explicit": true,
      "spotifyId": "1cMbBl0GLVNY62tWtpSjVy",
      "appleId": 1000644601579,
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cMbBl0GLVNY62tWtpSjVy",
        "apple": "https://podcasts.apple.com/podcast/3-love-has-won-mother-god-goes-on-dr-phil/id1630652128?i=1000644601579"
      }
    },
    {
      "id": "b21c1fc2-b588-43ae-a7c0-b2a1f0a7e154",
      "title": "38. Love Has Won: Mother Turns Blue",
      "description": "This week everything gets even crazier in episode two of Love Has Won: The Cult of Mother God. We learn that father god and Taylor are rocking the same hairstyle and apparently, there\u0027s some Father God\u0027s multiverse?  Also, Mother God may not be all-powerful because the alcohol and drug abuse starts to catch up with her and she starts to turn blue…Join us in this episode to learn all the ways to NOT join a cult!     Come hang out with me on TikTok and Instagram or join my Secret Membership to continue doing our trauma work together!   Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram   Additional Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership  Learn How to STOP Dealing with Narcissist Emotional Blackmail! Produced by: Dianni Hall  ",
      "release": "2024-02-01T07:00:00Z",
      "duration": "00:48:38.9120000",
      "explicit": true,
      "spotifyId": "1ufOcbnoICmIoZ2vuG8hdJ",
      "appleId": 1000643765015,
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ufOcbnoICmIoZ2vuG8hdJ",
        "apple": "https://podcasts.apple.com/podcast/38-love-has-won-mother-turns-blue/id1630652128?i=1000643765015"
      }
    },
    {
      "id": "e2a542d3-7e22-497a-9bae-15ebfe9be09f",
      "title": "37: Love Has Won: Pick Your Galactic Celebrity A Team",
      "description": "Ask an Advanced Bitch is back...and she\u0027s Serving Cult! Welcome to our new and improved podcast, Serving Cult where we mock cult leaders one cult doc at a time and learn the lessons so we don’t accidentally join one.   On this first episode of season three, we are diving into...Love Has Won: The Cult of Mother God. This cult doc series is all about the life (and death) of Mother God, also known as Amy Carlson. Join us as we dissect the first episode of Love Has Won and learn about her galactic celebrity A team, how she girlbossed her way into becoming a cult leader, and why we all should stay away from drugs...    Come hang out with me on TikTok and Instagram or join my Secret Membership where we can continue doing our trauma work together!   Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram Additional Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership  Learn How to STOP Dealing with Narcissist Emotional Blackmail!   Produced by: Dianni Hall",
      "release": "2024-01-25T00:00:00",
      "duration": "00:53:33.1910000",
      "explicit": true,
      "spotifyId": "5AiEaCjpqTeJzNK338yMTQ",
      "appleId": 1000642874468,
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5AiEaCjpqTeJzNK338yMTQ",
        "apple": "https://podcasts.apple.com/podcast/37-love-has-won-pick-your-galactic-celebrity-a-team/id1630652128?i=1000642874468"
      }
    },
    {
      "id": "5963ce15-763e-425f-88e9-c3331fce9045",
      "title": "36: Sometimes Self-Isolating is Safe",
      "description": "Advanced Bitches, it’s time to say Bye Bye! Sadly, we have made it to the end of another season. I’m immensely grateful for every bitch listening and I hope these episodes have given you insight or made you laugh in some way. Stick around for season 3, Advanced Bitches! In Part 1, I answer the question, “How do I stop self-isolating when I’m dealing with my shit?” First of all, I am the QUEEN of isolating myself when I’m struggling so the first thing I will tell you is….don’t beat yourself up. What would happen if you only treated yourself with compassion? I tried it…listen in to find out how that went! In part 2, Trent and I dissect the final episode of Wild Wild Country. This episode hits a bit differently as we see more blatant racism, Bhagwans in chains, and Shela continues to show zero remorse (not surprising) check out this episode to find out how this cult ends in flames.  Come hang out with me on TikTok and Instagram or join my Secret Membership where we can continue doing our trauma work together while the podcast is on hiatus!  Lots of love from one Advanced Bitch to another   Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership  Learn How to STOP Dealing with Narcissist Emotional Blackmail! Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-08-03T08:00:00Z",
      "duration": "01:01:45.3060000",
      "explicit": false,
      "spotifyId": "7aFYKYcJkt6K0QMPRTxPQo",
      "appleId": 1000623285567,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7aFYKYcJkt6K0QMPRTxPQo",
        "apple": "https://podcasts.apple.com/podcast/36-sometimes-self-isolating-is-safe/id1630652128?i=1000623285567"
      }
    },
    {
      "id": "ad1d1a74-8b44-4b65-9b02-b3c79a9e4124",
      "title": "35: Embracing Our True Selves While Healing",
      "description": "in Part 1, I answer the question, “How do we embrace and grow into our true selves as we heal? I have done some advanced as fuck work on self-acceptance. Now I’m faced with the question of who am I without all the bullshit?” And I answered this question with a question, “What if it is okay to not know?” Of course, advanced bitches, you know I can never give a short answer so listen in to hear me go into more detail! And if you’re looking for more on this topic, check out my newsletter where I recently answered this question! Also, in part 1 of the episode, I mention that next week\u0027s episode is going to be the last episode of season two. We have decided to put the podcast on pause for a bit. But, If you still want to interact with me, join me at my membership or on socials! In Part 2, of this week’s episode, we begin to see the beginning of the end for Wild Wild Country. Sheela has fled to Germany, the Bhagwan has decided to cancel his religion, and apparently, they’re blending up beavers?! Yeah, there’s a lot going on so listen in to find out more! And by the way, have you joined a cult this week? Write me and let me know! If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch to another. Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership  Learn How to STOP Dealing with Narcissist Emotional Blackmail! Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-07-27T07:00:00Z",
      "duration": "01:18:24.1360000",
      "explicit": false,
      "spotifyId": "1tSTfoSpDYAzo0IH9WkbmN",
      "appleId": 1000622487634,
      "subjects": [
        "Bhagwan Shree Rajneesh",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1tSTfoSpDYAzo0IH9WkbmN",
        "apple": "https://podcasts.apple.com/podcast/35-embracing-our-true-selves-while-healing/id1630652128?i=1000622487634"
      }
    },
    {
      "id": "58a09e15-477f-4741-835d-e407affaca8a",
      "title": "34: Imposter Syndrome: What Makes You Think You Don’t Belong?",
      "description": "Advanced Bitches, have I got a juicy episode for you this week! From NXIVM updates to chocolates being delivered to Trent and Taylor, you won’t want to miss this one! In Part 1, I answer the question, “Does Imposter Syndrome include hanging out with a certain group even when you really don’t belong?” Answer? The only requirement to belong is resonating with the message and wanting to belong. I get way deeper into this answer, but if you are struggling with Imposter Syndrome and want to learn more, check out my Secret Membership where I teach classes on healing trauma! In Part 2, of this week’s episode, we dig a lot deeper into Wild Wild Country, and trust me it gets WILD! In the first 10 minutes alone we find out about mass salmonella spreading through tacos causing all the old people to shit their pants…Also, Bhagwan is strung out on valium and laughing gas while starting doomsday prepping?? If you’re confused, advanced bitch, trust me so was I! You’ll have to listen in to find out what happens! And by the way, have you joined a cult this week? Write me and let me know! If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch to another.   Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Advanced Bitches Website Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Join The Secret Membership  Learn How to STOP Dealing with Narcissist Emotional Blackmail! Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-07-20T09:41:00Z",
      "duration": "01:17:48.1470000",
      "explicit": false,
      "spotifyId": "3kEwjhEEjNu7ZWvCb10k2P",
      "appleId": 1000621743736,
      "subjects": [
        "NXIVM",
        "Bhagwan Shree Rajneesh",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3kEwjhEEjNu7ZWvCb10k2P",
        "apple": "https://podcasts.apple.com/podcast/34-imposter-syndrome-what-makes-you-think-you-dont-belong/id1630652128?i=1000621743736"
      }
    },
    {
      "id": "32455ebf-b33c-4084-a135-77cf439888be",
      "title": "33: Journaling: Safety Over Everything",
      "description": "Advanced Bitches Welcome Back! In Part 1, I answer this question from a listener, “How do I start journaling?” There is only one answer! And it’s a much simpler answer than you’re probably expecting. Even Advanced Bitches tend to overcomplicate things sometimes, but that’s okay because you’re still an advanced bitch. In my response, I break down some journaling techniques to help you get started and even share a special one I haven’t shared before. Listen in to find out! And in part 2, We find out that Taylor has joined a cult…well she’s the leader, and Trent and I are thinking about joining?? No, we are working on getting her out, I promise! Trent and I also dive much deeper into Wild Wild Country and trust me, things certainly get WILD! From nude sunbathing in public parks to sedating homeless people, this episode has A LOT going on. If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch to another. Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-07-13T07:00:00Z",
      "duration": "01:13:27.3920000",
      "explicit": false,
      "spotifyId": "6D8VYyUmMQ7z9nDNs53zyO",
      "appleId": 1000620990620,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6D8VYyUmMQ7z9nDNs53zyO",
        "apple": "https://podcasts.apple.com/podcast/33-journaling-safety-over-everything/id1630652128?i=1000620990620"
      }
    },
    {
      "id": "b42c7766-c732-4635-82d4-abd7b429d3df",
      "title": "32: Can We Have A Real Relationship?",
      "description": "Are you an anxious, avoidant, anxious-avoidant, or secure attachment style? Well, in Part 1 of this week\u0027s episode, I answer this question from a listener, “How do I work on being secure in all relationships?” Answer? It starts with knowing the attachment style you have and making the conscious decision to have a real relationship! If you want to know more about what having a REAL relationship means, check out the episode and my book, The Irreverent Trust Guide! Does Duolingo count as a cult? Well according to Taylor it does and so does Wild Wild Country! In Part 2 of this week\u0027s episode, Trent joins us again to spill all his first impressions of the new cult series. There\u0027s everything from obliterating OSHA regulations to naked screaming?? Listen to this week\u0027s episode to find out! If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch to another. Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-07-06T04:00:00Z",
      "duration": "01:09:06.7230000",
      "explicit": false,
      "spotifyId": "7czWNUXX6aMWPswZ8CgblC",
      "appleId": 1000619473945,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7czWNUXX6aMWPswZ8CgblC",
        "apple": "https://podcasts.apple.com/podcast/32-can-we-have-a-real-relationship/id1630652128?i=1000619473945"
      }
    },
    {
      "id": "c8082ade-2cf2-4acd-b62e-3bb42fc8ce28",
      "title": "31: The 3 Grief Symptoms to Commit to Memory",
      "description": "Advanced Bitches, Welcome back! In this episode, we dissect a new cult documentary, talk about how not trimming your eyebrows is grounds for divorce, and Taylor reminisces on the old youtube days (who remembers salad fingers??) In Part 1, I answer this question from a listener, “How do I support my husband, he just lost his mom and has never experienced a loss like this?” I share 3 things I would tell anyone who is dealing with grief right now. I also suggest checking out my book,  The Irreverent Grief Guide: How to Survive Months 1 to 3. In Part 2, Taylor and I set the scene for the new cult documentary we’re watching Wild Wild Country. We talk about everything from why this cult leader is actually kind of iconic (??) to why salad bars are absolutely canceled! If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch (or primitive cunt) to another.   Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall   ",
      "release": "2023-06-29T06:26:00Z",
      "duration": "00:52:56.1980000",
      "explicit": true,
      "spotifyId": "2WIPpBlIJ3vreJz4GqFv01",
      "appleId": 1000618713512,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2WIPpBlIJ3vreJz4GqFv01",
        "apple": "https://podcasts.apple.com/podcast/31-the-3-grief-symptoms-to-commit-to-memory/id1630652128?i=1000618713512"
      }
    },
    {
      "id": "d654c9d2-4b6f-45c4-8140-79b4fc1fc586",
      "title": "30: Surviving Isn\u0027t Laziness",
      "description": "Advanced Bitches, we’ve brought last week\u0027s guest back! Alex is here again to share more about her experience with her alternative peer group aka cult. In Part 1, I answer this question from a listener, “Is freeze mode just the psyche\u0027s way of waiting for things to get better?” Because I’m not just an advanced bitch, but an honest bitch, I share about how I used to dissociate through bulimia and TV (my preferred dissociative cocktail) and why it’s important to be so so gentle with ourselves! In Part 2, We talk more with Alex about some of the “games” she used to play in her alternative peer group aka cult, in order to be accepted. Everything from drinking ash to smoking two packs a day. We also dive into the last episode of the three-part series, Stolen Youth: Inside the Cult of Sarah Lawerence! This episode ranges from ding dong ditching to creating a survivor reality show: cult edition? You’ll have to listen to find out, bitch! If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch to another. Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-06-24T16:31:00Z",
      "duration": "01:23:29.4200000",
      "explicit": false,
      "spotifyId": "46lDw5Za5wYQYRtvuv7Dmh",
      "appleId": 1000617944844,
      "urls": {
        "spotify": "https://open.spotify.com/episode/46lDw5Za5wYQYRtvuv7Dmh",
        "apple": "https://podcasts.apple.com/podcast/30-surviving-isnt-laziness/id1630652128?i=1000617944844"
      }
    },
    {
      "id": "1874cb27-4712-4b20-8cf9-56cee8422a53",
      "title": "29. Have You Ever Met An Unworthy Baby?",
      "description": "Welcome to another episode of Ask An Advanced Bitch! This episode is special because we have an advanced bitch guest on today. This guest has some experience with cults, so we got the inside scoop! In Part 1, I answer this question from a listener, “Dear Advanced Bitch, I’d love your quick and dirty guide to building self-worth.” I promise listener, you’re already more worthy than you think, but in case you don’t believe me - I give a three-step quick and dirty guide to building self-worth! And trust me, being worthy doesn’t always feel comfortable. In Part 2, The Advanced Bitches crew is joined by Alex Gisler! Alex is a labor and delivery nurse, a lover of the podcast, and an ex-cult member? Listen to find out more about Alex’s experience! We, of course, also continue to dissect Stolen Youth: Inside the Cult of Sarah Lawerence and there are LOTS of new developments to cover! If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch to another. Alternative Episode Titles:    Ask A Labor and Delivery Nurse   It All Starts With Self   How To Have a Self  Something That Was Learned Can Be Unlearned  Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-06-15T08:00:00Z",
      "duration": "01:31:33.2950000",
      "explicit": false,
      "spotifyId": "1lLNt8HFiTQJm6Nv0be6KK",
      "appleId": 1000617113922,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1lLNt8HFiTQJm6Nv0be6KK",
        "apple": "https://podcasts.apple.com/podcast/29-have-you-ever-met-an-unworthy-baby/id1630652128?i=1000617113922"
      }
    },
    {
      "id": "c9407b07-6107-40b0-ba5c-057fc0e31337",
      "title": "28. Keep Going Never Stop",
      "description": "Advanced Bitches, have you joined a cult this week? Well, the students at Sarah Lawerence accidentally did. On this week\u0027s episode of Ask an Advanced Bitch, we dive a little deeper into Stolen Youth: Inside the Cult of Sarah Lawerence. In Part 1, I answer this question from a listener, “How do I tell if I like someone romantically, as a friend, or if it’s my attachment wounds that like them?” Answer? The Ladder of Trust! If you’re not sure what that is, click the link below to check out my youtube video explaining exactly what the ladder of trust is! In Part 2, We continue to unpack the insanity that is Stolen Youth: Inside the Cult of Sarah Lawerence! We point out more things cult leaders do, so you can be on the lookout for if a creepy old man ever shows up at your university, Trent is disappointed by the lack of feet in this cult series, and the Ask an Advanced Bitch podcast is possibly starting a band called Gaslighting in Stereo??? You’ll have to listen to find out! If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch to another. Alternative Episode Titles:    Advanced Bitches Always Win   Magic is in The Action   How Do I Trust Myself   Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-06-08T08:00:00Z",
      "duration": "01:22:48.5040000",
      "explicit": false,
      "spotifyId": "7M81Sv3o6a6zj04PccRgMv",
      "appleId": 1000616115430,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7M81Sv3o6a6zj04PccRgMv",
        "apple": "https://podcasts.apple.com/podcast/28-keep-going-never-stop/id1630652128?i=1000616115430"
      }
    },
    {
      "id": "17a6e591-046e-454d-8523-423daa82c3f8",
      "title": "27. Trauma Did A Number On Us",
      "description": "Hey, there Advanced Bitches! Welcome back to the second episode of season 2 where we talk gentle habit stacking, college students getting stoned, and doing pilates in the dark?? Anyway, if you haven’t watched Stolen Youth: Inside the Cult of Sarah Lawerence, RUN to Hulu right now! In Part 1, I answer this question from a listener, “How…all of it…how?” Even with so few words, this question hits deep and the answer hits even deeper. In Part 2, Now with our season 2 catch-up out of the way, it’s time to dig into Stolen Youth: Inside the Cult of Sarah Lawerence! As cult experts we come up with rules for how to start a cult, discuss how creepy it is for a father to be living with college students in exchange for steak dinners, and how in an alternative universe, Taylor could have ended up in the Sarah Lawerence cult… If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch to another. Alternative Episode Titles:    You Can Blame Trauma For That   Just Do The Next Right Thing   The Power of Gentle Habit Stacking   Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-06-01T08:00:00Z",
      "duration": "01:14:37.9940000",
      "explicit": false,
      "spotifyId": "5ZGwpiLrsqVzGka8pqtDl0",
      "appleId": 1000615263277,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZGwpiLrsqVzGka8pqtDl0",
        "apple": "https://podcasts.apple.com/podcast/27-trauma-did-a-number-on-us/id1630652128?i=1000615263277"
      }
    },
    {
      "id": "5186deb5-475e-4f90-8fd1-444e8f2cae6d",
      "title": "26. You Can\u0027t Weaponize My Healing",
      "description": "Advanced Bitches, we are back with Season 2 of Ask An Advanced Bitch! Have you missed me?! I sure as hell have missed you and that’s why I’m extremely excited to be back kicking off another season with a primitive cunt chat with Taylor! In Part 1, I answer this question from a listener, “What is the safest and most advanced way to respond when people who aren’t advanced try to tell you that they are? How do I protect myself from people who try to weaponize my healing?” In Part 2, Taylor and I have a long catch-up chat to start off season 2. We talk about everything from Taylor getting last-minute floor seats at a Taylor Swift concert to my Instagram impersonator offering people psychic readings? And of course, there\u0027s a sprinkle of Vanderpump Rules chat too! If my podcast has helped you become the advanced bitch you want to be, leave a 5-star rating in Apple Podcast! Lots of love from one Advanced Bitch (or primitive cunt) to another. Alternative Episode Titles:   Back And As Mediocre As Ever   Primitive Cunt Talk   Life is Short Buy The Taylor Swift Tickets   Connect with Us More: Advanced Bitches Instagram Advanced Bitches TikTok Advanced Bitches Youtube Taylor Instagram Trent Instagram Advanced Bitches Resources:  The Irreverent Grief Guide: How to F*cking Survive Months 1-3 The Irreverent Trust Guide: How to Trust Again After Past Trauma F*cked You Up Cover Art By: https://www.jaymade.co/ Produced by: Dianni Hall",
      "release": "2023-05-25T08:00:00Z",
      "duration": "01:07:24.4600000",
      "explicit": false,
      "spotifyId": "0ldkpHfqs0QSAnk2PvRKj8",
      "appleId": 1000614436224,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ldkpHfqs0QSAnk2PvRKj8",
        "apple": "https://podcasts.apple.com/podcast/26-you-cant-weaponize-my-healing/id1630652128?i=1000614436224"
      }
    },
    {
      "id": "13a2d21c-8b3c-4998-8064-02ee96ca515d",
      "title": "25. 10 Requirements for Healing Trauma",
      "description": "It is the finale of Season 1! In Part 1 I talk about the 10 Requirements for healing trauma, citing D. Crenshaw’s work, linked below. I detail each requirement, explain the importance and give contextual examples of what this may look like. In Part 2 I am joined by Taylor to let you know about new developments in our lives and in the podcast, and what to expect for Season 2.   If my podcast helped you grow or made you giggle, I’d really appreciate it if you left an Apple Podcasts review. Let me know via email and socials what you’d like to see from Season 2, and hopefully I’ll see you in my group coaching calls linked below! Lots of love from one Advanced Bitch to another.     LINKS   Neuroscience and Trauma Treatment: Implications for Creative Arts Therapists by D. Crenshaw - https://psycnet.apa.org/record/2006-12259-001 The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Taylor Wallis - https://www.instagram.com/taylorwallis/ Trent Twomey - https://www.instagram.com/p/CdUNemlMxhL/   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books: The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2023-01-06T12:19:00Z",
      "duration": "00:58:54.6280000",
      "explicit": false,
      "spotifyId": "1C2nEbJ9PP1LyNSW2TLtiw",
      "appleId": 1000592860497,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1C2nEbJ9PP1LyNSW2TLtiw",
        "apple": "https://podcasts.apple.com/podcast/25-10-requirements-for-healing-trauma/id1630652128?i=1000592860497"
      }
    },
    {
      "id": "fd8bf449-5a10-4d89-b409-f0e16f647100",
      "title": "24. Cults: The Vow Season 2 Episode 2",
      "description": "This is the penultimate episode of Season 1 of Ask An Advanced Bitch! I am joined by Taylor and Trent to discuss all things The Vow Season 2 Episode 2. The Vow is an HBO true crime documentary series about the NXIVM Cult and its leader Keith Raniere. Thank you so much for riding with us for 24 episodes! If my podcast helped you grow or made you giggle, I’d really appreciate it if you left an Apple Podcasts review. Let me know via email and socials what you’d like to see from Season 2, and hopefully I’ll see you in my group coaching calls linked below! Lots of love from one Advanced Bitch to another.     LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Taylor Wallis - https://www.instagram.com/taylorwallis/ Trent Twomey - https://www.instagram.com/p/CdUNemlMxhL/   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books: The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-12-22T00:00:00",
      "duration": "01:20:34.3240000",
      "explicit": true,
      "spotifyId": "3HPe4VFd4lHP3fLwKkigIq",
      "appleId": 1000590975638,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3HPe4VFd4lHP3fLwKkigIq",
        "apple": "https://podcasts.apple.com/podcast/24-cults-the-vow-season-2-episode-2/id1630652128?i=1000590975638"
      }
    },
    {
      "id": "a0592b41-b18c-4823-8fb8-6deb9dd76c6f",
      "title": "23. Navigating Decision Paralysis",
      "description": "In this episode I give an update about how I’m doing as I experience post-event collapse syndrome due to moving house and state. I explain the coping mechanism I use in times where I have limited emotional and physical capacity, and have to let some responsibilities slide. I tease out a comforting concept, that while people might care about our dropped responsibilities, no one will remember the incident within a year. I also make a case for Imperfection Practice, which is showing up and doing things with the capacity available, rather than waiting for when one can achieve perfectly. I then answer a listener question about how to make big life decisions in general when stuck in paralysis because of it. I explain that indecision is still decision and its often the inner saboteur’s doing. I walk the listener through the exercise of creating environments that lead to conducive behaviours and decisions.   You can email in your written question, or send in a recorded MP3 voicenote to be inserted into the podcast via hello@advancedbitches.com. Please leave an Apple review to help my show grow, and subscribe wherever you listen to podcasts   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-12-15T11:00:00Z",
      "duration": "00:19:13.5410000",
      "explicit": false,
      "spotifyId": "1CinscUolMrP5F0ZQjWMd4",
      "appleId": 1000590267356,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1CinscUolMrP5F0ZQjWMd4",
        "apple": "https://podcasts.apple.com/podcast/23-navigating-decision-paralysis/id1630652128?i=1000590267356"
      }
    },
    {
      "id": "4edfce1a-d1d3-48d1-8940-6778b1614e4f",
      "title": "22. Cults: The Vow Episode 9 Season 1",
      "description": "Taylor joins me to wrap up season 1 of The Vow, discussing all things in episode 9. Grooming, manipulation and hypnotism through the screen!? The Vow is an HBO true crime documentary series about the NXIVM Cult and its leader Keith Raniere.   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Taylor Wallis - https://www.instagram.com/taylorwallis/   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books: The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-12-08T00:00:00",
      "duration": "01:27:37.9000000",
      "explicit": true,
      "spotifyId": "6DRZ9pVncmme8nijqYSoWF",
      "appleId": 1000589395425,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6DRZ9pVncmme8nijqYSoWF",
        "apple": "https://podcasts.apple.com/podcast/22-cults-the-vow-episode-9-season-1/id1630652128?i=1000589395425"
      }
    },
    {
      "id": "28455df7-4b07-41d6-8373-e118f4a77c37",
      "title": "21. Triggers in the workplace, Codependent Relationships and Maladaptive Eating Habits",
      "description": "Today’s episode is jam packed with your questions! In this solo episode I tackle everything from toxic workplaces to maladaptive food habits. Specifically, the questions are: how to handle a toxic work environment, understanding why parents’ décor decisions are frustrating, how to stop filling the void a codependent relationship left, how to maintain healthy relationships with family despite differing world views, how to find clarity and purpose after a divorce, and how to stop being emotionally overwhelmed. Buckle up for an episode full of tools for emotional self-regulation, advice on how to analyse relational dynamics, managing CPTSD responses, addressing detrimental coping mechanisms, and insight on the healing power of time.   You can email in your written question, or send in a recorded MP3 voicenote to be inserted into the podcast via hello@advancedbitches.com. Please leave an Apple review to help my show grow, and subscribe wherever you listen to podcasts   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-11-24T11:00:00Z",
      "duration": "00:38:58.6120000",
      "explicit": false,
      "spotifyId": "67k3lzrnXYAcdo4gmvmAy6",
      "appleId": 1000587380509,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/67k3lzrnXYAcdo4gmvmAy6",
        "apple": "https://podcasts.apple.com/podcast/21-triggers-in-the-workplace-codependent/id1630652128?i=1000587380509"
      }
    },
    {
      "id": "09dc8cfb-f01f-4487-aabc-00226feb81d3",
      "title": "20. Navigating Bigoted Family and Messy Healing Journeys",
      "description": "In today’s episode I answer two listener questions. The first one is about how to engage with bigoted family. My short answer is that…you don’t! I explain that engaging is a losing game, because they remain unconvinced and you remain frustrated. I share that in moments like these I like to reach into my toolbox of strategies and coping mechanisms, and offer some to them. I explain that if you have to be in the same space as a bigot, use scripts which are predetermined answers to questions and situations you will find uncomfortable as may help you feel prepared and safe. I also recommend “C Jade Run”, an acronym that outlines what co-dependents should avoid doing: Convincing people, Justifying themselves, Arguing, Defending and Explaining. Finally, I encourage the listener to leave spaces that make them uneasy; either physically by leaving a room, or mentally checking out by going on their phone. The second question is from a listener who asks why they can’t get better. I discuss this in detail, assuring them that the work isn’t staying on the path but about getting back on it when we veer off. I elaborate on what this looks like through a personal anecdote about how my therapist guided me through this same feeling   You can email in your written question, or send in a recorded MP3 voicenote to be inserted into the podcast via hello@advancedbitches.com. Please leave an Apple review to help my show grow, and subscribe wherever you listen to podcasts   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-11-17T11:00:00Z",
      "duration": "00:26:32.3720000",
      "explicit": false,
      "spotifyId": "6xfiXM80fpaZZ9PUvBTxEd",
      "appleId": 1000586559219,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6xfiXM80fpaZZ9PUvBTxEd",
        "apple": "https://podcasts.apple.com/podcast/20-navigating-bigoted-family-and-messy-healing-journeys/id1630652128?i=1000586559219"
      }
    },
    {
      "id": "1fc2fd8b-270d-47c4-b5c9-a9d47a3c06c7",
      "title": "19. Speaking to our Children about Our Trauma",
      "description": "Today’s episode is all about your trauma related questions! The first listener asks how much of our trauma do we share with our children once they become adults? I tackle this question in two parts, firstly how to approach discussing trauma with children when they’re young, and then with our children once they’re adults. I discuss how I approached telling my children I would be checking into to rehab, and how I navigated not wanting to lie while also not burdening them with details they wouldn’t be able to process. I encourage the listener to talk to their kids about their trauma how they’d talk to their kids about any difficult subject: with clarity and awareness of which details are unnecessarily scary. The second listener question is about how to deal with the voice that tells them they will fail after every ounce of success they achieve. I contextualize this fear of “the other shoe dropping” as very normal for folks who have CPTSD. Many of us don’t want to feel hope because we’ve had it crushed before, and so it is a natural defence mechanism. I detail the science behind why we think this way, and reference a study linked below. I offer some reassurance to help them reframe this feeling, to feel this feeling and to push past it anyway.   You can email in your written question, or send in a recorded MP3 voicenote to be inserted into the podcast via hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Homeostasis, Stress, Trauma, and Adaptation A Neurodevelopmental View of Childhood Trauma by Bruce D. Perry, MD, PhD Ronnie Pollard, MD, PhD -  https://scholar.google.co.za/scholar?q=perry\u002Band\u002Bpollard\u002B1998\u0026hl=en\u0026as_sdt=0\u0026as_vis=1\u0026oi=scholart     Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-11-10T11:00:00Z",
      "duration": "00:28:44.6560000",
      "explicit": true,
      "spotifyId": "2ZIHBFMgAFccoRcfHL5LXf",
      "appleId": 1000585753166,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZIHBFMgAFccoRcfHL5LXf",
        "apple": "https://podcasts.apple.com/podcast/19-speaking-to-our-children-about-our-trauma/id1630652128?i=1000585753166"
      }
    },
    {
      "id": "14dc1e35-7066-4079-a182-4993d39d9853",
      "title": "18. Co-dependency, Comparison and Self-Doubt After Divorce",
      "description": "Today’s episode is packed with your listener questions! From co-dependency, to comparison and divorce. In Part 1 I answer a listener question about what to do about a man she’s dating who is ‘hot and cold’, and generally inconsistent. I explain that first and foremost, in order to heal from co-dependency we must develop a keen eye for identifying relationship dynamics. I explain that the one he is exhibiting is the “bait and switch” and that she ultimately needs to create a standard for behaviour she tolerates and then move towards what she appreciates and away from what is distressing. I also recommend she revisit the Ladder of Trust. In Part 2 I describe a tool previously touched upon, called The Comparison Tool. I add more detail to it, describing how I avoid the natural but brutal act of comparison. I explain that inheriting people’s well fortune also means inheriting their woes, and that ultimately, it is safer to deal with the devil you know – ie. your own circumstances. In Part 3 a listener writes in to express her devastation that after her husband divorced her, he and his family seem happier than ever. I caution that social media is far from an accurate depiction of how  people are truly doing; pictures are a curated snapshot of what people want you to see. I also advise that dysfunctional dynamics follow people, so if her husband was not doing his self-development work with her, he won’t have suddenly become more enlightened with someone else.   You can submit your question by text or mp3 voicenote to be played on the podcast via hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-11-03T10:00:00Z",
      "duration": "00:26:58.5730000",
      "explicit": false,
      "spotifyId": "7w9TqTAHHq6BYpQXhbLmyb",
      "appleId": 1000584915593,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7w9TqTAHHq6BYpQXhbLmyb",
        "apple": "https://podcasts.apple.com/podcast/18-co-dependency-comparison-and-self-doubt-after-divorce/id1630652128?i=1000584915593"
      }
    },
    {
      "id": "0339e0e3-e0f0-4b48-9a7f-74570326cc45",
      "title": "17. Can Codependent Friendships withstand Self Development?",
      "description": "In Part 1 I answer a listener question about whether she can do my self-development programme while remaining in communication with a friend she has co-dependent and sometimes abusive dynamics with. She loves her friend dearly and is also afraid of being alone and without said friends’ love. I firstly establish that she is in control of her healing, and gets to decide who stays and who goes; there are no mandatory requirements. I warn her that it is easy to fall into old patterns with people we formed bonds with when we were young, and that this is something to be mindful of. In light of this, I give her two tools she can use to ensure she honours her self development while maintaining her friendship.  The first tool is for self-reflection, to help her understand what her friendship might reflect about herself, and to allow her to release judgement of herself and her friend. The second tool is about how to get off the cycle of abuse, which is also on my YouTube channel linked below. I assure her that as she keeps working on herself and her boundaries, the friendship will either withstand the changes or naturally fall away, both which she will be equipped to deal with because of the inner work she is doing. In Part 2 Trent and Taylor join me to discuss The Vow episode 5   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Trent Twomey - https://www.instagram.com/p/CdUNemlMxhL/ Codependent No More –  https://www.amazon.com/Codependent-No-More-Controlling-Yourself/dp/0894864025     Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-10-27T10:00:00Z",
      "duration": "01:21:52.7440000",
      "explicit": true,
      "spotifyId": "2FxD05WIyNkOtSy5ikLLJM",
      "appleId": 1000584080557,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2FxD05WIyNkOtSy5ikLLJM",
        "apple": "https://podcasts.apple.com/podcast/17-can-codependent-friendships-withstand-self-development/id1630652128?i=1000584080557"
      }
    },
    {
      "id": "455ec572-8e74-4c8b-93a2-696ca8705404",
      "title": "16. Self-Deprecation, Triggers and Master Manipulators",
      "description": "In Part 1 I answer a listener question about how to deal with someone in their running club who makes derogatory remarks about their body that inadvertently trigger the listener. I explain that we need to separate the question into its two parts: concern for the person making the remarks, and addressing how the listener is triggered by them. I firstly encourage the listener to consider whether adults need ever tell other adults how to feel and act. I explain that correcting adults in this way may highlight an underlying assumption that our behaviours and beliefs are superior to theirs. I suggest that the listener can lift up the person with compliments and assurance, or even use the nonviolent communication method to clearly illustrate the impact of the person’s remarks. For more on this communication method, check out Episode , for more on that check out Episode 13. I advise the listener to prepare for the person’s reaction, which could be that she resents them for this feedback. I then advise the listener on the second part of her question, which is how to deal with what triggers us. I advise setting a boundary or simply physically distancing from this person during their running club. In Part 2, Taylor and Trent join me to discuss The Vow Episode 4 and 5   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Trent Twomey - https://www.instagram.com/p/CdUNemlMxhL/     Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-10-20T10:00:00Z",
      "duration": "01:16:28.2510000",
      "explicit": true,
      "spotifyId": "7MC6fKtQ6f49Y4mnBOYEmv",
      "appleId": 1000583284836,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MC6fKtQ6f49Y4mnBOYEmv",
        "apple": "https://podcasts.apple.com/podcast/16-self-deprecation-triggers-and-master-manipulators/id1630652128?i=1000583284836"
      }
    },
    {
      "id": "c5f63194-bdf3-414b-b417-7a505347048a",
      "title": "15. Hurricanes and Harry Potter",
      "description": "In Part 1 I answer a listener request to offer support to those facing hurricane Ian in Florida. I talk about my experience during the grid failure in Texas and how isolating it was on an emotional and physical level. I encourage people suffering due to the hurricane to acknowledge the depths of their distress, and to generally allow themselves to grieve the end of the natural world as we know it due to climate change. I summarize that shitty things happen to all of us, but come in different flavours, and your flavour is unfortunately this hurricane. I explain that the best you can do is to have grace with yourself, understand that of course your executive function will drop, and to give yourself time and space to process, grieve and feel whatever comes up. In Part 2 I dig into the archives to bring you a special Harry Potter segment Trent and I recorded at the podcast’s inception.   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Trent Twomey - https://www.instagram.com/p/CdUNemlMxhL/     Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-10-13T10:00:00Z",
      "duration": "01:12:20.3750000",
      "explicit": false,
      "spotifyId": "2U4t4ow5oJCpsTqhlFRAoL",
      "appleId": 1000582517144,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2U4t4ow5oJCpsTqhlFRAoL",
        "apple": "https://podcasts.apple.com/podcast/15-hurricanes-and-harry-potter/id1630652128?i=1000582517144"
      }
    },
    {
      "id": "8dbbe524-c5ed-4c75-bd29-48cde265b4e2",
      "title": "14: Studying Cults, Betrayal and Outgrowing Friendships",
      "description": "Today is a solo episode, in Part 1 I discuss why I love studying cults, and in Part 2 I answer two listener questions. During the first half I explain how beneficial I find it to observe cults. I discuss how cults can be a mirror for our interpersonal relationships, and how empathizing with their victims helps us examine our own trauma responses. I also detail how engaging in cult material can help us be more aware and alert of cultish dynamics in the mundane and everyday. In Part 2, the first listener asks if their post-breakup expectations were unrealistic, and the second listener asks how to stay friends with people not doing inner work. In both scenarios I detail the ladder of trust as an appropriate tool to create intimacy and mutual investment.   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Complex PTSD: From Surviving to Thriving by Pete Walker https://amzn.to/3RLCkxm   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-10-12T00:00:00",
      "duration": "00:36:38.7000000",
      "explicit": true,
      "spotifyId": "4cZ6Uk0DhwUGbxn3zri2m7",
      "appleId": 1000581783616,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cZ6Uk0DhwUGbxn3zri2m7",
        "apple": "https://podcasts.apple.com/podcast/14-studying-cults-betrayal-and-outgrowing-friendships/id1630652128?i=1000581783616"
      }
    },
    {
      "id": "d6415360-eb5e-416f-9a93-74df55cdfcc7",
      "title": "13. Nonviolence and effective Confrontation",
      "description": "In part 1 answer a listener question about how to approach confronting a Fight Mode person about their upsetting behavior. I first detail why assessing other people\u0027s trauma responses in times of crisis is not conducive in achieving the desired outcome of mutual understanding, respect and boundaries. Diagnosing people can have the unintended effect of creating hierarchies and power dynamics in our heads that don’t aid conflict resolution. I then recommend the highly effective tool of Nonviolent Communication coined by Marshall Rosenberg. This framework advocates for a formulaic approach to confrontation that distinguishes fact from emotion in order to facilitate resolution. In part 2, Trent, Taylor and I discuss The Vow Episode 4 To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Taylor Wallis - https://www.instagram.com/taylorwallis/ NonViolent Communication book by Marshall Rosenberg - https://amzn.to/3drVSZy The Center for NonViolent Communication - https://www.cnvc.org/   Keep up with me:  https://www.instagram.com/advancedbitches/  https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches  https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow     ",
      "release": "2022-09-29T10:00:00Z",
      "duration": "01:27:39.4700000",
      "explicit": true,
      "spotifyId": "27xA2IbWC6Q7S0N7TJCOoV",
      "appleId": 1000581017402,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/27xA2IbWC6Q7S0N7TJCOoV",
        "apple": "https://podcasts.apple.com/podcast/13-nonviolence-and-effective-confrontation/id1630652128?i=1000581017402"
      }
    },
    {
      "id": "e2c08a74-45ea-4cc2-bc1f-3d4ee3cbb609",
      "title": "12. Trauma at the Hairdresser",
      "description": "In Part 1, a listener writes in explaining that her hairdresser did a poor job, and - despite her dismay - she found herself comforting the hairdresser. I explain that this is typical Fawn and Freeze Behaviour and contextualize what this behaviour looks like in different scenarios. I offer her comfort and practical tools to ensure better outcomes. I illustrate the power of bringing ‘advocates’ with her to services she knows she struggles vocalizing her needs. I recommend bookending experiences with check ins with an accountability partner so that she doesn’t end up agreeing to prices or services she didn’t want. And finally I discuss the importance of allowing people to experience the consequences of their actions instead of subsuming them herself. I encourage her to be free of self-judgement, and rather to observe and accept the resulting consequences of her Fawn and Freeze Behaviours, in a way that allows her to learn from them. I explain that the length of her self-advocacy will shorten and that’s how she can measure her progress. In Part 2, Taylor and Trent join me to discuss The Vow, Episode 4   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS Sign up to my Fairy Dusted Newsletter: https://www.advancedbitches.com/ The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Taylor Wallis - https://www.instagram.com/taylorwallis/ Trent Twomey - https://www.instagram.com/p/CdUNemlMxhL/   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-09-22T10:00:04Z",
      "duration": "01:15:08.8130000",
      "explicit": true,
      "spotifyId": "0gGVW3dQrY8RAgCHhfWiD9",
      "appleId": 1000580292821,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0gGVW3dQrY8RAgCHhfWiD9",
        "apple": "https://podcasts.apple.com/podcast/12-trauma-at-the-hairdresser/id1630652128?i=1000580292821"
      }
    },
    {
      "id": "7dcf187b-2ea9-4e24-998b-f098e2a165ef",
      "title": "11. Comparison is A Bitch, and NOT an Advanced One",
      "description": "In Part 1, I tackle a listener question about how to stop comparing herself to other women. I contextualize where this behaviour stems from. Her parents projected their own insecurities onto her by using comparison to other children as a tool to affirm and uplift her. This had the opposite effect, creating a belief that her achievements only exist in competition and contrast with others’, and that to be ‘up’ someone must be down. Moreover, this behaviour robs her of the opportunity to feel happy for herself and others, independent of jealousy. I detail an incredibly sobering tool I developed years ago that helps contextualize what one is envious of by humanizing the person in comparison. In Part 2, Taylor and Trent join me to discuss The Vow, episode 3. To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS Sign up to my Newsletter: https://www.advancedbitches.com/ The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions The Onion Article:  https://www.theonion.com/teachers-reveal-why-they-are-quitting-their-jobs-1849443196 Taylor Wallis - https://www.instagram.com/taylorwallis/ Trent Twomey - https://www.instagram.com/p/CdUNemlMxhL/   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-09-15T10:00:25Z",
      "duration": "01:11:09.7660000",
      "explicit": true,
      "spotifyId": "13aHJmGW0QJEeQY9pmrgOh",
      "appleId": 1000579559574,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/13aHJmGW0QJEeQY9pmrgOh",
        "apple": "https://podcasts.apple.com/podcast/11-comparison-is-a-bitch-and-not-an-advanced-one/id1630652128?i=1000579559574"
      }
    },
    {
      "id": "a1100314-dd57-4d60-92d1-c04bbd24490b",
      "title": "10. Surviving Caregiving for your Manipulative Parent",
      "description": "In Part 1 I make a special announcement about the formatting of the podcast going forward, and detail my newsletter subscription (linked below). In Part 2 I answer a listener question about how to safely engage with her ailing, emotionally manipulative mother. The listener is torn between caring for her mother in her time of need, while maintaining her own boundaries, work and general life interests that her mother sees as a direct threat to the love and care she’s receiving. I explain how ‘fawn’ responders might react to this overwhelming situation, and then detail how to foster a healthier. Firstly, I outline that she must not let her parent assume the role of a child because this forces the listener it0 chase after her mother emotionally. I detail how to mentally establish an ‘adult-to-adult’ approach and dynamic. From there I go over how to slowly and safely introduce boundaries in a way that still implies love and care for her mother, and that honours the listener’s needs too. I end by encouraging her to have patience and compassion for herself as dealing with such complicated family dynamics as a ‘fawner’ is incredibly triggering. In Part 2 Taylor and Trent join me to discuss The Vow, Episode 2. To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   Codependent No More by Melody Beattie https://amzn.to/3CZiWsW I\u0027m Glad my Mom Died by Jennette McCurdy https://amzn.to/3KVmFtn Sign up to my Newsletter: https://www.advancedbitches.com/ Caregiving Vs. Caretaking article -  https://www.expressivecounseling.com/articles/codependency-caretaking The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Taylor Wallis - https://www.instagram.com/taylorwallis/ Trent Twomey - https://www.instagram.com/p/CdUNemlMxhL/   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-09-08T10:00:59Z",
      "duration": "01:11:28.8880000",
      "explicit": true,
      "spotifyId": "5bWWGiPjDZo3m7FgYdpYVZ",
      "appleId": 1000578812531,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5bWWGiPjDZo3m7FgYdpYVZ",
        "apple": "https://podcasts.apple.com/podcast/10-surviving-caregiving-for-your-manipulative-parent/id1630652128?i=1000578812531"
      }
    },
    {
      "id": "2d147ed4-0dd4-4063-8d76-21073df32a9c",
      "title": "9. How to Differentiate Intuition from Trauma Responses",
      "description": "In Part 1 I tell you about what I’m working on: developing a comforting and sustainable sleeping routine! It’s harder than you think. In Part 2 I answer a listener question about intuition vs. trauma responses. How can she learn to trust her inner voice when it comes to dating men if it’s been informed by abandonment and neglect? I discuss the importance of defence mechanisms and how they’re rooted in experience and your body’s attempt at self-preservation. I then detail the active choice to override your initial defence mechanism response with an intentional tool to ensure your discernment is coming from an objective and carefully considered place. These tools are detailed further in my book, “The Irreverent Trust Guide”, linked below.   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Taylor Wallis - https://www.instagram.com/taylorwallis/  Trent Twomey - https://www.instagram.com/p/CdUNemlMxhL/ Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-09-01T10:00:16Z",
      "duration": "00:51:53.4040000",
      "explicit": false,
      "spotifyId": "0Q8SQgiusLuhR7wRmT5baH",
      "appleId": 1000578020703,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Q8SQgiusLuhR7wRmT5baH",
        "apple": "https://podcasts.apple.com/podcast/9-how-to-differentiate-intuition-from-trauma-responses/id1630652128?i=1000578020703"
      }
    },
    {
      "id": "bfe6b89b-02cd-430d-8a97-4867cec0d72f",
      "title": "8. Tooth Trauma and Toxic Workplaces",
      "description": "In Part 1 I talk tooth trauma! If you know, you know. For many of us the dentist’s chair is the last place we want to find ourselves. I share a recent distressing dental experience and use it to discuss how anxiety manifests differently in different people. In Part 2 I answer a listener question about how to deal with a toxic workplace. I explain that all organizations exist on a spectrum of toxicity and then walk through how to decide whether poor mental health is the price the listener is willing to pay to keep her job. In Part 3 Taylor joins me to discuss Netflix’ Keep Sweet, Prey and Obey.   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   Taylor Wallis - https://www.instagram.com/taylorwallis/  The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA Produced by Wowow",
      "release": "2022-08-25T10:00:30Z",
      "duration": "01:04:40.2020000",
      "explicit": false,
      "spotifyId": "47f6Hv8sVskQP2qtScMKaX",
      "appleId": 1000577316898,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/47f6Hv8sVskQP2qtScMKaX",
        "apple": "https://podcasts.apple.com/podcast/8-tooth-trauma-and-toxic-workplaces/id1630652128?i=1000577316898"
      }
    },
    {
      "id": "c3075752-bb85-41b7-a881-dca4e00e6ee9",
      "title": "7. Fall in Love with getting Ghosted",
      "description": "Yes, I mean it! Getting ghosted is a blessing in disguise. In Part 1 I explain how ghosting is a key indicator that someone is unwilling or unable to develop trust and emotional intimacy with you. I explain that it is only the beginning of what will be a string passive aggressive behaviour from the perpetrator, and that we must learn to heed ghosting as an early end of an inevitably doomed relationship. In Part 2 I answer a listener question about what to do when a bestie befriends an abusive ex-friend. I use an anecdote about how a strong friendship cultivated in recovery had a difficult but necessary ending. In Part 3 Taylor joins me for an analysis of the ending of Netflix’ Keep Sweet, Prey and Obey.   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   Taylor Wallis - https://www.instagram.com/taylorwallis/  The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions 4 Reasons to Fall in Love with Getting Ghosted -  https://thriveglobal.com/stories/4-reasons-to-fall-in-love-with-getting-ghosted/   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA",
      "release": "2022-08-18T10:00:52Z",
      "duration": "01:13:42.6350000",
      "explicit": true,
      "spotifyId": "0CEdAkI5SE1wYHjUwi5dhY",
      "appleId": 1000576472227,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CEdAkI5SE1wYHjUwi5dhY",
        "apple": "https://podcasts.apple.com/podcast/7-fall-in-love-with-getting-ghosted/id1630652128?i=1000576472227"
      }
    },
    {
      "id": "fdb111e0-cc0f-400f-ba95-ee917065af42",
      "title": "6. Self-Sabotage, Crossed Boundaries and Unreciprocated Effort",
      "description": "Warning! Today bubbles will be burst. In Part 1 I challenge the idea of self-sabotage. I invite you to consider how self-sabotage is actually a trauma response, and explain that defining our body’s act of inertia as \u0022sabotage\u0022, is discrediting its effort to keep us safe. I then use my journey with chronic dieting and eating disorders to illustrate this. In Part 2 I answer a listener’s question about how to handle a friend who repeatedly crosses their boundaries and who doesn’t make an effort. I use Gottman’s relational theory of “bid’s for connection”, my theory of “ladder of trust”, and Rosenberg’s theory of nonviolent communication to contextualize their experience and provide possible solutions. In Part 3 Taylor joins me to discuss Episode 2 of Netflix’ Keep Sweet, Pray and Obey. Trigger warning: sexual violence   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS Taylor Wallis - https://www.instagram.com/taylorwallis/ The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Atomic Habits – https://amzn.to/2KCFs1E Gottman’s “Bids for Connection” -  https://www.gottman.com/blog/want-to-improve-your-relationship-start-paying-more-attention-to-bids/ Breaking Free:  How I Escaped Polygamy, the FLDS Cult, and My Father, Warren Jeffs - https://amzn.to/3Qyx28e   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-08-11T10:00:29Z",
      "duration": "01:35:52.6590000",
      "explicit": true,
      "spotifyId": "3mPJozXNHLy9FGCo4KA5Z5",
      "appleId": 1000575755313,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mPJozXNHLy9FGCo4KA5Z5",
        "apple": "https://podcasts.apple.com/podcast/6-self-sabotage-crossed-boundaries-and-unreciprocated/id1630652128?i=1000575755313"
      }
    },
    {
      "id": "d18ab399-f392-4308-93db-db55a5f43ed5",
      "title": "5. Boundaries, Relationship Fantasies and Cults",
      "description": "In Part 1 I talk about the difference between telling people your boundaries versus living them. I discuss how boundaries are about protecting and honouring ourselves and our standards rather than controlling the behaviour of others. I hone in on the concept of consequences and acknowledge how difficult they are to act out because it places the consequence of a crossed boundary on us and not on the other person. In Part 2 I answer a listener question about how to mourn the death of a relationship they have fantasized about and exaggerated in their mind. I contextualize fantasy as a coping mechanism and not shameful and assure them that fantasy is just as painful as reality. I discuss shame and abandonment issues. In Part 3 I invite a dear friend Taylor Wallis on the show to discuss our obsession with cults, through the lens of the show Keep Sweet, Pray and Obey.   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   Taylor Wallis - https://www.instagram.com/taylorwallis/ The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books:   The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-08-04T10:00:06Z",
      "duration": "01:20:00.0780000",
      "explicit": false,
      "spotifyId": "0ENrUQNGo46wc22n9Xae2j",
      "appleId": 1000574986521,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ENrUQNGo46wc22n9Xae2j",
        "apple": "https://podcasts.apple.com/podcast/5-boundaries-relationship-fantasies-and-cults/id1630652128?i=1000574986521"
      }
    },
    {
      "id": "cfecb6e3-bd65-40a0-aa17-70ec23e48b44",
      "title": "4. Ego, Imposter Syndrome and Obi Wan",
      "description": "In Part 1, I talk about ego and how surrendering my ego has transformed my recovery from food addiction. On the flipside, I discuss how ego has sabotaged my efforts, and describe ego as a defensive mechanism in response to stress. In Part 2, I answer a listener question about whether it’s possible for imposter syndrome to show up in romantic relationships. I discuss how imposter syndrome is often just trauma dressed up, and how interrogating negative self-talk and learning about attachment theory could ease their overwhelm. And in Part 3, Trent and I take a deep dive into all things Obi Wan.   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions   Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books: The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA Produced by Wowow Podcasts",
      "release": "2022-07-28T10:00:46Z",
      "duration": "01:12:03.1340000",
      "explicit": false,
      "spotifyId": "7uPcivNI5zbOymanzucTyR",
      "appleId": 1000571439689,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7uPcivNI5zbOymanzucTyR",
        "apple": "https://podcasts.apple.com/podcast/4-ego-imposter-syndrome-and-obi-wan/id1630652128?i=1000571439689"
      }
    },
    {
      "id": "28e0b86a-6f71-4104-a95b-148eb181fd2f",
      "title": "3. Therapy Gone Wrong and A Crush on a Therapist",
      "description": "I discuss the experience of going to therapy as a counsellor myself, and a traumatic run-in with an overzealous one. I then answer a listener’s question about developing a crush on her therapist and explain transference and dreamwork to help contextualize and normalize her feelings. I discuss ethics that protect patients and therapists from romantic entanglements and leave her with actionable tools to process said feelings within the session itself. Trent joins me for the last segment where we mull over satirical gift ideas for dads, sad frozen pizzas and our quirky sense of humour.   To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Dad Gift Guide article -  https://www.theonion.com/onion-gift-guide-father-s-day-gifts-for-every-type-of-1849065889     Keep up with me: https://www.instagram.com/advancedbitches/ https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books: The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA",
      "release": "2022-07-21T10:00:45Z",
      "duration": "01:09:22.3770000",
      "explicit": true,
      "spotifyId": "37AUlHoRjG0QFZqDAV2Khw",
      "appleId": 1000570688398,
      "urls": {
        "spotify": "https://open.spotify.com/episode/37AUlHoRjG0QFZqDAV2Khw",
        "apple": "https://podcasts.apple.com/podcast/3-therapy-gone-wrong-and-a-crush-on-a-therapist/id1630652128?i=1000570688398"
      }
    },
    {
      "id": "c1503651-a5aa-459a-98d0-3ab83b06ea73",
      "title": "2. Grief, Childhood Trauma and Teachers Gone Wild",
      "description": "I talk about being gentle in times of grief and making peace with the process through the lens of a personal loss. I answer an Advanced Bitch’s question about why I prioritize healing trauma before addressing addiction. I then give you a tool to combat perfectionism, which is a trait hardly taken seriously, but can kill – literally. Finally, we finish on a silly note with Trent joining me for a hilarious dissection of a local education scandal. To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   LINKS   The Advanced Bitchifesto - https://www.advancedbitches.com/the-bitchifesto Advanced Bitches Bingo - https://www.advancedbitches.com/bingo-instructions Teacher article -  https://www.newsweek.com/houston-teacher-resigns-video-trading-grades-book-reviews-1710055   Keep up with me: https://www.instagram.com/advancedbitches/   https://www.advancedbitches.com/membership https://www.tiktok.com/@advancedbitches https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books: The Irreverent Grief Guide:  How to F*cking Survive Months 1-3 https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA   Produced by Wowow",
      "release": "2022-07-14T10:00:12Z",
      "duration": "00:46:59.3170000",
      "explicit": false,
      "spotifyId": "6xVH6vMJF0W1UKDbX8lUKW",
      "appleId": 1000569881292,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6xVH6vMJF0W1UKDbX8lUKW",
        "apple": "https://podcasts.apple.com/podcast/2-grief-childhood-trauma-and-teachers-gone-wild/id1630652128?i=1000569881292"
      }
    },
    {
      "id": "45376d62-7e50-4d98-9668-870f9c8eb636",
      "title": "1. Flight Mode Bitch",
      "description": "I answer an Advanced Bitche\u0027s question about how to handle her flight response that results in uprooting her family when faced with triggers. In discussing her dilemma I detail the four trauma responses: I explain how to address when they don’t serve you, and how to have compassion for yourself through them. I also discuss how to embrace parts of your personality created from your trauma response and how to identify and leverage the benefits that may be hidden within it. To submit a question, you can email it or send a voice recording of your question to be played on the podcast to hello@advancedbitches.com   Keep up with me:  https://www.instagram.com/advancedbitches/  https://www.advancedbitches.com/membership  https://www.tiktok.com/@advancedbitches  https://www.youtube.com/channel/UCND6RMWO-erRUYMXVOAynWQ   My books: The Irreverent Grief Guide:  How to F*cking Survive Months 1-3  https://amzn.to/3sZYalY The Irreverent Trust Guide:  How to Trust Again after Past Trauma F*cked You Up  https://amzn.to/3JJbIKA",
      "release": "2022-07-07T09:00:37Z",
      "duration": "00:42:33.1290000",
      "explicit": false,
      "spotifyId": "5GFKccmOugFVvQ90h0HoSm",
      "appleId": 1000569121585,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GFKccmOugFVvQ90h0HoSm",
        "apple": "https://podcasts.apple.com/podcast/1-flight-mode-bitch/id1630652128?i=1000569121585"
      }
    },
    {
      "id": "eab45107-8945-4df2-a753-ab720b2e4df8",
      "title": "Ask An Advanced Bitch - Trailer",
      "description": "Hello, I’m Elizabeth. And I was formerly fucked up. Very fucked up. It took years and years to unlearn self-sabotage, rewrite negative self-talk, forgive myself and others and develop the tools to understand and manage my trauma. Through therapy, and becoming a therapist and life coach myself, I leveled up my mind, body and soul - and have realized my true nature as a confident, self-assured, free woman. Or for short, an Advanced Bitch. And I want this for you, too! Every week I’ll deliver no-nonsense episodes that break down and simplify the dirty work that is transforming your life, one mindset shift at a time. And to let you know, even though I’m a licensed therapist, this podcast is not therapy. If you want to further your healing, please seek out relevant practitioners and join my membership for in-depth, personalized classes.",
      "release": "2022-06-15T20:38:00Z",
      "duration": "00:03:34.6420000",
      "explicit": false,
      "spotifyId": "0WPajXeJUW9ErBQ0FroGkO",
      "appleId": 1000567037247,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0WPajXeJUW9ErBQ0FroGkO",
        "apple": "https://podcasts.apple.com/podcast/ask-an-advanced-bitch-trailer/id1630652128?i=1000567037247"
      }
    }
  ]
}