{
  "id": "c537107a-e522-49d7-abdf-2ba574abf92c",
  "name": "Sex Ed with DB: smart, science-backed sex education",
  "spotifyId": "6uCAo6v1ioxJzRuiiyw9sB",
  "appleId": 1286811573,
  "youTubeChannelId": "UCjmfihSFHe7Yo-7tIm0voOA",
  "episodes": [
    {
      "id": "512b004f-61f5-4a3a-9867-f1a879bc75c6",
      "title": "Secrets of a sex cult: when pleasure gets weaponized with Ellen Huet",
      "description": "This week, we\u0027re talking about how sexuality can be used to coerce people in cultlike settings, through the lens of Ellen Huet\u0027s new book EMPIRE OF ORGASM: Sex, Power, and the Downfall of a Wellness Cult. Ellen joins DB to talk about OneTaste, a for-profit wellness company that was hit with allegations of coercion, forced labor, and other abusive practices. Listen in for the story of how Ellen dove into this story as an investigative journalist -- including the time she came face-to-face with the alleged perpetrators she was covering. CONTENT WARNINGS In this episode, we discuss allegations of sexual assault, coersion, grooming tactics, cults. These topics will be present throughout the entire conversation, so if this is something that hits a little too close to home or is too heavy to dive into right now, please take care of yourself. ABOUT OUR GUEST Ellen Huet is an investigative journalist for Bloomberg News and the author of EMPIRE OF ORGASM: Sex, Power, and the Downfall of a Wellness Cult, a book about the rise and fall of a wellness cult. She writes award-winning features for Bloomberg Businessweek magazine, has hosted two seasons of the podcast Foundering, and holds a particular interest in writing about strange and complex subcultures. Previously, she was a staff writer at Forbes and a crime reporter at the San Francisco Chronicle. She lives in the San Francisco Bay Area. ABOUT SEASON 13 Season 13 of Sex Ed with DB is ALL ABOUT PLEASURE! Solo pleasure. Partnered pleasure. Orgasms. Porn. Queer joy. Kinks, sex toys, fantasies -- you name it. We\u0027re here to help you feel more informed, more empowered, and a whole lot more turned on to help YOU have the best sex. CONNECT WITH US Instagram: @sexedwithdbpodcast TikTok: @sexedwithdb Threads: @sexedwithdbpodcast X: @sexedwithdb YouTube: Sex Ed with DB SEX ED WITH DB SEASON 13 SPONSORS Uberlube , Magic Wand , and LELO . Get discounts on all of DB\u0027s favorite things here ! GET IN TOUCH Email: sexedwithdb@gmail.com Subscribe to our BRAND NEW newsletter for hot goss, expert advice, and *the* most salacious stories. FOR SEXUAL HEALTH PROFESSIONALS Check out DB\u0027s workshop: \u0022Building A Profitable Online Sexual Health Brand\u0022 ABOUT THE SHOW Sex Ed with DB is your go-to podcast for smart, science-backed sex education — delivering trusted insights from top experts on sex, sexuality, and pleasure. Empowering, inclusive, and grounded in real science, it\u0027s the sex ed you\u0027ve always wanted. ASK AN ANONYMOUS SEX ED QUESTION Fill out our anonymous form to ask your sex ed question. SEASON 13 TEAM Creator, Host \u0026 Executive Producer: Danielle Bezalel (DB) (she/her) Producer and Growth Marketing Manager: Wil Williams (they/them) Social Media Content Creator: Iva Markicevic Daley (she/her) MUSIC Intro theme music: Hook Sounds Background music: Bright State by Ketsa Ad music: Soul Sync by Ketsa, Always Faithful by Ketsa, and Soul Epic by Ketsa. Thank you Ketsa !",
      "release": "2025-11-19T08:00:00Z",
      "duration": "00:57:23.6050000",
      "explicit": true,
      "spotifyId": "3BYWzEmlWxNGFUtFlMJECW",
      "appleId": 1000737378176,
      "youTubeId": "sbLPo1fVIts",
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BYWzEmlWxNGFUtFlMJECW",
        "apple": "https://podcasts.apple.com/podcast/secrets-of-a-sex-cult-when-pleasure-gets/id1286811573?i=1000737378176",
        "youtube": "https://www.youtube.com/watch?v=sbLPo1fVIts"
      }
    }
  ]
}