{
  "_ts": 0,
  "id": "8b0413b6-dbd1-4c9d-bdd4-1b255a3b3953",
  "name": "Sexvangelicals",
  "spotifyId": "6tOJBMOMn1BtzUyiXm3KDn",
  "appleId": 1541092846,
  "episodes": [
    {
      "id": "ce80b121-f830-480d-8020-2f724b30f04d",
      "title": "Bonus Re-Release: Loving, Living, and Leaving the Evangelical Church, with Sarah McCammon, part 1",
      "description": "Last March, we had the opportunity of interviewing NPR national correspondent Sarah McCammon discussing the strategy and implementation of rigid conservative values in her book The Exvangelicals: Loving, Living, and Leaving the White Evangelical Church. We are re-releasing both our conversations with Sarah in honor of the paperback release on February 18th. In this episode, we discuss the relationship between Trump and Evangelicals, the rise of religious NONES, why folks stay in EMPish (Evangelical, Mormon, Pentecostal) spaces, and grief around those who leave. Check out our advertisement for our new relationship coaching business, Let\u0027s Heal Together!",
      "release": "2025-02-10T05:23:00Z",
      "duration": "00:43:13.9060000",
      "explicit": true,
      "spotifyId": "0n65eHLIMFLKxiKe2V3Tax",
      "appleId": 1000690746764,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0n65eHLIMFLKxiKe2V3Tax",
        "apple": "https://podcasts.apple.com/podcast/bonus-re-release-loving-living-and-leaving/id1541092846?i=1000690746764"
      }
    },
    {
      "id": "80dfb517-c74d-436a-a439-c9b12ea7a431",
      "title": "Episode #86: Letting the Dust Settle: Finding Your Values and People",
      "description": "Letting the dust settle allows us to step out of the reactionary space and evaluate our own lives and relationships. In our final episode of the series \u0022How to Practice Social Justice Without Being a Jackass\u0022, Julia and Jeremiah talk about how to make decisions based on values that are important to you and your family system. A proactive process, rather than reactive process, also makes it easier to make relationships with people who align with your values. Check out our conversations about: PACT: The Psychobiological Approach to Couples Therapy Discovering your values Relationship anarchy Creating a shared purpose and vision statement Partnering with people who have a shared vision, but perhaps different lanes Check out Episode #86: Letting the Dust Settle: Finding Your Values and People on Apple Podcasts, Spotify, or wherever you get your podcasts. Show notes and transcript are on the Sexvangelicals website.",
      "release": "2024-12-30T18:51:00Z",
      "duration": "00:53:02.8110000",
      "explicit": true,
      "spotifyId": "2rVH5s4LQWVEtHjle0x4VR",
      "appleId": 1000682159775,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rVH5s4LQWVEtHjle0x4VR",
        "apple": "https://podcasts.apple.com/podcast/episode-86-letting-the-dust-settle-finding-your/id1541092846?i=1000682159775"
      }
    },
    {
      "id": "6389bade-8cc9-4f25-a98f-4bcf78776cc8",
      "title": "Episode 72: Was Keith Green a Cult Leader?",
      "description": "This week, Sexvangelicals has teamed up with the I was a Teenage Fundamentalist podcast, to bring you their thought-provoking conversation with Tracey Phalen. She herself was a teenage fundamentalist, and details her experience as a member of the Last Days Ministries. The episode begs the question, was Keith Green a cult leader?",
      "release": "2024-05-26T22:39:00Z",
      "duration": "01:23:14.9030000",
      "explicit": true,
      "spotifyId": "4BbpHfUpVWSqvDNjB1FIwh",
      "appleId": 1000656832819,
      "subjects": [
        "Last Days Ministries"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BbpHfUpVWSqvDNjB1FIwh",
        "apple": "https://podcasts.apple.com/podcast/episode-72-was-keith-green-a-cult-leader/id1541092846?i=1000656832819"
      }
    },
    {
      "id": "215b6894-156d-4101-bbc6-ffc42334d986",
      "title": "Episode #64: Banned Books: A Well Trained Wife, with Tia Levings, part 1 of 2",
      "description": "\u0022While this story is my own memoir, the situations in this book are far from unique. With me stands a choir of invisible fundamentalist women, too silenced to tell their stories for themselves.\u0022 We\u0027re honored to have Tia Levings (@tialevingswriter), author of the upcoming book A Well Trained Wife, as our podcast guest this week. Tia shares her research, wisdom, and immense bravery with us; we focus our conversations around: How the Evangelical Church is a Microcosm of a Bigger System Waiting for the Other Shoe to Drop: Perfectionism Books that Encourage Evangelical Family Structures Tradwives Dating Under Purity Culture Covenant Marriage Cosigning Misery The Wellness Industry and Christianity Assigning Credit to Yourself Instead of God",
      "release": "2024-04-01T20:36:00Z",
      "duration": "00:54:56.0260000",
      "explicit": true,
      "spotifyId": "6Xmr77YAaPVHTLV3Dcjhj2",
      "appleId": 1000651117864,
      "subjects": [
        "Evangelicalism",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Xmr77YAaPVHTLV3Dcjhj2",
        "apple": "https://podcasts.apple.com/podcast/episode-64-banned-books-a-well-trained-wife-with/id1541092846?i=1000651117864"
      }
    },
    {
      "id": "d2b428ef-7ab4-4a03-a376-a0f4b414938d",
      "title": "Episode #63: Banned Books: The Exvangelicals, with Sarah McCammon, part 2 of 2",
      "description": "There\u0027s a lot of memoirs, social media comments, and dialogue about leaving the evangelical church. However, as our guest, Sarah McCammon (@sarahmccammon_journalist) says, \u0022you can\u0027t really understand the leaving without understanding loving and living the evangelical church.\u0022 Sarah is the author of the new book The Exvangelicals. She talks with us about: The history of Christianity and politics What religion may offer The Bill Clinton Era and Purity Culture Evangelical Relationships Performing Gender Loving and Living (and Leaving) the Evangelical Church Grief Connection and Trauma Bonding Healing Through Storytelling Check out Episode #63: Banned Books: The Exvangelicals, with Sarah McCammon, part 2 of 2 on Apple Podcasts, Spotify, or wherever you get your podcasts. Show notes and transcript are on the SV website",
      "release": "2024-03-26T21:38:00Z",
      "duration": "00:32:15.2550000",
      "explicit": true,
      "spotifyId": "3BwklUN7VNPJYEahvfse7H",
      "appleId": 1000650543468,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BwklUN7VNPJYEahvfse7H",
        "apple": "https://podcasts.apple.com/podcast/episode-63-banned-books-the-exvangelicals-with/id1541092846?i=1000650543468"
      }
    },
    {
      "id": "8ae6f905-37e8-4565-a6f2-c8b13ed46c78",
      "title": "Episode #62: Banned Books: The Exvangelicals, with Sarah McCammon, part 1 of 2.",
      "description": "It\u0027s been really fascinating to watch the ways that Evangelical, Mormon, and Pentecostal (EMPish) cultures have begun to be deconstructed and discussed on a wider cultural level. While some still struggle to accurately name the direct correlation between EMPish cultures and the construction of the modern-day Republican Party, NPR national correspondent Sarah McCammon (@sarahmccammon_journalist) discusses the strategy and implementation of rigid conservative values in her new book The Exvangelicals: Loving, Living, and Leaving the White Evangelical Church. In part 1 of a 2 part interview, Sarah talks with us about: Trump and Evangelicals The rise of the religious Nones Two target audiences The purpose of The Exvangelicals Fear of Judgement Empathy and Honesty Why People Stay in EMPish Spaces Lack of Goodbyes Christianity and Inclusivity Promises Unfulfilled Salem Witch Trials and Christian Textbooks The Exvangelicals comes out this week--buy it on Amazon! Check out Episode #62: Banned Books: The Exvangelicals, with Sarah McCammon, part 1 of 2 on Apple Podcasts, Spotify, or wherever you get your podcasts. Show notes and transcript are on the SV website",
      "release": "2024-03-19T04:56:00Z",
      "duration": "00:40:51.8790000",
      "explicit": true,
      "spotifyId": "5Fq1HwfBMJLvQzmzEqxSee",
      "appleId": 1000649662195,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Fq1HwfBMJLvQzmzEqxSee",
        "apple": "https://podcasts.apple.com/podcast/episode-62-banned-books-the-exvangelicals-with/id1541092846?i=1000649662195"
      }
    },
    {
      "id": "96365faa-2285-4326-9c4f-dbf9f986c25e",
      "title": "Episode #60: Banned Books: When Religion Hurts You, with Laura Anderson (part 1 of 2)",
      "description": "What is religious abuse? Dr. Laura Anderson, in her new book When Religion Hurts You, defines it as: \u0022The improper use of religious beliefs, teachings, doctrines, and relationships against another person. This might include harassment, humiliation, mind control, psychological abuse, isolation, threats, intimidation, minimizing, denying, blaming, asserting spiritual authority, and making it difficult to leave the religious community.\u0022 If you\u0027re experienced one or more of the above, our interview with Laura provides some strategies for processing and navigating these experiences. Laura talks with us about: Addressing Religious Trauma Downplaying Trauma How Diagnosing Blames the Individual Focusing on the Body Eating Disorders and EMPish Communities Acknowledging Before Healing Two-Choice Dilemmas Honoring Grief The Demonization of Anger Check out Episode #60: Banned Books: When Religion Hurts You, with Laura Anderson (part 1 of 2) on Apple Podcasts, Spotify, or wherever you get your podcasts.",
      "release": "2024-03-04T22:47:00Z",
      "duration": "00:54:49.8610000",
      "explicit": true,
      "spotifyId": "5LXhBphI8pmeSZxMspXSeZ",
      "appleId": 1000648002968,
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5LXhBphI8pmeSZxMspXSeZ",
        "apple": "https://podcasts.apple.com/podcast/episode-60-banned-books-when-religion-hurts-you-with/id1541092846?i=1000648002968"
      }
    },
    {
      "id": "936fe0ea-2dec-41f1-ac2c-3d37f2695aed",
      "title": "Episode #59: Banned Books: The Secret Lives of Church Ladies, with Deesha Philyaw",
      "description": "Purity Culture is largely embedded within White social and political systems intended to dominate and control bodies through a hyper-moralistic, anti-sex landscape. However, in this last week of Black History month, it\u0027s imperative that we talk about the ways that Purity Culture has impacted Black communities. To help us, we are sharing our interview with Deesha Philyaw (@deeshaphilyaw), author of The Secret Lives of Church Ladies, about how the values of Purity Culture have infiltrated Black churches and informed sexual relationships and expectations within the Black community. We talk about: Purity Culture within Cultural Contexts Values How Sexual Misinformation Informs the Writing Process The Lack of Conversation Divorce within the Church Fiction and Sexual Health Suffering in Silence “Daddy Issues\u0027\u0027 Grief Working Through Self-Hate Through Fiction Sexism within Black Churches Check out Episode 59: Banned Books: The Secret Lives of Church Ladies, with Deesha Philyaw on Apple Podcast, Spotify, or wherever you get your podcasts. Please give us a five star review as well! Show notes and transcript are found on the Sexvangelicals website.",
      "release": "2024-02-27T03:10:00Z",
      "duration": "01:28:39.3660000",
      "explicit": true,
      "spotifyId": "5539ybyR4CUHAviWhfsbPx",
      "appleId": 1000647175770,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5539ybyR4CUHAviWhfsbPx",
        "apple": "https://podcasts.apple.com/podcast/episode-59-banned-books-the-secret-lives-of/id1541092846?i=1000647175770"
      }
    },
    {
      "id": "f95e9c15-803b-4bcc-9975-c1b69bdc5adf",
      "title": "Episode #54: Kicking Off the New Year with Spiritual Abuse: How Romantic Comedies Can Reinforce the Worst Parts of Evangelical Culture, with Katherine Spearing",
      "description": "“Romantic comedies and chick lit reflect messages that are prevalent in both secular culture and religious spaces. Although Christian spaces give lots of lip service to being counter cultural, they usually repackage the same message from popular culture with a different wrapping paper.” We continue our mini-series Let’s Kick Off the New Year with Spiritual Abuse, with Katherine Spearing, co-founder of Tears of Eden and author of Hartfords, a historical romantic comedy. Katherine talks with us about how literature can often reinforce some of the rigid, unhelpful ideas about gender and relationships, and how writing Hartfords positively impacted her own healing process. Join us as we explore: Chiclit and Romcoms (2:00) Jane Austen and Subtle Messaging (6:00) The Fear of Art Within the Church (16:00) Art as a Means of Survival (21:00) Psychology, Art, and the Church (26:00) Rom Coms and the Church (31:00) Friendship within Hartfords (35:00) The Power of the Pen (40:00) Deconstruction and Hartfords (45:00) Healing (59:00) Check out Episode #54: Kicking Off the New Year with Spiritual Abuse: How Romantic Comedies Can Reinforce the Worst Parts of Evangelical Culture, with Katherine Spearing on Apple Podcasts, Spotify, or wherever you get your podcasts. Show notes and transcript are on the Sexvangelicals website: www.sexvangelicals.com Let’s heal together!",
      "release": "2024-01-15T04:49:00Z",
      "duration": "01:02:07.1510000",
      "explicit": true,
      "spotifyId": "1AZ8ZhMw8XGfuhnxpIThex",
      "appleId": 1000641661865,
      "subjects": [
        "Evangelicalism",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1AZ8ZhMw8XGfuhnxpIThex",
        "apple": "https://podcasts.apple.com/podcast/episode-54-kicking-off-the-new-year-with-spiritual/id1541092846?i=1000641661865"
      }
    },
    {
      "id": "8d2cc474-f548-44a3-a132-408c1a2520cc",
      "title": "Episode #53: Kicking Off the New Year with Spiritual Abuse: How to Leave a Controlling Family Environment, with Katherine Spearing",
      "description": "Happy New Year! January is Spirtual Abuse Awareness month, and so we\u0027re kicking off the New Year with a couple of episodes with Katherine Spearing (@katherinespearing), host of the Uncertain Podcast (@uncertainpodcast) and founder of the nonprofit Tears of Eden. \n  \n Katherine defines spiritual abuse as \u0022invoking a religious text or deity as a way to maintain power and control over both individuals and communities.\u0022 In this episode, we describe the multiple systems in Katherine\u0027s life that practiced abusive dynamics--family of origin, churches, the Evangelical system at large. Katherine talks with us about: \n   Stay at Home Daughters (7:00) Women as Property (9:00) Double Binds of Womanhood (13:00) Arrested Development (17:00) Labeling Abuse and Defining Spiritual Abuse Once More (25:00) Finding a Voice You Never Had (29:00) Individuation (31:00) Phobias and Leaving Cults (39:00) Silent Patriarchy (45:00)  Tears of Eden and Healing (55:00)  Learn more about Katherine\u0027s work by visiting tearsofeden.org. We\u0027re so grateful for her influence and passion for helping folks in the early stages of deconstruction!",
      "release": "2024-01-07T18:44:00Z",
      "duration": "01:01:55",
      "explicit": false,
      "spotifyId": "2gV1N8vVThWIXFIMT0X23S",
      "appleId": 1000640862687,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2gV1N8vVThWIXFIMT0X23S",
        "apple": "https://podcasts.apple.com/podcast/episode-53-kicking-off-the-new-year-with-spiritual/id1541092846?i=1000640862687"
      }
    },
    {
      "id": "6a4983b5-62cb-4114-b47f-dbe4e4623b58",
      "title": "Episode #41: How Purity Culture Informed the 90s and 00s, with Teddi and Nick from Oh God I Forgot About That",
      "description": "Purity Culture isn’t just a collection of pithy quotes and misappropriation of Scripture about bodies and relationships. It’s a creation of a myriad of businesses, media, and political systems that work together to showcase and reinforce the existence of particular types of relationships. We’ve learned that understanding the larger context of Purity Culture, from the intersection of theology and American history to the cultural icons and legislative processes that these create, has helped us in our own deconstruction process. Which is also true for our guests this week, Teddi and Nick from the podcast Oh God I Forgot About That. They study cultural and literary artifacts from the 90s and 00s and talk about how each of these got used and enhanced to propagate the larger goals of Purity Culture. They talk with us this week about: Cosmic Consequences (10:00): “I say this basically every single episode. When you attach cosmic consequences to anything you guarantee it\u0027s going to be messed up. You\u0027re creating trauma. You\u0027re creating anxieties. And that\u0027s what I did.” Nick highlights the quintessential issue within the Church, and that is attaching God-given consequences to actions. For instance, if you have sex before marriage, you are going to go to hell. This type of thinking fosters intense anxiety within folks because it gets rid of their ability to explore life without feeling like they will be punished for stepping out of line. Deconstruction Within Relationships (12:00): Julia and Jeremiah both speak on how deconstruction happens within relationships, romantic or not, and how it is not the solo experience it is so often pictured to be. Julia says: “I’ve also noticed that some folks in the early stages of deconstruction can sometimes understandably overcompensate because they\u0027ve been in these enmeshed communities for maybe decades. And so understandably, they want to start making their own individual autonomous choices as we should. However, as Jeremiah and I are relationship therapists, the deconstruction world doesn\u0027t always give good resources for how we still live in relationships all the time, not just with partners.” She mentions that many folks may struggle with moving too far into an isolated space as a form of regaining autonomy. Jeremiah adds: “And a good reminder that deconstruction happens in relationships. This isn\u0027t a person like sailing away on their own solitary boat out into the great blue ocean. This happens through the conversations that y\u0027all are talking about and, sometimes with partners, sometimes not with partners and that\u0027s exciting. It\u0027s complicated.” He talks about how deconstruction is happening within the context of our relationships, and it’s important to have these conversations because deconstruction looks different for everyone, however we all have people in our lives and it’s important to figure out how to navigate this enormous change. Physical Contact Through a Sexual Lens (22:00): “My partner said something brilliant, we were just having this conversation about the reason men misunderstand their sexual urges and desires. Especially men in the church are two-pronged. The first is what we\u0027ve already talked about, which is you\u0027re always already in sexual temptation. But the other is, that men are conditioned to not be physical with each other, except in the context of violence. Or competition, right? So you can, you can have a football huddle. You can do the bro hug where you do the weapons check and the smack on the back. You can punch fists. But, there is no physical intimacy encouraged or allowed in masculine spheres. And then when you\u0027re man to woman, boy to girl, forget it, it\u0027s off limits. You are, as a human being, boxed into this corner where no physical intimacy, except maybe your parents. So then because the only valence for physical contact that you as a man in the church are given is sexuality, right? Yeah, all of your desire for any sort of physical contact or physical intimacy that isn\u0027t necessarily sexual. Gets filtered through that sexual lens.” Nick describes how the Church creates an environment in which physical touch is only offered to men through a violent lens or sexual one. This also creates a world view where sexuality is informed by violence and feeds into the idea that men are inherently violent. Creating the Podcast (27:00): “Eleanor Roosevelt said something along the lines of like you\u0027d be like delighted and disturbed to know how little people are actually thinking about you. And that proved true with the podcast. Like I have heard from no one about it. I mean, they could all be listening. All the people from my youth could be listening and discussing it behind my back. Perhaps they\u0027re not. I\u0027ve had a few people who are more in the deconstruction stage of their faith, say that they\u0027re listening and that it\u0027s helpful to them, they almost presented in a kind of envious way, like, I can\u0027t wait to be on the other side and be able to talk about this the way you guys are talking about it, but for those who are deep in the church, like, I haven\u0027t heard anything from them and occasionally I will wonder what they\u0027re thinking, because how can you not?” Teddi talks about the challenges that come along with creating a podcast that talks about the Church, after years of being deeply rooted within it. The Church creates a Panopticon system, where everyone has the fear of being watched and told on, but is not sure if they are being watched at that moment. It generates an environment where trust is a challenging thing. Separating the Individual and the Institution (32:00): “That\u0027s a conversation I\u0027ve had with a few people in my life about the podcast because I know a lot of folks who are still in the church are still in conservatism and they have listened or they\u0027ve like known that I\u0027ve done it. […] I\u0027m in a much better place where I can let everyone have their spiritual journey, and that\u0027s a very beneficial and important place for me, but the thing that I emphasize in those conversations is, again, the difference between the institution and the individual, right? When we look at somebody like Rob Bell, or we look at something like the Eldridge, you know, John and Stacey Eldridge\u0027s books, right? They feel fluffy, they feel vapid, anodyne, but they\u0027re put in this context where they become defining for not just the culture, but patterns of thought.” Nick talks about how it’s essential to let everyone have their own spiritual journey. Many folks who deconstruct are confronted by the people in their lives who still subscribe to Church ideologies, and many of those people feel personally attacked when someone is deconstructing. What is important on both sides is allowing folks to have their own relationship with spirituality and religion. Another point Nick covers is how Christian authors define thought, despite clearly lacking deep and meaningful research. As discussed many times on Sexvangelicals, Christian authors will use small sample sizes in their research, will fall back on Biblical principles, and sometimes, just straight up lie. What is dangerous however is their impact on thought within the Church and especially on young folks to whom these books are distributed too. Doctrine Over Relationships (46:00): “Jeremiah and I always come back to the idea of a relationship. We had a conversation with Tia Levings, who people probably recognize from Shiny Happy People, and she describes fundamentalism as anything that puts a doctrine or a dogma over a human relationship.” Julia discusses a fundamental issue within the Church, which is putting doctrine over people. A key example of this is an unmarried couple who will abstain from sex because they believe they will go to hell for engaging in sex or with their sexuality. This is putting doctrine over relationships because this can and will harm many folks and their relationships because it makes sex the enemy and then sex becomes an enemy that has to be engaged with for the rest of their married lives.",
      "release": "2023-10-02T06:49:00Z",
      "duration": "01:02:15.3790000",
      "explicit": true,
      "spotifyId": "09cyNGbLAzZ4mSfncedQu0",
      "appleId": 1000629869167,
      "subjects": [
        "Institute In Basic Life Principles",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09cyNGbLAzZ4mSfncedQu0",
        "apple": "https://podcasts.apple.com/podcast/episode-41-how-purity-culture-informed-the-90s-and/id1541092846?i=1000629869167"
      }
    },
    {
      "id": "1d507482-89b3-4512-94e8-8c240a348fb4",
      "title": "Episode #38: Partnership Building: How Purity Culture Makes It Hard for Couples to Practice Positivity, with Jeremiah and Julia",
      "description": "We\u0027re back from our month off hiking the Alpe Adria in Austria, Slovenia, and Italy. And we pick up today where we left off, talking about the Sound Marital House model from couples therapy gurus John and Julie Gottman. For a friendly reminder, the first three levels of the Sound Marital house are curiosity, appreciation, and leaning toward your partner. And this week, Julia and Jeremiah talk about the fourth value: the positive perspective, including: Defining Terms (10:00): “For the sake of today, we\u0027re going to say that being positive about sexuality in a partnership means being positive about the existence of eroticism in a relationship, which to be clear is not the same as sex. […] To simplify it for today, eroticism is ultimately about the presence of sexual desire, whether or not you consummate that sexuality. So we\u0027ll be focusing on positivity about the presence of sexual desire, and since this is a relationship podcast, We\u0027ll talk about the presence of sexual desire within a partnership or whatever other relational structure you have.” Julia defines positive perspective, eroticism, and sexuality in terms of today\u0027s episode. Defining clear terms is an important value for Sexvangelicals, and it is important to have a clear understanding of how we will be using these terms to navigate our topic. Hierarchy (17:00): “The gatekeeping around marriage creates an exclusionary social hierarchy in which you\u0027ve got married Christian folks at the top, accessing all their God-given sexual rights. And unmarried Christian folks, one rung below, who are either dating or pursuing marriage in some sort of explicit way. Eventually, those folks may have full access to the post-marriage sex script. But until marriage, they are inherently limited. Unmarried folks who by choice or not by choice will not ever get married are the next level lower. They are not able to access the joy of sexuality in marriage. […] And all of this is important in setting up the episode today because we are highlighting that dichotomy of the pre-marriage sexual script and the post-marriage sexual script. And I suppose if we have this hierarchy... The secular folks are just outside of this system because they refuse to participate because they\u0027re relishing in their heathen ways. Like us. Us unmarried folks who are still having sex.” Julia highlights the hierarchy within EMPish communities based on marriage status. EMPish Churches only have two scripts, one for those pre and post-marriage, creating a system where only those two realities exist. This is incredibly damaging as all your relationships in the “pre” sphere exist as a march to the wedding, as Julia will go on to share today. Preserving Purity (19:00): “So due to the gatekeeping around marriage, the dichotomy between the pre-marriage and post-marriage scripts inherently function to protect the system of social and sexual hierarchy that we just described […] So, if the pre-marriage script focuses on preserving the purity of your sexuality until you can access the post marriage script, folks hoping to get married face some, some unique sexual challenges.” Jeremiah talks about how the pre-marriage script is incredibly limited in fundamentalist communities and that the only information people hoping to get married receive is that they will unlock all these secrets about sex when they’re already married. This causes a lot of pain and grief, because the reality is without proper sex education and knowledge around sex, most of people confronted with the post-marriage script do not know what to do. He also says: “Depending on the level of fundamentalism in a person\u0027s community, the rules limiting access to sexuality may vary in strictness while still serving to protect sexual purity.” This statement encapsulates the issue at hand because the rules around sexuality in fundamentalist communities are structured around preserving purity, however, once you are married, your “purity” goes away. It’s All About Sex (28:00): “Because I wanted to have sex. Even at the time, I had some shame around that because I knew, according to the church, that I as a woman was not supposed to have those sexual desires. Interestingly, by eradicating any meaningful sexual expression, the church\u0027s teachings actually make dating relationships all about sex.” Julia speaks about how by repressing any means of sexual expression, the church inadvertently makes dating all about sex. A lot of young couples instead of enjoying their time dating, spend time focusing on “not giving in to sin.” This puts sex on a pedestal, which in turn makes people want it more. Shame and Grief (40:00): “The reason that this story is so essential to this episode is that you met someone that you liked, you briefly dated, you enjoyed some sexual experiences, which would be completely developmentally appropriate for a 19-year-old who\u0027s working during the summer months while in college, but instead of enjoying it, instead of learning about yourself and exploring relational and sexual values, you obsessed over your sin.” Jeremiah says in response to Julia’s story. He talks about how instead of being able to relax into developmentally appropriate desires she had to spend her entire relationship worrying about sinning. Julia then adds: “Yes. I\u0027m sad for my 19-year-old self, and I know that this story is not unique. I can\u0027t tell you how many times I\u0027ve supported clients in grieving what they lost due to sexual shame. And I\u0027m not specifically grieving the relationship itself, I\u0027m grieving that I lost the opportunity to get to know myself and I\u0027m grieving how much pleasure and fun not just sexual pleasure and fun that the shame stole from you.” She shares the grief of not being able to have those “normal” experiences because of the fundamentalist community she was in. EMPish communities have a focus on teaching people shame, not on teaching people about sexuality, and shame dictates the pre-marriage script. Lack of Eroticism (49:00): “Sex was finally allowed. And that actually killed a big part of the eroticism for me and for many people. The massive barriers to sexuality created by purity culture actually make sex pretty sexy. But folks like me and like so many others didn\u0027t know how to create and build eroticism on their own without those barriers. Which often causes sex to be pretty disappointing after the barriers of purity culture are no longer present. […] Second, sexuality was now not only allowed, it was expected. Which I know you\u0027ll discuss more in your episode, Jeremiah, and that generated a lot of sexual pressure for me. This thing, intercourse, was expected, but I didn\u0027t have relational or individual literacy about sexuality or tools to co-create a pleasurable experience.” Julia shares how after the barriers to entry were removed, there was no eroticism present nor was there a way for her to engage in sexuality due to the lack of resources and knowledge. EMPish communities foster an environment where people are forbidden to have sexual desires and thoughts up until their wedding night, and they are just expected to know right after they say “I Do.” Beginning the Conversation Around Neutrality (1:04:00): “Neutrality means that you do not actively want sex. And you are open to go full circle to the possibility of a sexual experience. So, I learned that you don\u0027t have to wait until you really want to have sex to have a great sexual experience. So, if the responsive desire is a big part of the sexual template for many individuals, many couples, or throuples or whatever your group, then we\u0027ve got to actually figure out what to do with that. Simply knowing that responsive desire is important for folks or the dominant template for folks isn\u0027t enough. And in future episodes, we\u0027re going to be talking about what does it mean to take that neutrality. Take that responsive desire and build something that hopefully is really fun and pleasurable.” Julia explains what neutrality and responsive desire are, a topic that will be explored more in the coming months. It is important to highlight in this Relationship 101 that sexual desire looks different for everyone and to not hold yourself to the same standard as everyone else, because it looks different for everyone as Jeremiah notes: “And one of the things that we\u0027ll come across when we do this, just to skip ahead a little bit, is the idea of conflict. Yes. Because... How you access sexuality, Julia, is going to be different from how I access sexuality. And we\u0027ve got to figure out how to navigate those differences and to create something that works for both of us. That both of us really enjoy. And conflict doesn\u0027t have to be scary, it doesn\u0027t have to be fighting, anything like that. Even though some emotions will probably come up for folks, even for you and I, as we navigate this.”",
      "release": "2023-09-11T01:04:00Z",
      "duration": "01:08:58.3440000",
      "explicit": true,
      "spotifyId": "7gK4VsTUudspSSFXOgUSzQ",
      "appleId": 1000627407093,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7gK4VsTUudspSSFXOgUSzQ",
        "apple": "https://podcasts.apple.com/podcast/episode-38-partnership-building-how-purity-culture/id1541092846?i=1000627407093"
      }
    },
    {
      "id": "4d071ac2-cbdc-4782-99d4-cb1b086bbdbf",
      "title": "Summer Rewatch Series: How Purity Culture is Uniquely Damaging to Teens and Young Adults, with Linda Kay Klein",
      "description": "16 years ago, Linda Kay Klein embarked on a storytelling journey that would change her life (and the lives of many others). In her 2018 book Pure: Inside the Evangelical Movement That Shamed a Generation of Young Women and How I Broke Free, Linda captures the experiences of hundreds of women, herself included, who grew up within and confronted the consequences of the Evangelical purity culture movement in the 90s and early 2000s. Through Pure and her nonprofit, Break Free Together , Linda has created numerous spaces to bring folks together to share their stories about repression, bravery, and ultimately freedom. We are thrilled to have her as a podcast guest! Freedom comes in expected and unexpected ways. For instance, in this episode, learn how shrimp tails and boxes drawn on a dorm room wall were formative experiences that helped Linda access the bravery to tell the story that she was so afraid to share. “The great thing about doing something that you’re really, really afraid of is the feeling when you survive.” Linda, Jeremiah, and Julia also discuss: What makes purity culture particularly appealing and damaging to adolescents (10:00): At a time in which youth are particularly vulnerable, leaders within the purity culture movement combine language of belonging and intense emotionality to create a culture of conformity. Linda describes, “When I left Evangelicalism, I had to contend with how damaging it was. I went in with a pretty good sense of myself and the world.” Sadly, the confines of purity culture had long-lasting, devastating consequences. The grief and anger that accompanied the writing process (21:30): Initially, Linda was hopeful when she met other women who could relate to her story. “But then, when the numbers started to add up, and it became clear that this was a lot of people who are hurting, that became something to grieve over time.” Additionally, the systemic coverup of overt and covert sexual abuse in churches and the ensuing silencing of survivors showed that the people who were supposed to protect a generation of women had failed to keep them safe. The confusion in finding your freedom (30:00): As a sexual health coach, Linda’s clients often want to dive right into “fixing” sexual problems. Linda wisely takes a step back and asks people to explore simpler decisions. After all, purity culture’s rigid binary system increases the anxiety around the decision-making process. Identifying what you want sexually is really challenging when you’re not even sure how to decide what you want for dinner. What it’s like to have relationships with people who are “worried” about you (42:00): When a person leaves Evangelicalism, those within the community tend to worry about your wellbeing, and even your salvation. Linda describes her experiences of navigating this, and Jeremiah and Julia introduce a potential support group: Moms of Millenials Straying from the Church. How motherhood impacts sexuality (58:00): Linda describes how she talks about sexuality with her 19-year-old stepdaughter differently than she experienced in the church, and how parenting a newborn can introduce a new type of intimacy within the couple and family relationships. Wherever you are in your journey toward sexual freedom, we hope that you can find comfort and healing in the power of telling and sharing stories. Let’s heal together!",
      "release": "2023-08-21T01:39:00Z",
      "duration": "01:05:46.9970000",
      "explicit": true,
      "spotifyId": "59UmFtujT3rBuAAowJ5Lmj",
      "appleId": 1000625074581,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/59UmFtujT3rBuAAowJ5Lmj",
        "apple": "https://podcasts.apple.com/podcast/summer-rewatch-series-how-purity-culture-is-uniquely/id1541092846?i=1000625074581"
      }
    },
    {
      "id": "f77bd191-9567-4ffe-b0b9-182d9fd703b8",
      "title": "Episode #36: Partnership Building: How Purity Culture Teaches You to Turn Away from Yourself, with Luke and Lauren from Flourish Therapy",
      "description": "We are continuing our summer series called Partnership Building, where we discuss how sexual health is relational health, and relational health is sexual health. We’re talking about seven principles of healthy relationships, according to relationship experts John and Julie Gottman. In the first four episodes of this series, we’ve discussed two foundations of healthy relationships: curiosity and admiration/appreciation. In the next two episodes, we’ll talk about the third principle of healthy relationships (according to the Gottman’s): turning toward each other. And we have amazing guests, Luke and Lauren Smallcomb from the brilliant podcast Filled to Flourish . Luke and Lauren are the founders of Flourish Therapy . They live in Chiang Mai, Thailand with their kids and 3 cuddly dogs. Luke and Lauren talk with us about: An Unquestioned System (6:00) The Unforgivable Sin (14:00) Eroticism (20:00) Lack of Freedom (25:00) Falling Back on Gender Roles (34:00) Good and Bad (49:00) Luke and Lauren will talk more with us next week about how to turn toward each other when your systems of origin begin to turn away from you. You won’t want to miss it!",
      "release": "2023-07-23T16:55:00Z",
      "duration": "00:48:13.5830000",
      "explicit": true,
      "spotifyId": "6xnPwZjpAEDCixUQ7EPERS",
      "appleId": 1000622057292,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6xnPwZjpAEDCixUQ7EPERS",
        "apple": "https://podcasts.apple.com/podcast/episode-36-partnership-building-how-purity-culture/id1541092846?i=1000622057292"
      }
    }
  ]
}