{
  "id": "7378d361-6b0e-4030-a093-ba66a79c777d",
  "name": "Sexy Unique Podcast",
  "spotifyId": "72KwUG8XvMncTWqM32NOHH",
  "appleId": 1199768588,
  "episodes": [
    {
      "id": "550094e2-9a74-4884-add2-8eca3dc6b18f",
      "title": "Salty Utah Queens - The People vs Meredith Marks, Esq. (RHOSLC S6E18 Reunion Pt. II)",
      "description": "Lara and Carey to the livestream for another rendition of SUP AFTER DARK, recapping part deux of the RHOSLC season 6 reunion (live with chat!) First, they discuss an update in Beckxit, the liberation of Amanda Batula, Club Chalamet’s new pivot, and a divisive episode of INDUSTRY. Back on the reunion, Angie’s scroll reveals Babygirl Lisa’s Reality Von Teased-esque alter ego, as Meredith continues to let her Plum Sister flail against the firing squad. Britani arrives to muted reaction, as Mary answers for the cult allegations and gives a sad but potentially hopeful update on Robert Jr’s struggle with addiction. Lisa lobs a vague accusation at Bronwyn over Todd’s Dubai activities; and its curtains for Heather and Meredith’s friendship. Then, Meredith — gearing up to address PlaneGate — begins her most lawyer ass chess play yet, diverting from her own allegedly feral behavior to weave a tale of Britani, bigoted nail techs and Yelp reviews. The countdown to the end continues… Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2026-01-23T11:00:00Z",
      "duration": "01:08:42.4360000",
      "explicit": false,
      "spotifyId": "2GyUhyaGerYXQcEdrWNglR",
      "appleId": 1000746328367,
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2GyUhyaGerYXQcEdrWNglR",
        "apple": "https://podcasts.apple.com/podcast/salty-utah-queens-the-people-vs-meredith-marks-esq/id1199768588?i=1000746328367"
      }
    },
    {
      "id": "0c876ce5-491b-4c9f-ba92-0c2831091e5c",
      "title": "Cult of Body \u0026 Soul (SoulCycle Documentary)",
      "description": "Introducing Cult of Body \u0026 Soul (new SoulCycle docu series). “Cult of Body \u0026 Soul” is a docu-podcast series that explores how SOULCYCLE transcended fitness as it captured the New York City zeitgeist with ritual, candlelight, and cult of personality. Featuring interviews with instructors, studio managers, front desk staff, and corporate insiders — this is the story behind the brand that became the SoHo House of fitness. Listen on Apple Podcasts, Spotify, or Watch on YouTube Apple Podcasts: https://podcasts.apple.com/us/podcast/cult-of-body-soul/id1814921742 Spotify: https://open.spotify.com/show/5Uuyrffmf9LkvCKKqcgKV3?si=oy175GMNTkyS7-krtl54FA Watch on YouTube: https://www.youtube.com/watch?v=Mr-xXrYQCHg\u0026t=553s Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-07-22T06:00:00Z",
      "duration": "00:52:01.3450000",
      "explicit": false,
      "spotifyId": "5ujfJMW6igMOAxHwKfG1HT",
      "appleId": 1000718419029,
      "subjects": [
        "SoulCycle"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ujfJMW6igMOAxHwKfG1HT",
        "apple": "https://podcasts.apple.com/podcast/cult-of-body-soul-soulcycle-documentary/id1199768588?i=1000718419029"
      }
    }
  ]
}