{
  "id": "16592b7f-f450-4f7f-972c-2bec08cbe258",
  "name": "Sexy Biz Babe",
  "spotifyId": "492zwHF3ezAzkucRgNtuVU",
  "appleId": 1450558365,
  "youTubeChannelId": "UChycib-zDvG0VyFPX0tFlaA",
  "episodes": [
    {
      "id": "8025cf2c-4efb-4d5b-9d36-35fd22866338",
      "title": "168: Leaving a Cult, Foot Fetishes, and Domination with Sophia Domina",
      "description": "Episode 168: Leaving a Cult, Foot Fetishes, and Domination with Dominatrix Sophia Domina This week on Sexy Biz Babe, we’re diving headfirst into the thrilling, seductive world of kink, BDSM, and domination with the captivating Sophia Domina, a premier Los Angeles Dominatrix who knows how to command attention and devotion. Sophia takes us on her provocative journey—from escaping a restrictive cult to embracing her power as a sensual, confident, and unapologetic Dominatrix. We explore: \u0026#x1f5a4; The seductive power of submission and why it’s more empowering than you think \u0026#x1f5a4; How Sophia creates intimate and sensual play parties that ignite desires \u0026#x1f5a4; Foot fetishes—what fuels the obsession and why it’s so intoxicating \u0026#x1f5a4; How she left a cult and became a dominatrix \u0026#x1f5a4; Secrets to becoming a Dominatrix or exploring your submissive side \u0026#x1f5a4; How kink can transform shame into pleasure and empowerment \u0026#x1f5a4; The sultry art of role play and the allure of power dynamics Plus, Sophia shares her shapeshifting experiences, tantalizing tales from her play parties, and how kink allows for ultimate freedom and self-expression. This episode is packed with jaw-dropping moments, sexy insights, and empowering truths about embracing your authentic self. Ready to explore the darker, more exciting side of desire? Don’t wait—tune in now! \u0026#x1f3a7; \u0026#x1f48b; Listen Now Get her book, Domme \u0026 Dommer - Learn more and book Sophia Domina - sophiadomina.com ——————— Website to work with me! Book a call or check out my Sexy Goddess Course! - Levelupwithtia.com Book a FREE 20 Call - https://levelupwithtia.as.me/sexybabechat",
      "release": "2025-01-22T02:09:00Z",
      "duration": "00:51:13.3420000",
      "explicit": true,
      "spotifyId": "4CZhRl1bcBlKMCjkFvkhp6",
      "appleId": 1000684932860,
      "youTubeId": "x11uMwwZScU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4CZhRl1bcBlKMCjkFvkhp6",
        "apple": "https://podcasts.apple.com/podcast/168-leaving-a-cult-foot-fetishes-and-domination/id1450558365?i=1000684932860",
        "youtube": "https://www.youtube.com/watch?v=x11uMwwZScU"
      }
    }
  ]
}