{
  "id": "2f57ed60-72fd-480d-8e39-27efbd3d22ac",
  "name": "Shameless Sex",
  "spotifyId": "6ZdhZeupiXtBZxCeI7jkEk",
  "appleId": 1242394336,
  "episodes": [
    {
      "id": "684c99af-8736-49c1-8bde-ecd01ca8ce5f",
      "title": "#470 Sex, Power, and the Downfall of a Wellness Cult",
      "description": "What happens when a sexual wellness practice turns into a cult, and how can we spot the warning signs? Join us on this episode of Shameless Sex as we explore the fascinating and disturbing world of OneTaste, a company that promised to unlock the secrets of orgasmic meditation but allegedly became a breeding ground for abuse and manipulation. Award-winning investigative journalist and author Ellen Huet takes us on a journey into the heart of OneTaste, sharing her insights from her book Empire of Orgasm: Sex, Power, and the Downfall of a Wellness Cult Here\u0027s what you\u0027ll learn from this episode: * The history of OneTaste and how it started as a seemingly innocuous wellness practice * The benefits and risks of orgasmic meditation (OM) and how to approach it with a critical eye * The warning signs of a cult and how to spot when a practice or community is becoming toxic * The latest updates on the criminal case against OneTaste\u0027s leaders and what it means for the future of the wellness industry * How to prioritize consent, safety, and critical thinking in your own sex life and wellness practices As a journalist who\u0027s covered some of the most complex and intriguing stories of our time, Ellen Huet brings her expertise and sharp analysis to the conversation. Whether you\u0027re a seasoned sex educator or just curious about the world of wellness, this episode is for you. Tune in to learn more about the intersection of sex, power, and exploitation, and how to create a safer, more consensual world for everyone. And stay until the end to find out how to get your hands on Ellen\u0027s book and support her work. So, can a wellness practice be both empowering and toxic? Listen in to find out. website: https://www.ellenhuet.com/ buy the book: https://www.amazon.com/Empire-Orgasm-Power-Downfall-Wellness/dp/0374604193 instagram: https://www.instagram.com/ehuet/ newsletter: https://ellenhuet.substack.com/ Come to our October 2026th retreats - one for women and one for couples! Learn more and reserve your spot here: ⁠https://www.shamelesssex.com/retreat⁠ Join us on the Killing Kittens cruise in the Mediterranean in June 2026: h⁠ttps://kkcruise.com Do you love us? Do you REALLY love us? Then order ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠our book⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ now! Go to ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠shamelesssex.com⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ to snag your copy Support Shameless Sex by sending us gifts via our ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠Amazon Wish List⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Other links: Get into turbo drive with Drive Boost from VB.Health, and use code SHAMELESS to get 10% off at vb.health Get Erika Lust\u0027s beautiful , connected, ethical, and SUPER HOT porn at ⁠⁠⁠⁠http://erikalust.com⁠⁠⁠⁠ , and use code SHAMELESS to get 45% off! Get an additional 15% off taking care of YOU in the New Year \u0026#43; any annual membership at ⁠⁠http://masterclass.com/shameless⁠⁠ Get 10% off \u0026#43; free shipping with code SHAMELESS on Uberlube AKA our favorite lubricant at ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠http://uberlube.com⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Get 10% off while learning the art of pleasure at ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠http://OMGyes.com/shameless⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Get 15% off all of your sex toys with code SHAMELESSSEX at ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠http://purepleasureshop.com⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠",
      "release": "2026-01-27T21:43:00Z",
      "duration": "01:22:25.4490000",
      "explicit": false,
      "spotifyId": "7lrdTIkNgNbHiHXd3uTCgF",
      "appleId": 1000746920494,
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7lrdTIkNgNbHiHXd3uTCgF",
        "apple": "https://podcasts.apple.com/podcast/470-sex-power-and-the-downfall-of-a-wellness-cult/id1242394336?i=1000746920494"
      }
    }
  ]
}