{
  "id": "071b9164-a25e-4dbf-a60f-6158c50d99ea",
  "name": "Shannon",
  "youTubeChannelId": "UCK-5jqgldgfPE_M97mIrNOQ",
  "episodes": [
    {
      "id": "22fb9b34-a17b-4832-a00f-4b5fc2e9b265",
      "title": "A Cult Survivor\u0026#39;s Recap | The Full Story in 20 Minutes | \u0026quot;My Youth Pastors Became Cult Leaders\u0026quot;",
      "description": "If you\u0027re new here, you may just be learning that I am an ex-cult member and current mental health Counselor. This is the summary of my story, one in which I joined a youth group, and was groomed by my youth pastors to join their \u0022dream ministry,\u0022 in which they made money under the guise of the \u0022troubled teen industry.\u0022 These youth pastors feigned good intentions, but were slowly entrapping us, taking us further and further from our families, and independence. Once they gained our trust, they started a \u0022ministry\u0022 called, \u0022Adullam Youth Outreach.\u0022 This is the entity under which more than 50 teens and young adults (and counting) would go on to suffer abuse over the course of 14 years. \n\nFor the last six months, I, along with others, have shared stories of abuse, and exposed the truth of OUR side of the story, which was suppressed for so long. I have a 12 part series on those stories under my playlist, \u0022How NOT to Join A Cult,\u0022 where you can learn many more details of those allegations, where they are now, etc., which I briefly touch on here. \n\nI forgot to add this in, but here is what I\u0027ve learned through this process;\n**Some people deal with difficult things by not thinking about them. It isn\u0027t my place to judge how anyone\u0027s path unfolds. But, I am ok with the fact that not everyone will understand mine. Even if I struggle with that sometimes.\n**Two conflicting experiences often can exist at the same time. But abuse IS abuse, and an abuser can still seem \u0022nice,\u0022 or have excuses made for them. That is often why abuse is not straightforward, easy, or something anyone wants to have to address.\n**I feel an endless amount of closure, and surrealness. I always felt their exposure would make me re-evaluate spirituality and coincidence, and leave me with a lot to ponder, and it has. I just didn\u0027t know I would be the one exposing after all these years. \n**I even have less symptoms of CPTSD than I used to.\n**The support has greatly outweighed those who deny, or undermine, our allegations.\n**I do believe that there needs to be major reform in Christianity, especially surrounding mental health, accountability, protection of children, and healthy versus unhealthy group dynamics. Otherwise, these types of abuse will continue to happen.\n\nIf you\u0027re returning for my re-cap, what questions do you still have? What perplexed you the most? What key factors do you feel need to be changed in order to prevent this in the future? WHAT in the WORLD should I talk about next???",
      "release": "2025-07-20T12:30:12Z",
      "duration": "00:21:06",
      "explicit": false,
      "youTubeId": "CEX1u7sn-Hk",
      "subjects": [
        "Troubled Teen Industry",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CEX1u7sn-Hk"
      }
    },
    {
      "id": "25571820-06dc-43d6-9a9c-f59a8506d318",
      "title": "Ep. 13 Kevin\u0026#39;s Story | \u0026quot;All I Did Was Manual Labor\u0026quot; | Surviving Mark \u0026amp; Leslie Dollar | Adullam Youth",
      "description": "Kevin and Shannon outline Kevin\u0027s story and explore more examples of neglect and child labor that were perpetrated by Mark and Leslie Dollar while they ran Adullam \u0022youth outreach\u0022 and took in teen and young adults. \n\nKevin discusses physical manual labor, being isolated and taken to another state to do remodels with unqualified or vetted adults, whom they were left with for two weeks. This occurred when Kevin was 15 and 16. \n\nMark and Leslie abused teens for around 10 years in Russellville, Arkansas before moving to Hamilton, Alabama in 2021, after our survivor Facebook group was formed. They continue to work with another alleged cult, The Ramp, ran by Karen Wheaton in Hamilton, Alabama.\n\n#podcast #theramp #theramphamilton #hamiltonalabama #alabama #arkansas #russellvillearkansas #cultsandextremebeliefs #cults #cultstories #cultsurvivor #share #mystory#vlog #speak #trauma #religioustrauma #christian #exchristain #ptsd #cptsd #spiritualtrauma #psychologicaltrauma #cultsurvivors #survivorstories #storytime",
      "release": "2025-06-29T13:00:47Z",
      "duration": "01:08:33",
      "explicit": false,
      "youTubeId": "MibA5wnIQAY",
      "subjects": [
        "The Ramp",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MibA5wnIQAY"
      }
    },
    {
      "id": "50e14130-9118-4d9d-9a2a-16c698d19f62",
      "title": "Ep. 12 Emily\u0026#39;s Story | Two Counselors Who Escaped the Same Cult | Abused at a Christian \u0026quot;Outreach\u0026quot;",
      "description": "Emily and Shannon are both mental health counselors who suffered abuse as teens at the hands of a small town cult called, \u0022Adullam Youth Outreach,\u0022 which was ran by cult leaders Mark and Leslie Dollar. \n\nEmily talks about many specific examples of inappropriate anger, mistreatment of teens, lying, and more, perpetrated by these cult leaders, who made the entire town believe they were a \u0022safe\u0022 place for teens and young adults. Mark and Leslie refuse to take any accountability despite about 45 survivors who have come together over their shared abuse. These two leaders still work in \u0022ministry\u0022 at another cult in Hamilton, Alabama called, \u0022The Ramp.\u0022 \n\nAs a reminder, Mark Dollar also had girls in the program rubbing his feet on a regular basis. This is not simply a \u0022one time offense\u0022 or a case of \u0022forgive and give grace.\u0022 Mark and Leslie abused, that means this was a pattern of inappropriate behavior which happened on a CONSISTENT basis. I am happy that our narrative is now also public knowledge. The voice of 45\u002B survivors, and numerous witnesses, bystanders who also suffered mistreatment from them, and families, is now also a part of their \u0022ministry\u0022 narrative.\n\nBased on their patterns, they are likely still perpetrating abuse. This is not simply a \u0022one time offense\u0022 or a case of \u0022forgive and give grace.\u0022 Mark and Leslie abused, that means this was a pattern of inappropriate behavior which happened on a CONSISTENT basis. I am happy that our narrative is now also public knowledge. The voice of 45\u002B survivors, and numerous witnesses, bystanders who also suffered mistreatment from them, and families, is now also a part of their \u0022ministry\u0022 narrative.\n\n#markandlesliedollar #theramp #hamiltonalabama #russellvillearkansas #cult #cults #cultsandextremebeliefs #religiousabuse #religioustrauma #PTSD #posttraumaticstress #ourstory #mystory #vlog #shannonshares",
      "release": "2025-06-15T22:33:09Z",
      "duration": "01:30:05",
      "explicit": false,
      "youTubeId": "1SBsber_rNY",
      "subjects": [
        "The Ramp"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1SBsber_rNY"
      }
    },
    {
      "id": "87ec3993-a597-4ed1-8f8e-a3db30397001",
      "title": "Ep. 11 Same Cult Different Year | Counselor\u0026#39;s Discuss the Cult They Were In | Shawn\u0026#39;s Story",
      "description": "Shawn met Mark and Leslie Dollar while in college, and sought a place where he could connect and help others. \n\nLike many who were entrapped by Mark and Leslie, it started off positive. But as time passed, it became clear that abuse was occurring. Shawn suffered verbal, emotional, and psychological abuse, and watched even more occur. Shawn is yet another member of this organization who was told to lie to the department of human services about rules that were not being followed. He saw students being degraded and made fun of. He saw contradictory behavior to what was being taught. He saw questionable treatment towards students and young adults.\n\nThough there is a growing number of survivors, and those being interviewed, many still support Mark and Leslie, and refuse to believe any of our allegations. \n\nMore interviews coming soon.\n\n#strange #true #truecrime #weird #cult #story #mystory #podcast #exposé #documentary",
      "release": "2025-05-11T16:19:14Z",
      "duration": "01:24:08",
      "explicit": false,
      "youTubeId": "6T2UN_b0uVo",
      "subjects": [
        "The Ramp"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6T2UN_b0uVo"
      }
    },
    {
      "id": "fb00bf40-791f-4334-ad99-7d2ba48d9a2c",
      "title": "Ep. 10 Makenzie\u0026#39;s Story | \u0026quot;They had someone watch me shower.\u0026quot; | Surviving Mark and Leslie Dollar",
      "description": "Makenzie was only twelve years old when she went to live with Mark and Leslie Dollar at Adullam Youth Outreach. \n\nLabeled a \u0022troubled child,\u0022 Makenzie found herself at a place much like a \u0022group home\u0022 for teens. Though it seemed \u0022perfect\u0022 at first, alleged abuse began to unfold and show itself as time went on. Makenzie was talked down to, taunted, publicly humiliated, blamed for things she didn\u0027t do, her weight monitored, and even placed in a facility on a false claim.\n\nMakenzie is doing well in life now, pursuing a nursing degree, and is engaged. It\u0027s important that we continue to share truth about \u0022troubled teen\u0022 industries, religious abuse, and mistreatment. These alleged abusers are still working with young people at The Ramp, in Hamilton Alabama, a place also accused of abuse.\n\n#podcast #religiousabuse #theramp #cultsandextremebeliefs #cultstory #hamiltonalabama #theramphamilton #christiannews #russellvillearkansas",
      "release": "2025-04-18T22:52:32Z",
      "duration": "01:11:16",
      "explicit": false,
      "youTubeId": "NtfjgcFVK9Q",
      "subjects": [
        "The Ramp",
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NtfjgcFVK9Q"
      }
    },
    {
      "id": "8c26b188-a8ae-4f62-9c8d-7cb653764a4a",
      "title": "Ep. 9 Money Over All | Mark \u0026amp; Leslie Dollar Kept a Predator on their Board for Years AFTER Assault",
      "description": "Updates on my investigation into my ex-cult leaders Mark and Leslie Dollar, who operated in Russellville, Arkansas from 2003-2021 under the guise of generous ministers to \u0022troubled teens,\u0022 and who are now operating in Hamilton, Alabama with The Ramp \u0022ministries.\u0022\n\nFor years, survivors have been denied the truth, that we suffered abuse of all kinds at the hands of Mark and Leslie, as well as other predators. Now we are coming together and coming forward with our allegations. There are around 47 survivors in our private group as well as many more coming forward all the time. This does not even include others impacted, such as parents and families.\n\nThe most disturbing allegations and findings yet seem to show that Mark and Leslie kept a predator on their board for years after learning of abuse, because he was a wealthy donor.\n\nConsistent patterns are arising as we cover their entire timeline operating their ex-cult/ministry \u0022Adullam Youth Outreach.\u0022 I will continue to share more survivor stories. Upcoming will also be discussions between myself and two other survivors who also went on to become mental health professionals. We will discuss common questions that survivors get, and problems faced.\n\nI will be taking a few weeks break, and updating with shorter videos if needed before releasing another interview.\n\n#theramp #theramphamilton #investigation #religiousabuse #religioustrauma #cultstory #cults #cultsandextremebeliefs #weirdandtrue #mentalhealthcounselor #podcast #isurvivied #survivor #conartist #ongoinginvestigation #ongoingstories #advocacy #russellvillearkansas #hamiltonalabama",
      "release": "2025-03-30T05:11:12Z",
      "duration": "00:30:16",
      "explicit": false,
      "youTubeId": "LPtUUs9_1Mg",
      "subjects": [
        "The Ramp",
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LPtUUs9_1Mg"
      }
    },
    {
      "id": "41c1203d-11f4-4b17-a451-ad0a77cd5a6b",
      "title": "Brook\u0026#39;s Story | Surviving Mark \u0026amp; Leslie Dollar | \u0026quot;Made me wash my stalker\u0026#39;s car for money.\u0026quot;",
      "description": "Brook was left with no other option than to rely on others after finding herself facing homelessness, before she had even graduated from high school, in 2013.\n\nShe met Mark and Leslie Dollar through a church, and ended up utilizing their seemingly kind offer to come and live on their property. Having no other option, she had to accept. Unfortunately, she did not find any more safety or refuge while living with them than she found in any other situation she had been in.\n\nSome may argue that Mark and Leslie helped these young people. I am not above stating that they did indeed offer shelter and precisely THREE basic meals a day (no snacks provided). However, this can be true, and the fact that they abused and exploited these young people, is also true at the same time. Abuse occurred. Full advantage was taken of these young people. \n\nBrook experienced this abuse, as well as various inappropriate moments, while living with Mark and Leslie Dollar from age 18-22. Not only did Mark have a disturbingly close attachment to her, even making fun of his own wife to her, but she also experienced scary behavior from other boys that seemed to be encouraged by Mark. Mark continued to text her years after she left.\n\nIn addition, everything she did was controlled. Leslie threatened to take away Brook’s vehicle, and also called her a slut and a whore, for not wanting to change jobs at their orders. Most adults were forced to work at the same location, just as the children were all forced to go to the same school, or later on, the same “post education,” The Ramp. Leslie constantly belittled Brook, as she has done others, usually calling her a slut and a whore.\n\nAs a reminder, Mark and Leslie Dollar abused dozens, if not a hundred, teens, before moving on to where they now work and associate, The Ramp, in Hamilton, Alabama, under Karen Wheaton. They are still using young people and teens for financial gain to this day.\n\nFind the podcast they were on that is suspicious as hell on Youtube \nWhat\u0027s Next God? Podcast\n@whatsnextgodpodcast7957\nEpisode 4\n\n#theramp #theramphamilton #hamiltonalabama #russellvillearkansas #arkansas #christiannews #cults #cultstory #mystory #speakup #religiousabuse #religioustrauma #cultsandextremebeliefs #strange #dark #cultmembers #sharingstories #cultstories #excultmember #podcast",
      "release": "2025-03-21T22:55:42Z",
      "duration": "00:53:31",
      "explicit": false,
      "youTubeId": "ndN7pEFCEhs",
      "subjects": [
        "The Ramp"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ndN7pEFCEhs"
      }
    },
    {
      "id": "1f68ef11-a521-4326-8f60-399c308beacc",
      "title": "Ep. 7 Dillon\u0026#39;s Story | Surviving Mark \u0026amp; Leslie Dollar | \u0026quot;We had a clear shower curtain.\u0026quot;",
      "description": "Dillon was subjected to horrible abuse before he came to live with Mark and Leslie Dollar at \u0022Adullam Youth Outreach\u0022 in 2009. \n\nMany children, whether they are in poverty, in unsafe homes, in foster care, or the like, suffer multiple traumas in their childhood. Unfortunately, some of those who pretend to offer safety and refuge are, in fact, abusive behind the scenes. \n\nMark and Leslie are yet another example of abuse in Dillon\u0027s childhood. Allowing untrained \u0022leaders\u0022 to decide punishment, humiliating him publicly for confessions made in private, and then further humiliating him by completely forgetting his birthday...meanwhile telling others how much of a \u0022family\u0022 they are offering these children.\n\nFortunately for Dillon, he was able to build a good life for himself and other children. He did not, \u0022come out with issues because he went in with issues...\u0022 He came out with additional trauma and abuse, and he then overcame it.\n\n#theramp #theramphamilton #hamiltonalabama #russellvillearkansas #arkansas #christiannews #cults #cultstory #mystory #speakup #religiousabuse #religioustrauma #cultsandextremebeliefs #strange #dark #cultmembers #sharingstories #cultstories #excultmember #podcast",
      "release": "2025-03-19T23:00:58Z",
      "duration": "00:46:44",
      "explicit": false,
      "youTubeId": "540KMymldkg",
      "subjects": [
        "The Ramp"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=540KMymldkg"
      }
    },
    {
      "id": "ed6cf051-defb-4f7c-afdd-4a0f32a456f1",
      "title": "Ep. 6 Shaina\u0026#39;s Story | Trapped by Mark \u0026amp; Leslie Dollar | \u0026quot;It sticks in your subconscious .\u0026quot;",
      "description": "Shaina knew Mark and Leslie Dollar from the time that she was only thirteen years old. \n\nShaina didn’t leave their home until she was twenty years old. She had to leave by basically taking her things and leaving without telling anyone. By that time, she had been so oppressed for so long, she didn’t know what to do with all of her freedom. She tried to mask her pain for years, until finally finding peace and happiness again through addressing her trauma. \n\nShaina shares her thoughts on gr**ming and ab*se, patterns she has seen, and concerns. When she was at the Dollar’s “youth outreach” she was constantly scrutinized for her body size, and was even pressured to spend money on a weight consultant and gym membership. Shain passed out from “fasting” several times, a noted solution for “the spirit of gluttony.”\n\nShaina is now reunited with her family, and her sister Sierrah, and is constantly working to build her happiness and help others do the same. Shaina is spiritual and mystic, you can learn more about her, and follow her own journey sharing videos (coming soon!) @PinkPanthressPrincess \n\nAs a reminder, Mark and Leslie Dollar abused dozens, if not a hundred, teens, before moving on to where they now work and associate, The Ramp, in Hamilton, Alabama, under Karen Wheaton. They are still using young people and teens for financial gain.\n\n#theramp #theramphamilton #hamiltonalabama #russellvillearkansas #arkansas #christiannews #cults #cultstory #mystory #speakup #religiousabuse #religioustrauma #cultsandextremebeliefs #strange #dark #cultmembers #sharingstories #cultstories #excultmember #podcast",
      "release": "2025-03-19T20:23:58Z",
      "duration": "00:48:07",
      "explicit": false,
      "youTubeId": "3pFSZIQUY5g",
      "subjects": [
        "The Ramp"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3pFSZIQUY5g"
      }
    },
    {
      "id": "bc6cba22-80e4-46b3-a524-7fd6aa0941c2",
      "title": "Ep. 5 Sierrah\u0026#39;s Story | Mistreatment By Mark and Leslie Dollar | A Lifetime of Luring",
      "description": "Sierrah knew Mark and Leslie Dollar from the time she was a child. \n\nHer older sister was a part of the original group that Mark and Leslie had gathered when they began the nightmare “Youth Outreach” that would go on to house, but also abuse, teens for the next twelve years.\n\nNaturally, after her sister finally escaped Mark and Leslie’s home, they naturally set their sights on Sierrah.\n\nSierrah was asked to “testify” about her life after surviving SA on stage to strangers when they traveled to minister. She was called homeless in newspapers. She was used for labor to build housing, remodel, minister, and much, much more. She was constantly monitored for what she wore, ate, and did. \n\nThis is Sierrah’s story.\n\nAs a reminder, Mark and Leslie Dollar abused dozens, if not a hundred, teens, before moving on to where they now work and associate, The Ramp, in Hamilton, Alabama, under Karen Wheaton. They are still using young people and teens for financial gain.\n\n#theramp  #theramphamilton  #hamiltonalabama   #russellvillearkansas   #arkansas  #christiannews  #cults  #cultstory  #mystory  #speakup  #religiousabuse  #religioustrauma  #cultsandextremebeliefs  #strange  #dark  #cultmembers  #sharingstories #cultstories  #excultmember #podcast",
      "release": "2025-03-18T19:19:38Z",
      "duration": "00:38:31",
      "explicit": false,
      "youTubeId": "LasWKIhoL_Q",
      "subjects": [
        "The Ramp"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LasWKIhoL_Q"
      }
    },
    {
      "id": "ee6100a7-2ef0-4a06-9ebc-b9e2743575d6",
      "title": "BIG REVEAL of My Ex-Cult Leaders | Abusers of Dozens | Now They’re at The Ramp in Hamilton, Alabama",
      "description": "In January of 2025 I began sharing my story of abuse that happened at the hands of ex-cult leaders and abusers of dozens others, who I will finally reveal in this video by name.\n\nI began sharing because there were a few whistle blowers speaking up about the same types of allegations against The Ramp, in Hamilton, Alabama, where my abusers currently are.\n\nMy abusers loved Ramp, and we went many times. We practically copied them. I knew they had moved to Hamilton around 2021, and were attending services there. But I had no Idea how deeply they were involved.\n\nThey are not only entangled in the real estate business run by The Ramp higher ups, but rumor has it they take in young people from The Ramp, and even potentially teach there.\n\nKnowing what I know, and also having experienced what I did, with dozens and dozens of others who personally suffered at the hands of these two abusers, I decided I must call them out by name and warn others.\n\n\n501c3 lookup I mentioned here:\nhttps://501c3lookup.org/adullam-youth-outreach_274551552\n\nFollow the journey with others against The Ramp here:\n@godcomplexshow \n\nCheck out this podcast where myself, and others have begun pairing with:\n@amongtheashespodcast \n\nSPOILER BELOW\nThe names of my abusers are Mark and Leslie Dollar, who ran Adullam Youth Outreach in Russellville, AR from 2007-2021. They are now living and working in Hamilton, and are still involved in youth ministry alongside The Ramp, who also has hundreds of allegations against them, in particular their leadership. Cases are being investigated by the FBI regarding many of these leaders. I have now submitted my own tip about my own abusers, and hope that naming them will help even one person avoid their trap.\n\n#theramp #theramphamilton #hamiltonalabama #karenweaton #cult #cults #cultstory #cultsandextremebeliefs #russellvillearkanas #counselor #therapist #cultsurvivor #news #religioustrauma #religiousabuse #abuseawareness",
      "release": "2025-03-12T00:26:06Z",
      "duration": "00:23:00",
      "explicit": false,
      "youTubeId": "Io6OOoigB3c",
      "subjects": [
        "The Ramp"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Io6OOoigB3c"
      }
    },
    {
      "id": "d62cc6dd-b30e-471c-88d4-c89890871b9f",
      "title": "I Am A Motherless Daughter | What It’s Like | A Brief Introduction | Ask Me Anything",
      "description": "In this video, I briefly talk about what it’s like growing up without a mother. My mom died from cancer when I was seven years old, and she was 40 years old. \n\nI have experienced a lot over the years, and had many repeated traumas. In my experience, there just isn’t as much information or discussion out there about absent, or bad, moms. \n\nI am curious to know about those of you who may relate, and what you may want to discuss and explore.\n\nI worked hard to make happiness for myself, and life got better. I am now a mental health counselor, and recently began speaking out about my cult experience and current allegations against those cults. I want to expand my channel more into mental health, and helping others.\n\nThank you for following in my new journey. \n\n\n#womenhelpingwomen #counselor #therapist #mentalhealth #moms #motherlessdaughter #trauma #complextrauma #ptsd #childhooodtrauma #mystory #podcast #vlog #myjourney #newcreator #grief #growing #healing #helping #happiness #askmeanything",
      "release": "2025-03-01T05:52:57Z",
      "duration": "00:17:55",
      "explicit": false,
      "youTubeId": "3tdQOxPwSe4",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3tdQOxPwSe4"
      }
    },
    {
      "id": "7ed79de1-18d7-418f-b060-85f932a47dc8",
      "title": "SHORT Joni Lamb of Daystar | Perry Stone | The Ramp \u0026amp; Karen Wheaton Ministries | Allegations of Ab#%",
      "release": "2025-02-22T00:08:29Z",
      "duration": "00:10:00",
      "explicit": false,
      "youTubeId": "5IV14DevXew",
      "subjects": [
        "The Ramp",
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5IV14DevXew"
      }
    },
    {
      "id": "32225563-6795-4a50-80ac-ab498f457ec8",
      "title": "Joni Lamb, Perry Stone, \u0026amp; Karen Wheaton of The Ramp | A Cult You May Not Have Heard Of | Allegations",
      "description": "In this video, Shannon, an ex-cult member and current mental health counselor, discusses an alleged cult that you may not have heard about yet. \n------------------------------------------------------------------------------------------------------------------\n\nIf you have been following the many allegations, you may know about Daystar, Joni Lamb, Perry Stone, or the number of other mega churches who are now being exposed, here’s another to add to that list.\n\nThe “church” and “ministry school” I discuss here is run by yet another from the “name it and claim it,” era, a religious singer and “minister” named Karen Wheaton who runs The Ramp in Hamilton, Alabama. Karen is close friends with Perry Stone (who has had allegations of SA, and been investigated for fraud) as well as Joni Lamb (the head of Daystar with allegations of not reporting SA of a child). \n\nAll of these “leaders” have a surprising amount of both money, and abuse allegations. They also have something else in common…….an inability to take accountability and repent.\n\n-----------------------------------------------------------------------------------------------------------------\nShannon was a member of a small trickle down cult that was based out of Russellville, AR from 2007-2021. This cult modeled themselves after The Ramp, which she attended several times, and followed their teachings, as her cult leaders idolized and wanted to be just like them. Her ex-cult leaders are now living in Hamilton, and are deeply involved in The Ramp.\n\n---------------------------------------------------------------------------------------------------------------------\n\nLearn more:\n\nPerry Stone and Joni Lamb by visiting @theunction220  on YouTube, @JulieRoysReport  follow our cult story exposing The Ramp @GodComplexshow  on youtube. Find some interviews with ex-cult members on youtube @amongtheashespodcast  season 4, episodes 33 and 34 with Cantley, Jordan, and soon, Stephen and myself.\n\nFind others stories on:\n\nStephen Womack, on Facebook, insta/tiktok @ thestephenwomack\nJoey Trieb Tiktok @ joeytrieb\nJennifer @ jennysjourney0\nChris @ epistemiccrisis\nOr on my own tiktok @ the_shannon_shares",
      "release": "2025-02-21T07:10:06Z",
      "duration": "00:29:08",
      "explicit": false,
      "youTubeId": "yXe9u3ubpDo",
      "subjects": [
        "The Ramp",
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yXe9u3ubpDo"
      }
    }
  ]
}