{
  "_ts": 0,
  "id": "426cab62-0356-4389-bd34-34806a2b8c37",
  "name": "Invading the Darkness: Stories from the Fight against Child Sex Trafficking",
  "spotifyId": "7Gk0sE0FnuTwEEoMjAdJlH",
  "appleId": 1573288148,
  "youTubeChannelId": "UCE2cLSFHAOOrBNt--H3v1PA",
  "episodes": [
    {
      "id": "438222a4-bb4f-4cfb-a91c-e2c7fe4b29b9",
      "title": "Navigating Legal Systems with Trauma-Informed Care: Lacey\u0027s Story S4E4",
      "description": "In this deeply moving episode of Invading the Darkness, Lacey shares her experience navigating the legal system as a trafficking survivor—and the lasting impact it had on her healing. From being retraumatized by the very systems meant to protect her, to becoming an advocate for change, Lacey sheds light on the urgent need for trauma-informed, survivor-centered support in every step of the justice process.\n\nHer story is a powerful reminder that justice must do more than prosecute—it must protect, restore, and truly see the person behind the case.\n\nYou can help make the legal system more survivor-centered and trauma informed! Take the Victim-Offender Intersectionality course and share it with criminal justice professionals you know. Visit https://store.sharedhope.org/product/voi/ to get started!\n\nDon’t forget to subscribe @sharedhopeinternational,\nfollow us on social media, and check out invadingthedarkness.org.\nVisit https://invadingthedarkness.org/\nLearn more about how you can take action https://sharedhope.org/justlikeme/ \nSUPPORT THE PODCAST https://sharedhope.org/appealforms/podcastsupport/ \n\nListen now to hear Lacey’s journey and the call to reform systems that were never built with survivors in mind.",
      "release": "2025-07-01T15:51:42Z",
      "duration": "00:32:16",
      "explicit": false,
      "spotifyId": "11q9uQVmB5cljh61HlwZCN",
      "appleId": 1000715310118,
      "youTubeId": "S-TnbPYRj_0",
      "subjects": [
        "Human Trafficking",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/11q9uQVmB5cljh61HlwZCN",
        "apple": "https://podcasts.apple.com/podcast/navigating-legal-systems-with-trauma-informed-care/id1573288148?i=1000715310118",
        "youtube": "https://www.youtube.com/watch?v=S-TnbPYRj_0"
      }
    }
  ]
}