{
  "_ts": 0,
  "id": "84f86602-6fff-4835-8462-f6db8c88644e",
  "name": "She Persisted: Your Teen Mental Health Resource",
  "spotifyId": "53JGhfgwgD92PjNTpBukzH",
  "appleId": 1463051730,
  "episodes": [
    {
      "id": "a03700bd-8420-448e-a9e5-a11f4a3a9e03",
      "title": "197. Life After The Program feat. Netflix Director \u0026 TTI Survivor Katherine Kubler",
      "description": "#197 Today\u0027s guest is Katherine Kubler— a Los Angeles-based writer, director, and editor. She recently directed and executive produced the Netflix original documentary series The Program: Cons, Cults, and Kidnapping, which exposes the corruption and abuse of the troubled teen industry. In this episode, we discuss: \u0026#43; Katherine\u0027s firsthand experience in the troubled teen industry (TTI) \u0026 how it led to her creating The Program \u0026#43; My experience in the TTI \u0026 what it\u0027s like to unpack it years later \u0026#43; How survivors can struggle to process their experiences in these programs \u0026#43; Red flags that a treatment program is part of the TTI \u0026#43; If there\u0027s any evidence that TTI programs do help teens \u0026 the overall lack of research out there on TTI programs \u0026#43; What Katherine has learned about the TTI since the documentary has come out \u0026#43; The fake high school diplomas that many programs give out \u0026#43; Advice for parents \u0026 teens considering residential treatment programs Katherine\u0027s Instagram: https://www.instagram.com/katherinekubler MENTIONED \u0026#43; The Program \u0026#43; Help At Any Cost \u0026#43; She Persisted Ep. 196 \u0026#43; Katherine\u0027s website SHOP GUEST RECOMMENDATIONS: https://amzn.to/3A69GOC STARBUCKS GIFTCARD GIVEAWAY: Want coffee on me?! Each month I\u0027ll be randomly choosing a winner to receive a Starbucks giftcard! To enter this giveaway, all you have to do is leave a review of the podcast on Spotify and/or Apple Podcasts and DM me on a screenshot of your review on Instagram . Win bonus entries by tagging the podcast on your Instagram story or TikTok! Good luck! LET\u0027S CONNECT \u0026#43; Instagram (@shepersistedpodcast) \u0026#43; Website (shepersistedpodcast.com) \u0026#43; YouTube (Sadie Sutton: She Persisted Podcast) \u0026#43; Twitter (@persistpodcast) \u0026#43; Facebook (@shepersistedpodcast) \u0026#43; TikTok (@shepersistedpodcast) \u0026#43; inquiries@shepersistedpodcast.com © 2020 She Persisted LLC. This podcast is copyrighted subject matter owned by She Persisted LLC and She Persisted LLC reserves all rights in and to the podcast. Any use without She Persisted LLC’s express prior written consent is prohibited.",
      "release": "2024-08-02T01:00:00Z",
      "duration": "00:39:24.3060000",
      "explicit": false,
      "spotifyId": "6Fo7BROXpv6lAoE8scDd8v",
      "appleId": 1000664084693,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Fo7BROXpv6lAoE8scDd8v",
        "apple": "https://podcasts.apple.com/podcast/life-after-the-program-feat-netflix-director-tti/id1463051730?i=1000664084693"
      }
    }
  ]
}