{
  "id": "7854917d-d543-42d7-bc52-9ad016dbb422",
  "name": "shellfein1",
  "youTubeChannelId": "UCDbf6SUwLWww0Q8Shh44gCw",
  "episodes": [
    {
      "id": "36fe2a41-d819-4dac-b0ee-510248625382",
      "title": "The Sullivanians: A group that went from Creativity to  Cult",
      "description": "Today\u0027s episode begins Thanksgiving Day three years after   I became entangled with the  Sullivanians a seemingly benign group  that   supported creativity but  would morph into the singular cult that remained undetected on Manhattan Upper West Side.\n\nAnnie was my roommate and friend,  but I on that day I began to realize her ardent belief in the Sullivanians as the vanguard party that would would soon shape  the world\u0027s future was all encompassing.   On that frigid day we found our way to a Greenwich Village cafe where Annie also openly discussed wrestling with the presence of her mother in the group.  I\u0027d often  thought of Maria as an older sister and  Annie as the younger but going forward,  her declaration left me in the murky waters of uncertainty.  \n\nThe episode doesn\u0027t end at the café, though. Learn why I was referred to a fourth therapist in three years and how I  wind up at Reliable Lists, Inc and how I\u0027m guided by  Stan Arnold, my new therapist, to become part of that office\u0027s union drive. \n\n The episode culminates in an emotionally charged farewell,, as Maria Alena departs for Sierra Leone.   This  episode carries you little further along my intertwining personal path, that  eventually carved a way for me out of the Sullivanian cult and towards a new beginning.\n\n\nThe complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts.\nThank you",
      "release": "2024-08-07T23:11:18Z",
      "duration": "00:19:18",
      "explicit": false,
      "youTubeId": "VRrBzJfNEy0",
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VRrBzJfNEy0"
      }
    },
    {
      "id": "97cfb22c-6e67-4cd9-98ba-c9c64a00e1c8",
      "title": "through a blue window: The Sullivanians (c)2019 S Feinerman(edited (2020)",
      "description": "In the 1970\u0027s, on Manhattan\u0027s upper west side, there existed a pyscho sexual therapy group known as the Sullivanian\u0027s  In later years characterized as a cult, the therapists advocated patients sleep with the therapists and cut off all contact with their families. Babies were forcibly taken from their mothers.  I was involved for five years. This is my story. (c) 2019 S. feinerman",
      "release": "2020-03-28T23:08:35Z",
      "duration": "01:29:45",
      "explicit": false,
      "youTubeId": "kHJ0LyhfH9o",
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kHJ0LyhfH9o"
      }
    }
  ]
}