{
  "_ts": 0,
  "id": "a4ac00e3-feab-4c1f-a809-39add7dca6f4",
  "name": "She\u0027s On The Money",
  "spotifyId": "3S1XdTyuhErGDAEgLEjl9c",
  "appleId": 1468033698,
  "episodes": [
    {
      "id": "7923f020-2219-427d-b6e6-7add782ea3ce",
      "title": "Kangen Water: Miracle Product or MLM Trap",
      "description": "What do a $6,500 water machine, misleading promises of financial freedom, and a whole lot of pseudoscience have in common? This week, Victoria dives deep into one of the most predatory MLM schemes yet—unpacking how high-pressure sales tactics and debt traps leave people drowning, not thriving. From bogus health claims to a compensation plan so confusing it’s practically a trap, this episode pulls back the curtain on how these schemes exploit vulnerability and sell dreams that often turn into financial nightmares. Whether you’ve been curious about the “magic” of Kangen water or just love a good MLM takedown, this episode will fire you up with facts, expose the truth, and empower you to spot the red flags before they reel you in. Don’t miss this deep dive into the dark side of \u0022too good to be true.\u0022 Tune in now! Acknowledgement of Country By Natarsha Bamblett aka Queen Acknowledgements. The advice shared on She\u0027s On The Money is general in nature and does not consider your individual circumstances. She\u0027s On The Money exists purely for educational purposes and should not be relied upon to make an investment or financial decision. If you do choose to buy a financial product, read the PDS, TMD and obtain appropriate financial advice tailored towards your needs. Victoria Devine and She\u0027s On The Money are authorised representatives of Money Sherpa PTY LTD ABN - 321649 27708, AFSL - 451289. See omnystudio.com/listener for privacy information.",
      "release": "2024-12-13T18:00:00Z",
      "duration": "00:28:46.8760000",
      "explicit": false,
      "spotifyId": "0pIThP2bP2PnUQNyPjkz0K",
      "appleId": 1000680293196,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0pIThP2bP2PnUQNyPjkz0K",
        "apple": "https://podcasts.apple.com/podcast/kangen-water-miracle-product-or-mlm-trap/id1468033698?i=1000680293196"
      }
    }
  ]
}