{
  "id": "4f665805-ba3b-4834-a437-c913d4c0a897",
  "name": "She\u0027s on the Money | Victoria Devine",
  "spotifyId": "3S1XdTyuhErGDAEgLEjl9c",
  "appleId": 1468033698,
  "youTubeChannelId": "UCq2kw2W9H4cDR7Gt4IIgORA",
  "episodes": [
    {
      "id": "22a0a9fc-9e0b-4dce-901c-2626c1128e60",
      "title": "Potential Cult Vibes: What to Do When a Loved One Is Caught Up in Something Sketchy",
      "description": "This week’s dilemma hits close to home. A listener’s brother has thrown himself into a self-development program called Landmark, spending thousands and encouraging the rest of the family to do the same—offering to even cover part of the cost. The catch? It’s giving off major MLM and cult-like vibes.\n\nOur listener’s sister has already signed up despite being unable to afford it, and the whole situation feels uncomfortable and coercive. In this episode, Victoria and Jess break down what Landmark actually is, why it’s so controversial, and how to navigate the complex emotional dynamics when family is involved.\n\nWe unpack:\n\nWhat Landmark and other LGATs (Large Group Awareness Trainings) actually are\n\nThe red flags to look out for in these programs\n\nWhether Landmark is technically an MLM—or something even more intense\n\nThe fine line between offering support and setting boundaries\n\nAdvice from the community, including past participants and those who’ve tried to intervene\n\nThis one’s a mix of real talk, financial caution, and emotional support—because sometimes protecting your money means protecting your peace, even from those closest to you.\n\nHave you ever felt pressured to join something that didn’t sit right with you? Let us know in the comments.\nhttps://www.shesonthemoney.com.au/links\n\nThe advice shared on She\u0027s On The Money is general in nature and does not consider your individual circumstances. She\u0027s On The Money exists purely for educational purposes and should not be relied upon to make an investment or financial decision. If you do choose to buy a financial product, read the PDS, TMD and obtain appropriate financial advice tailored towards your needs. Victoria Devine and She\u0027s On The Money are authorised representatives of Money Sherpa PTY LTD ABN - 321649 27708, AFL - 451289. See omnystudio.com/listener for privacy information.",
      "release": "2025-10-19T22:00:18Z",
      "duration": "00:14:51",
      "explicit": false,
      "youTubeId": "JVkazd5xgvw",
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings",
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JVkazd5xgvw"
      }
    }
  ]
}