{
  "_ts": 0,
  "id": "1c3f4830-3d2b-4bca-b757-8191c5153520",
  "name": "shiezoli",
  "youTubeChannelId": "UCzqpZ8XdZsLBGNYKbEZn-TA",
  "episodes": [
    {
      "id": "e1522a68-67e3-47b0-b62f-ce2313c0ebf6",
      "title": "Lev Tahor: Yoel Levy’s Dramatic Escape After 3 Suspicious Deaths | יואל לוי - לב טהור",
      "description": "Bonus 4 minutes: Watch Yoel Levy Expose the Lev Tahor Mastermind:  https://www.youtube.com/watch?v=YC0HDYr37II\n\nYou may have met Mendy Levy. Watch his brother, Yoel Levy, recount his dramatic escape after 3 suspicious deaths surprised the Lev Tahor cult.\n\nOver the course of one year, in a community of three hundred, three people died. Each death was easily avoidable and markedly suspicious, all were related to Yoel.\n\nA new 35 minute documentary shares the story of a 20 year old survivor of the Lev Tahor cult’s suspenseful escape from their Guatemalan compound.\n\nThe film, produced by several members of the Hasidic community who are trying to expose the abuse and help people trapped inside Lev Tahor, \nfollows Yoel Levy as he meets fellow cult survivor Rabbi Yaniv Assis for the first time in 10 years.\n\nRabbi Assis is a respected educator and Torah scholar who spent time with the cult when they were based in a small town in Quebec’s Laurentian Mountains. Yoel Levy was born and raised in Ste Agathe, Quebec to parents who were members of Lev Tahor, a semi-secluded Jewish cult with members of its leadership sitting in prison for kidnapping, child abuse, and child sexual exploitation. They both allowed a film crew to document their reunion, where they tried to piece together the twisted Lev Tahor puzzle.\n\nUsing newly leaked documents, photos, and videos, the documentary details the cult’s dramatic midnight flight from Quebec as authorities were closing in to rescue 14 children, and their travels to several locations, each more contained and enclosed than the previous, tightening the noose around members’ families with stricter rules and regiments.\n\nOnce inside their own remote Guatemalan compound, kept inside with barb wire and armed guards, three easily avoidable deaths took place, including the tragic passing of Yoel’s father.\n\nFacing constant abuse, punishment, and hunger, Yoel made a dramatic exit following an engagement to a girl he had never met. He was the first escapee from the compound. His brother Mendy followed, and numerous others have since managed to leave, some (like Yoel) dropping their Jewish observance, while others (like Yaniv) opting to grow in their religious beliefs.\n\nFollowing the incarceration of four members of Lev Tahor’s administration, including their current leader Nachman Helbrans, more members have left the cult. Providing them with food, travel expenses, and lodging in safe homes with religious families is a group of people who call themselves “Lev Tahor survivors.” They operate a website, https://www.levtahorsurvivors.com and a phone line those committed to escaping the cult can call (the number is \u002B1-725-226-3636).\n\n“The goal of this documentary is to create awareness about the destruction of lives taking place inside Lev Tahor,” said Meyer*, a member of Lev Tahor Survivors. “We need your help in spreading the video and the information contained inside it to anyone who may be supporting the cult. We are working on several more short documentaries and are preparing to release incriminating documents from a hard drive smuggled out of the compound. We will not stop until the abuse ends and members are in control of their own lives.”\n\nMore information, how you can help, and further films exposing the cult can be found at https://www.levtahorsurvivors.com\n\nThis video and the Mendy Levy video was produced by Faudak.\n\nThe archives and news footage courtesy of:\nCBC News: the Fifth Estate\n16x9\nCrime Beat TV\nSUN News\nCTV Windsor\nRonal Pichillá, Canal 8\nPOLO AMBROSIO GT\natreveteguatemala\nReed Trimmer\nGuy Shachar\nDiario de Centro América DCATV\nLos Silva Vlogs\nLevy family archives\n777 Daniel\n\n#LevTahor #YoelLevy #MendyLevy\n\nבסרט תיעודי חדש משתף, יואל לוי, בן ה-20, ניצול כת \u0027לב טהור\u0027, את רגעי הבריחה מהכת בגואטמלה. הסרט, שהופק על ידי אנשים טובים שמנסים לחשוף את ההתעללות ולסייע לאלה שנלכדו בתוך לב טהור להיחלץ מציפורניה. יואל לוי פוגש את חברו לשעבר מהכת, הרב יניב עסיס לראשונה מזה 10 שנים. שניהם אפשרו לצוותי צילום לתעד את המפגש המחודש שלהם, שם ניסו להבין את המוח המעוות של לב טהור. \n\nהרב עסיס הינו מחנך, איש תורני מוערך ששהה זמן רב עם הכת, כאשר זו חנתה בקוויבק בקנדה, אז תחת ניהולו של המנהיג והמייסד שלמה ארז הלברנץ ז\u0022ל. יואל לוי, נולד בקוויבק להורים שהיו חברים ב\u0027לב טהור\u0027, אביו כבר איננו בין החיים וטמון ביער שבו שוכנת הכת בגואטמלה. בגיל 16.5, אחרי שנות סבל וכאב, הוא אזר אומץ ותושיה והיה הנמלט הראשון מהמתחם. אחיו הצעיר מנדי הלך בעקבותיו, ורבים אחרים הצליחו מאז לערוק ולהתחיל חיים חדשים במקומות אחרים.",
      "release": "2022-05-09T18:03:17Z",
      "duration": "00:35:38",
      "explicit": false,
      "youTubeId": "fMLBIwiEv3I",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fMLBIwiEv3I"
      }
    },
    {
      "id": "216f95ef-93c2-4958-b6a6-400f2a8f4772",
      "title": "Cult Mastermind of Lev Tahor - Revealed",
      "description": "Uriel Goldman has raised millions of dollars to fund the Lev Tahor cult, which has continued to thrive following the death of its leader Shlomo Helbrans.\n\nIn this video, we expose his method of telling people what they want to hear, including numerous outright lies, via leaked audio and video.\n\nLev Tahor\u0027s structure has kept changing since the death of the cult\u0027s leader and the imprisonment of numerous administrative members. The one constant driver managing the fundraising, abuse, and media representation, is Uriel Goldman.\n\n#LevTahor #UrielGoldman #Cult",
      "release": "2022-04-21T03:48:45Z",
      "duration": "00:04:05",
      "explicit": false,
      "youTubeId": "qNSd3Jjj0uE",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qNSd3Jjj0uE"
      }
    },
    {
      "id": "174d6776-ca21-4f09-ad72-8ec7782c30da",
      "title": "I Grew up in the Extremist Jewish Cult of Lev Tahor | The Story of Mendy Levy",
      "description": "Must Watch Mendy\u0027s Brother Yoel Levy’s Dramatic Escape from Lev Tahor Cult\nhttps://youtu.be/fMLBIwiEv3I\n\n\nFollow Mendy on Instagram https://www.instagram.com/mendy.levy/\n\nAn 18-year-old who fled an extremist Jewish cult called Lev Tahor has recounted his horrific upbringing in the group - revealing that his father died after the leaders refused to let him see a doctor. \n\nMendy Levy, who was born in Canada in 2003, recalled being forced to swim in freezing cold, snake-filled water and eat hot pepper if he told a lie. When he was 15 years old, he was told he had to marry his 12 year old cousin, and that was the last straw for him. \n\nMendy said the group, which was founded by Shlomo Helbrans in the 1980s, was about \u0027total control.\u0027\n\n\u0027You can\u0027t do anything without permission. And if they ask you do something, you have to do it,\u0027 he recalled to Insider. \n\n\u0027They don\u0027t want people to see the outside world. No one is able to go anywhere without the leader\u0027s permission.\u0027  \n\nMendy recalled a time when a woman, who was allergic to sesame seeds, was told she had to eat them after to prove \u0027her faith\u0027 to the rabbi.\n\n\u0027Two hours later, she died,\u0027 he said. \u0027As she was suffering from the allergic reaction, they didn\u0027t let her call an ambulance. They don\u0027t allow doctors in Lev Tahor without the rabbi\u0027s permission. They told us to trust the rabbi.\u0027 \n\nSomething similar happened to his father - who developed an infection in 2016 and needed to go to the hospital. \n\n\u0027The rabbi said no,\u0027 Mendy explained. \u0027My father wasn\u0027t eating. He wasn\u0027t walking. He got sicker and sicker over a week and a half. And that\u0027s how it ended. He died on October 25, 2016.\u0027 \n\nDuring his days at Lev Tahor, Mendy said he woke up at 5:30 in the morning every day. After attending shul (synagogue), all the boys were forced to go into a freezing cold river that was filled with snakes for a ritual called mikvah.\n\nAfter that, it was back to shul for morning prayer, also called Shacharis - which would last three hours. Then, they were required to listen to the rabbi\u0027s speech, which sometimes lasted six or seven hours.\n\nThe rest of the day was spent either in shul or in class. But school was different than you\u0027d expect - there was no science, English or math class. Mendy explained that Shlomo had written all of his own books, and that he wanted everyone to know them by heart, so the kids were required to spend all of their free time studying them - and nothing else.\n\n\u0027We didn\u0027t even know what the word \u0022science\u0022 meant. We didn\u0027t speak a word of English. No reading,\u0027 he said. \n\n\u0027If you write \u0022ABC\u0022 in Lev Tahor, you get a punishment. We don\u0027t know what Trump is. We don\u0027t know what Biden is. I barely knew what the Holocaust was at the time. No iPhone, no computers, nothing like that unless you were one of the leaders.\u0027 \n\nWhen it came to eating, Mendy said he was forced to skip meals all the time. He also recalled being \u0027physically and mentally abused.\u0027\n\nHe said, \u0027There\u0027s the hitting, the beating up. If someone says a lie - even a small child - they would take hot pepper, the powder, and make them swallow it. After getting hit or beaten, you had to kiss the hand of whoever just hit you and thank him.\u0027\n\nHe also said that there was no affection allowed in Lev Tahor, which was made up of about 60 families in total. Parents weren\u0027t allowed to hug their kids - and if they were ever caught having a positive connection with them, the children would be \u0027taken away and placed in a different house.\u0027 \n\n\u0027Why? Because they want everyone to believe, listen, and trust only them. If a leader hits you, they don\u0027t want you to go to your mother crying. So they cut off the connection between you and your parents,\u0027 he added. \n\nMendy called Shlomo a \u0027genius\u0027 due to his ability to \u0027brainwash and control a few hundred people for years.\u0027\n\n\u0027People would believe him and follow his society,\u0027 Mendy explained. \u0027They made us look at the outside world like it was the worst and we\u0027re the only ones who are the best.\n\n\u0027They made us believe Lev Tahor is the only authentic form of Judaism in the world, and that it\u0027s better to die than to leave.\n\nThe 18-year-old said that after the group moved from Canada to Guatemala in 2014, he had a nervous breakdown.\n\n\u0027My brain just stopped working because of all this pain. I was thinking of committing suicide. I just exploded,\u0027 he recalled.\n\n\u0027I was in the hospital for about half a year. Until then, I didn\u0027t understand the things around me were wrong. Most kids wouldn\u0027t understand it was wrong. \n\n\u0027But in the hospital, I started thinking differently. I got a different perspective from everyone else in the cult. It was then I started thinking about how I could leave Lev Tahor.\u0027\n\nIn 2017, Shlomo drowned in a river during a trip to Mexico, and his son, Nachman Helbrans, took over. According to Mendy, life in the group got even worse after that. \n\nRead More at \nhttps://www.insider.com/lev-tahor-jewish-extremist-group-life-after-escape-2021-11",
      "release": "2021-11-23T23:31:34Z",
      "duration": "00:21:46",
      "explicit": false,
      "youTubeId": "m95BTIEpvOc",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=m95BTIEpvOc"
      }
    }
  ]
}