{
  "id": "278b03b8-ca04-482f-bba8-7784b83d3fea",
  "name": "Shifting Dimensions",
  "spotifyId": "4K6a6lWbjWyyvZVkSrZaQd",
  "appleId": 1726772371,
  "youTubeChannelId": "UCr0p1zDPaPLmnmI3AIWhDFQ",
  "episodes": [
    {
      "id": "6bc35f30-edf8-4a43-9890-dab5dde3ee9f",
      "title": "74. Satanic Cults, the Quest for Conscious Freedom, and the New Earth Ft. Isabella Young",
      "description": "In this episode of the Shifting Dimensions Podcast, Jummie speaks with Isabella Young, a survivor of a Messianic cult controlled by her ex-husband. Isabella, also known as Bella, shares her harrowing experiences of manipulation, loss, and ultimately breaking free. She delves into her journey of healing and spiritual awakening, shedding light on how she helps others escape similar situations. Bella discusses the realization that manipulation extends beyond cults to global systems of control and offers tools for healing and empowerment. The conversation touches on topics like self-love, nature connection, and tapping into higher consciousness. Additionally, Bella explores the notion that humanity is entangled in a larger system of global control and how we can reclaim our freedom. This episode includes sensitive content such as discussions on suicidal ideation, death, and sexual abuse, so listeners\u0027 discretion is advised. Where to find Bella: https://feelingbetternaturally.love/ Send us a text Love the show? Your support helps keep these conversations going. You can treat me to a coffee here: https://buymeacoffee.com/shiftingdimensions Subscribe to our YouTube channel: https://www.youtube.com/channel/UCr0p1zDPaPLmnmI3AIWhDFQ Follow us: TikTok - @shiftingdimensions444 Instagram - @shiftingdimensions_pod Disclaimer: The views, thoughts, and opinions expressed are the guest’s own and do not represent the views, thoughts, and opinions of Shifting Dimensions. The material and information presented here is for general information and entertainment purposes only.",
      "release": "2025-06-17T04:00:00Z",
      "duration": "01:16:42.3570000",
      "explicit": false,
      "spotifyId": "5AhNO3Ar6uwyaNwM53RcbQ",
      "appleId": 1000713194276,
      "youTubeId": "eVptkbBIZu8",
      "subjects": [
        "Louix Dor Dempriey"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5AhNO3Ar6uwyaNwM53RcbQ",
        "apple": "https://podcasts.apple.com/podcast/74-satanic-cults-the-quest-for-conscious-freedom-and/id1726772371?i=1000713194276",
        "youtube": "https://www.youtube.com/watch?v=eVptkbBIZu8"
      }
    }
  ]
}