{
  "_ts": 0,
  "id": "205d6421-6d79-48be-8b81-618b877c00a8",
  "name": "Shincheonji Exposed",
  "youTubeChannelId": "UCbY8y9NsCrcLjxtPuhBqL-A",
  "episodes": [
    {
      "id": "ac6ee872-d162-45b9-9259-3dad35a2246d",
      "title": "Self-proclaimed de facto Jesus: Our research in Korea (2/2)",
      "description": "As part of his research on Shincheonji, Simon traveled to Korea, where he was able to speak with both founding members and former high-ranking members of the religious movement. His investigations led to significant revelations, including explosive details about the private life of the leader Lee Man-Hee.\n\nIn this second conversation with Mike Malke, Bible teacher and apologist for the Syrian Orthodox Church, Simon provides deep insights into the hidden world of Shincheonji. The interview sheds light on the systematic control and surveillance of followers, as well as its destructive effects on those affected and their families.\n\nIn addition, the conversation reveals previously unknown aspects, in particular the shocking truth about the cult leader and his abuse of the cult for the sexual exploitation of young women.",
      "release": "2025-02-16T15:00:07Z",
      "duration": "01:08:33",
      "explicit": false,
      "youTubeId": "7ufM02tNJlo",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7ufM02tNJlo"
      }
    },
    {
      "id": "c183d05c-2f57-4a67-ab41-82e7f6208ac1",
      "title": "How a Korean sect is infiltrating our churches (1/2)",
      "description": "In this interview, Simon meets Mike Malke from the Syrian Orthodox Church. He is an exegete, apologist and the former chairman of the Central Council of Oriental Christians. We talk about the worrying activities of Shincheonji. The religious high-control group from Korea pursues a systematic strategy: it infiltrates Christian communities in order to lead their members into a personality cult around its founder Man-Hee Lee.",
      "release": "2025-02-06T20:05:06Z",
      "duration": "00:55:32",
      "explicit": false,
      "youTubeId": "DXA2MN4Oszw",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DXA2MN4Oszw"
      }
    },
    {
      "id": "233eea49-188d-415a-a424-ba0748c5bd96",
      "title": "In front of a camouflage church from Shincheonji",
      "description": "Shincheonji operates several camouflage churches (as of 2019: 300) in Korea, where unknowing visitors are deceived and lied to for months in order to lure them into the clutches of the religious high-control group.",
      "release": "2025-01-30T20:11:00Z",
      "duration": "00:10:14",
      "explicit": false,
      "youTubeId": "LUrtNJdHob0",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LUrtNJdHob0"
      }
    },
    {
      "id": "e439be4a-a285-417e-8734-7843631d88cf",
      "title": "Wir besuchen eine Tarnkirche von Shincheonji",
      "description": "Shincheonji betreibt mehrere Tarnkirchen (Stand 2019: 300) in Korea, in denen unwissende Besucher über Monate getäuscht und belogen werden, um sie auf diesem Weg in die Fänge der religiösen Hochkontrollgruppe zu lotsen.",
      "release": "2025-01-30T16:00:34Z",
      "duration": "00:10:15",
      "explicit": false,
      "youTubeId": "Rc7DR1-ekjo",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Rc7DR1-ekjo"
      }
    },
    {
      "id": "280c0e5d-0b85-4dd4-b9be-2988ac6595aa",
      "title": "How Shincheonji spiritualizes buildings and landscapes for its interpretation",
      "description": "After more than 30 years in Shincheonji, Gong, Hee-Suk is able to give us interesting insights into the beliefs of Shincheonji, which can seem very exotic to outsiders. These include the alleged deeper symbolic meanings of bridges and buildings in Korea. \n\n#shincheonji #leemanhee #seoul #seoulgrandpark",
      "release": "2024-10-22T07:33:10Z",
      "duration": "00:09:20",
      "explicit": false,
      "youTubeId": "4lN1g2sREt8",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4lN1g2sREt8"
      }
    },
    {
      "id": "24299ba3-0bf0-4dd0-94a2-16d9350548a3",
      "title": "Former Head Instructor speaks out: Changed doctrines and hidden secrets of SCJ 😳",
      "description": "Shin Hyun-Wook founded and led a (then) 2000-member Shincheonji Church in Seoul and was primarily responsible for the teachings of the cult for decades. In this interview, the former second-in-command of Lee Man-Hee uses SCJ teaching materials to prove that doctrines have been changed and reveals secrets of the cult that will shock many members.\n\nOur website with some contradictions, doctrinal changes and information about SCJ: www.shincheonji-geprueft.de\nIf the content raises questions and doubts in you and you would like to talk to us: info@apologetik-projekt.de\nIf you find this work important and would like to support it: https://apologetik-projekt.de/spenden\n\n#shincheonji",
      "release": "2024-10-07T21:48:12Z",
      "duration": "00:58:05",
      "explicit": false,
      "youTubeId": "P59L5_VjXms",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P59L5_VjXms"
      }
    },
    {
      "id": "0c76d70f-e6e3-4646-868a-1cc8c67f414c",
      "title": "High Rank Leader gives insights: FAKE 100k celebrations, embezzled funds, LMHs affairs etc.",
      "description": "Mr. Noh spent half his life in Shincheonji and only got out a few months before our interview. In 1995, he was appointed by Lee Man-Hee to the highest leadership echelon of the cult. His lies, altered teachings, growing sex scandals and the lavish spending of donations from SCJ members led him to leave.\n\nOur website with some contradictions, doctrinal changes and information about SCJ: www.shincheonji-geprueft.de\n\nIf the content raises questions and doubts in you and you would like to talk to us: info@apologetik-projekt.de\n\nIf you find this work important and would like to support it: https://apologetik-projekt.de/spenden\n\n0:00 Introduction and explanation of the SCJ structure\n05:10 What made him doubt LMH\n11:25 LMHs affair with Kim Nam-Hee\n23:30 Change in LMH\u0027s character\n30:00 Increasing pressure to go on a mission. Beginning of the secret mission\n34:42 Wrong numbers at 100,000th graduation ceremonies\n43:07 Non-Koreans before the foreign mission\n47:00 Which teachings have been changed?\n53:03 LMH\u0027s poor health\n57:20 Final words",
      "release": "2024-09-30T10:46:01Z",
      "duration": "01:01:12",
      "explicit": false,
      "youTubeId": "62wntQwULTE",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=62wntQwULTE"
      }
    },
    {
      "id": "be32e5ff-c25f-4063-8af4-052d4a1c8055",
      "title": "SCJ\u0027s lies about advice centers and “Babylonian” pastors – cult counselor comments",
      "description": "Chung-Il Kim was a member of Shincheonji for six years. During that time, he was ordered to use physical violence to terrorize cult counseling centers. Today, he is a pastor and the director of a large counseling center that has helped thousands of people leave Shincheonji.\nIn our conversation, he comments, among other things, on the lies that are spread in the cult about counseling centers and Pastors in order to prevent members from leaving. \nHe also discusses some of the brainwashing mechanisms used by SCJ and other cults, and gives practical tips to relatives and those willing to leave.",
      "release": "2024-09-28T09:31:11Z",
      "duration": "00:53:45",
      "explicit": false,
      "youTubeId": "2STSY7axWww",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2STSY7axWww"
      }
    }
  ]
}