{
  "id": "73660279-9496-4ced-80c3-fb4787536a67",
  "name": "Shoot The Hostage",
  "spotifyId": "3wL7Duh0FeWg9HicMygGBy",
  "appleId": 1685480550,
  "episodes": [
    {
      "id": "ee9d6659-7ae0-4b88-828a-6bf90c3b35c5",
      "title": "Battlefield Earth - S10 E76",
      "description": "Get ready folks, because this week on Shoot the Hostage, Dan and Sarah bravely (or stupidly) sat through the cinematic turd known as Battlefield Earth (2000). Yes, that\u0027s right, we\u0027re diving headfirst into what many consider to be not just a box office flop, but a serious contender for the title of worst movie of all time. If you\u0027ve ever wondered what happens when you try to adapt roughly 40% of a massive thousand-page book by the prolific (in quantity, at least) science fiction writer and Scientology founder, L. Ron Hubbard, into a single film, prepare to have your expectations crater like this movie\u0027s box office. We\u0027ll be dissecting this glorious mess starring John Travolta (who lobbied for years to get this passion project made). Prepare for questionable acting choices, baffling plot points and more screen wipes than you can shake a stick at. We’ll also try (and likely fail) to understand the vision of director Roger Christian, whose commentary track apparently suggests we just \u0022don\u0027t get it\u0022. If you\u0027re searching for a podcast that doesn\u0027t hold back on its criticism of films based on books that go spectacularly wrong, or if you\u0027re simply curious about one of the most notorious movie flops in cinematic history, you\u0027ve come to the right (or perhaps wrong) place. Trust us, after this episode, you might just consider Waterworld a masterpiece. In this episode you can expect: A scathing takedown of Battlefield Earth from start to finish. Our bewildered attempts to make sense of the plot and the alien motivations. Plenty of discussion about John Travolta\u0027s… unique? performance and his deep connection to the source material. Observations on just how a film with a reported budget of $70-80 million (or maybe $40 million) could look this visually unappealing. Digressions into the bizarre world of Scientology, the religion/cult behind the book. The definitive answer to whether this truly deserves its reputation as one of the worst films ever made. So, strap yourselves in for a bumpy ride as we try to navigate the post-apocalyptic wasteland that is Battlefield Earth! Season 10 runs until May 26th with 10 episodes this time Would you like to see the full lineup for season 10? The only place you can see it is on Patreon but you don\u0027t need to be a paying member. Sign up for a free membership and get access to the lineup. If you do have some loose change consider signing up as a paid member. Our £3 a month Patreon tier will grant you access to all of our end of season wrap shows for seasons 1-9 and a minimum of 2 reviews of brand new movies each month. Plus the back-catalogue of reviews from 2023 and 2024. Enjoy the show but can\u0027t support us financially? We get it. You could submit a review on the podcast player you\u0027re reading this on right now. Or if you listen on Spotify and you haven\u0027t given us a five-star rating yet, what are ye waiting for? It\u0027s easy. If you\u0027ve done some or all of that and still want to do more, we would love it if you tell a friend about the show. Or come find us on social media: Instagram | TikTok | Threads | YouTube",
      "release": "2025-04-14T06:00:00Z",
      "duration": "01:13:10.6620000",
      "explicit": true,
      "spotifyId": "0s2m9wKIBxf6YvDH2IQFX9",
      "appleId": 1000703423618,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0s2m9wKIBxf6YvDH2IQFX9",
        "apple": "https://podcasts.apple.com/podcast/battlefield-earth-s10-e76/id1685480550?i=1000703423618"
      }
    }
  ]
}