{
  "id": "d31b51a5-02f9-408c-b189-c45668ac08f8",
  "name": "Should I Delete That?",
  "spotifyId": "0EUpx2p1AU30RZmRqDGFem",
  "appleId": 1602088590,
  "episodes": [
    {
      "id": "f6704bd4-755a-4d6d-9752-30c75ad7236a",
      "title": "“You’re not even allowed to think for yourself” - surviving a ‘cult’… with Rachael Reign",
      "description": "Rachael Reign was 13 years old when she joined what she thought was a youth group… the next eight years of her life were dedicated to an organisation that she describes as a \u0027cult\u0027. We spoke to Rachael about her experience in the UCKG - a church with over 30 locations in the UK that has been accused by Rachael and other ex-members of dangerous, cult-like behaviour. The UCKG states that they are not a cult - and it is a registered charity in the UK. Rachael told us about her years within the church - the effect it has had on her life, the fear she felt around leaving and why she has created the UK’s only black-led specialist support group for fellow survivors. Follow @msrachaelreign on Instagram Follow @survivinguniversaluk on Instagram If you want to get in touch you can email us on shouldideletethatpod@gmail.com Follow us on Instagram: @shouldideletethat @em_clarkson @alexlight_ldn Should I Delete That is produced by Faye Lawrence Studio Manager: Elliott Mckay Video Editor: Celia Gomez Social Media Manager: Sarah English Music: Alex Andrew Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-11-03T00:05:00Z",
      "duration": "00:57:09.5110000",
      "explicit": true,
      "spotifyId": "16c1Bw7G40Y4MiihE4okRa",
      "appleId": 1000734934952,
      "subjects": [
        "Universal Church Of The Kingdom Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/16c1Bw7G40Y4MiihE4okRa",
        "apple": "https://podcasts.apple.com/podcast/youre-not-even-allowed-to-think-for-yourself-surviving/id1602088590?i=1000734934952"
      }
    }
  ]
}