{
  "id": "43e74868-2e76-4663-8850-515af7baea1e",
  "name": "Shrinking The World With Dr Raj Persaud",
  "youTubeChannelId": "UCkSLuOK5_VzMFpwUtLS5LSQ",
  "episodes": [
    {
      "id": "63f4fd58-8f41-4b67-869d-3e2aa99f653e",
      "title": "Prince Andrew’s Arrest: The Psychological Twist No One Is Talking About",
      "description": "Prince Andrew’s arrest has triggered intense public reaction — but what are the deeper psychological implications?\n\nDr Raj Persaud, consultant psychiatrist in private practice on Harley Street, examines the unexpected mental and strategic dimensions of this fast-moving story. From the King’s rapid distancing statement to the pressures of public disgrace, this discussion explores how psychological manipulation operates in real time — and how crisis can sometimes alter the balance of risk.\n\nRaj considers:\n\n• Whether arrest in the UK may reduce pressure to face more serious proceedings abroad\n• The psychological dangers of public humiliation\n• Why narcissism can increase — not decrease — the risk of self-harm under stress\n• How hopelessness, not scandal, is the key risk factor\n• What “reframing” means in psychotherapy during crisis\n• And what the choice of barrister might signal about behind-the-scenes support\n\nThis analysis does not speculate on guilt or innocence. All individuals are presumed innocent unless proven guilty in a court of law. The focus here is on psychological processes, coping mechanisms, and how extreme public scrutiny affects the human mind.\n\nShrinking the World brings clinical insight to major cultural and political events — helping viewers understand the psychology beneath the headlines.",
      "release": "2026-02-20T17:39:18Z",
      "duration": "00:18:52",
      "explicit": false,
      "youTubeId": "UmEvOqQGfAI",
      "subjects": [
        "Human Trafficking",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UmEvOqQGfAI"
      }
    },
    {
      "id": "e33b31b9-b554-4116-934d-ae8266008d12",
      "title": "Epstein, The Royals \u0026 Power: Dr Raj Persaud and Andrew Lownie Investigate",
      "description": "Newly released Epstein files have reignited questions about the Royal Family, Sarah Ferguson, Prince Andrew and a network of powerful figures whose relationships with Jeffrey Epstein are under renewed scrutiny.\n\nOn this episode of Shrinking The World, Dr Raj Persaud — consultant psychiatrist in Harley Street — is joined by historian and royal biographer Andrew Lownie to examine the latest revelations. They explore Fergie’s “marry me” emails, patterns of flattery and intimacy around Epstein, the psychology of entitlement and transactional power, and what these disclosures may mean for the monarchy.\n\nThe conversation looks at:\n\n• Why so many high-profile figures appeared unusually close to Epstein\n• The psychology of influence, status and boundary-crossing\n• Prince Andrew’s position within the wider royal institution\n• Whether the Epstein files represent a reputational tipping point\n• How elite networks operate behind closed doors\n\nThis discussion analyses publicly reported material and released documents. It does not make new allegations. All individuals mentioned are innocent unless proven otherwise.\n\n00:00 Introduction – New Epstein Files\n00:59 Fergie’s “Marry Me” Emails\n02:45 Flattery, Boundaries \u0026 Transactional Power\n06:13 Entitlement \u0026 Why Epstein Was So Attractive to Elites\n10:00 Peter Mandelson – Money \u0026 Photos\n14:17 Did Epstein Offer Sanctuary to the Powerful?\n17:20 Prince Andrew – New Images \u0026 Behaviour\n20:04 Elite Networks \u0026 What We Still Don’t Know\n23:24 Epstein’s Wealth – Myth vs Reality\n26:29 Could This Threaten the Royal Family?\n29:10 Protection, Accountability \u0026 Media Complicity\n33:32 The Royal Rota \u0026 Press Deference\n37:00 Epstein’s Death – Suicide or Murder? \n45:00 Final Reflections\n\nSubscribe to Shrinking The World for long-form conversations on psychology, power and public life.\n\n#EpsteinFiles #PrinceAndrew #SarahFerguson #RoyalFamily #DrRajPersaud #AndrewLownie #JeffreyEpstein",
      "release": "2026-02-17T20:06:24Z",
      "duration": "00:50:38",
      "explicit": false,
      "youTubeId": "K5FZdZqdsfs",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K5FZdZqdsfs"
      }
    },
    {
      "id": "c44d1d90-08b5-481a-9e4d-9c480a24b15d",
      "title": "Prince Andrew, Epstein, and the Psychology of Entitlement | A Psychiatrist with Andrew Lownie",
      "description": "In this episode of Shrinking the World, consultant psychiatrist Dr Raj Persaud is joined by historian and author Andrew Lownie to examine the psychology behind Jeffrey Epstein’s relationships with powerful and influential figures — including Prince Andrew.\n\nRather than focusing on allegations or sensational detail, this discussion explores the psychological patterns that appear repeatedly in Epstein’s social world: power, entitlement, flattery, transactional relationships, and the erosion of boundaries among elites who are used to access and privilege.\n\nTopics explored include:\n\nWhy influential people appeared unusually close to Epstein\n\nThe psychology of entitlement and transactional intimacy\n\nHow power can distort judgement and boundaries\n\nWhy generosity is sometimes not questioned by those at the top\n\nThe difference between personal responsibility and institutional culture\n\nThis conversation does not claim to establish private facts or legal conclusions. Instead, it applies psychiatric and psychological frameworks to publicly available material in order to better understand how such relationships can form — and why warning signs may be missed.\n\n⚠️ Disclaimer\n\nThis video is an educational discussion of psychology and public behaviour.\nIt does not diagnose individuals, allege criminal conduct, or claim knowledge of private events. All commentary is based on public reporting and presented for analytical and educational purposes only.",
      "release": "2026-02-06T19:43:53Z",
      "duration": "00:36:38",
      "explicit": false,
      "youTubeId": "IQQpgZB6f5E",
      "subjects": [
        "Human Trafficking",
        "Psychology",
        "_America",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IQQpgZB6f5E"
      }
    },
    {
      "id": "b47bf1fd-ac07-4fd3-bac4-57ed2e7fd22a",
      "title": "Shocking Allegations: Epstein, Andrew, Fergie, Philip \u0026 Trump | Andrew Lownie | Shrinking The World",
      "description": "📖 All the revelations in this video come from Andrew Lownie’s explosive new book Entitled: The Rise and Fall of the House of York.\n\nIn this full, uncut interview, historian Andrew Lownie joins psychiatrist Dr. Raj Persaud to uncover the hidden scandals, unanswered questions, and explosive allegations surrounding Jeffrey Epstein, Prince Andrew, and the Royal Family. From secret deals with the press to royal mistresses, from Sarah Ferguson’s controversies to explosive claims linking Donald Trump to Epstein’s circle, this is a deep dive into the secrets the Palace worked hard to keep from the public.\n\n🔎 Topics covered include:\n\nThe suspicious circumstances of Jeffrey Epstein’s prison “suicide.”\n\nPrince Andrew’s scandals: Epstein, Ghislaine Maxwell, money trails, and compromising connections.\n\nExplosive allegations linking Trump, Prince Andrew, and the Royal Family.\n\nAllegations of Prince Philip’s multiple affairs — and how the press was pressured into silence.\n\nMedia collusion, threats, and rewards used to protect the monarchy’s image.\n\nShocking claims of espionage, blackmail, and international intelligence involvement.\n\nSarah Ferguson’s celebrity obsessions, questionable business ventures, and blurred charity deals.\n\nHow privilege, secrecy, and the Queen’s protection shaped Andrew and Sarah’s downfall.\n\nFrom Epstein to Andrew, from Philip’s affairs to Sarah Ferguson’s scandals, this conversation exposes the hidden forces that have shaped — and shielded — the monarchy for decades.\n\n👉 Don’t forget to like, share, and subscribe for more deep dives into power, psychology, and corruption.\n\n⚠️ Disclaimer: This video discusses allegations and claims reported by Andrew Lownie in his book Entitled. These are not the views or opinions of Dr. Raj Persaud or this channel, and no direct accusations are being made without evidence.\n\n00:00 - Introduction: A Historian Investigating the Establishment\n03:35 - Tapping into Conspiracy: The Elite, Sex \u0026 Money\n07:33 - Who Was Jeffrey Epstein?\n09:04 - Epstein\u0027s Network: Blackmail \u0026 Supplying Women\n10:48 - The Trump \u0026 Epstein Connection\n12:45 - Ghislaine Maxwell\u0027s Role \u0026 Relationship with Andrew\n17:10 - Astonishing Allegation: Prince Philip\u0027s Affairs\n18:33 - Maxwell\u0027s \u0022Get Out of Jail Free Card\u0022\n21:51 - Was Epstein\u0027s Death a Suicide?\n26:03 - Why Did Epstein Fly Back to the US to be Arrested?\n30:45 - Media Collusion to Protect the Monarchy\n38:52 - Prince Andrew: Using Public Office to Line His Pockets\n44:56 - The Queen\u0027s Role in Protecting Andrew\n50:11 - Allegations of Andrew\u0027s Voracious Sexual Appetite\n57:27 - Sarah Ferguson: Exploiting the Royal Brand?\n01:04:57 - The Book\u0027s Darkest Allegation About the Queen\n01:07:38 - The Psychology of a Prince: Entitlement \u0026 Early Trauma\n01:15:57 - The Teddy Bear Obsession \u0026 Arrested Development\n01:18:14 - Is the Royal Family an Anachronism?\n01:23:48: - Draining the British \u0022Swamp\u0022",
      "release": "2025-09-11T13:01:11Z",
      "duration": "01:25:37",
      "explicit": false,
      "youTubeId": "XPCWki8R_7o",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XPCWki8R_7o"
      }
    }
  ]
}