{
  "_ts": 0,
  "id": "277a8d8a-6644-4960-af35-558729368f22",
  "name": "Shyam Meera Singh",
  "youTubeChannelId": "UCyAMoOTlfSGPxrtvh6M6wig",
  "episodes": [
    {
      "id": "dcb3eb59-28a8-4214-8253-e64a05347cd3",
      "title": "What\u0027s happening in Sadhguru (Jaggi Vasudev)\u0027s Ashram?",
      "description": "Sadhguru (born Jagadish \u0022Jaggi\u0022 Vasudev, 3 September 1957) is an Indian guru and founder of the Isha Foundation, based in Coimbatore, India. We have obtained the official emails of two close women associates of Sadhguru and his Isha Foundation—Maa Bharti Vardharaj and Maa Pradyuta. These emails reveal that crimes falling under the P.O.C.S.O Act have taken place at Sadhguru’s Isha School involving minor girls. I have investigated these emails and am presenting the truth before you.  \nWatch this video till the end, subscribe to the channel, like the video, and show your support.\n \nUpdate: I am not uploading the PDF file because I have already shown all the emails in the video. You can pause the video to read the emails. I could have uploaded the PDF, but it contains a lot of sensitive information that could be misused. So, I apologize for not uploading the full PDF. However, if any social activist wants to file a PIL based on these emails, I can provide the original emails. For this, you can send me an email. my email- Shyammeerasingh@gmail.com\n\n#shyammeerasingh #smshow #sadhguru \n---------\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCyAMoOTlfSGPxrtvh6M6wig/join\n---------\nConnect with me: \nFacebook Page: https://www.facebook.com/ShyamMeeraSingh2/\nTwitter: https://twitter.com/ShyamMeeraSingh\nInstagram: https://www.instagram.com/shyammeerasingh/",
      "release": "2025-02-24T16:29:14Z",
      "duration": "00:25:02",
      "explicit": false,
      "youTubeId": "RtiHOm5iwas",
      "subjects": [
        "Sadhguru"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RtiHOm5iwas"
      }
    }
  ]
}