{
  "id": "4ffa9b6e-b60f-4094-b6fe-102e7afda32a",
  "name": "Simplify",
  "spotifyId": "3WaRdhap1VUKXg4mUsRAtr",
  "appleId": 1255922966,
  "youTubeChannelId": "UCW9kDwARSTZtD2MirEEf-Nw",
  "episodes": [
    {
      "id": "55a6ba22-57e3-48cb-b992-ad076b04fe2a",
      "title": "Jane Borden: Cults and the American Monomyth",
      "description": "What if the United States wasn’t just influenced by cult-like thinking, but shaped by it from the very beginning? This week on Simplify, Caitlin Schiller speaks with journalist and author Jane Borden, whose book Cults Like Us: Why Doomsday Thinking Drives America explores how cult dynamics show up across U.S. history, politics, consumer culture, and self-help. From Puritan theology to superhero movies, Borden argues that cults aren’t fringe phenomena—they’re extreme versions of patterns baked so deep into American culture that they came over in the metaphorical sourdough starter brought over on the Mayflower. Together, Caitlin and Jane unpack why Americans are so drawn to comfort, certainty, and strongmen—and what it costs us when we give up agency in exchange for reassurance. You\u0027ll also hear about Caitlin\u0027s new least favorite figure in history (spoilers: it\u0027s the compunctionless Edward Bernays), dismantle the stories about power we\u0027re told, learn how the desire for comfort slowly erodes democracy, and where we should turn—if not to a singular outside \u0022hero\u0022—to save the day. Resources Cults Like Us by Jane Borden The American Monomyth by Robert Jewett \u0026 John Shelton Lawrence Caitlin\u0027s rec: T he Hardest Job in the World by John Dickerson Ben\u0027s rec: Bowling Alone by Robert D. Putnam Let us know what you thought of this episode! Find us on instagram at @simplifypod . Subscribe to our newsletter here—this week, a take on hero worship \u0026 Bad Bunny. You can email us at info@kollomedia.com This episode of Simplify was produced by Caitlin Schiller, Ben Schuman-Stoler, and Ody Constantinou in Berlin, Germany, for Kollo Media .",
      "release": "2026-02-09T06:00:00Z",
      "duration": "00:52:38.9570000",
      "explicit": true,
      "spotifyId": "213CpiwE6vsXnvNHVJMBL4",
      "appleId": 1000748859726,
      "youTubeId": "3Sk7zaPWjLc",
      "subjects": [
        "Cult Psychology",
        "Self-Help",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/213CpiwE6vsXnvNHVJMBL4",
        "apple": "https://podcasts.apple.com/podcast/jane-borden-cults-and-the-american-monomyth/id1255922966?i=1000748859726",
        "youtube": "https://www.youtube.com/watch?v=3Sk7zaPWjLc"
      }
    }
  ]
}