{
  "_ts": 0,
  "id": "c5de888f-729f-4b1f-b51f-325f977080f4",
  "name": "Sinar Daily",
  "youTubeChannelId": "UCmP1aTuhF-SwMKuFqV4hqTg",
  "episodes": [
    {
      "id": "d76e3482-fac3-4a58-9c3a-b000bd4897c3",
      "title": "Fireside Chat with Sabrina Bolivar, child cult victim",
      "description": "In this episode of Sinar Daily’s Fireside Chat series, we sit down with Sabrina Bolivar, the daughter of a former top executive of Al-Arqam, now known as GISB Holdings Sdn Bhd (GISBH). \n\nSabrina bravely shares her harrowing experiences growing up in a cult, detailing the emotional and psychological trauma she endured after escaping.\n\nRevealing how her grandmother fought fiercely for her, her three siblings, and her mother to break free from the cult\u0027s control, she talks about her the courageous act not only changed their lives but also allowed them to begin the long journey of healing and reclaiming their identities.\n\nSabrina highlights the dangers of cults, exposing the manipulative tactics used by organisations like GISB and aims to raise awareness about the hidden realities within such groups.\n\nJoin us as we explore vital topics such as cult recovery, the impact of emotional trauma, and the importance of family support in overcoming adversity. \n\nIf you\u0027re interested in understanding more about cults, psychological manipulation, and personal recovery stories, this episode is a must-watch. Don\u0027t forget to like, share, and subscribe to our channel for more enlightening discussions and personal journeys. Your support helps us amplify important voices and stories.\n\n#SabrinaBolivar #Bolivar #FiresideChat #Cults #GISB #GISBH #AlArqam #Deviant #DeviantTeachings #CultSurvivor #PsychologicalTrauma #Trauma #GlobalIkhwan #Resilience #HealingJourney #SinarDaily",
      "release": "2024-09-24T09:26:41Z",
      "duration": "00:22:12",
      "explicit": false,
      "youTubeId": "CU-nAQN8JQ4",
      "subjects": [
        "GISBH"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CU-nAQN8JQ4"
      }
    }
  ]
}