{
  "_ts": 0,
  "id": "7d945383-7818-44c7-a033-0b9041370ede",
  "name": "Sinisterhood",
  "spotifyId": "3k2zyY36LXPj0vBjuO0d6S",
  "appleId": 1391483100,
  "youTubeChannelId": "UCKGnI1fe7mLTvda2cdEdhYQ",
  "episodes": [
    {
      "id": "57092aeb-ad38-4071-b30a-a95459d004cc",
      "title": "Episode 298: 90s Heartthrobs or Cult Leaders? Part 2",
      "description": "His baby blues captivated the hearts of teen fans around the world in the 90s. Then this baby-faced hunk traded his acting gigs for a guitar. Now, he\u0027s a full-blown rockstar with an Oscar, known for his dedicated followers and allegations of favoring young fans. Is the band\u0027s refrain, Yes, this is a cult, merely an inside joke as they claim? Or is it something sinister hiding in plain sight? This week\u0027s episode is 90s Heartthrobs or Cult Leaders? Part 2: Jared Leto / My So-Called Cult Click here for this week\u0027s show notes. Click here to sign up for our Patreon and receive hundreds of hours of bonus content. Please click here to leave a review and tell us what you think of the show. Please consider supporting the companies that support us! -Head over to AthenaClub.com to get their already-affordable Razor Kit for 30% off with code CREEPY at checkout. - For a limited time, use my code CREEPY to get a free gift with your Journey Pack! Head to tryfum.com",
      "release": "2024-07-10T05:00:00Z",
      "duration": "01:52:34.7420000",
      "explicit": true,
      "spotifyId": "3WcTkWxs0iDh3nMdyce0CY",
      "appleId": 1000661739683,
      "youTubeId": "t5oEYtH2lAU",
      "subjects": [
        "Jared Leto",
        "Spiritual Narcissist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3WcTkWxs0iDh3nMdyce0CY",
        "apple": "https://podcasts.apple.com/podcast/episode-298-90s-heartthrobs-or-cult-leaders-part-2/id1391483100?i=1000661739683",
        "youtube": "https://www.youtube.com/watch?v=t5oEYtH2lAU"
      }
    },
    {
      "id": "ec7ef849-bddc-4889-bd70-e92ab3d7758e",
      "title": "Episode 297: 90s Heartthrobs or Cult Leaders? Part 1",
      "description": "Their faces graced the cover of teen magazines, and the dreamy roles they played in the 1990s and 2000s got the hearts of their young fans pumping. But now, not one but two former ‘90s heartthrobs have been accused of running cults. Are these men using their fame and influence for personal gain and gratification? Or has the media taken a few too many liberties with the truth? This week’s episode is: Andrew Keegan and Jared Leto - 90s Heartthrobs or Cult Leaders? Part 1 Click here for this week\u0027s show notes. Click here to sign up for our Patreon and receive hundreds of hours of bonus content. Please click here to leave a review and tell us what you think of the show. Please consider supporting the companies that support us! -Sinisterhood is sponsored by BetterHelp. Get 10% off your first month at betterhelp.com/SINISTER -Head to PAIRED.COM/CREEPY to get a 7-day free trial and 25% off if you sign up for a subscription. -Visit OliveandJune.com/CREEPY for 20% off your first Mani System! -Go to Quince.com/creepy for free shipping on your order and 365-day returns.",
      "release": "2024-07-03T05:00:00Z",
      "duration": "01:35:32.2050000",
      "explicit": true,
      "spotifyId": "19Tg34l9eKdXlzFuqYXaCr",
      "appleId": 1000660994525,
      "youTubeId": "5c_N8uVBIME",
      "subjects": [
        "Jared Leto",
        "Spiritual Narcissist",
        "Andrew Keegan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/19Tg34l9eKdXlzFuqYXaCr",
        "apple": "https://podcasts.apple.com/podcast/episode-297-90s-heartthrobs-or-cult-leaders-part-1/id1391483100?i=1000660994525",
        "youtube": "https://www.youtube.com/watch?v=5c_N8uVBIME"
      }
    },
    {
      "id": "5404f5c1-1ac4-48a2-b863-35a8ef207c5a",
      "title": "Episode 287: The Cult of Synanon - Part 3",
      "description": "By the late 1970s, the once heralded haven for those struggling with addiction had turned into a multi-million dollar corporation. With its sights set less on saving lives and more on cashing in and accumulating guns, the formerly sterling reputation of Synanon began to tarnish. As soon as they began acting on their violent threats, the thin thread holding the whole group together frayed into oblivion. But the group’s legacy is one thing its virulent dictator couldn’t control. This week’s episode is The Cult of Synanon - Part 3. Click here for this week\u0027s show notes. Click here to sign up for our Patreon and receive hundreds of hours of bonus content. Please click here to leave a review and tell us what you think of the show. Please consider supporting the companies that support us! -Cut your wireless bill to 15 bucks a month at MINTMOBILE.com/sinisterhood -Go to Zocdoc.com/CREEPY and download the Zocdoc app for FREE. Then find and book a top-rated doctor today",
      "release": "2024-04-24T05:00:00Z",
      "duration": "01:50:05.5830000",
      "explicit": true,
      "spotifyId": "2rZbN3idMKfknlV4BfZYzE",
      "appleId": 1000653416247,
      "youTubeId": "R-6LrA262qU",
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rZbN3idMKfknlV4BfZYzE",
        "apple": "https://podcasts.apple.com/podcast/episode-287-the-cult-of-synanon-part-3/id1391483100?i=1000653416247",
        "youtube": "https://www.youtube.com/watch?v=R-6LrA262qU"
      }
    },
    {
      "id": "1aa3a5b1-7137-4d3b-8214-c8d732d0ac4d",
      "title": "Episode 286: The Cult of Synanon - Part 2",
      "description": "Charles Dederich’s sanctuary for those fighting drug addiction had morphed in its first decade of existence. It expanded from helping those with substance issues to becoming a utopian community with a growing list of business assets and resources. With its leader running things like a corporation, Synanon residents soon found their every hour accounted for, but they had no idea what was in store for their own futures or the future of their children. This week’s episode is The Cult of Synanon - Part 2. Click here for this week\u0027s show notes. Click here to sign up for our Patreon and receive hundreds of hours of bonus content. Please click here to leave a review and tell us what you think of the show. Please consider supporting the companies that support us! -Sinisterhood is sponsored by BetterHelp. Get 10% off your first month at betterhelp.com/SINISTER",
      "release": "2024-04-17T05:00:00Z",
      "duration": "01:19:51.5100000",
      "explicit": true,
      "spotifyId": "5glb39XHUJ9MpcWLC3TLiu",
      "appleId": 1000652696273,
      "youTubeId": "5DNEcn_dFWk",
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5glb39XHUJ9MpcWLC3TLiu",
        "apple": "https://podcasts.apple.com/podcast/episode-286-the-cult-of-synanon-part-2/id1391483100?i=1000652696273",
        "youtube": "https://www.youtube.com/watch?v=5DNEcn_dFWk"
      }
    },
    {
      "id": "0c548a3a-d86f-460d-b17b-3a39ad912d80",
      "title": "Episode 285: The Cult of Synanon - Part 1",
      "description": "What began as a drug rehabilitation program soon transformed into a controversial community. Its unconventional methods gained nationwide coverage, attracting celebrity interest and political support. But over time, its boisterous leader shifted the group’s focus towards profit-making endeavors to fund his vision for a utopian society. This week’s episode is The Cult of Synanon - Part 1 Click here for this week\u0027s show notes. Click here to sign up for our Patreon and receive hundreds of hours of bonus content. Please click here to leave a review and tell us what you think of the show. Please consider supporting the companies that support us! -Go to PoshPeanut.com/CREEPY , and use promo code CREEPY for 20% off your first order -Visit OliveandJune.com/CREEPY for 20% off your first Mani System! -Head to TryFum.com and use code CREEPY to save 10% off when you get the Journey pack today",
      "release": "2024-04-10T05:00:00Z",
      "duration": "01:36:38.1640000",
      "explicit": true,
      "spotifyId": "2rTiXpV475yTZmhoY8MMb7",
      "appleId": 1000651982561,
      "youTubeId": "GIJFr4d-r0k",
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rTiXpV475yTZmhoY8MMb7",
        "apple": "https://podcasts.apple.com/podcast/episode-285-the-cult-of-synanon-part-1/id1391483100?i=1000651982561",
        "youtube": "https://www.youtube.com/watch?v=GIJFr4d-r0k"
      }
    }
  ]
}