{
  "_ts": 0,
  "id": "8ffe089b-4f6c-4558-872b-5268aabbe1c5",
  "name": "Sinners Among Saints",
  "spotifyId": "4lwZxwhRnEAr7z8j8Fetdv",
  "appleId": 1647812101,
  "episodes": [
    {
      "id": "44438e5c-720f-47a3-a250-7903f4d7cc18",
      "title": "Episode 81: The Kurim Case // Part 2",
      "description": "The Kurim case is a disturbing true crime story that occurred in 2007 in Kuřim, Czech Republic. It involved the horrific abuse of two boys, Jakub (7) and Ondrej (9) Mauerová, by their own mother, Klara Mauerová, her sister, Katerina Mauerová, and a woman named Barbora Skrlová. Further investigation revealed a dark and disturbing story. The boys were allegedly subjected to starvation, torture, and ritualistic abuse, all documented by the perpetrators themselves. These videos were intended to be used as evidence of alleged Satanic rituals by a nonexistent cult. The trial became a media sensation in the Czech Republic. All three women were found guilty. Klara Mauerová received the harshest sentence of 12 years imprisonment. Skrlová and Katerina Mauerová were sentenced to 8.5 years and 10 years respectively. The book used for research on this case: The Kurim Case by Ryan Green Thanks for all the support!! Please follow us on Facebook, Instagram, and Tik Tok, or email us, and remember we now have a Patreon!! patreon.com/sinnersamongsaintspodcast sinnersamongsaintspodcast@gmail.com Tik Tok @sinnersamongsaints",
      "release": "2024-04-26T06:00:00Z",
      "duration": "01:39:26.0070000",
      "explicit": false,
      "spotifyId": "77e1dLOoEAcpGVhwJdwbHv",
      "appleId": 1000653654154,
      "subjects": [
        "Kurim Case"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/77e1dLOoEAcpGVhwJdwbHv",
        "apple": "https://podcasts.apple.com/podcast/episode-81-the-kurim-case-part-2/id1647812101?i=1000653654154"
      }
    },
    {
      "id": "cc2c99c6-6d7e-4820-8103-33b984f2b409",
      "title": "Episode 80: The Kurim Case // Part 1",
      "description": "The Kurim case involves the abuse of two young boys in Kurim, Czech Republic. The Mauerova sisters were accused, along with several others of subjecting two young boys named Jakub and Ondrej to horrific treatment. The story takes a bizarre turn that will keep you guessing. All suspects faced charges of child abuse and were linked to a possible cult. Book used for research on this case: The Kurim Case by Ryan Green Thanks for all the support!! Please follow us on Facebook, Instagram, and Tik Tok, or email us, and remember we now have a Patreon!! patreon.com/sinnersamongsaintspodcast sinnersamongsaintspodcast@gmail.com Tik Tok @sinnersamongsaints",
      "release": "2024-04-19T06:00:00Z",
      "duration": "00:51:39.3760000",
      "explicit": false,
      "spotifyId": "1100uoA4u9WEK1WIUImxkf",
      "appleId": 1000652941551,
      "subjects": [
        "Kurim Case"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1100uoA4u9WEK1WIUImxkf",
        "apple": "https://podcasts.apple.com/podcast/episode-80-the-kurim-case-part-1/id1647812101?i=1000652941551"
      }
    }
  ]
}