{
  "_ts": 0,
  "id": "95ac9243-08b0-44e8-b2d9-947b5da14ded",
  "name": "Sinners and Secrets: Sins Of Scientology",
  "spotifyId": "14QmgCiZdw6yYGno96Qv8L",
  "appleId": 1591849562,
  "episodes": [
    {
      "id": "e0240673-1404-4036-9081-3809f5ab535c",
      "title": "Uncovering Narconon: The Controversial Rehab Linked to Scientology",
      "description": "Email us and tell us what topics you would like us to cover. What if the very rehabilitation program you trusted to save your loved one from addiction was built on controversial and unverified methods? This episode pulls back the curtain on Narconon, a drug treatment program with deep ties to Scientology, founded by William \u0022Bill\u0022 Benitez after being inspired by L. Ron Hubbard\u0027s teachings. We scrutinize the origins and operations of Narconon, questioning the safety and efficacy of its practices, which are often administered by staff members lacking proper medical training. Join us as we uncover the questionable practices and troubling statistics behind Narconon rehab centers. From inconsistent success rates to flawed studies and misleading data, we leave no stone unturned in exposing the program\u0027s dubious credibility. We investigate the failed attempt to establish a facility in Bouquet Canyon, California, and the regulatory violations that came to light, further casting doubt on the integrity of Narconon\u0027s operations. —————————————————————— Welcome to Sins of Scientology, where we delve into the intriguing world of true crime. Before we dive into each episode, we want to make it clear that while we dedicate extensive effort to research and verify the details presented, the nature of true crime storytelling means that some information may be subject to interpretation or may evolve over time. We strive to provide accurate and up-to-date information, drawing from reputable sources and expert insights. Disclaimer: The views and opinions expressed in this video are personal and do not necessarily reflect the official policy or position of any other agency, organization, employer, or company. Assumptions made in the analysis are not reflective of the position of any entity other than the creator(s). These views are subject to change, revision, and rethinking at any time and are not to be held in perpetuity. We make no representations as to the accuracy, completeness, correctness, suitability, or validity of any information on this video and will not be liable for any errors, omissions, or delays in this information or any losses injuries, or damages arising from its display or use. All information is provided on an as-is basis. It is the reader’s responsibility to verify their own facts ————————————————————— Resources https://www.cs.cmu.edu/ https://www.youtube.com/@XENUTV https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-09-26T20:00:00Z",
      "duration": "00:54:56.2080000",
      "explicit": false,
      "spotifyId": "0JJrHQlVEK4vS8Xcjm1XVl",
      "appleId": 1000670832916,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0JJrHQlVEK4vS8Xcjm1XVl",
        "apple": "https://podcasts.apple.com/podcast/uncovering-narconon-the-controversial-rehab-linked-to/id1591849562?i=1000670832916"
      }
    },
    {
      "id": "0dc5fb35-b24c-4cb8-bf61-bcee7f7ecd22",
      "title": "Scientology vs Psychiatry (A True Crime Podcast)",
      "description": "Email us and tell us what topics you would like us to cover. Lisa McPherson\u0027s tragic story is just the beginning. Explore the dark and deep-seated conflict between Scientology and psychiatry, a battle rooted in the very origins of Scientology itself. This episode promises to shed light on the controversial and often shocking tactics employed by the Church of Scientology to undermine psychiatric practices, featuring firsthand insights from Scientology leader David Miscavige and examining L. Ron Hubbard\u0027s foundational beliefs. Discover the relentless campaigns led by the Citizens Commission on Human Rights (CCHR) against psychiatric treatments like electroconvulsive therapy (ECT) and medication, and hear from those who have been personally affected by the Church\u0027s vehement opposition. We uncover the profound implications for mental health care, from class action lawsuits against pharmaceutical giants to the tragic outcomes for individuals who grew up in the Church. Listen to the heartbreaking cases of Jeremy Perkins and Kendra Wiseman, and understand the dangerous consequences of rejecting conventional psychiatric treatment. Finally, we bring to light the enduring impact of Scientology\u0027s war on psychiatry, from public perception battles to potential future conflicts. Our discussion covers improvements and advancements in modern psychiatry, the financial and emotional burdens faced by Scientology members, and the ethical debates that continue to rage on. Stay curious with us as we delve into the hidden truths and untold stories of Scientology, emphasizing the critical importance of evidence-based mental health care. ------------------------------------------------------------------------------------------------------------------- Welcome to Sins of Scientology, where we delve into the intriguing world of true crime. Before we dive into each episode, we want to make it clear that while we dedicate an extensive effort to research and verify the details presented, the nature of true crime storytelling means that some information may be subject to interpretation or may evolve over time. We strive to provide accurate and up-to-date information, drawing from reputable sources and expert insights. ------------------------------------------------------------------------------------------------------------------- Disclaimer: The views and opinions expressed in this video are personal and do not necessarily reflect the official policy or position of any other agency, organization, employer, or company. Assumptions made in the analysis are not reflective of the position of any entity other than the creator(s). These views are subject to change, revision, and rethinking at any time and are not to be held in perpetuity. We make no representations as to the accuracy, completeness, correctness, suitability, or validity of any information on this video and will not be liable for any errors, omissions, or delays in this information or any losses injuries, or damages arising from its display or use. All information is provided on an as-is basis. It is the reader’s responsibility to verify their own facts ————————————————————— Resources \u0022Going Clear: Scientology, Hollywood, and the Prison of Belief\u0022 by Lawrence Wright \u0022Inside Scientology: The Story of America\u0027s Most Secretive Religion\u0022 by Janet Reitman \u0022Bare-Faced Messiah: The True Story of L. Ron Hubbard\u0022 by Russell Miller Academic journals on psychiatry and critiques of Scientology\u0027s practices Documentaries and Films: \u0022Leah Remini: Scientology and the Aftermath\u0022 (A\u0026E Documentary Series) Websites and Online Resources: Citizens Commission on Human Rights (CCHR) website: www.cchr.org https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-08-05T16:00:00Z",
      "duration": "01:18:33.1160000",
      "explicit": false,
      "spotifyId": "0AIsBLr3bnsksetnsPS1HX",
      "appleId": 1000664388088,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0AIsBLr3bnsksetnsPS1HX",
        "apple": "https://podcasts.apple.com/podcast/scientology-vs-psychiatry-a-true-crime-podcast/id1591849562?i=1000664388088"
      }
    },
    {
      "id": "81a09705-aba5-4626-b9e8-0b86a42baa15",
      "title": "Spiraling Into Darkness: The Lisa McPherson Tragedy pt3 (A True Crime Podcast)",
      "description": "Email us and tell us what topics you would like us to cover. What really happened to Lisa McPherson inside the Fort Harrison Hotel? This episode of Sins of Scientology takes you through the tragic case of Lisa McPherson, a devoted Scientologist whose life came to a shocking end under mysterious and troubling circumstances. We provide a gripping narrative of Lisa\u0027s journey, from her vibrant life to her final, harrowing days, where church protocols were prioritized over her well-being. Listen as we recount the car accident that marked the beginning of her tragic end and the chaotic attempts by church members to manage her deteriorating condition. Hear firsthand accounts from those closest to Lisa during her final days. Rita Boykin and Barbro Wenberg\u0027s testimonies reveal the desperate and disorganized efforts to care for Lisa. Joan and Valerie Demange\u0027s observations paint a haunting picture of Lisa\u0027s mental and physical decline, exacerbated by inadequate medical oversight and a dangerous reliance on church methods. We also address the systemic failures and legal responsibilities associated with Lisa\u0027s care. Former senior executive Marty Rathburn and nurse Rick Pemberton offer critical insights into the flawed system that prioritized ideology over health and safety. This episode is a call for accountability and transparency, aiming to honor Lisa McPherson\u0027s memory by advocating for much-needed reforms. ————————————————————————— Welcome to Sins of Scientology, where we delve into the intriguing world of true crime. Before we dive into each episode, we want to make it clear that while we dedicate extensive effort to research and verify the details presented, the nature of true crime storytelling means that some information may be subject to interpretation or may evolve over time. We strive to provide accurate and up-to-date information, drawing from reputable sources and expert insights. However, we acknowledge that despite our best efforts, errors or discrepancies may occur. Additionally, the recounting of true crime stories may involve sensitive or disturbing content. Listener discretion is advised, and we encourage you to prioritize your well-being while engaging with our content. Should you notice any inaccuracies or have concerns about the content presented, please don\u0027t hesitate to reach out to us. Your feedback is invaluable as we continuously strive to improve our podcast. Thank you for joining us on this journey into the fascinating world of true crime. Disclaimer: The views and opinions expressed in this video are personal and do not necessarily reflect the official policy or position of any other agency, organization, employer, or company. Assumptions made in the analysis are not reflective of the position of any entity other than the creator(s). These views are subject to change, revision, and rethinking at any time and are not to be held in perpetuity. We make no representations as to the accuracy, completeness, correctness, suitability, or validity of any information on this video and will not be liable for any errors, omissions, or delays in this information or any losses injuries, or damages arising from its display or use. All information is provided on an as-is basis. It is the reader’s responsibility to verify their own facts ————————————————————————- Resources: TampaBay.com/St/Petersburg Times LisaFiles.com https://markrathbun.blog LisaMcPherson.org https://tonyortega.substack.com https://www.cs.cmu.edu https://www.youtube.com/@MarkBunker Inside Scientology by Janet Reitman Clearwater Police Dept. MEDICAL EXAMINER District SIX https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-07-24T04:00:00Z",
      "duration": "00:56:46.9150000",
      "explicit": false,
      "spotifyId": "6cFCBbbZeiRIcA1FDIVxIv",
      "appleId": 1000663158993,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cFCBbbZeiRIcA1FDIVxIv",
        "apple": "https://podcasts.apple.com/podcast/spiraling-into-darkness-the-lisa-mcpherson-tragedy/id1591849562?i=1000663158993"
      }
    },
    {
      "id": "1d3247aa-2ea1-47da-96bf-12e49eecbb0e",
      "title": "Spiraling into Darkness: The Lisa McPherson Tragedy pt2 (A True Crime Podcast)",
      "description": "Email us and tell us what topics you would like us to cover. What happens when medical advice collides with religious belief? This episode of \u0022Sins of Scientology\u0022 takes you to November 18, 1995, to unravel the unsettling events surrounding Lisa McPherson\u0027s car accident and her ensuing public breakdown. We reconstruct that chaotic day through the eyes of first responders and delve into Lisa\u0027s strange behavior, which ultimately led her to Morton Plant Hospital. The tension between Scientology\u0027s strict doctrines and the hospital\u0027s medical protocols forms the crux of this tragic narrative, highlighting the significant conflicts that arose during her ER visit. Join us as we explore the stories of key figures like Judy Goldsberry Weber, Annie Morrow, and Humberto Fontana, who were integral in managing Lisa\u0027s case under the Church\u0027s watchful eye. From opposing a psychiatric evaluation to ensuring her discharge, we shine a light on the lengths to which church members went to adhere to their faith while ostensibly supporting Lisa. This episode provides a riveting examination of the controversies and complexities that shadowed Lisa McPherson\u0027s last days, revealing the powerful influence of Scientology on her fate. ————————————————————————— Welcome to Sins of Scientology, where we delve into the intriguing world of true crime. Before we dive into each episode, we want to make it clear that while we dedicate extensive effort to research and verify the details presented, the nature of true crime storytelling means that some information may be subject to interpretation or may evolve over time. We strive to provide accurate and up-to-date information, drawing from reputable sources and expert insights. However, we acknowledge that despite our best efforts, errors or discrepancies may occur. Additionally, the recounting of true crime stories may involve sensitive or disturbing content. Listener discretion is advised, and we encourage you to prioritize your well-being while engaging with our content. Should you notice any inaccuracies or have concerns about the content presented, please don\u0027t hesitate to reach out to us. Your feedback is invaluable as we continuously strive to improve our podcast. Thank you for joining us on this journey into the fascinating world of true crime. Disclaimer: The views and opinions expressed in this video are personal and do not necessarily reflect the official policy or position of any other agency, organization, employer, or company. Assumptions made in the analysis are not reflective of the position of any entity other than the creator(s). These views are subject to change, revision, and rethinking at any time and are not to be held in perpetuity. We make no representations as to the accuracy, completeness, correctness, suitability, or validity of any information on this video and will not be liable for any errors, omissions, or delays in this information or any losses injuries, or damages arising from its display or use. All information is provided on an as-is basis. It is the reader’s responsibility to verify their own facts ————————————————————————- Resources: TampaBay.com/St/Petersburg Times LisaFiles.com https://markrathbun.blog LisaMcPherson.org https://tonyortega.substack.com https://www.cs.cmu.edu https://www.youtube.com/@MarkBunker Inside Scientology by Janet Reitman Clearwater Police Dept. MEDICAL EXAMINER District SIX https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-07-08T21:00:00Z",
      "duration": "00:42:55.5950000",
      "explicit": false,
      "spotifyId": "1SFY1yFCJn3UbGY5Kd9kLE",
      "appleId": 1000661584766,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1SFY1yFCJn3UbGY5Kd9kLE",
        "apple": "https://podcasts.apple.com/podcast/spiraling-into-darkness-the-lisa-mcpherson-tragedy/id1591849562?i=1000661584766"
      }
    },
    {
      "id": "15cbfba3-406f-4f07-835c-cf085f17bafc",
      "title": "Spiraling Into Darkness: The Lisa McPherson Tragedy (A True Crime Podcast)",
      "description": "Email us and tell us what topics you would like us to cover. What happens when a desperate search for salvation leads to a tragic end? Join us as we uncover the chilling and heartbreaking story of Lisa McPherson. This episode sheds light on her life, marked by a turbulent childhood with familial struggles, her brother’s suicide, and her immersion into the world of Scientology. Lisa’s journey from the suburbs of Dallas to the enigmatic Sea Org in Los Angeles unfolds a series of personal letters and stories that reveal her intense dedication to the church. Despite facing divorce, financial hardships, and emotional isolation, she clung to Scientology, hoping for the solace she desperately needed. Through a series of intimate recollections, we walk you through Lisa’s experiences, from her initial excitement and successes within Scientology to the haunting moments leading up to her tragic end. Her letters offer a glimpse into the intricate dynamics of her life, her relationships with fellow Scientologists, and the relentless pressures she faced. This episode delves into the unsettling mystery surrounding Lisa’s final days, marked by erratic behavior and a plea for help that went unanswered. The eerie obsession and ultimate tragedy of Lisa McPherson’s story will leave you haunted, questioning the price of unwavering faith in a controversial belief system. Welcome to Sins of Scientology, where we delve into the intriguing world of true crime. Before we dive into each episode, we want to make it clear that while we dedicate extensive effort to research and verify the details presented, the nature of true crime storytelling means that some information may be subject to interpretation or may evolve over time. We strive to provide accurate and up-to-date information, drawing from reputable sources and expert insights. However, we acknowledge that despite our best efforts, errors or discrepancies may occur. Additionally, the recounting of true crime stories may involve sensitive or disturbing content. Listener discretion is advised, and we encourage you to prioritize your well-being while engaging with our content. Should you notice any inaccuracies or have concerns about the content presented, please don\u0027t hesitate to reach out to us. Your feedback is invaluable as we continuously strive to improve our podcast. Thank you for joining us on this journey into the fascinating world of true crime. Disclaimer: The views and opinions expressed in this video are personal and do not necessarily reflect the official policy or position of any other agency, organization, employer, or company. Assumptions made in the analysis are not reflective of the position of any entity other than the creator(s). These views are subject to change, revision, and rethinking at any time and are not to be held in perpetuity. We make no representations as to the accuracy, completeness, correctness, suitability, or validity of any information on this video and will not be liable for any errors, omissions, or delays in this information or any losses injuries, or damages arising from its display or use. All information is provided on an as-is basis. It is the reader’s responsibility to verify their own facts. TampaBay.com/St/Petersburg Times LisaFiles.com https://markrathbun.blog LisaMcPherson.org https://tonyortega.substack.com https://www.cs.cmu.edu https://www.youtube.com/@M https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-06-27T06:00:00Z",
      "duration": "00:42:18.7360000",
      "explicit": false,
      "spotifyId": "06YJ391PECRm9YkU9mSqFe",
      "appleId": 1000660401772,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/06YJ391PECRm9YkU9mSqFe",
        "apple": "https://podcasts.apple.com/podcast/spiraling-into-darkness-the-lisa-mcpherson-tragedy/id1591849562?i=1000660401772"
      }
    },
    {
      "id": "ed4783ee-3155-4169-8e85-238646746e77",
      "title": "Heber Jentzsch: A Tale of Faith, Power, and Betrayal (A True Crime Podcast)",
      "description": "Email us and tell us what topics you would like us to cover. Can a man’s journey from devout Mormonism to the heights of Scientology leadership illuminate the darkest corners of this controversial organization? Join us on \u0022Sins of Scientology\u0022 as we unravel the life of Heber Jentzsch, whose transformation from a Salt Lake City native to a Master of Media manipulation within Scientology reveals a story of ambition, adaptation, and controversy. This episode takes you through Heber\u0027s early influences, his academic pursuits in communications, and his initial foray into journalism and the arts, all of which set the stage for his rise to become the Church of Scientology International president. We spotlight Heber\u0027s relentless efforts to promote Scientology globally and his crises, including the harrowing period spent in \u0022The Hole,\u0022 Scientology\u0027s notorious prison. Explore Heber’s complex family dynamics, particularly his marriage to influential Scientologist Yvonne Gillham, and the heartbreaking story of his son Alexander. Alexander\u0027s life within the Sea Organization, his rare interactions with his father, and his mysterious death at just 27 years old add a haunting layer to this narrative. This chapter offers an in-depth look at the human cost of Scientology\u0027s secretive and often ruthless practices. As we conclude our exploration of Heber Jentzsch’s life, we pivot to the broader issues raised by his story, setting the scene for our next gripping topic: the tragic case of Lisa McPherson. Her untimely death and the ensuing legal battles pull back the curtain on Scientology’s internal policies and the lengths it goes to protect its secrets. Please tune in to uncover the chilling realities of Scientology and the lives forever changed by its reach. https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-06-17T04:00:00Z",
      "duration": "00:50:48.3850000",
      "explicit": false,
      "spotifyId": "4SfQWNAqYGEqXpV5F7pTjA",
      "appleId": 1000659224153,
      "subjects": [
        "Scientology",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4SfQWNAqYGEqXpV5F7pTjA",
        "apple": "https://podcasts.apple.com/podcast/heber-jentzsch-a-tale-of-faith-power-and/id1591849562?i=1000659224153"
      }
    },
    {
      "id": "07d6d1ac-2d09-487b-8737-ae03c5fc2c16",
      "title": "The Harrowing Story of Paulette Cooper (A True Crime Podcast)",
      "description": "Email us and tell us what topics you would like us to cover. Paulette Cooper\u0027s relentless pursuit of the truth cost her dearly, but it also set a high bar for investigative journalism. We uncover the extraordinary lengths to which the Church of Scientology went to silence her, from fabricated bomb threats to smear campaigns and even attempts to frame her for crimes she didn\u0027t commit. Cooper\u0027s journey from a Holocaust survivor to a fearless journalist, who risked everything to expose alleged abuses within the Church, is nothing short of awe-inspiring. Join us as we navigate through Cooper\u0027s tumultuous legal battles and the intense harassment she faced from Scientology. This episode sheds light on the significant FBI raids that unveiled the Church’s illegal activities and Cooper\u0027s vital role in the investigation. We\u0027ll also discuss her enduring influence on online platforms and activism, particularly through groups like Anonymous. Paulette Cooper\u0027s story isn\u0027t just about her trials; it\u0027s about her incredible resilience and her lasting impact on the fight against controversial practices within Scientology. https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-06-10T04:00:00Z",
      "duration": "00:44:12.0550000",
      "explicit": false,
      "spotifyId": "5HSd6BPPCwEkiXrIhACoiM",
      "appleId": 1000658406818,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5HSd6BPPCwEkiXrIhACoiM",
        "apple": "https://podcasts.apple.com/podcast/the-harrowing-story-of-paulette-cooper-a-true-crime-podcast/id1591849562?i=1000658406818"
      }
    },
    {
      "id": "f9c4e63d-e057-4f80-88e4-479861c8f7ec",
      "title": "The Takeover of Clearwater pt2",
      "description": "Email us and tell us what topics you would like us to cover. What if your peaceful hometown suddenly became the target of a covert invasion? Today, we uncover the shocking story of Clearwater, Florida, in 1975, where the Church of Scientology, led by L. Ron Hubbard, stealthily executed a takeover. We expose the shadowy tactics used to acquire key properties under the guise of the United Churches of Florida and the sinister plots against critics and opponents. Mayor Gabe Cazares’s brave resistance and the infamous FBI raids in 1977 reveal a town under siege and a community\u0027s fight for truth. But that\u0027s just the beginning. We then delve into the meticulous planning behind Scientology\u0027s operations, spotlighting figures like Dick Weigand, Morris Moe Kahn, and Marty Rathbun. Discover the elaborate strategies of Operation Normandy and the deceptive property acquisitions that aimed to dominate Clearwater. Drawing from Pulitzer Prize-winning journalism, we unravel the relentless legal battles and the ultimate exposure of these covert activities. Join us for this intense narrative, as we bring to light how a tranquil town became the epicenter of a battle between secrecy and transparency. https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-06-05T05:00:00Z",
      "duration": "00:27:38.6940000",
      "explicit": false,
      "spotifyId": "2uSn0xlFFfJ6Tr1bDyZHl3",
      "appleId": 1000657893153,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2uSn0xlFFfJ6Tr1bDyZHl3",
        "apple": "https://podcasts.apple.com/podcast/the-takeover-of-clearwater-pt2/id1591849562?i=1000657893153"
      }
    },
    {
      "id": "69412891-7c8f-4bf3-950c-f312f142755f",
      "title": "The Takeover of Clearwater (PT1) (A True Crime Podcast)",
      "description": "Email us and tell us what topics you would like us to cover. How did Clearwater, Florida, transform from a serene coastal town into a stronghold for Scientology? Join hosts Sandi McKenna and Abraham Aurich as they pull back the curtain on the covert operations that redefined this sunny paradise in the latest episode of \u0022Sins of Scientology.\u0022 We expose the shadowy saga of property purchases under false names, the harassment of local politicians, and the silencing of residents. From the vibrant pre-Scientology days with its bustling downtown and iconic Fort Harrison Hotel, to the intense conflicts spearheaded by Mayor Gabe Cazares, we\u0027ll navigate through the labyrinth of manipulation, intimidation, and control that has shrouded Clearwater for decades. This episode also uncovers the legal battles and FBI raids that brought Scientology\u0027s covert activities to light, highlighting the courage of those who stood up against powerful forces. We discuss the church\u0027s aggressive tactics, from defamation lawsuits to a public relations campaign in the 1980s aimed at improving its tarnished image. Despite efforts to win over the community, skepticism persisted, leading to a significant federal investigation into alleged criminal activities. Tune in as we recount Clearwater\u0027s ongoing struggle for justice and accountability, revealing the secrets and stories that have shaped its legacy. #TrueCrime #fairgame #scientology #sptv #sosflashcards #LRonHubbard #seaorg #davidmiscavige #shellymiscavage #WheresShelly #xenu ------------------------------------------------------------------------------------------------------------- Welcome to Sins of Scientology, where we delve into the intriguing world of true crime. Before we dive into each episode, we want to make it clear that while we dedicate extensive effort to research and verify the details presented, the nature of true crime storytelling means that some information may be subject to interpretation or may evolve over time. We strive to provide accurate and up-to-date information, drawing from reputable sources and expert insights. However, we acknowledge that despite our best efforts, errors or discrepancies may occur. Additionally, the recounting of true crime stories may involve sensitive or disturbing content. Listener discretion is advised, and we encourage you to prioritize your well-being while engaging with our content. Should you notice any inaccuracies or have concerns about the content presented, please don\u0027t hesitate to reach out to us. Your feedback is invaluable as we continuously strive to improve our podcast. Thank you for joining us on this journey into the fascinating world of true crime. ------------------------------------------------------------------------------------------------------------- Disclaimer: The views and opinions expressed in this video are personal and do not necessarily reflect the official policy or position of any other agency, organization, employer, or company. Assumptions made in the analysis are not reflective of the position of any entity other than the creator(s). These views are subject to change, revision, and rethinking at any time and are not to be held in perpetuity. We make no representations as to the accuracy, completeness, correctness, suitability, or validity of any information on this video and will not be liable for any errors, omissions, or delays in this information or any losses injuries, or damages arising from its display or use. All information is provided on an as-is basis. It is the reader’s responsibility to verify their own facts. https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-05-28T23:00:00Z",
      "duration": "00:34:05.9100000",
      "explicit": false,
      "spotifyId": "7yjIYTht1SHTDN2GZOjBsj",
      "appleId": 1000657099257,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7yjIYTht1SHTDN2GZOjBsj",
        "apple": "https://podcasts.apple.com/podcast/the-takeover-of-clearwater-pt1-a-true-crime-podcast/id1591849562?i=1000657099257"
      }
    },
    {
      "id": "600a5efb-65cd-4edf-9443-b3a0e78cee44",
      "title": "Miscavige The Rise to Power (A True Crime Podcast)",
      "description": "Email us and tell us what topics you would like us to cover. Uncover the hidden truths of David Miscavige\u0027s ascent within the Church of Scientology, a tale that takes us from his battles with asthma to commanding an empire of devout followers. The journey begins with a young boy\u0027s family seeking healing and leads to his undeniable rise, where strict adherence and a penchant for leadership aboard the Apollo set the stage for his future reign. We peel away the layers of Miscavige\u0027s early influences and the disciplined environment that molded him into the Church\u0027s formidable leader, laying the groundwork for a narrative brimming with power plays and secrecy. The episode continues with the tumultuous aftermath of L. Ron Hubbard\u0027s passing, a pivotal moment that saw Miscavige emerge from the shadows to take control. With candid recollections from those who witnessed the seismic shifts, we explore how Miscavige outmaneuvered contenders, established his dominance, and instated policies that would forever alter the lives of Sea Org members. We examine the far-reaching consequences of his strict governance, from the prohibition of children to the strategies employed to ensure unwavering loyalty, as we seek to understand the man behind the veil of the church\u0027s top echelon. Finally, we delve into some of Scientology\u0027s most enigmatic and chilling narratives, including the haunting disappearance of Shelly Miscavige, the infamous Lisa McPherson case and Miscavige\u0027s secretive world, revealing a litany of legal confrontations and the grim personal costs of staunch allegiance. Join us as we navigate a labyrinth of intrigue and control at the heart of one of the most inscrutable religious organizations of our time, led by a man whose quest for power is as compelling as it is controversial. #TrueCrime #fairgame #scientology #sptv #sosflashcards #LRonHubbard #seaorg #davidmiscavige #shellymiscavage #WheresShelly #xenu ------------------------------------------------------------------------------------------------------------- Welcome to Sins of Scientology, where we delve into the intriguing world of true crime. Before we dive into each episode, we want to make it clear that while we dedicate extensive effort to research and verify the details presented, the nature of true crime storytelling means that some information may be subject to interpretation or may evolve over time. We strive to provide accurate and up-to-date information, drawing from reputable sources and expert insights. However, we acknowledge that despite our best efforts, errors or discrepancies may occur. Additionally, the recounting of true crime stories may involve sensitive or disturbing content. Listener discretion is advised, and we encourage you to prioritize your well-being while engaging with our content. Should you notice any inaccuracies or have concerns about the content presented, please don\u0027t hesitate to reach out to us. Your feedback is invaluable as we continuously strive to improve our podcast. Thank you for joining us on this journey into the fascinating world of true crime. ------------------------------------------------------------------------------------------------------------- Disclaimer: The views and opinions expressed in this video are personal and do not necessarily reflect the official policy or position of any other agency, organization, employer, or company. Assumptions made in the analysis are not reflective of the position of any entity other than the creator(s). These views are subject to change, revision, and rethinking at any time and are not to be held in perpetuity. We make no representations as to the accuracy, completeness, c https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-05-21T08:00:00Z",
      "duration": "00:44:30.8370000",
      "explicit": false,
      "spotifyId": "3OMJZzpPG97KDwqlnJfByh",
      "appleId": 1000656258571,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3OMJZzpPG97KDwqlnJfByh",
        "apple": "https://podcasts.apple.com/podcast/miscavige-the-rise-to-power-a-true-crime-podcast/id1591849562?i=1000656258571"
      }
    },
    {
      "id": "0ac580f6-2433-4db2-8893-e5f0e39305c3",
      "title": "The Enigmatic L. Ron Hubbard (A True Crime Podcast)",
      "description": "Email us and tell us what topics you would like us to cover. In this gripping episode of \u0022Unforgettable Conversations, The Sins of Scientology,\u0022 we delve into the tumultuous life of L. Ron Hubbard, the founder of Scientology. From his early ambitions as a prolific writer to the controversial creation of Dianetics and Scientology, Hubbard\u0027s life was nothing short of dramatic. We explore his multiple marriages, marked by strife and scandal, and his complex relationships with his children. As we peel back the layers of his later years, spent in reclusive obscurity, we uncover the mysterious circumstances surrounding his final days. Join us as we seek to understand the man behind a legacy that continues to evoke fascination and fervor across the globe. #TrueCrime #fairgame #scientology #sptv #sosflashcards #LRonHubbard #seaorg #davidmiscavige #shellymiscavage #WheresShelly #xenu ------------------------------------------------------------------------------------------------------------- Welcome to Sins of Scientology, where we delve into the intriguing world of true crime. Before we dive into each episode, we want to make it clear that while we dedicate extensive effort to research and verify the details presented, the nature of true crime storytelling means that some information may be subject to interpretation or may evolve over time. We strive to provide accurate and up-to-date information, drawing from reputable sources and expert insights. However, we acknowledge that despite our best efforts, errors or discrepancies may occur. Additionally, the recounting of true crime stories may involve sensitive or disturbing content. Listener discretion is advised, and we encourage you to prioritize your well-being while engaging with our content. Should you notice any inaccuracies or have concerns about the content presented, please don\u0027t hesitate to reach out to us. Your feedback is invaluable as we continuously strive to improve our podcast. Thank you for joining us on this journey into the fascinating world of true crime. ------------------------------------------------------------------------------------------------------------- Disclaimer: The views and opinions expressed in this video are personal and do not necessarily reflect the official policy or position of any other agency, organization, employer, or company. Assumptions made in the analysis are not reflective of the position of any entity other than the creator(s). These views are subject to change, revision, and rethinking at any time and are not to be held in perpetuity. We make no representations as to the accuracy, completeness, correctness, suitability, or validity of any information on this video and will not be liable for any errors, omissions, or delays in this information or any losses injuries, or damages arising from its display or use. All information is provided on an as-is basis. It is the reader’s responsibility to verify their own facts. https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-05-11T18:00:00Z",
      "duration": "00:43:58.1320000",
      "explicit": false,
      "spotifyId": "120zeNoLLRCqCgPQKD3CqA",
      "appleId": 1000655276819,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/120zeNoLLRCqCgPQKD3CqA",
        "apple": "https://podcasts.apple.com/podcast/the-enigmatic-l-ron-hubbard-a-true-crime-podcast/id1591849562?i=1000655276819"
      }
    },
    {
      "id": "98e7b9b6-fe88-42f9-8877-b5d4180e8f92",
      "title": "Welcome to Sins of Scientology",
      "description": "Email us and tell us what topics you would like us to cover. Deciphering Scientology One Term at a Time! https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2024-03-10T13:00:00Z",
      "duration": "00:00:19.5270000",
      "explicit": false,
      "spotifyId": "0TdxCCPucjJumkBAPU682p",
      "appleId": 1000648653105,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0TdxCCPucjJumkBAPU682p",
        "apple": "https://podcasts.apple.com/podcast/welcome-to-sins-of-scientology/id1591849562?i=1000648653105"
      }
    },
    {
      "id": "cf67b753-ceb9-40af-a8c5-f5b4a84479aa",
      "title": "The High and Lows of Moving to Another Country #Portugal",
      "description": "Email us and tell us what topics you would like us to cover. Have you ever thought of packing up everything and moving to another country? My guests today did just that. they did it, how they did it. Sue Reddel and Diana Laskaris of Food Travelist share tips, tricks and all the ups and down of what you need to know if you want to move to another country. We take a deep dive into why they decided on Portugal and what life has been like since moving abroad. https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-06-20T04:00:00Z",
      "duration": "00:40:05.4010000",
      "explicit": false,
      "spotifyId": "5ZsP8Q4QW3YAWqIAcnpYgA",
      "appleId": 1000567085203,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZsP8Q4QW3YAWqIAcnpYgA",
        "apple": "https://podcasts.apple.com/podcast/the-high-and-lows-of-moving-to-another-country-portugal/id1591849562?i=1000567085203"
      }
    },
    {
      "id": "cb8d8581-18bb-4aff-aad2-2d91e82e791b",
      "title": "Out and About Dad: A Gay Dad\u0027s Story #PrideMonth",
      "description": "Email us and tell us what topics you would like us to cover. It was the mid nineties and Jim Joseph upended his suburban life. In the blink of an eye he was married, had two children under three, got divorced, realized he was gay and had to make an entire new life. This the his story of how he navigated his new life as a gay dad, from balancing a high profile career to finding peace and acceptance ( and a few challenges) along the way. Out and About Dad Jim on Instagram Jim On Twitter https://www.jimjoseph.com/ https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-06-05T18:00:00Z",
      "duration": "00:23:23.2510000",
      "explicit": false,
      "spotifyId": "1J5Kh463CJNloIjQjkr5mu",
      "appleId": 1000565293498,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1J5Kh463CJNloIjQjkr5mu",
        "apple": "https://podcasts.apple.com/podcast/out-and-about-dad-a-gay-dads-story-pridemonth/id1591849562?i=1000565293498"
      }
    },
    {
      "id": "1a764c67-357f-4e5e-afd8-a5c1227c6c29",
      "title": "Depp V Heard: What Their Astrological Charts Tell Us",
      "description": "Email us and tell us what topics you would like us to cover. I\u0027ve been fascinated by the Johnny Depp and Amber Heard trial. I\u0027ve been watching live feeds every day on Emily D Baker\u0027s YouTube channel . She\u0027s a lawyer and she\u0027s a legal commentator. She provides in-depth commentary and she explains the law. This trial has been filled with enough sex, drugs, and rock and roll that it\u0027s surely going to end up as a Netflix blockbuster. But I wondered, How did they get to this point? Whatever possessed them to air all of their dirty laundry for the world to see comment on and draw conclusions about. My guest today is Trisha Morrissey. She\u0027s the host of the Rooted in Starlight Podcast. She\u0027s a talented and insightful astrologer with decades of experience. And this episode, she takes us for a deep dive into the astrological charts of Johnny Depp and Amber Heard taking us to the root of where it all began. Rooted in Starlight Podcast Tricia on Instagram https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-05-27T16:00:00Z",
      "duration": "00:40:04.9370000",
      "explicit": false,
      "spotifyId": "1aTFwxWgCnqQN64xXBWrYb",
      "appleId": 1000564214582,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1aTFwxWgCnqQN64xXBWrYb",
        "apple": "https://podcasts.apple.com/podcast/depp-v-heard-what-their-astrological-charts-tell-us/id1591849562?i=1000564214582"
      }
    },
    {
      "id": "92497034-8096-4778-a2b8-f5b7fbedd930",
      "title": "It\u0027s a Matter of Perspective: Tips to Lift Mental Blocks",
      "description": "Email us and tell us what topics you would like us to cover. John Chao is one of the most inspiring individuals I\u0027ve ever met. He\u0027s the host of Perspective Maintenance, he\u0027s a dynamic leader and a clarity coach. In today\u0027s conversation. John shares tips on how to change your perspective to lift mental blocks and get you unstuck, freeing you to be your healthiest, most creative, and fulfilled self. Perspective Maintenance Podcast John Chao https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-05-23T04:00:00Z",
      "duration": "00:37:32.9620000",
      "explicit": false,
      "spotifyId": "2Uwox0HilkA7Ccvmd6FiVi",
      "appleId": 1000563216994,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Uwox0HilkA7Ccvmd6FiVi",
        "apple": "https://podcasts.apple.com/podcast/its-a-matter-of-perspective-tips-to-lift-mental-blocks/id1591849562?i=1000563216994"
      }
    },
    {
      "id": "6ffc3658-7157-451d-b8a4-73ebf4667fd2",
      "title": "You Can Do Amazing Things",
      "description": "Email us and tell us what topics you would like us to cover. Have you ever been stuck, unable to get out of your own way? Have you ever been overwhelmed, trying to find that work-life balance? My guest today, Hollie Rumman is the host of You Can Do Amazing Things. In today\u0027s conversation, we\u0027ll talk about finding your passion, a positive mindset, building confidence, and creating good habits. Holly shares, many helpful tips, and strategies to get you from being stuck to becoming motivated and taking action so you too can do amazing things. https://hollierumman.com/ You Can Do Amazing Things Podcast Hollie on Instagram https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-05-16T12:00:00Z",
      "duration": "00:24:12.8260000",
      "explicit": false,
      "spotifyId": "4vTJrA6rKcu6eyFTJvmacz",
      "appleId": 1000561517159,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vTJrA6rKcu6eyFTJvmacz",
        "apple": "https://podcasts.apple.com/podcast/you-can-do-amazing-things/id1591849562?i=1000561517159"
      }
    },
    {
      "id": "bcb9bf50-d204-4894-b825-b296916abc7f",
      "title": "5 Minute Meditation",
      "description": "Email us and tell us what topics you would like us to cover. A 5-minute guided meditation to renew, refresh and center yourself. We all need a little balance, a little more peace in our lives. 5-minutes twice a day will do wonders. Listen while sipping your morning coffee/tea, on your lunch break, in the car line at school, or after a stressful day. Namaste. https://myonlineretreat.org/ https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-05-11T13:00:00Z",
      "duration": "00:08:06.6670000",
      "explicit": false,
      "spotifyId": "3QWKs9FXUHC4xMZ686mopq",
      "appleId": 1000560515178,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QWKs9FXUHC4xMZ686mopq",
        "apple": "https://podcasts.apple.com/podcast/5-minute-meditation/id1591849562?i=1000560515178"
      }
    },
    {
      "id": "9adf4fde-9388-424f-9f4a-554f11153412",
      "title": "Awaken to the Life You\u0027re Meant to Live",
      "description": "Email us and tell us what topics you would like us to cover. If you could choose to live out the truest version of yourself in this lifetime, would you say YES? This episode is about awakening to the life that you\u0027re meant to live without all of the layers of crap that have been piled on us over the years. It\u0027s like peeling back the onion slowly to get to your truth, to how you want to live this life, how you want to be here. Learn how discovering your inner child can change your life. Awaken to Your Freedom Trade-Up Megan on Instagram https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-05-02T04:00:00Z",
      "duration": "00:23:26.1770000",
      "explicit": false,
      "spotifyId": "6Dfz6oybNZ8UMxaaWRVa8P",
      "appleId": 1000559291603,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Dfz6oybNZ8UMxaaWRVa8P",
        "apple": "https://podcasts.apple.com/podcast/awaken-to-the-life-youre-meant-to-live/id1591849562?i=1000559291603"
      }
    },
    {
      "id": "183219c4-0b47-4318-81a4-2ae5247c60f6",
      "title": "Finding Long Lost Friends",
      "description": "Email us and tell us what topics you would like us to cover. It used to be that generations lived their entire lives in the same neighborhood. That\u0027s changed considerably and today, friends and family are scattered all over the world. Weekly Sunday dinners are few and far between, replaced by FaceTime and zoom calls. So it got me thinking. I wonder where everyone landed? I had an ideal childhood. I grew up on Long Island in New York. We moved a couple of times during my years in grades K through 12. I attended two elementary schools, junior high school, and one high school, and was homeschooled. Yeah, there was a thing even before it became fashionable. In my senior year, my family traveled throughout the United States in an RV visiting landmarks and historical sites, and purely experiencing North America firsthand. With this said, I lost touch with many of my schoolmates over the years. And while researching for the article that I was writing gave me an opportunity to see where they were now, the roads that their lives had taken and if somehow I could find them and we could reconnect. Find me on social: linktr.ee/sandimckenna https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-04-24T21:00:00Z",
      "duration": "00:12:21.9700000",
      "explicit": false,
      "spotifyId": "7d5iYftemJ3dca5CeXwbwG",
      "appleId": 1000558542406,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7d5iYftemJ3dca5CeXwbwG",
        "apple": "https://podcasts.apple.com/podcast/finding-long-lost-friends/id1591849562?i=1000558542406"
      }
    },
    {
      "id": "f85d7f48-e669-43fa-86b5-30f01e7a88c4",
      "title": "Staying Motivated in MidLife",
      "description": "Email us and tell us what topics you would like us to cover. Lesley McShane is in perpetual motion. She is a seasoned cyclist, a producer, a wife, a mother, and an advocate for women over 50. She also hosts not one but two long-running podcasts, The Friday Night Beer Blog Podcast and the New Old You Podcast In this episode, you’ll learn how to prioritize yourself, guilt-free! Lesley\u0027s Links https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-04-18T18:00:00Z",
      "duration": "00:28:40.7370000",
      "explicit": false,
      "spotifyId": "61Nio7GMUd8vxErnppAI6P",
      "appleId": 1000557953321,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61Nio7GMUd8vxErnppAI6P",
        "apple": "https://podcasts.apple.com/podcast/staying-motivated-in-midlife/id1591849562?i=1000557953321"
      }
    },
    {
      "id": "9e9ad6e1-83b9-44f7-bc50-dc00b69c9106",
      "title": "Living Off The Grid:From Beverly Hills to Breaking Bad",
      "description": "Email us and tell us what topics you would like us to cover. Melody Papaj is an artist, an author, an entrepreneur, and a boondocking septuagenarian whose journey has taken her from the comfort and trappings of Hollywood, California off the grid to a quirky little town in the middle of the Arizona desert known as Quartzsite.. In this episode, she shares the trials and tribulations of her life in her 1986, Shasta RV she calls nomad and that she lovingly describes as Breaking Bad on the outside but Beverly Hills on the inside. In this episode, you\u0027ll also hear why she decided to give up her comfortable lifestyle, how she overcame the fear of stepping outside her comfort zone, and the roadblocks along the way. https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-04-11T04:00:00Z",
      "duration": "00:27:35.7450000",
      "explicit": false,
      "spotifyId": "21KIn6c3vxDwbjokam7RZ8",
      "appleId": 1000556939249,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21KIn6c3vxDwbjokam7RZ8",
        "apple": "https://podcasts.apple.com/podcast/living-off-the-grid-from-beverly-hills-to-breaking-bad/id1591849562?i=1000556939249"
      }
    },
    {
      "id": "e3391a86-b5ee-46aa-9fd1-878322f386e7",
      "title": "Shattering the Silence",
      "description": "Email us and tell us what topics you would like us to cover. Shattering the Silence of Sexual Violence My guest Angela Rose , shares the story of her harrowing abduction at knifepoint in broad daylight by a man who was on parole for MURDER! Her story is one of incredible resilience. Today she leads the movement to create a world free from sexual violence \u0026 build communities to support survivors. #ShatteringTheSilence #SAAM https://linktr.ee/paveinfo https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-04-04T04:00:00Z",
      "duration": "00:41:31.3850000",
      "explicit": true,
      "spotifyId": "48NIJqhfml4D829o2DWfCQ",
      "appleId": 1000556140048,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/48NIJqhfml4D829o2DWfCQ",
        "apple": "https://podcasts.apple.com/podcast/shattering-the-silence/id1591849562?i=1000556140048"
      }
    },
    {
      "id": "3c4ebb9c-8a32-45e7-ad58-cb5311088b6c",
      "title": "Comedian and Actor: Tim Wilkins",
      "description": "Email us and tell us what topics you would like us to cover. A 20-year veteran stand-up comedian Tim has entertained millions in legendary venues ranging from Radio City Music Hall to chow halls in Afghanistan. From his first time opening for the legendary Earth, Wind, and Fire in 1998, to his 6-year-run with international superstar Julio Iglesias, and a live stage interview with the cast of Modern Family, Tim has worked with some of the biggest names in music and entertainment. He\u0027s entertained our troops in Afghanistan, Kyrgystan, and state-side bases as part of the “Comics on Duty” World Tour. He\u0027s opened for BIG names including Diana Ross, Earth, Wind \u0026 Fire, The Righteous Brothers, Aretha Franklin, Olivia Newton-John, Hall and Oates, Styx, Belinda Carlisle, Wynonna Judd, Julio Iglesias, Frank Sinatra Jr., Paul Anka, Engelbert Humperdinck, The Isley Brothers, Loverboy, Eddie Money, Michael McDonald and many more. You\u0027ve seen him nationally on HBO, ESPN2, Fox Sports, TLC, CW, WE Network, MOR in Tampa, LifeTime, “The Daily Buzz”, “BetterTV”, “Daytime,” and CMT’s “Next Big Comic”. And yet, he still sits down with me. We talk comedy, fitness, family, throughout our unforgettable conversation. There are lots of laughs, a few tears, and Tim\u0027s amazing stories as only he can tell them! http://timwilkins.com/ Instagram If this episode resonated with you please share it with someone you know would enjoy it. If you\u0027re loving the podcast, please review and rate it. It really helps with our listening reach. Rate/Review: Apple Podcasts and/or Spotify https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-03-28T04:00:00Z",
      "duration": "00:47:34.0800000",
      "explicit": false,
      "spotifyId": "4cPuMu3cSCFu9CQdmo3zHv",
      "appleId": 1000555414248,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cPuMu3cSCFu9CQdmo3zHv",
        "apple": "https://podcasts.apple.com/podcast/comedian-and-actor-tim-wilkins/id1591849562?i=1000555414248"
      }
    },
    {
      "id": "54cd84fb-dcdb-413b-8594-3b5249d50bb3",
      "title": "Fostering Human Connection, Communication and Growth",
      "description": "Email us and tell us what topics you would like us to cover. Patricia Rossi had a rough start, overcoming a challenging childhood and dyslexia. Instead of discouraging her though, it fueled her flames of success and ambition. Today, she is a frequent speaker for top-tier organizations, including the NFL, Raymond James, Major League Baseball Moen, Bayer, and Hyatt. She is a featured business etiquette expert for Bloomberg, the New York Times, USA Today, Mashable, Monster.com, Chicago Tribune, Redbook, HGTV, Parade, Real Simple, and The Wall Street Journal. She is the best-selling author of Everyday Etiquette: How to navigate 101 common and uncommon social situations. She is a TV and Radio Personality. And for more than a decade, her etiquette segments aired in 165 markets across the U.S. on the syndicated Daytime Show. She is a wife, a mom, and a very dear friend. https://patriciarossi.com/ https://www.instagram.com/patricia_rossi https://twitter.com/patriciarossi https://www.linkedin.com/in/patriciarossi/ https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-03-21T04:00:00Z",
      "duration": "00:39:36.2600000",
      "explicit": false,
      "spotifyId": "0edipLgpjyzRZfTc4DH2AI",
      "appleId": 1000554676470,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0edipLgpjyzRZfTc4DH2AI",
        "apple": "https://podcasts.apple.com/podcast/fostering-human-connection-communication-and-growth/id1591849562?i=1000554676470"
      }
    },
    {
      "id": "a786c6d7-6df8-455f-829e-2daea04d5e7e",
      "title": "Becky Bortack: Mom, Widow, Songwriter, and Yogi",
      "description": "Email us and tell us what topics you would like us to cover. Becky Bortak, my guest today is a mom, a widow, a songwriter, and a Yogi who believes love conquers all. In today\u0027s unforgettable conversation we talk about her journey, navigating depression, divorce, finding love again, fertility issues, her husband\u0027s shocking diagnosis, and what she did to keep her sanity through it all. On her website, My Online Retreat you\u0027ll find restoration for your body, your mind, and your soul. And listen until the very end of our conversation for a very special five-minute meditation, just for you! MyOnlineRetreat.com Instagram Facebook https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-03-14T04:00:00Z",
      "duration": "00:37:04.1230000",
      "explicit": false,
      "spotifyId": "1176mQpl1SML3H3K59jkH4",
      "appleId": 1000553902782,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1176mQpl1SML3H3K59jkH4",
        "apple": "https://podcasts.apple.com/podcast/becky-bortack-mom-widow-songwriter-and-yogi/id1591849562?i=1000553902782"
      }
    },
    {
      "id": "e371b394-0a0d-4c3e-afd8-12e17d194d7a",
      "title": "Jim Joseph: Out and About Dad (Part 2)",
      "description": "Email us and tell us what topics you would like us to cover. Jim Joseph is the award-winning author of Out and About Dad. In this conversation we get personal. We talk about marriage parenthood, divorce, self-discovery, finding love again, and being true to who you are. His journey hasn\u0027t been an easy one, but Jim shares all the highs and lows in this unforgettable conversation. https://www.jimjoseph.com/ Jim\u0027s Books https://twitter.com/JimJosephExp https://www.instagram.com/jimjosephexp/ https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-03-07T05:00:00Z",
      "duration": "00:27:48.6780000",
      "explicit": false,
      "spotifyId": "1UE0T62daJ0Kg7dT9nOQlV",
      "appleId": 1000553127964,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1UE0T62daJ0Kg7dT9nOQlV",
        "apple": "https://podcasts.apple.com/podcast/jim-joseph-out-and-about-dad-part-2/id1591849562?i=1000553127964"
      }
    },
    {
      "id": "48003450-e45d-48ac-8b5d-0b1894118bf6",
      "title": "Jim Joseph:  The Experience Effect (Part 1)",
      "description": "Email us and tell us what topics you would like us to cover. Jim Joseph has been awarded numerous accolades throughout his storied career, including Entrepreneur of the Year, Agency of the Year, Most Creative Agency, Social Media Icon, Hall of Fame. He is a global leader in brand marketing and communications, with years of consumer marketing leadership, and If running an agency wasn\u0027t big enough, he\u0027s also an award-winning author, blogger, professor at New York University, and he’s been a regular contributor to Entrepreneur and the Huffington Post. He’s also a husband and a dad. They say when you want to get something done, give it to someone who\u0027s busy! In part one of this two-part series, we talk about Brand Marketing, Personal Marketing, and the social media landscape, where it started, and where it’s going. https://www.jimjoseph.com/ Jim\u0027s Books https://twitter.com/JimJosephExp https://www.instagram.com/jimjosephexp/ https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-03-01T19:00:00Z",
      "duration": "00:16:43.8910000",
      "explicit": true,
      "spotifyId": "1siaNhT1ZsHNQ8jr9Je9rv",
      "appleId": 1000552618007,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1siaNhT1ZsHNQ8jr9Je9rv",
        "apple": "https://podcasts.apple.com/podcast/jim-joseph-the-experience-effect-part-1/id1591849562?i=1000552618007"
      }
    },
    {
      "id": "0fc465c4-8279-4116-b7bd-396c5ffc571d",
      "title": "Audrey McClelland: Creating the Life You Want (and Deserve)",
      "description": "Email us and tell us what topics you would like us to cover. Audrey McClelland wears many hats and has navigated her life and career with vision and trust, following her heart and gut. She began her career in New York City, working in the fashion industry for designer Donna Karan. Her personal life mirrors a Hallmark movie: leaving the big city for small town life, meeting the love of her life in a chance encounter on the campus green, raising five children while creating a thriving online business, and ultimately becoming an inspiration and role model for women and moms everywhere. She\u0027s an author, an entrepreneur, a businesswoman, a brand spokesperson, and a thought leader. She has been featured on everything from the today show and Nightline to the New York times and parenting magazine. Her social media numbers are staggering with an engaged online community. We talk about how it all began, the juggling act to get it all done in a day, and how you can create the life that you want. Audrey\u0027s Books Mom Generations Permission to Hustle Instagram Tik Tok https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-02-21T03:00:00Z",
      "duration": "00:44:25.5810000",
      "explicit": false,
      "spotifyId": "3zBtnStGpiTpuNjUjTmtxn",
      "appleId": 1000551720960,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zBtnStGpiTpuNjUjTmtxn",
        "apple": "https://podcasts.apple.com/podcast/audrey-mcclelland-creating-the-life-you-want-and-deserve/id1591849562?i=1000551720960"
      }
    },
    {
      "id": "13c6931d-6313-40ab-ae96-22d7f1fb6b0d",
      "title": "From Abandonment to a Brain Tumor Shannon DalPozzal\u0027s life reads like a Danielle Steel Novel",
      "description": "Email us and tell us what topics you would like us to cover. The deck was stacked against her from birth and the rollercoaster of ups and downs that followed her throughout her life read like a Danielle Steel novel. Abandonment, adoption, motherhood, divorce, a brain tumor, the glass ceiling, several careers, reinventions, and ultimately finding love at 30,000 feet. https://www.instagram.com/sandimckenna https://www.twitter.com/sandimckenna www.unforgettableconversations.com https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-02-14T14:00:00Z",
      "duration": "00:40:27.9240000",
      "explicit": false,
      "spotifyId": "1b21nwbfIJsz35Fe1WnCE1",
      "appleId": 1000551048033,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1b21nwbfIJsz35Fe1WnCE1",
        "apple": "https://podcasts.apple.com/podcast/from-abandonment-to-a-brain-tumor-shannon/id1591849562?i=1000551048033"
      }
    },
    {
      "id": "cdc03154-bd7e-48f8-a153-a3917f1a4018",
      "title": "Marci Wise, M.A., LMHC (Suicide Part 2)",
      "description": "Email us and tell us what topics you would like us to cover. In part, one of my conversation with John Lewis, we talked about his son\u0027s suicide and how he navigated his grief on a personal level. today In part two, of this conversation about suicide I talked with Marci Wise, a licensed mental health counselor and author, who is devoted to helping empower clients to achieve their most fulfilling life. The Suicide Prevention Lifeline provides 24/7, free and confidential support for people in distress, prevention, and crisis resources for you or your loved ones. Suicide Hotline 1 800-2 7 3 -8 2 5 5 https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-02-09T14:00:00Z",
      "duration": "00:11:10.5690000",
      "explicit": false,
      "spotifyId": "5etS9SFNlhrUTm3DoMSp7t",
      "appleId": 1000550573093,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5etS9SFNlhrUTm3DoMSp7t",
        "apple": "https://podcasts.apple.com/podcast/marci-wise-m-a-lmhc-suicide-part-2/id1591849562?i=1000550573093"
      }
    },
    {
      "id": "87de2853-e468-4f1d-ae99-550b4ac55efe",
      "title": "A Single Dad\u0027s Journey: The Tragic Loss of His Only Son (Suicide Part 1)",
      "description": "Email us and tell us what topics you would like us to cover. John Lewis, a single father, lost his only son to suicide. He shares his journey as a single parent raising a son, his shock when he received that fateful call, and how he came to terms with such an unimaginable loss. In this raw and revealing conversation, John shares all of his feelings and emotions with honesty and empathy. SUICIDE PREVENTION HOTLINE 1-800-273-TALK (8255) suicidepreventionlifeline.org https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-02-07T05:00:00Z",
      "duration": "00:23:39.4350000",
      "explicit": true,
      "spotifyId": "2PheWQDveLVa2r72bezpGK",
      "appleId": 1000550268074,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2PheWQDveLVa2r72bezpGK",
        "apple": "https://podcasts.apple.com/podcast/a-single-dads-journey-the-tragic-loss-of-his/id1591849562?i=1000550268074"
      }
    },
    {
      "id": "ad087e74-f4dc-4153-b868-338c41dc4c14",
      "title": "Unwrap your Passion to Create the Life You Truly Want",
      "description": "Email us and tell us what topics you would like us to cover. Karen Putz is known as the passion mentor with a mission to help people unwrap their passions, at any age. She is an author, a sought-after motivational speaker, a wife, and a mom to three children who all lost hearing when they were very young. Her family is one of only four in the world that share a rare gene. In this episode, she shares her incredible and inspiring story about losing her hearing, facing her fears, and following her passion. Be sure to listen through to the end to learn simple steps you too can take to unwrap your passion! Karen Putz Ageless Passions Unwrapping Your Passion Instagram https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-01-31T23:00:00Z",
      "duration": "00:29:02.1000000",
      "explicit": false,
      "spotifyId": "4qZJ5Sb7fzCsH5DJWRO5QU",
      "appleId": 1000549602031,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4qZJ5Sb7fzCsH5DJWRO5QU",
        "apple": "https://podcasts.apple.com/podcast/unwrap-your-passion-to-create-the-life-you-truly-want/id1591849562?i=1000549602031"
      }
    },
    {
      "id": "5a54af23-fc83-49c0-8d03-4f8a7e5b8392",
      "title": "Finding YOUR Spark to Reach Your Full Potential",
      "description": "Email us and tell us what topics you would like us to cover. Once in a place where she had zero spark, not even an itty bitty flame, my guest today suffered for years with poor health and an autoimmune diagnosis. Back in 2010 fed up with being sick, sad, and stuck, she took charge of her life and became a certified natural health professional. From there she learned about flower essences and saw what they did for her and at that very moment, she knew she needed to make a commitment to help others. In today\u0027s episode, Heather Radke shares how YOU can find YOUR spark to reach YOUR full potential. http://www.heatherradkeholistics.com http://www.instagram.com/heatherradkeholistics https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-01-24T05:00:00Z",
      "duration": "00:24:04.0940000",
      "explicit": false,
      "spotifyId": "0QNgtTjG8X6kZjy5BpHnFb",
      "appleId": 1000548778898,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0QNgtTjG8X6kZjy5BpHnFb",
        "apple": "https://podcasts.apple.com/podcast/finding-your-spark-to-reach-your-full-potential/id1591849562?i=1000548778898"
      }
    },
    {
      "id": "5aa1d1ce-0c0d-4b34-bb38-ebf3b1bcc3fa",
      "title": "The Ultimate Gift: The Gift of Life",
      "description": "Email us and tell us what topics you would like us to cover. Heroes come in all shapes and sizes, from all walks of life. And my guest in this episode embodies the premise that ordinary people do lead extraordinary lives. She is the epitome of grace and generosity. It is my honor, and my privilege to introduce you to Jen Carlisle. kidney.org organdonor.gov Life Link Legacy Fund Gabriel House of Care https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-01-17T17:00:00Z",
      "duration": "00:45:51.3700000",
      "explicit": false,
      "spotifyId": "73YsZeZCrs7ioNczMta6HF",
      "appleId": 1000548141512,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/73YsZeZCrs7ioNczMta6HF",
        "apple": "https://podcasts.apple.com/podcast/the-ultimate-gift-the-gift-of-life/id1591849562?i=1000548141512"
      }
    },
    {
      "id": "81a4173a-9d99-4482-9fd6-0605b5048667",
      "title": "Walk Your Way Calm",
      "description": "Email us and tell us what topics you would like us to cover. In this UNFORGETTABLE CONVERSATION, I talk with Jennifer Walsh about nature and its impact on human and planetary wellness. We take a deep dive into nature therapy and how you can bring the health benefits of nature into your everyday life. You don\u0027t want to miss her Instagram feed and for daily inspiration. Her new book Walk Your Way Calm teaches you how to tap into the stress-busting benefits of walking and gives you easy-to-use tools to build a regular mindfulness practice. Discover 101 unique, purposeful walks, all designed to help unclutter your mind, decrease anxiety, and boost your mental and physical health—whether you’ve got an hour or just a few minutes. Each walk offers thoughtful writing prompts, encouraging you to reflect on your experience of every step. A Walking Wellness Tracker lets you log your walks and create a record of the progress you’ve made. https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-01-10T23:00:00Z",
      "duration": "00:30:16.1990000",
      "explicit": false,
      "spotifyId": "3NdC2hMXJ8seOGAJsbLUdu",
      "appleId": 1000547485239,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3NdC2hMXJ8seOGAJsbLUdu",
        "apple": "https://podcasts.apple.com/podcast/walk-your-way-calm/id1591849562?i=1000547485239"
      }
    },
    {
      "id": "17da8903-a6f4-4de1-a502-3a52863e2612",
      "title": "Eating Well to Live a More Vibrant, Meaningful Life",
      "description": "Email us and tell us what topics you would like us to cover. In this episode, Celeste Anderson demystifies why prioritizing plants as the center of your plate can be easy, delicious, and the best decision you might ever make. Her journey from the inside out has taken her from a protein-centric diet to embracing carbohydrates. She tells us what the best sources are, why we need them and how to choose food that makes you feel good for life. Pivot to Plants Podcast https://www.instagram.com/celeste.arielle/ https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-01-10T15:00:00Z",
      "duration": "00:41:40.0940000",
      "explicit": false,
      "spotifyId": "6S4319S665pxa1fTUuHDbG",
      "appleId": 1000547447736,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6S4319S665pxa1fTUuHDbG",
        "apple": "https://podcasts.apple.com/podcast/eating-well-to-live-a-more-vibrant-meaningful-life/id1591849562?i=1000547447736"
      }
    },
    {
      "id": "b8588636-0069-4cd4-b515-a081b8eca61f",
      "title": "Kim Westfall, a catalyst in the anti-trafficking movement",
      "description": "Email us and tell us what topics you would like us to cover. Focussed on the tremendous and complex task of rescuing and restoring shattered hearts, minds, and psyches, Kim Westfall, like many others is moved by compassion, outrage, and faith. Her organization, UNCAGED.ORG, places special emphasis on young women in the sex trade. Our conversation is about Human Trafficking and her goal for Uncaged to become one of the world’s leading catalysts and resource hubs for the anti-trafficking movement. https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2022-01-10T05:00:00Z",
      "duration": "00:18:58.8640000",
      "explicit": false,
      "spotifyId": "1J48GMX1GzJtEd4afZTPDE",
      "appleId": 1000547383469,
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1J48GMX1GzJtEd4afZTPDE",
        "apple": "https://podcasts.apple.com/podcast/kim-westfall-a-catalyst-in-the-anti-trafficking-movement/id1591849562?i=1000547383469"
      }
    },
    {
      "id": "8300fd44-039f-4cc9-b3d0-afbb520ad841",
      "title": "Unforgettable Conversations Trailer",
      "description": "Email us and tell us what topics you would like us to cover. Welcome to the UNFORGETTABLE CONVERSATIONS PODCAST with host Sandi McKenna. Every week I\u0027ll introduce you to people from all walks of life. Everyone from experts in their fields to folks who have simply “lived through it”. I’m pulling back the curtain on sometimes difficult, often hilarious, always engaging conversations that promise to be unforgettable. Join me as we take a “deep dive” into real, raw, life-changing conversations that I hope resonate with you, uplift you and give you a road map to resilience no matter where you’re at on your journey. Now Let’s get this conversation started! https://youtube.com/@SinsofScientology?si=w_r1XkNawsDAgjPg",
      "release": "2021-10-17T19:00:00Z",
      "duration": "00:02:34.9090000",
      "explicit": false,
      "spotifyId": "5lSOJO6tVij9tYW7aRuElB",
      "appleId": 1000539576158,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5lSOJO6tVij9tYW7aRuElB",
        "apple": "https://podcasts.apple.com/podcast/unforgettable-conversations-trailer/id1591849562?i=1000539576158"
      }
    }
  ]
}