{
  "id": "27281b25-5199-48d6-97da-30b7c2e53543",
  "name": "Sisters Not Wives",
  "spotifyId": "6Ami5idZ4k2o5ZPT7mU2Zh",
  "appleId": 1818932495,
  "youTubeChannelId": "UCEWohgkI089Vj2hnCMLQ9ew",
  "episodes": [
    {
      "id": "940fb524-860d-4181-b526-4785de5a941d",
      "title": "What Netflix Got Totally Wrong | The Actual History of Mountain Meadows Massacre | Sisters Not Wives#20",
      "description": "The Mountain Meadows Massacre is one of the darkest and most disturbing events in Utah history and the truth is far more twisted than what most people have seen on screen.\n\nIn this episode, we break down where Netflix’s American Primeval gets the story wrong, why its portrayal of frontier violence oversimplifies what really happened, and how last year’s best-selling book None Left to Tell comes closer to capturing the emotional and human reality behind the massacre.\n\nWe walk through the actual historical events that led to the 1857 slaughter of the Baker-Fancher wagon train in southern Utah: the growing paranoia of the Utah War, the role of local Mormon militia members, the deception under a white flag of truce, and the brutal execution of men, women, and children. We also explore how the massacre was deliberately covered up for decades, with blame shifted away from those responsible and the truth buried in official narratives.\n\nFrom Hollywood dramatization to historical fiction to documented fact, this episode explores how fear, loyalty, and power converged to produce one of the most horrific massacres in Utah history.\n\nShow Notes:\nModern Scholarly Works\nWalker, Ronald W., Richard E. Turley Jr., and Glen M. Leonard.\nMassacre at Mountain Meadows: An American Tragedy. New York: Oxford University Press, 2008.\nTurley, Richard E. Jr., and Barbara Jones Brown.\nVengeance Is Mine: The Mountain Meadows Massacre and Its Aftermath. New York: Oxford University Press, 2023.\nTurley, Richard E. Jr., Janiece L. Johnson, and LaJean Purcell Carruth, eds.\nMountain Meadows Massacre: Collected Legal Papers. Salt Lake City: Church Historian’s Press, 2017.\n\nPrimary and Early Accounts\nLee, John D.\nMormonism Unveiled; or, The Life and Confessions of the Late Mormon Bishop, John D. Lee (Written by Himself). St. Louis: Bryan, Brand \u0026 Co., 1877.\nBrooks, Juanita.\nThe Mountain Meadows Massacre. Norman: University of Oklahoma Press, 1950.",
      "release": "2026-02-05T23:51:06Z",
      "duration": "00:57:28.7900000",
      "explicit": false,
      "spotifyId": "31NTD1V9iYmyxFMAPdsRQo",
      "appleId": 1000748449449,
      "youTubeId": "zi3CZbVjn90",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/31NTD1V9iYmyxFMAPdsRQo",
        "apple": "https://podcasts.apple.com/podcast/what-netflix-got-totally-wrong-the-actual-history/id1818932495?i=1000748449449",
        "youtube": "https://www.youtube.com/watch?v=zi3CZbVjn90"
      }
    },
    {
      "id": "074e9cc2-264a-400b-b67e-07e533d8dd89",
      "title": "\u0022Obedience Over Logic!\u0022 2025 LDS Sunday School Debacle | Sisters Not Wives #19",
      "description": "In November 2025, the LDS Church’s Sunday School lesson on polygamy and Doctrine \u0026 Covenants Section 132 raised more questions than answers and for many, confirmed long-standing concerns about how the Church handles its own history.\nIn this episode of Sisters Not Wives, we break down what actually happened in that lesson and why it felt less like transparency and more like carefully managed silence.\nWe talk about:\n-  How the lesson skirted around the truth of LDS polygamy\n- Why absolute obedience was emphasized instead of historical context\n- The fear Church leaders seem to have around open discussion\n- The deeply troubling parts of Section 132 that remain canonized today\n- Consent loopholes, biblical justifications built on logical fallacies, and sexist rules that harmed everyone\n- How “pretend transparency” keeps members compliant but uninformed\nSection 132 isn’t just a relic of the past. It’s still scripture. And when you actually read it, the implications are unsettling.\nThis episode isn’t about attacking faith. It’s about telling the truth, asking better questions, and refusing to let institutional discomfort rewrite lived history.\n🎙️ Subscribe for more honest conversations about Mormonism, polygamy, faith deconstruction and construction, and religious accountability.",
      "release": "2026-01-25T14:29:58Z",
      "duration": "00:59:54",
      "explicit": false,
      "spotifyId": "5JZ0Zwz1f8vfzQfo15nbtc",
      "appleId": 1000746564369,
      "youTubeId": "OIxmuGlY9Dc",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5JZ0Zwz1f8vfzQfo15nbtc",
        "apple": "https://podcasts.apple.com/podcast/obedience-over-logic-2025-lds-sunday-school-debacle/id1818932495?i=1000746564369",
        "youtube": "https://www.youtube.com/watch?v=OIxmuGlY9Dc"
      }
    },
    {
      "id": "b2ac9f49-5ef1-4850-8fda-806026b601ec",
      "title": "How Tension on the Frontier Turned Deadly: The Road to Mountain Meadows | Sisters Not Wives #18",
      "description": "Today, we\u0027re exploring how a rising climate of religious fervor, growing suspicion, and a sense of impending doom shaped life in Utah Territory during the 1850s. As tensions escalated between Latter-day Saint settlers and outsiders, the community braced for what many believed would be another invasion, this time from the United States government during the brewing Utah (Mormon) War.\n\nWe also look closely at the murder of Apostle Parley P. Pratt, a flashpoint that intensified fear, anger, and hostility across the region. These overlapping pressures—spiritual, political, and personal—created a volatile environment that ultimately contributed to the tragic events at Mountain Meadows in 1857.\n\nJoin us as we unpack the complicated, often overlooked factors that led to this pivotal moment in Western and Mormon history.",
      "release": "2025-11-15T23:01:35Z",
      "duration": "00:32:44.1890000",
      "explicit": false,
      "spotifyId": "38VpMLyGtVyfuh1m6ylTsu",
      "appleId": 1000736903196,
      "youTubeId": "pKbSffIIf6U",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38VpMLyGtVyfuh1m6ylTsu",
        "apple": "https://podcasts.apple.com/podcast/how-tension-on-the-frontier-turned-deadly-the-road/id1818932495?i=1000736903196",
        "youtube": "https://www.youtube.com/watch?v=pKbSffIIf6U"
      }
    },
    {
      "id": "da5e77dc-c378-40a0-bb6e-5527b7f0de3b",
      "title": "Mormon History: Polygamy, Racism, \u0026 Violence Uncovered",
      "description": "What triggered a peaceful community to turn to religious violence so quickly? It\u0027s not what you think... #MormonHistory #UtahHistory #Polygamy #Racism #BloodAtonement #mormonstories #utahmormon #poygamyandmormonism",
      "release": "2025-11-13T06:57:52Z",
      "duration": "00:04:22",
      "explicit": false,
      "youTubeId": "j5U2mx7cTtE",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j5U2mx7cTtE"
      }
    },
    {
      "id": "695ca074-4a1e-4e84-881e-b46cd54ac6fa",
      "title": "The Untold History of Why Early Mormons Believed In Blood Atonement | Sisters Not Wives #17",
      "description": "In this episode, we uncover the chilling truth behind why early Mormons believed in Blood Atonement: one of the most disturbing doctrines to ever emerge from 19th-century American religion.\n\nWe explore how this belief shaped the foundations of early Mormon history and how a culture of fear, guilt, and divine punishment took hold during the Mormon Reformation. In a time of famine, natural disasters, and desperation, many early Saints believed that shedding blood could restore their purity before God, a terrifying example of how faith and fanaticism can collide.\n\nJoin us as we dive into the untold history of how spiritual panic, charismatic leadership, and apocalyptic thinking led ordinary people to justify the unthinkable all in the name of redemption.\n\n#MormonHistory #BloodAtonement #LDSChurch #ExMormon #Mormon #ReligiousExtremism #MormonReformation #AmericanHistory #CultDocumentary #FaithAndFear #DarkHistory",
      "release": "2025-11-08T01:05:00Z",
      "duration": "01:07:28.0090000",
      "explicit": false,
      "spotifyId": "7z3qjyjXPtmObyUcZ67juU",
      "appleId": 1000735806466,
      "youTubeId": "_1PLf3O6Az8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7z3qjyjXPtmObyUcZ67juU",
        "apple": "https://podcasts.apple.com/podcast/the-untold-history-of-why-early-mormons-believed/id1818932495?i=1000735806466",
        "youtube": "https://www.youtube.com/watch?v=_1PLf3O6Az8"
      }
    },
    {
      "id": "6ec307b6-e60e-4b74-9d21-c4e37e1ffac5",
      "title": "What No One Talks About In Mormon Temple Culture | Sisters Not Wives #16",
      "description": "Three sisters, each raised in the LDS (Mormon) Church and now at different stages in their faith journeys, sit down for a raw, unfiltered discussion about what no one talks about in Mormon temple culture.\n\nWe dive deep into the traditions, expectations, and emotional layers behind eternal marriage, temple covenants, and the shame culture that can quietly shape women’s lives within the Church of Jesus Christ of Latter-day Saints. From exploring the origins of temple practices to confronting the pressures of worthiness interviews and modesty rules, this conversation opens space for honesty, healing, and hope.\n\nThis isn’t about tearing down faith; it’s about understanding it. We talk candidly about what’s beautiful in the culture, what’s painful, and what needs to change so that future generations can experience more authentic connection, compassion, and spiritual freedom within or outside of Mormonism.\n\nJoin the conversation, share your thoughts, and let’s take the taboo out of talking about what really matters.\n\n#MormonCulture #LDSChurch #FaithJourney #ExMormon #MormonWomen #TempleCulture #EternalMarriage #FaithDiscussion #Deconstruction #SpiritualHealing #ReligiousTrauma #MormonPodcast #WomenOfFaith #HonestConversations #MormonStories #HealingFromReligion",
      "release": "2025-11-01T15:13:21Z",
      "duration": "00:44:38",
      "explicit": false,
      "spotifyId": "3ad2YViZSzrakwtVhswIWa",
      "appleId": 1000734621316,
      "youTubeId": "EaVMidRMPcI",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ad2YViZSzrakwtVhswIWa",
        "apple": "https://podcasts.apple.com/podcast/what-no-one-talks-about-in-mormon-temple-culture-sisters/id1818932495?i=1000734621316",
        "youtube": "https://www.youtube.com/watch?v=EaVMidRMPcI"
      }
    },
    {
      "id": "b21eabed-79ec-4030-b76d-bc232947b320",
      "title": "Blood Atonement: The Shocking Mormon Doctrine Explained #shorts",
      "description": "Have you ever heard of blood atonement before? #Mormonism #BloodAtonement #ControversialDoctrine #ReligiousBeliefs",
      "release": "2025-10-28T05:59:37Z",
      "duration": "00:03:37",
      "explicit": false,
      "youTubeId": "F--irvocg3I",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F--irvocg3I"
      }
    },
    {
      "id": "9d14ddd0-b38a-432b-8fd2-f0193fe439c3",
      "title": "3 Terrifying Mormon Blood Atonement Cults | Sisters Not Wives #15",
      "description": "Today, we dive deep into one of the darkest doctrines to ever come out of American religious extremism, Mormon blood atonement, and the chilling ways it has surfaced in modern history.\n\nWe break down three disturbing real world examples of cult leaders who justified violence in the name of God:\n\n• Ervil LeBaron: The so called Mormon Manson who ordered dozens of killings and ran his polygamist sect like a cartel\n• The Lafferty Brothers: Two extremists who believed they were commanded by God to carry out brutal “righteous” executions\n• Warren Jeffs: Still exerting power from prison with disturbing future prophecies that show just how dangerous blind faith can become\n\nBut this episode isn’t just about shocking crimes. We explore how ordinary people get pulled into cult thinking, the psychology of obedience, and the terrifying slippery slope that happens when religious conviction turns into moral exemption.\n\nWhy do people follow destructive leaders? How do belief systems twist into violence? And could this kind of extremism rise again in today’s polarized world?\n\nListen as we unpack the warning signs and why understanding these stories is more important now than ever.\n\n👉 Don’t forget to like, comment, and subscribe if you’re ready for more deep dives into faith, power, and the human psyche.\n\n#cults #truecrimepodcast #mormonhistory #religiousextremism #ervillebaron #laffertybrothers #warrenjeffs #fundamentalistmormon #psychology #blindobedience #truecrimecommunity #podcastclips #exmormon",
      "release": "2025-10-18T16:52:35Z",
      "duration": "01:01:33",
      "explicit": false,
      "spotifyId": "71U2ZYPegW5hmjQQBLchIw",
      "appleId": 1000732442721,
      "youTubeId": "kGOfx_obe2o",
      "subjects": [
        "FLDS Church",
        "Church of the First Born of the Lamb of God",
        "School Of Prophets",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/71U2ZYPegW5hmjQQBLchIw",
        "apple": "https://podcasts.apple.com/podcast/3-terrifying-mormon-blood-atonement-cults-sisters-not/id1818932495?i=1000732442721",
        "youtube": "https://www.youtube.com/watch?v=kGOfx_obe2o"
      }
    },
    {
      "id": "9c140718-62dd-493f-b22d-9802f2a3e445",
      "title": "Did We Accidentally Join a Cult in Utah? | Sisters Not Wives: # 14",
      "description": "Growing up in Utah, we were part of three different groups that, looking back, might’ve been more cult-like than we realized. In this episode, we revisit our teenage experiences, what was tied into money and power, and the red flags we missed along the way.\nFrom risky rituals to systematic exposure of trauma, and from homeschool gatherings to inner circles with a $20,000 entry fee—this is our deep dive into what happened to us as teenagers.\n🎧 Subscribe for more deep dives into hidden Utah history and current and past.\n#UtahCults #GrowingUpHomeschool #ExcultStories #FaithJourney #UtahHistory #CultAwareness #SistersNotWives ##UtahPodcast",
      "release": "2025-10-11T23:55:16Z",
      "duration": "01:16:28",
      "explicit": false,
      "spotifyId": "4dy7tiSszadSUM3Blzhfqr",
      "appleId": 1000731385474,
      "youTubeId": "26eD1Vifmtw",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4dy7tiSszadSUM3Blzhfqr",
        "apple": "https://podcasts.apple.com/podcast/did-we-accidentally-join-a-cult-in-utah-sisters-not-wives-14/id1818932495?i=1000731385474",
        "youtube": "https://www.youtube.com/watch?v=26eD1Vifmtw"
      }
    },
    {
      "id": "65dc788b-9b99-48a2-8157-0cd2556b5441",
      "title": "Sisters Not Wives: #13 The Mormon Makeover - How Utah Changed The Religion",
      "description": "After the end of Joseph Smith, Brigham Young led the Latter-day Saints west to the remote Utah Territory, but the move wasn’t just geographical. In this video, we dive deep into the surprising doctrinal changes and theological shifts introduced by Brigham Young that reshaped Mormonism as we know it.\n\nFrom Adam-God theory, The Law of Adoption, and increased emphasis on plural marriage, to the creation of a theocratic system in the Utah desert, this video explores how the LDS Church began to diverge from its original teachings...and why.\n\nWe’ll also examine how the rapidly changing world of the 19th century, from American expansionism to the discovery of gold in California, pushed the Mormons toward deeper isolationism, cultural preservation, and religious fundamentalism.\n\nIf you\u0027re interested in Mormon history, religious evolution, or the ways that belief systems adapt under pressure, this video is for you.\n\n👉 Don’t forget to like, subscribe, and share if you want more deep dives into Mormon doctrine, American religious history, and untold stories of faith in flux.\n#mormonhistory  #brighamyoung  #ldschurch  #exmormon  #churchhistory  #polygamy #doctrinalshift #hiddenhistory  #americanreligion #utahhistory  #19thcenturyamerica  #faithvsculture \n\nShow Notes:\nBrigham Young’s sermon the Adam-God Doctrine\n​​ Journal of Discourses. 1:50-51; Friday, April 9, 1852; Sermon delivered by President Brigham Young in the Salt Lake Tabernacle, SLC, Utah.\nhttps://contentdm.lib.byu.edu/digital/collection/JournalOfDiscourses3/id/1861/\nHeber C. Kimball Quote\n Journal of Wilford Woodruff; April 10, 1852; Quoting Heber C. Kimball.\nhttps://wilfordwoodruffpapers.org/documents/0c971e56-08d1-4e91-9ade-4fb00f2883f0/page/6d8e7243-1f50-4b30-a950-645434cfe26c \n\nHyrum Smith’s April 8th 1844 Sermon - I was wrong about this one. It wasn’t taken out of the JSP. There are apparently two versions from the records of the meeting when this sermon was delivered. The full transcript includes the crossed out section in the first link given below. When Brigham Young and the church leaders were writing “The History Of The Church” they decided to revise these records and write a short summary of what Hyrum’s speech was about, instead of including the full transcript of his words. In the summary, they curiously left out any mention of him speaking against polygamy and the difference between polygamy and eternal marriage. \nJoseph Smith Papers. History, 1838–1856, Volume E‑1 [1 July 1843–30 April 1844]. ID #8112. Edited transcript. Accessed September 28, 2025. https://www.josephsmithpapers.org/paper-summary/history-1838-1856-volume-e-1-1-july-1843-30-april-1844/1#full-transcript.\nShorter version omitting any mention of eternal marriage or polygamy:\nHistory, 1838–1856, volume E-1 [1 July 1843–30 April 1844] [addenda], p. 11 [addenda], The Joseph Smith Papers, accessed September 28, 2025, https://www.josephsmithpapers.org/paper-summary/history-1838-1856-volume-e-1-1-july-1843-30-april-1844/434?highlight=addenda%208%20april%201844 \n\nBrigham Young being sealed to 38 men source:\nBrooks, Juanita (1992) [1961], John Doyle Lee: Zealot, Pioneer Builder, Scapegoat, Logan, Utah: Utah State University Press, p. 73.\nSee also “Isn’t One Wife Enough?” By Kimball Young that includes Brigham Young quotes like there will be a time in the future \u0022when men would be sealed to men in the priesthood in a more solemn ordinance than that by which women were sealed to men, and in a room over that in which women were sealed to man.\u0022",
      "release": "2025-09-28T18:37:36Z",
      "duration": "00:58:05",
      "explicit": false,
      "spotifyId": "6pddOg3xPfxTKMkvN4xXc8",
      "appleId": 1000731385313,
      "youTubeId": "hB80kg3fYFQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6pddOg3xPfxTKMkvN4xXc8",
        "apple": "https://podcasts.apple.com/podcast/the-mormon-makeover-how-utah-changed-the-religion/id1818932495?i=1000731385313",
        "youtube": "https://www.youtube.com/watch?v=hB80kg3fYFQ"
      }
    },
    {
      "id": "cd5e3c76-5a3f-4548-a967-e52f95fc4173",
      "title": "Sisters Not Wives: #12 The Most Bizarre (and Hilarious) Mormon Homeschool Stories | Part 1",
      "description": "Today, we\u0027re taking a slightly different turn by talking about modern-day Mormonism, namely what it was like growing up in an extremely religious, conservative lds homeschool community in the early 2000s. Join or reminiscing and reenactments as we go down memory lane with some of the cringiest and hilarious stories that come up to the surface.",
      "release": "2025-09-23T01:37:19Z",
      "duration": "00:50:43",
      "explicit": false,
      "spotifyId": "588TOqcdBoBkXxJRiZXAkv",
      "appleId": 1000731381695,
      "youTubeId": "MDXpVCvLodQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/588TOqcdBoBkXxJRiZXAkv",
        "apple": "https://podcasts.apple.com/podcast/the-most-bizarre-and-hilarious-mormon-homeschool/id1818932495?i=1000731381695",
        "youtube": "https://www.youtube.com/watch?v=MDXpVCvLodQ"
      }
    },
    {
      "id": "681bae52-2244-4d1d-a225-db6ae467bb74",
      "title": "#11: Exploring the Roots of Mormon Feminism",
      "description": "In this episode, we take a look at the history of women\u0027s rights within the church and how they were slowly dismantled and changed.\n\nWith a mass exodus of women leaving religion, we discuss the challenges and obstacles in a system that still has gender-based power structures.\n\nAnd finally, listen in to hear a once common, then forbidden, and now forgotten matriarchal blessing full of beauty and power that made this the first episode we cried in.",
      "release": "2025-09-07T14:00:00Z",
      "duration": "00:56:53.7840000",
      "explicit": false,
      "spotifyId": "2DLSlStpy7AfbPZMcyYY3w",
      "appleId": 1000725379874,
      "youTubeId": "jHbQxIamplg",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2DLSlStpy7AfbPZMcyYY3w",
        "apple": "https://podcasts.apple.com/podcast/11-exploring-the-roots-of-mormon-feminism/id1818932495?i=1000725379874",
        "youtube": "https://www.youtube.com/watch?v=jHbQxIamplg"
      }
    },
    {
      "id": "e1cc0d8b-3ae3-4118-b2a0-924a70a4ff40",
      "title": "#10: The Polygamy Power Struggle | How Brigham Young Took Control",
      "description": "A murdered prophet. A power struggle. And a flood of hidden wives.",
      "release": "2025-08-17T15:00:00Z",
      "duration": "00:59:25.3600000",
      "explicit": false,
      "spotifyId": "07ofhNLjZr7iiSCbzzxEZA",
      "appleId": 1000722293536,
      "youTubeId": "CN1zCpjeM9U",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07ofhNLjZr7iiSCbzzxEZA",
        "apple": "https://podcasts.apple.com/podcast/10-the-polygamy-power-struggle-how-brigham-young-took/id1818932495?i=1000722293536",
        "youtube": "https://www.youtube.com/watch?v=CN1zCpjeM9U"
      }
    },
    {
      "id": "3a6a31d2-3989-436a-9ac3-2816be594433",
      "title": "#9 The Scripture Brigham Young Didn\u0027t Want You To See",
      "description": "In this episode of Sisters Not Wives, we uncover the scripture Brigham Young didn’t want you to see, one that directly contradicts the narrative he later built around Joseph Smith and plural marriage. This chapter, once part of LDS canon, mysteriously vanished as polygamy took hold. We dig into the historical records, analyze the scripture itself, and expose the efforts to rewrite church history to justify the rise of polygamy. If you\u0027ve ever wondered how doctrine can shift, and who gets to decide what stays and what goes, this is the episode for you. \u0026#x1f4dc; Hidden scripture. Shifting power. A battle for the soul of the early church. \u0026#x1f514; Don’t forget to like, subscribe, and share if you\u0027re ready to question the \u0022official\u0022 story around polygamy. #MormonHistory #LDSPolygamy #JosephSmith #BrighamYoung #ExMoPodcast #SistersNotWives",
      "release": "2025-08-10T13:00:00Z",
      "duration": "00:45:47.4250000",
      "explicit": false,
      "spotifyId": "1Levyj9OerL2QfJFvVRt6S",
      "appleId": 1000721379157,
      "youTubeId": "MLaKUMEvFvI",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Levyj9OerL2QfJFvVRt6S",
        "apple": "https://podcasts.apple.com/podcast/9-the-scripture-brigham-young-didnt-want-you-to-see/id1818932495?i=1000721379157",
        "youtube": "https://www.youtube.com/watch?v=MLaKUMEvFvI"
      }
    },
    {
      "id": "fd281fbd-24a9-4bcb-a059-07ec520ed87a",
      "title": "#8 Mormon Polygamy Stories | The Reputation Scandal | Fighting Over Sarah Pratt",
      "description": "In this eye-opening episode, we uncover the long-suppressed story of Sarah Pratt, the wife of early LDS apostle Orson Pratt, and the explosive scandal that shook the foundations of Nauvoo in the 1840s. While Orson was away on a mission, Sarah found herself entangled in a bitter power struggle between Joseph Smith, the founder of the Church of Jesus Christ of Latter-day Saints, and John C. Bennett, a former ally turned outspoken critic of Smith. Accused of infidelity, Sarah became the target of vicious rumors, claims she always denied. But was she a victim of a smear campaign? And what role did early polygamy and shifting power dynamics play in what happened to her? As Orson returned and ultimately accepted polygamy, rising within the church hierarchy, Sarah’s story faded into silence. Now, for the first time, we bring her narrative to light, revealing a complex, human story of loyalty, betrayal, and the hidden costs of religious authority. \u0026#x1f514; Subscribe for more forgotten stories from Mormon history and beyond. \u0026#x1f44d; Like and comment if you want to see more videos exploring the lives of early Latter-day Saint women. #MormonHistory #SarahPratt #JosephSmith #OrsonPratt #JohnCBennett #LDSChurch #Polygamy #UntoldStories #NauvooScandal",
      "release": "2025-08-03T13:00:00Z",
      "duration": "01:00:46.0930000",
      "explicit": false,
      "spotifyId": "3HvGEd9J3EejxwceKTTl44",
      "appleId": 1000720483347,
      "youTubeId": "XP0GXAHnV6Y",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3HvGEd9J3EejxwceKTTl44",
        "apple": "https://podcasts.apple.com/podcast/8-mormon-polygamy-stories-the-reputation-scandal/id1818932495?i=1000720483347",
        "youtube": "https://www.youtube.com/watch?v=XP0GXAHnV6Y"
      }
    },
    {
      "id": "94119420-d334-4ae3-93b2-1b019fc74646",
      "title": "#7 The Cult That Started Polygamy Before The Mormons",
      "description": "Before the mainstream Mormon Church embraced polygamy, another radical sect in the United States was already practicing it, and they were the ones who ended up being converted by the Mormons. In this episode, we dive deep into the little-known story of a cult-like religious group in early 19th-century Maine whose beliefs would profoundly shape early Mormon doctrine. Learn how eight of the twelve LDS apostles, sent as missionaries to England, encountered this group and then how their experiences helped influence the rise of polygamy in the church. Want to hear about Brigham Young\u0027s hot boy summer in Manchester and William Clayton\u0027s tell-all journals that look more like Love Island than missionary work? We gotchu.",
      "release": "2025-07-27T13:00:00Z",
      "duration": "01:08:00.8220000",
      "explicit": false,
      "spotifyId": "7HSwiDCySjAvmFKcL5Ukf7",
      "appleId": 1000719369518,
      "youTubeId": "N7Y5oOfvVRA",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7HSwiDCySjAvmFKcL5Ukf7",
        "apple": "https://podcasts.apple.com/podcast/7-the-cult-that-started-polygamy-before-the-mormons/id1818932495?i=1000719369518",
        "youtube": "https://www.youtube.com/watch?v=N7Y5oOfvVRA"
      }
    },
    {
      "id": "e6c295ef-7bcb-4498-8ba1-de221007de1f",
      "title": "#6 The Sketchy Mayor/Controversial Children\u0027s Picture Book about Polygamy",
      "description": "In this episode, we dive into the wild rise and fall of John C. Bennett, a man who swept into Nauvoo with charm and ambition, became the city\u0027s mayor, and then left a trail of scandal, betrayal, and chaos in his wake. From his political maneuvering to his secret spiritual wifery and eventual excommunication, Bennett’s story is a critical piece in understanding the backdrop of early Mormon polygamy.\n\nThen we fast forward to 2025, where a children\u0027s storybook about plural marriage recently made waves for its problematic moral lessons and highly sanitized take on one of the most fraught elements of church history. We talk about the backlash, the public response, and why packaging polygamy for kids is such a complicated and charged endeavor.\n\nNote: Since recording this episode, the children’s book has been edited due to the significant backlash it received. You can now find the revised version in the Church’s Gospel Library.",
      "release": "2025-07-24T01:52:25Z",
      "duration": "01:08:27.1570000",
      "explicit": false,
      "spotifyId": "1fwm5SGOAM2DZzRrmQVttn",
      "appleId": 1000718755387,
      "youTubeId": "UbzLuBh4bCc",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1fwm5SGOAM2DZzRrmQVttn",
        "apple": "https://podcasts.apple.com/podcast/6-the-sketchy-mayor-controversial-childrens-picture/id1818932495?i=1000718755387",
        "youtube": "https://www.youtube.com/watch?v=UbzLuBh4bCc"
      }
    },
    {
      "id": "f10162fb-3a2c-4e4f-90d7-5c6fdbcd2602",
      "title": "#5 Fires, Riots, and Murder in LDS History!",
      "description": "Today, we\u0027re investigating a particularly chaotic period in LDS Church history, marked by significant religious turmoil and historical violence. The context of the Mormons\u0027 time in Missouri is a key part of the story to fully understand the people who later became involved in polygamy and what shaped their psyches to influence their controversial actions and beliefs. The roots of Blood Atonement, a secret vigilante group known as The Danites, and Mormon hostility towards the government (that would lead to an even bigger war years later) all stem from this time period.\nLet\u0027s talk about it!",
      "release": "2025-06-15T15:00:00Z",
      "duration": "00:28:34.1080000",
      "explicit": false,
      "spotifyId": "0CMdBzugnks5LyUlZvOXaA",
      "appleId": 1000712966651,
      "youTubeId": "mGbWaybSMUQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CMdBzugnks5LyUlZvOXaA",
        "apple": "https://podcasts.apple.com/podcast/5-fires-riots-and-murder-in-lds-history/id1818932495?i=1000712966651",
        "youtube": "https://www.youtube.com/watch?v=mGbWaybSMUQ"
      }
    },
    {
      "id": "0962e49a-a588-4558-89f2-cd14d1c2e758",
      "title": "#4 What Happened During the Polygamy Era?",
      "description": "Before diving into the jaw-dropping personal stories tied to polygamy in Mormon history, we’re stepping back to lay the groundwork. This episode breaks down the key events: from the Church\u0027s founding in 1830, through the rise of plural marriage, to its official end in 1904 when the LDS Church declared polygamists would be excommunicated.\n\nBut there’s more: we’ll also trace how these events splintered the movement, leading to the creation of major offshoots like the LDS, RLDS, and FLDS churches. If the history of Mormon polygamy feels confusing or fragmented, this episode will connect the dots—and probably surprise you in the process.",
      "release": "2025-06-08T14:04:11Z",
      "duration": "00:55:12.9320000",
      "explicit": false,
      "spotifyId": "2ZCjU6CpDU3X21V1L6ZBIH",
      "appleId": 1000711993488,
      "youTubeId": "AVCLP5VAxNY",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZCjU6CpDU3X21V1L6ZBIH",
        "apple": "https://podcasts.apple.com/podcast/4-what-happened-during-the-polygamy-era/id1818932495?i=1000711993488",
        "youtube": "https://www.youtube.com/watch?v=AVCLP5VAxNY"
      }
    },
    {
      "id": "c5b2a2e3-722b-4d56-b240-07073f435d2b",
      "title": "#3 Fanny Alger: The Forgotten Beginning of Mormon Polygamy",
      "description": "This is the origin story for polygamy in Mormonism and where our jorney begins...\nSadly, we do not have any records from Fanny herself, but quite a number of people had things to say about her and Joseph Smith and we are diving into the sources that have been relied upon most heavily in their narrative. Was this the start of a holy practice sanctified by religion? Was it a scandalous affair? Or was it something else entirely?\nLet\u0027s talk about it!",
      "release": "2025-06-08T12:20:49Z",
      "duration": "01:02:53.7300000",
      "explicit": false,
      "spotifyId": "5jTI5if2zixXFqrnQZ8pKo",
      "appleId": 1000711989064,
      "youTubeId": "MH9W_sMF0IM",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jTI5if2zixXFqrnQZ8pKo",
        "apple": "https://podcasts.apple.com/podcast/3-fanny-alger-the-forgotten-beginning-of-mormon-polygamy/id1818932495?i=1000711989064",
        "youtube": "https://www.youtube.com/watch?v=MH9W_sMF0IM"
      }
    },
    {
      "id": "569b10c3-33a8-4a57-b523-6fe6a3468155",
      "title": "#2: Leaving the LDS Church - Joslyn\u0027s Story",
      "description": "We decided to do this podcast together to have an open discussion from two different viewpoints. Last week, Kensley told some of her experience and her story of choosing to stay in the LDS Church and looking into Church History and particularly the history of polygamy. A lot of people asked to hear Joslyn\u0027s story who is no longer in the Church. In this episode, we talk about our upbringing, her experiences, what a faith transition can do to your life, and why it\u0027s important to have these kind of conversations with people from different perspectives.",
      "release": "2025-06-08T11:59:35Z",
      "duration": "00:42:59.6270000",
      "explicit": false,
      "spotifyId": "6K6GLOVBWFF1uJuJpzTQqw",
      "appleId": 1000711987755,
      "youTubeId": "NhOFExUC-Wc",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6K6GLOVBWFF1uJuJpzTQqw",
        "apple": "https://podcasts.apple.com/podcast/2-leaving-the-lds-church-joslyns-story/id1818932495?i=1000711987755",
        "youtube": "https://www.youtube.com/watch?v=NhOFExUC-Wc"
      }
    },
    {
      "id": "55ed78c7-96c8-40b7-9a2c-6157597afb6e",
      "title": "#1: Mormon Polygamy from Female Perspectives",
      "description": "Welcome to the first episode of our podcast Sisters Not Wives where we are looking at the history of Mormon polygamy from a female lens. This topic that has always been controversial and hence silenced and suppressed in the past and today. We\u0027re two sisters openly discussing the history of polygamy in the Church of Jesus Christ of Latter Day Saints, also known as Mormon polygamy; what actually happened and how it still is impacting our beliefs, culture, and lives.\n\nPolygamy is generally either dismissed as irrelevant because the LDS church doesn\u0027t actively practice it today or it\u0027s quickly explained away using logical fallacies or claims to authority. Yet, issues such as divorce, celestial marriage, gender inequality, obedience, motherhood, fatherhood, loneliness, and many more are topics that are more relevant than ever in our day and all have roots in polygamy. So let\u0027s talk about it...",
      "release": "2025-06-06T02:27:41Z",
      "duration": "00:56:56.1080000",
      "explicit": false,
      "spotifyId": "1ZjLMxkNjhawCxbWHDpwgc",
      "appleId": 1000711767514,
      "youTubeId": "B0OPYNtsHV4",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ZjLMxkNjhawCxbWHDpwgc",
        "apple": "https://podcasts.apple.com/podcast/1-mormon-polygamy-from-female-perspectives/id1818932495?i=1000711767514",
        "youtube": "https://www.youtube.com/watch?v=B0OPYNtsHV4"
      }
    }
  ]
}