{
  "id": "27281b25-5199-48d6-97da-30b7c2e53543",
  "name": "Sisters Not Wives",
  "spotifyId": "6Ami5idZ4k2o5ZPT7mU2Zh",
  "appleId": 1818932495,
  "youTubeChannelId": "UCEWohgkI089Vj2hnCMLQ9ew",
  "episodes": [
    {
      "id": "e1cc0d8b-3ae3-4118-b2a0-924a70a4ff40",
      "title": "#10: The Polygamy Power Struggle | How Brigham Young Took Control",
      "description": "A murdered prophet. A power struggle. And a flood of hidden wives.",
      "release": "2025-08-17T15:00:00Z",
      "duration": "00:59:25.3600000",
      "explicit": false,
      "spotifyId": "07ofhNLjZr7iiSCbzzxEZA",
      "appleId": 1000722293536,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07ofhNLjZr7iiSCbzzxEZA",
        "apple": "https://podcasts.apple.com/podcast/10-the-polygamy-power-struggle-how-brigham-young-took/id1818932495?i=1000722293536"
      }
    },
    {
      "id": "3a6a31d2-3989-436a-9ac3-2816be594433",
      "title": "#9 The Scripture Brigham Young Didn\u0027t Want You To See",
      "description": "In this episode of Sisters Not Wives, we uncover the scripture Brigham Young didn’t want you to see, one that directly contradicts the narrative he later built around Joseph Smith and plural marriage. This chapter, once part of LDS canon, mysteriously vanished as polygamy took hold. We dig into the historical records, analyze the scripture itself, and expose the efforts to rewrite church history to justify the rise of polygamy. If you\u0027ve ever wondered how doctrine can shift, and who gets to decide what stays and what goes, this is the episode for you. \u0026#x1f4dc; Hidden scripture. Shifting power. A battle for the soul of the early church. \u0026#x1f514; Don’t forget to like, subscribe, and share if you\u0027re ready to question the \u0022official\u0022 story around polygamy. #MormonHistory #LDSPolygamy #JosephSmith #BrighamYoung #ExMoPodcast #SistersNotWives",
      "release": "2025-08-10T13:00:00Z",
      "duration": "00:45:47.4250000",
      "explicit": false,
      "spotifyId": "1Levyj9OerL2QfJFvVRt6S",
      "appleId": 1000721379157,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Levyj9OerL2QfJFvVRt6S",
        "apple": "https://podcasts.apple.com/podcast/9-the-scripture-brigham-young-didnt-want-you-to-see/id1818932495?i=1000721379157"
      }
    },
    {
      "id": "fd281fbd-24a9-4bcb-a059-07ec520ed87a",
      "title": "#8 Mormon Polygamy Stories | The Reputation Scandal | Fighting Over Sarah Pratt",
      "description": "In this eye-opening episode, we uncover the long-suppressed story of Sarah Pratt, the wife of early LDS apostle Orson Pratt, and the explosive scandal that shook the foundations of Nauvoo in the 1840s. While Orson was away on a mission, Sarah found herself entangled in a bitter power struggle between Joseph Smith, the founder of the Church of Jesus Christ of Latter-day Saints, and John C. Bennett, a former ally turned outspoken critic of Smith. Accused of infidelity, Sarah became the target of vicious rumors, claims she always denied. But was she a victim of a smear campaign? And what role did early polygamy and shifting power dynamics play in what happened to her? As Orson returned and ultimately accepted polygamy, rising within the church hierarchy, Sarah’s story faded into silence. Now, for the first time, we bring her narrative to light, revealing a complex, human story of loyalty, betrayal, and the hidden costs of religious authority. \u0026#x1f514; Subscribe for more forgotten stories from Mormon history and beyond. \u0026#x1f44d; Like and comment if you want to see more videos exploring the lives of early Latter-day Saint women. #MormonHistory #SarahPratt #JosephSmith #OrsonPratt #JohnCBennett #LDSChurch #Polygamy #UntoldStories #NauvooScandal",
      "release": "2025-08-03T13:00:00Z",
      "duration": "01:00:46.0930000",
      "explicit": false,
      "spotifyId": "3HvGEd9J3EejxwceKTTl44",
      "appleId": 1000720483347,
      "youTubeId": "XP0GXAHnV6Y",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3HvGEd9J3EejxwceKTTl44",
        "apple": "https://podcasts.apple.com/podcast/8-mormon-polygamy-stories-the-reputation-scandal/id1818932495?i=1000720483347",
        "youtube": "https://www.youtube.com/watch?v=XP0GXAHnV6Y"
      }
    },
    {
      "id": "94119420-d334-4ae3-93b2-1b019fc74646",
      "title": "#7 The Cult That Started Polygamy Before The Mormons",
      "description": "Before the mainstream Mormon Church embraced polygamy, another radical sect in the United States was already practicing it, and they were the ones who ended up being converted by the Mormons. In this episode, we dive deep into the little-known story of a cult-like religious group in early 19th-century Maine whose beliefs would profoundly shape early Mormon doctrine. Learn how eight of the twelve LDS apostles, sent as missionaries to England, encountered this group and then how their experiences helped influence the rise of polygamy in the church. Want to hear about Brigham Young\u0027s hot boy summer in Manchester and William Clayton\u0027s tell-all journals that look more like Love Island than missionary work? We gotchu.",
      "release": "2025-07-27T13:00:00Z",
      "duration": "01:08:00.8220000",
      "explicit": false,
      "spotifyId": "7HSwiDCySjAvmFKcL5Ukf7",
      "appleId": 1000719369518,
      "youTubeId": "N7Y5oOfvVRA",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7HSwiDCySjAvmFKcL5Ukf7",
        "apple": "https://podcasts.apple.com/podcast/7-the-cult-that-started-polygamy-before-the-mormons/id1818932495?i=1000719369518",
        "youtube": "https://www.youtube.com/watch?v=N7Y5oOfvVRA"
      }
    },
    {
      "id": "e6c295ef-7bcb-4498-8ba1-de221007de1f",
      "title": "#6 The Sketchy Mayor/Controversial Children\u0027s Picture Book about Polygamy",
      "description": "In this episode, we dive into the wild rise and fall of John C. Bennett, a man who swept into Nauvoo with charm and ambition, became the city\u0027s mayor, and then left a trail of scandal, betrayal, and chaos in his wake. From his political maneuvering to his secret spiritual wifery and eventual excommunication, Bennett’s story is a critical piece in understanding the backdrop of early Mormon polygamy.\n\nThen we fast forward to 2025, where a children\u0027s storybook about plural marriage recently made waves for its problematic moral lessons and highly sanitized take on one of the most fraught elements of church history. We talk about the backlash, the public response, and why packaging polygamy for kids is such a complicated and charged endeavor.\n\nNote: Since recording this episode, the children’s book has been edited due to the significant backlash it received. You can now find the revised version in the Church’s Gospel Library.",
      "release": "2025-07-24T01:52:25Z",
      "duration": "01:08:27.1570000",
      "explicit": false,
      "spotifyId": "1fwm5SGOAM2DZzRrmQVttn",
      "appleId": 1000718755387,
      "youTubeId": "UbzLuBh4bCc",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1fwm5SGOAM2DZzRrmQVttn",
        "apple": "https://podcasts.apple.com/podcast/6-the-sketchy-mayor-controversial-childrens-picture/id1818932495?i=1000718755387",
        "youtube": "https://www.youtube.com/watch?v=UbzLuBh4bCc"
      }
    },
    {
      "id": "f10162fb-3a2c-4e4f-90d7-5c6fdbcd2602",
      "title": "#5 Fires, Riots, and Murder in LDS History!",
      "description": "Today, we\u0027re investigating a particularly chaotic period in LDS Church history, marked by significant religious turmoil and historical violence. The context of the Mormons\u0027 time in Missouri is a key part of the story to fully understand the people who later became involved in polygamy and what shaped their psyches to influence their controversial actions and beliefs. The roots of Blood Atonement, a secret vigilante group known as The Danites, and Mormon hostility towards the government (that would lead to an even bigger war years later) all stem from this time period.\nLet\u0027s talk about it!",
      "release": "2025-06-15T15:00:00Z",
      "duration": "00:28:34.1080000",
      "explicit": false,
      "spotifyId": "0CMdBzugnks5LyUlZvOXaA",
      "appleId": 1000712966651,
      "youTubeId": "mGbWaybSMUQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CMdBzugnks5LyUlZvOXaA",
        "apple": "https://podcasts.apple.com/podcast/5-fires-riots-and-murder-in-lds-history/id1818932495?i=1000712966651",
        "youtube": "https://www.youtube.com/watch?v=mGbWaybSMUQ"
      }
    },
    {
      "id": "0962e49a-a588-4558-89f2-cd14d1c2e758",
      "title": "#4 What Happened During the Polygamy Era?",
      "description": "Before diving into the jaw-dropping personal stories tied to polygamy in Mormon history, we’re stepping back to lay the groundwork. This episode breaks down the key events: from the Church\u0027s founding in 1830, through the rise of plural marriage, to its official end in 1904 when the LDS Church declared polygamists would be excommunicated.\n\nBut there’s more: we’ll also trace how these events splintered the movement, leading to the creation of major offshoots like the LDS, RLDS, and FLDS churches. If the history of Mormon polygamy feels confusing or fragmented, this episode will connect the dots—and probably surprise you in the process.",
      "release": "2025-06-08T14:04:11Z",
      "duration": "00:55:12.9320000",
      "explicit": false,
      "spotifyId": "2ZCjU6CpDU3X21V1L6ZBIH",
      "appleId": 1000711993488,
      "youTubeId": "AVCLP5VAxNY",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZCjU6CpDU3X21V1L6ZBIH",
        "apple": "https://podcasts.apple.com/podcast/4-what-happened-during-the-polygamy-era/id1818932495?i=1000711993488",
        "youtube": "https://www.youtube.com/watch?v=AVCLP5VAxNY"
      }
    },
    {
      "id": "c5b2a2e3-722b-4d56-b240-07073f435d2b",
      "title": "#3 Fanny Alger: The Forgotten Beginning of Mormon Polygamy",
      "description": "This is the origin story for polygamy in Mormonism and where our jorney begins...\nSadly, we do not have any records from Fanny herself, but quite a number of people had things to say about her and Joseph Smith and we are diving into the sources that have been relied upon most heavily in their narrative. Was this the start of a holy practice sanctified by religion? Was it a scandalous affair? Or was it something else entirely?\nLet\u0027s talk about it!",
      "release": "2025-06-08T12:20:49Z",
      "duration": "01:02:53.7300000",
      "explicit": false,
      "spotifyId": "5jTI5if2zixXFqrnQZ8pKo",
      "appleId": 1000711989064,
      "youTubeId": "MH9W_sMF0IM",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jTI5if2zixXFqrnQZ8pKo",
        "apple": "https://podcasts.apple.com/podcast/3-fanny-alger-the-forgotten-beginning-of-mormon-polygamy/id1818932495?i=1000711989064",
        "youtube": "https://www.youtube.com/watch?v=MH9W_sMF0IM"
      }
    },
    {
      "id": "569b10c3-33a8-4a57-b523-6fe6a3468155",
      "title": "#2: Leaving the LDS Church - Joslyn\u0027s Story",
      "description": "We decided to do this podcast together to have an open discussion from two different viewpoints. Last week, Kensley told some of her experience and her story of choosing to stay in the LDS Church and looking into Church History and particularly the history of polygamy. A lot of people asked to hear Joslyn\u0027s story who is no longer in the Church. In this episode, we talk about our upbringing, her experiences, what a faith transition can do to your life, and why it\u0027s important to have these kind of conversations with people from different perspectives.",
      "release": "2025-06-08T11:59:35Z",
      "duration": "00:42:59.6270000",
      "explicit": false,
      "spotifyId": "6K6GLOVBWFF1uJuJpzTQqw",
      "appleId": 1000711987755,
      "youTubeId": "NhOFExUC-Wc",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6K6GLOVBWFF1uJuJpzTQqw",
        "apple": "https://podcasts.apple.com/podcast/2-leaving-the-lds-church-joslyns-story/id1818932495?i=1000711987755",
        "youtube": "https://www.youtube.com/watch?v=NhOFExUC-Wc"
      }
    },
    {
      "id": "55ed78c7-96c8-40b7-9a2c-6157597afb6e",
      "title": "#1: Mormon Polygamy from Female Perspectives",
      "description": "Welcome to the first episode of our podcast Sisters Not Wives where we are looking at the history of Mormon polygamy from a female lens. This topic that has always been controversial and hence silenced and suppressed in the past and today. We\u0027re two sisters openly discussing the history of polygamy in the Church of Jesus Christ of Latter Day Saints, also known as Mormon polygamy; what actually happened and how it still is impacting our beliefs, culture, and lives.\n\nPolygamy is generally either dismissed as irrelevant because the LDS church doesn\u0027t actively practice it today or it\u0027s quickly explained away using logical fallacies or claims to authority. Yet, issues such as divorce, celestial marriage, gender inequality, obedience, motherhood, fatherhood, loneliness, and many more are topics that are more relevant than ever in our day and all have roots in polygamy. So let\u0027s talk about it...",
      "release": "2025-06-06T02:27:41Z",
      "duration": "00:56:56.1080000",
      "explicit": false,
      "spotifyId": "1ZjLMxkNjhawCxbWHDpwgc",
      "appleId": 1000711767514,
      "youTubeId": "B0OPYNtsHV4",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ZjLMxkNjhawCxbWHDpwgc",
        "apple": "https://podcasts.apple.com/podcast/1-mormon-polygamy-from-female-perspectives/id1818932495?i=1000711767514",
        "youtube": "https://www.youtube.com/watch?v=B0OPYNtsHV4"
      }
    }
  ]
}