{
  "_ts": 0,
  "id": "9186dc14-6057-4e40-9e93-310e07b752aa",
  "name": "Sisters Declassified Life Survival Guide: Two sisters with four daughters; dishing drama, trauma and survival tips for the everyday.",
  "spotifyId": "6iItmBb8ACgSrLwYfo9SsN",
  "appleId": 1704345082,
  "episodes": [
    {
      "id": "42fa8661-f047-488f-a203-b8cc9b03771c",
      "title": "Education vs. Butker",
      "description": "Controversy erupted at Benedictine College\u0027s graduation, and we pull no punches dissecting the speech that sparked heated debates. The address, which seemed to diminish women\u0027s roles to domesticity, despite their academic achievements, gets a critical analysis from us. We respect personal choices in homemaking, but we won\u0027t shy away from challenging views that threaten to undermine women\u0027s broader aspirations. Plus, we don\u0027t hold back on discussing the delicate interplay between Catholic doctrine on birth control and the responsibility of public speech. Turning our gaze to the many cracks in the public education system, we expose the urgent need for literacy and self-education. Stories of individuals who\u0027ve taken their learning into their own hands despite systemic failures underscore our conversation. We confront the stark realities of special education tracks, the weight of parental expectations, and the debilitating pressure of standardized tests—like the dreaded STAR tests in Texas. Ending on a personal note, I recount the disappointment of a lackluster university commencement, which left families like mine feeling undervalued after our investment in education. Join us for a candid exploration of how learning should truly prepare us for the journey ahead. Thanks for listening!",
      "release": "2024-05-24T06:00:00Z",
      "duration": "01:01:02.2620000",
      "explicit": false,
      "spotifyId": "3NhRi2KoxpDMdSGzZiFHCU",
      "appleId": 1000656602771,
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3NhRi2KoxpDMdSGzZiFHCU",
        "apple": "https://podcasts.apple.com/podcast/education-vs-butker/id1704345082?i=1000656602771"
      }
    },
    {
      "id": "5ae3e958-e270-4d46-a4dc-cfbb8796872a",
      "title": "Indoctrination Podcast with Rachel Bernstein, Part 2",
      "description": "Stepping out of the shadows of a cult\u0027s influence is a journey fraught with challenges and triumphs; Rachel and Liz are testaments to this arduous path toward freedom. Our latest episode is a riveting exploration of their escape and the myths and stereotypes about women that often underpin such oppressive environments. These sisters, one a mother and movement specialist from Southern California, the other a grandmother and entrepreneur from Oklahoma, lay bare their hearts, detailing the critical moments that propelled them to seek a life beyond the cult\u0027s confines. Their stories are not just about breaking free but also the healing that follows, illustrating the potent blend of vulnerability and strength that has shaped their new beginnings. The complexities of leaving a cult do not end at the decision to walk away; the aftermath is a labyrinth of emotional and legal challenges that many survivors face. In this episode, Rachel and Liz lead us through the dark corridors of fear and intimidation that loom over those who dare to leave. From confronting developmental delays to facing the backlash of a community that once promised safety, they share their personal experiences with a candor that is as enlightening as it is heart-wrenching. Their insights offer a deeper understanding of the psychological barriers that cult survivors must overcome and the resilience required to rebuild a life grounded in autonomy and self-discovery. This conversation is not just about the shadows but also the light at the end of the tunnel—the reclaiming of body positivity, personal identity, and the simple yet revolutionary act of donning a bikini for the first time. Rachel and Liz\u0027s empowering narratives underscore the transformative power of questioning norms and forging an individual path. As they articulate the value of ongoing healing and the freedom to choose one\u0027s beliefs, their stories are a powerful reminder of the courage it takes to step into the unknown and the profound personal growth that awaits on the other side. Join us for an episode that celebrates the indomitable human spirit and the boundless possibilities that can emerge from the depths of adversity. Thanks for listening!",
      "release": "2024-05-17T06:00:00Z",
      "duration": "01:08:03.1210000",
      "explicit": false,
      "spotifyId": "7oNr8bb5eqJy2jtOAb18g0",
      "appleId": 1000655885364,
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7oNr8bb5eqJy2jtOAb18g0",
        "apple": "https://podcasts.apple.com/podcast/indoctrination-podcast-with-rachel-bernstein-part-2/id1704345082?i=1000655885364"
      }
    },
    {
      "id": "dbb0448b-fa98-4a8c-949d-f49b3265f686",
      "title": "IndoctriNation with Rachel Bernstein, Liz and Rachel Part 1",
      "description": "Embarking on a path to freedom demands courage, a truth Rachel Holt and Liz Humble know all too well. As survivor sisters, they share their gripping tales of escaping the IFB cult, navigating the aftershocks of a controlled upbringing, and the liberating struggle towards healing. Their book, \u0022The King James Virgins,\u0022 serves as a backdrop to a candid conversation that also spills into their podcast, \u0022Sisters Declassified Life Survival Guide,\u0022 where they fuse life lessons with actionable advice for those walking similar paths to recovery. Parenting after cult life presents an intricate dance between providing structure and fostering independence. The sisters delve into their personal experiences, discussing the critical role of supportive partners and the importance of family in reassembling a life once dictated by oppressive control. Their stories of raising children in the shadow of their past resonate deeply, offering a beacon to others striving to break free from generational cycles of restriction. In an atmosphere where trust is often a casualty of betrayal, Rachel and Liz courageously confront the darker chapters of their past. They engage in a raw reflection on abuse, the complexities of finding trustworthy therapeutic support, and the power of owning one\u0027s narrative. Their journey is a testament to resilience, a guidepost for navigating the murky waters of trauma, and an invitation to listeners to embark on their own journey of healing, bolstered by the strength found in honesty, humility, and sisterhood. Thanks for listening!",
      "release": "2024-05-03T06:00:00Z",
      "duration": "01:12:14.9680000",
      "explicit": false,
      "spotifyId": "5rpCTSI1VOLAmlgrkSLW82",
      "appleId": 1000654330429,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rpCTSI1VOLAmlgrkSLW82",
        "apple": "https://podcasts.apple.com/podcast/indoctrination-with-rachel-bernstein-liz-and-rachel-part-1/id1704345082?i=1000654330429"
      }
    }
  ]
}