{
  "_ts": 0,
  "id": "9186dc14-6057-4e40-9e93-310e07b752aa",
  "name": "Sisters Declassified Life Survival Guide: Two sisters with four daughters; dishing drama, trauma and survival tips for the everyday.",
  "spotifyId": "6iItmBb8ACgSrLwYfo9SsN",
  "appleId": 1704345082,
  "episodes": [
    {
      "id": "dbb0448b-fa98-4a8c-949d-f49b3265f686",
      "title": "IndoctriNation with Rachel Bernstein, Liz and Rachel Part 1",
      "description": "Embarking on a path to freedom demands courage, a truth Rachel Holt and Liz Humble know all too well. As survivor sisters, they share their gripping tales of escaping the IFB cult, navigating the aftershocks of a controlled upbringing, and the liberating struggle towards healing. Their book, \u0022The King James Virgins,\u0022 serves as a backdrop to a candid conversation that also spills into their podcast, \u0022Sisters Declassified Life Survival Guide,\u0022 where they fuse life lessons with actionable advice for those walking similar paths to recovery. Parenting after cult life presents an intricate dance between providing structure and fostering independence. The sisters delve into their personal experiences, discussing the critical role of supportive partners and the importance of family in reassembling a life once dictated by oppressive control. Their stories of raising children in the shadow of their past resonate deeply, offering a beacon to others striving to break free from generational cycles of restriction. In an atmosphere where trust is often a casualty of betrayal, Rachel and Liz courageously confront the darker chapters of their past. They engage in a raw reflection on abuse, the complexities of finding trustworthy therapeutic support, and the power of owning one\u0027s narrative. Their journey is a testament to resilience, a guidepost for navigating the murky waters of trauma, and an invitation to listeners to embark on their own journey of healing, bolstered by the strength found in honesty, humility, and sisterhood. Thanks for listening!",
      "release": "2024-05-03T06:00:00Z",
      "duration": "01:12:14.9680000",
      "explicit": false,
      "spotifyId": "5rpCTSI1VOLAmlgrkSLW82",
      "appleId": 1000654330429,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rpCTSI1VOLAmlgrkSLW82",
        "apple": "https://podcasts.apple.com/podcast/indoctrination-with-rachel-bernstein-liz-and-rachel-part-1/id1704345082?i=1000654330429"
      }
    }
  ]
}