{
  "_ts": 0,
  "id": "021a9017-4a02-4daf-ac2c-6beaa97d5ece",
  "name": "Sixteenth Minute (of Fame)",
  "spotifyId": "5sCioSaEXylfv9CwRW26Cn",
  "appleId": 1743960803,
  "episodes": [
    {
      "id": "a3dd39fa-875c-493d-8c3b-c061cab89d99",
      "title": "why are there so many mormon influencers? pt. 2",
      "description": "In part two of this definitely minisode series, Jamie talks with ex-Mormon YouTuber and author of How to Leave the Mormon Church: An Ex-Mormons Guide to Rebuilding After Religion Alyssa Grenfell about how the LDS may have found a back channel to bankroll its most powerful influencers, without leaving a paper trail. Alyssa walks Jamie through how she thinks it\u0027s done, and how the LDS has succeeded and fumbled its relationships with influencers in the past. Buy Alyssa\u0027s book!: https://www.howtoleavethemormonchurch.com/about Watch Alyssa\u0027s full theory here: https://www.youtube.com/watch?v=MGXggLIafrc Subscribe to Alyssa\u0027s channel here: https://www.youtube.com/@alyssadgrenfell See omnystudio.com/listener for privacy information.",
      "release": "2024-09-12T04:00:00Z",
      "duration": "00:56:03.7870000",
      "explicit": false,
      "spotifyId": "6juaZcKOJK96yHgyXuK9Ya",
      "appleId": 1000669234905,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6juaZcKOJK96yHgyXuK9Ya",
        "apple": "https://podcasts.apple.com/podcast/why-are-there-so-many-mormon-influencers-pt-2/id1743960803?i=1000669234905"
      }
    },
    {
      "id": "0c6dac5c-9d06-452f-b8a1-62f8d427ed58",
      "title": "why are there so many mormon influencers? pt. 1",
      "description": "This week, Jamie takes a treacherous voyage into a complicated question -- why on Earth are there so many successful Mormon influencers? In this two-part series, she looks at how the origins and the values of the Mormon church deceptively align with the conservative \u0022tradwife\u0022 influencing space of today... and yes, she will get into the tradwives. Contained herein: Joseph Smith shoving his face into a hat, a new Hulu reality series that is deceptively boring, Ballerina Farm, and the Mormons\u0027 early success in the conservative mommy blogging space. Tune in for part 2, where ex-Mormon Alyssa Grenfell poses a theory at how the Church of Latter Day Saints stays two steps ahead of it all. See omnystudio.com/listener for privacy information.",
      "release": "2024-09-10T04:00:00Z",
      "duration": "00:59:44.8620000",
      "explicit": false,
      "spotifyId": "4Hk9n25Hx3RWbaWcGypulj",
      "appleId": 1000668967664,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Hk9n25Hx3RWbaWcGypulj",
        "apple": "https://podcasts.apple.com/podcast/why-are-there-so-many-mormon-influencers-pt-1/id1743960803?i=1000668967664"
      }
    }
  ]
}