{
  "_ts": 0,
  "id": "31bdb96b-6a3d-4207-9d83-b53573da52d4",
  "name": "The Michael Shermer Show",
  "spotifyId": "4eDCVvVXJVwKCa0QfNbuXA",
  "appleId": 1352860989,
  "youTubeChannelId": "UCfsuI3-92QNO3DVy06PO9wg",
  "episodes": [
    {
      "id": "6fe2727f-c637-4547-b08d-32725cc35676",
      "title": "Surviving the Ultra-Religious Family Cult “The Field”",
      "description": "The Michael Shermer Show # 441 \n\nMichelle Dowd was born into an ultra-religious cult, “The Field,” started in the 1930s by her grandfather, who convinced generations of young male followers that he would live five hundred years and ascend to the heavens when doomsday came.\n\nMichelle Dowd is a professor of journalism at Chaffey College and contributor to The New York Times, Alpinist, The Los Angeles Book Review, Catapult, OnlySky, and other national publications. She founded The Chaffey Review, an award-winning literary journal, advises student media, teaches poetry and critical thinking in the California State prisons, and has been recognized as a Longreads Top 5 for The Thing with Feathers, on the relationship between environmentalism and hope. Her memoir is Forager: Field Notes for Surviving a Family Cult.\n\nSUPPORT THE PODCAST\nIf you enjoy the podcast, please show your support by making a $5 or $10 monthly donation.\nhttps://www.skeptic.com/donate/\n\n#michaelshermer\n#skeptic\n\nListen to The Michael Shermer Show or subscribe directly on YouTube, Apple Podcasts, Spotify, Amazon Music, and Google Podcasts.\nhttps://www.skeptic.com/michael-shermer-show/",
      "release": "2024-06-18T19:56:33Z",
      "duration": "01:09:08",
      "explicit": false,
      "spotifyId": "150btmuTPxJpeZ1IfGfDAn",
      "appleId": 1000659437049,
      "youTubeId": "oidUZbBxJTM",
      "subjects": [
        "Kare Youth League",
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/150btmuTPxJpeZ1IfGfDAn",
        "apple": "https://podcasts.apple.com/podcast/born-into-a-cult-michelle-dowd/id1352860989?i=1000659437049",
        "youtube": "https://www.youtube.com/watch?v=oidUZbBxJTM"
      }
    }
  ]
}