{
  "id": "e51e0165-9bf1-4a5f-9dd5-e8b6614af8af",
  "name": "Skeptics in the Pub Online",
  "spotifyId": "0HwZWFItdaWCzLdk8yulC1",
  "appleId": 1614613301,
  "youTubeChannelId": "UCk8VxXlmwhi4NBje8NxCtgw",
  "episodes": [
    {
      "id": "6bde15f3-9e3b-4ead-908c-3bf29b710612",
      "title": "Building bridges – how to talk to conspiracy believers - Ulrike Schiesser",
      "description": "Streamed live on 26th January 2023\n\nIn the last two years conspiracy theories seemed to have spread like a different kind of virus even to people, we would never have expected to be susceptible. Discussions have been unavoidable and ugly, we lost friends, saw family members drifting away and experienced an increasing radicalization.\n\nHow to respond to conspiracy narratives? Why do people believe them in the first place? Are some more susceptible to it than others? What are good conversation strategies? Should you break off contact? What if it involves close relatives? How can we connect despite different world views?\n\nUlrike Schiesser is a psychologist and psychotherapist working at the Federal Office for Cult Affaires (Bundesstelle für Sektenfragen) an Austrian state-run office who who deals with cults and various problematic developments in the field of esotericism, personality cults, authoritarian and monopolizing group structures and conspiracy theories. She does counselling of family members of conspiracy affiliated persons and public stakeholders and accompanies people through rethinking and change processes.\n\nChapters:\n0:00 Intro\n4:26 Talk\n50:50 Q\u0026A",
      "release": "2023-01-29T08:00:10Z",
      "duration": "01:18:09",
      "explicit": false,
      "spotifyId": "0mQPPg0D7bygOtjRya0QTx",
      "appleId": 1000597106015,
      "youTubeId": "NSlMnI-KoYQ",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0mQPPg0D7bygOtjRya0QTx",
        "apple": "https://podcasts.apple.com/podcast/building-bridges-how-to-talk-to-conspiracy-believers/id1614613301?i=1000597106015",
        "youtube": "https://www.youtube.com/watch?v=NSlMnI-KoYQ"
      }
    }
  ]
}