{
  "id": "31bdb96b-6a3d-4207-9d83-b53573da52d4",
  "name": "The Michael Shermer Show",
  "spotifyId": "4eDCVvVXJVwKCa0QfNbuXA",
  "appleId": 1352860989,
  "youTubeChannelId": "UCfsuI3-92QNO3DVy06PO9wg",
  "episodes": [
    {
      "id": "e8b61737-0cbc-4514-a0fc-f71c89ecedb3",
      "title": "Why No One Thinks They’re in a Cult",
      "description": "What really defines a cult—and why do smart, well-intentioned people get caught up in them? In this episode, Michael Shermer sits down with cult intervention specialist Ashlen Hilliard to explore the psychology of high-control groups and the people drawn into them. Her work has been featured in prominent media outlets like Hulu, NewsNation, HuffPost, and BET\u0026#43;. In 2022, Ashlen founded People Leave Cults, offering intervention and recovery resources for survivors and concerned loved ones. As one of the few Cult Intervention Specialists in the country, Ashlen consults with a team of experts to develop personalized intervention strategies for families that have a loved one involved in a range of coercive situations, including cults, gangs, domestic violence, trafficking, and violent extremism. She also served as the Director of Events for the International Cultic Studies Association (ICSA), organizing regional and international events, workshops, and conferences for those affected by the cult phenomena and psychological manipulation. She is touring the Fall of 2025 in these cities for her show https://www.psychologyofcults.com/ : October 8 Jacksonville, FL Florida Theatre October 9 Newberry, SC Newberry Opera House October 11 Huntsville, AL Mars Music Hall October 12 Bristol, TN Paramount Bristol October 14 Charleston, WV Maier Foundation Performing Hall October 16 Stroudsburg, PA Sherman Theater October 17 Morristown, NJ Mayo Performing Arts Center October 18 Stamford, CT Palace Theatre October 19 Concord, NH Chubb Theatre October 21 Buffalo, NY Electric City October 22 Columbus, OH The Southern Theatre October 24 Pontiac, MI Flagstar Strand Theatre October 26 Cincinnati, OH Bogart\u0027s October 28 Chicago, IL City Winery October 29 Indianapolis, IN Clowes Memorial Hall October 30 Cleveland, OH Connor Palace November 23 Livermore, CA Livermore Valley Performing Arts Center",
      "release": "2025-10-05T18:00:00Z",
      "duration": "01:13:41.2240000",
      "explicit": false,
      "spotifyId": "4jATN3dpLzBYPWATbwHEUz",
      "appleId": 1000730282757,
      "youTubeId": "WOqYomEf4_I",
      "subjects": [
        "Churches of Christ (non-institutional)",
        "Cult-Expert",
        "Cult Psychology",
        "Human Trafficking",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4jATN3dpLzBYPWATbwHEUz",
        "apple": "https://podcasts.apple.com/podcast/why-no-one-thinks-theyre-in-a-cult/id1352860989?i=1000730282757",
        "youtube": "https://www.youtube.com/watch?v=WOqYomEf4_I"
      }
    },
    {
      "id": "6978ef9c-0ae9-4586-8935-47ae0fcbccb9",
      "title": "The Suggestible Brain",
      "description": "In The Suggestible Brain, cognitive psychologist Amir Raz delves into how suggestions can influence everything from wine preferences to memory and emotional reactions. As society grapples with misinformation, Raz’s research spans across cognitive psychology, sociology, and culture, emphasizing the profound impact of suggestion on both personal and collective levels. Raz’s expertise, merging magic with neuropsychology, unveils actionable insights for utilizing suggestion to enhance mental resilience and defend against manipulation. Dr. Raz’s career includes roles as Canada Research Chair and Director of the Institute for Interdisciplinary Brain and Behavioral Sciences. A speaker and author, his insights on suggestion have been widely recognized by media and academic audiences. His work, grounded in extensive research and engaging storytelling, highlights the interconnectedness of suggestion with consciousness, memory, and identity. Shermer and Raz discuss: the evolutionary basis of suggestibility, how brain imaging captures the power of suggestion, and the psychology behind hypnosis, meditation, and placebos. They discuss historical influences like Milgram’s obedience studies and explore suggestibility’s role in social contagions and cults. Raz also shares insights on psychedelics, neurofeedback, and using suggestion to manage conditions like ADHD, depression, and anxiety.",
      "release": "2024-12-14T17:00:00Z",
      "duration": "01:28:53.2630000",
      "explicit": false,
      "spotifyId": "1Tzt3JNw32G6BtJ3AQZiXv",
      "appleId": 1000680368439,
      "youTubeId": "8NE96DissZM",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Tzt3JNw32G6BtJ3AQZiXv",
        "apple": "https://podcasts.apple.com/podcast/the-suggestible-brain/id1352860989?i=1000680368439",
        "youtube": "https://www.youtube.com/watch?v=8NE96DissZM"
      }
    },
    {
      "id": "6fe2727f-c637-4547-b08d-32725cc35676",
      "title": "Surviving the Ultra-Religious Family Cult “The Field”",
      "description": "The Michael Shermer Show # 441 \n\nMichelle Dowd was born into an ultra-religious cult, “The Field,” started in the 1930s by her grandfather, who convinced generations of young male followers that he would live five hundred years and ascend to the heavens when doomsday came.\n\nMichelle Dowd is a professor of journalism at Chaffey College and contributor to The New York Times, Alpinist, The Los Angeles Book Review, Catapult, OnlySky, and other national publications. She founded The Chaffey Review, an award-winning literary journal, advises student media, teaches poetry and critical thinking in the California State prisons, and has been recognized as a Longreads Top 5 for The Thing with Feathers, on the relationship between environmentalism and hope. Her memoir is Forager: Field Notes for Surviving a Family Cult.\n\nSUPPORT THE PODCAST\nIf you enjoy the podcast, please show your support by making a $5 or $10 monthly donation.\nhttps://www.skeptic.com/donate/\n\n#michaelshermer\n#skeptic\n\nListen to The Michael Shermer Show or subscribe directly on YouTube, Apple Podcasts, Spotify, Amazon Music, and Google Podcasts.\nhttps://www.skeptic.com/michael-shermer-show/",
      "release": "2024-06-18T19:56:33Z",
      "duration": "01:09:08",
      "explicit": false,
      "spotifyId": "150btmuTPxJpeZ1IfGfDAn",
      "appleId": 1000659437049,
      "youTubeId": "oidUZbBxJTM",
      "subjects": [
        "Kare Youth League",
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/150btmuTPxJpeZ1IfGfDAn",
        "apple": "https://podcasts.apple.com/podcast/born-into-a-cult-michelle-dowd/id1352860989?i=1000659437049",
        "youtube": "https://www.youtube.com/watch?v=oidUZbBxJTM"
      }
    },
    {
      "id": "c7a6e6a4-b9bd-4639-aa0f-2fb362d500a4",
      "title": "Michael Shermer with Amber Scorah — Leaving the Witness: Exiting a Religion and Finding a Life (#97)",
      "description": "Listen to the Science Salon Podcast # 97 (audio-only):\nhttp://bit.ly/ScienceSalon97\n\nIn this revealing conversation Amber Scorah opens the box into the psychology of religious belief to show how, exactly, religions and cults convince members that theirs is the one true religion, to the point, she admits, that she would have gladly died for her faith. As a third-generation Jehovah’s Witness, Amber Scorah had devoted her life to sounding God’s warning of impending Armageddon. She volunteered to take the message to China, where the preaching she did was illegal and could result in her expulsion or worse. Here, she had some distance from her community for the first time. Immersion in a foreign language and culture — and a whole new way of thinking — turned her world upside down, and eventually led her to lose all that she had been sure was true. As a proselytizer in Shanghai, using fake names and secret codes to evade the authorities’ notice, Scorah discreetly looked for targets in public parks and stores. To support herself, she found work at a Chinese language learning podcast, hiding her real purpose from her coworkers. Now with a creative outlet, getting to know worldly people for the first time, she began to understand that there were other ways of seeing the world and living a fulfilling life. When one of these relationships became an “escape hatch,” Scorah’s loss of faith culminated in her own personal apocalypse, the only kind of ending possible for a Jehovah’s Witness. Shunned by family and friends as an apostate, Scorah was alone in Shanghai and thrown into a world she had only known from the periphery — with no education or support system. A coming of age story of a woman already in her thirties, this unforgettable memoir examines what it’s like to start one’s life over again with an entirely new identity. Scorah and Shermer also discuss:\n\n• the legals and logistics of writing a memoir\n• the rise of the nones and disbelief and why stories like hers provide social proof for living without religion\n• what Jehovah’s Witnesses believe and why they believe it\n• what it’s like to go door-to-door witnessing for a religion\n• Armageddon and what doomsayers do when the world doesn’t end\n• the mindset of the fundamentalist\n• why religions are obsessed with female sexuality\n• why religions forbid homosexuality\n• the psychology of deconversion\n• the problem of evil, or why bad things happen to good people\n• how she would try to talk someone out of joining ISIS\n• what it’s like to be expelled from a religion and be an apostate, and\n• how to start your life over when you’ve lost everything.\n\nAmber Scorah is a writer living in Brooklyn, NY. Her articles have been published in The New York Times, The Believer, and USA Today. Prior to coming to New York, Scorah lived in Shanghai, where she was creator and host of the podcast Dear Amber: An Insider’s Guide to Everything China. Leaving the Witness is her first book.\n\nThis dialogue was recorded on December 9, 2019 as part of the Science Salon Podcast series hosted by Michael Shermer and presented by The Skeptics Society, in California.\n\nListen to Science Salon via Apple Podcasts, Spotify, Google Play Music, Stitcher, iHeartRadio, TuneIn, and Soundcloud.\nhttps://www.skeptic.com/podcasts/science-salon/\n\nWatch past Science Salon videos\nhttps://www.skeptic.com/science-salon/\n\nLearn more about Skeptic\nhttps://www.skeptic.com/\n\n\nSUPPORT THE PODCAST\n\nYou play a vital part in our commitment to promote science and reason. If you enjoy the Science Salon Podcast, please show your support by making a donation, or by becoming a patron. Your ongoing patronage will help ensure that sound scientific viewpoints are heard around the world.\n\nhttps://www.skeptic.com/donate/\n\n#sciencesalon",
      "release": "2019-12-31T08:00:01Z",
      "duration": "01:35:32",
      "explicit": false,
      "youTubeId": "4jAhbxkMqgI",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4jAhbxkMqgI"
      }
    }
  ]
}