{
  "_ts": 0,
  "id": "7b6e05ff-e57c-417d-a49a-c2d099868044",
  "name": "Skeptic Perspective",
  "youTubeChannelId": "UCHYavMSu0M7lVynUAZdwwqg",
  "episodes": [
    {
      "id": "9ad2f78a-0df6-4ddc-987c-ba82ebcd51ae",
      "title": "Does chanting make you happy?",
      "description": "Spoiler alert, it doesn’t. Excerpt from the Hare Krishna podcast.",
      "release": "2024-08-28T22:27:05Z",
      "duration": "00:00:52",
      "explicit": false,
      "youTubeId": "vBtFDJQ16Qs",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vBtFDJQ16Qs"
      }
    },
    {
      "id": "b0070f18-d4e7-468d-bdfd-9657830d7260",
      "title": "How the Hare Krishna Cult Infiltrate Academia",
      "description": "Garuda Das \u0022Kaviraja\u0022 otherwise known as Graham Schweig is a disciple of the founder of the Hare Krishna cult, Prabhupada. \n\nHare Krishna cult members like Graham use their position in academia to promote their cult, for example, Graham requires all members of his class to buy a copy of his cult\u0027s version of the Bhagavad Gita. \n\nNotably, the original ISKCON version because it is more aligned with the cult\u0027s original dogma than the modern-day \u0022edited\u0022 version he opposes.  Regardless of the fact the original ISKCON Bhagavad Gita includes a significant amount of errors, misprints, misspellings and an endless amount of unscientific, superstitious and outright illogical claims.",
      "release": "2023-09-10T00:04:01Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "W1nSF-BfotE",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=W1nSF-BfotE"
      }
    },
    {
      "id": "4c4d560f-33fb-486c-a589-cfa4fc14bc84",
      "title": "Hare Krishna Cult Thought Control Tactic",
      "description": "This video perfectly encapsulates the cognitive dissonance and mental gymnastics required to justify following the founder of the Hare Krishna cult, AC Bhaktivedanta Swami Prabhupada who is known for unashamedly spouting his extremely bigoted, misogynistic, racist, sexist, anti-science, and outright delusional views.",
      "release": "2023-09-09T13:00:35Z",
      "duration": "00:00:33",
      "explicit": false,
      "youTubeId": "ydyQJt1b1yU",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ydyQJt1b1yU"
      }
    },
    {
      "id": "4f1493ab-11a7-47ea-8717-e3418d19a225",
      "title": "The Violent Swami of the Hare Krishna Cult",
      "description": "Swami B.G Narasingha was a disciple of AC Bhaktivedanta Swami Prabhupada, the founder of the Hare Krishna Cult. He was known as the \u0022Surfing Swami\u0022 and was notorious for his violent acts while masquerading as a guru in the Hare Krishna Cult. \n\nSee an example of his sexism and misogyny: https://www.youtube.com/watch?v=V_tb-MeNV7A\u0026feature=youtu.be",
      "release": "2023-09-09T12:51:49Z",
      "duration": "00:00:35",
      "explicit": false,
      "youTubeId": "nbYfFT7gknM",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nbYfFT7gknM"
      }
    },
    {
      "id": "81aea008-9471-49dd-bde1-0588b3dc70cd",
      "title": "\u0022He Could Kill Me At Any Moment!\u0022 Brainwashed by Hare Krishna Cult",
      "description": "Kailasa Candra Dasa is a disciple of AC Bhaktivedanta Swami Prabhupada, the founder of the Hare Krishna Cult otherwise known as ISKCON. This video clearly demonstrates the level of brainwashing experienced by followers of Prabhupada. \n\nKailasa Candra Das \u0022Prabhupada could immediately kill me\u0022",
      "release": "2023-09-09T12:35:47Z",
      "duration": "00:00:47",
      "explicit": false,
      "youTubeId": "1By4UQ_2pvU",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1By4UQ_2pvU"
      }
    },
    {
      "id": "bd7eb397-4988-4a95-9847-d1bdb361d393",
      "title": "Srila Prabhupada Chⅰld Marriage (Horrifying)",
      "description": "Before joining the Hare Krishna cult, please independently research the history of their founder \u0022Prabhupada\u0022. There are countless examples of blatant bigotry, sexism, homophobia, racism, etc. This is information not provided to members when they are thinking of joining but it is only right for \u0022devotees\u0022 to know the truth about their founder whom they worship as \u0022good as god\u0022.\n\nquotes from Hare Krishna cult founder AC Bhaktivedanta Swami: \n\n“In this regard, the word vikhyatam is very significant. A man is always famous for his aggression toward a beautiful woman, and such aggression is sometimes considered rαpe. Although rape is not legally allowed, it is a fact that a woman likes a man who is very expert at rαpe.”\n\n“Generally, when a woman is attacked by a man–whether her husband or some other man–she enjoys the attack, being too lusty.”\n\n\u0022When a husbandless woman is attacked by an aggressive man, she takes his action to be mercy.”\n\n\u0022Prabhupada: “Yes, that is law always. Rαpe means without consent, sex. Otherwise there is no rαpe. There was a rαpe case in Calcutta, and the lawyer was very intelligent. He some way or other made the woman admit, ‘Yes, I felt happiness.’ So he was released. ‘Here is consent.’ And that’s a fact. Because after all, sex, rαpe or no rαpe, they will feel some pleasure. So the lawyer by hook and crook made the woman agree, ‘Yes, I felt some pleasure.’ ‘Now, there is consent.’ So he was released. After all, it is an itching sensation. So either by force or by willingly, if there is itching, everyone feels relieved itching it. That’s a psychology. It is not that the woman do not like rαpe. They like sometimes. They willingly. That is the psychology. Outwardly they show some displeasure, but inwardly they do not. This is the psychology.” (Morning Walk — May 11, 1975, Perth)",
      "release": "2022-04-26T06:55:14Z",
      "duration": "00:01:04",
      "explicit": false,
      "youTubeId": "sxGXhZLK7fc",
      "subjects": [
        "Psychology",
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sxGXhZLK7fc"
      }
    },
    {
      "id": "93cb571b-1af2-49d8-b249-b94201d9bf28",
      "title": "Exposing the Cult of Yogi Bhajan",
      "description": "All credit to the original uploader 3HO Cult Info. For more information go to: \n\nhttps://3hocultinfo.wordpress.com/\n\n\nOne of Yogi Bhajan’s original \u0027secretaries\u0027 published a tell-all book and it brought forth a tumult of accusations from other women who were sexually abused by the group leader. The whole 3HO house of cards is crumbling and the, now deceased, leader has been revealed as having been a sexual serial predator, a conman and crook. \nYogi Bhajan himself has been dead since 2004, but the truth about him is finally coming out. In early 2020, his first secretary, a woman he gave the spiritual name Premka, released a tell-all book, 30 years after she left the group. It wasn’t her first effort to reveal the truth about the yogi. She had sued him back in the late 80’s but lacked the resources to fight his legal delays. She ended up settling out of court. Because there was no Internet at the time, many in the 3 H O community didn’t hear about it, or if they did, were told to deny the story and quickly forgot what had actually happened.\nIn early 2020, the book, \u0022Premka-White Bird in a Golden Cage\u0022 by Pamela Saharah Dyson, found an audience. Because of social media the news about the yogi\u0027s sexual predation could not be contained by 3 H O. The reaction to the book grew particularly strong in a Facebook group called “Beyond the Cage”. The Facebook group drew people out and the stories started to flow. So much so that the people in 3 H O couldn’t ignore the stories any more.\nFor more information, check out these articles: \n* LA Magazine - Yogi Bhajan Turned an L.A. Yoga Studio into a Juggernaut, and Left Two Generations of Followers Reeling from Alleged Abuse\nhttps://www.lamag.com/citythinkblog/y...\n\n* Yoga Journal - A New Report Details Decades of Abuse at the Hands of Yogi Bhajan\nhttps://www.yogajournal.com/yoga-101/...\n* Santa Fe New Mexican - Legacy of Yogi Bhajan swirls in controversy years after his death\nhttps://www.santafenewmexican.com/new...\n* Religion News Service - Yogi Bhajan, yoga guru and founder of 3HO, ‘more likely than not’ sexually abused followers, says report\nhttps://religionnews.com/2020/08/18/y...\n* This is a report commissioned by the 3HO group itself - Report on an Investigation into Allegations of Sexual and Related Misconduct by Yogi Bhajan \nhttps://epsweb.org/aob-report-into-al...\nFacebook Private Group: Beyond the Cage: https://www.facebook.com/groups/premka\nFacebook Public Group: https://www.facebook.com/yogi.bhajan....\nPremka\u0027s Book: https://www.amazon.com/Premka-White-B...\nWikipedia Entry: beware of this one, it is still heavily influenced by some of the \u0027deniers\u0027 within 3HO https://en.wikipedia.org/wiki/Harbhaj...\n\nA new web site has launched recently to help make the abuses of Yogi Bhajan and 3HO more accessible. It is called Abuse in Kundalini Yoga (https://abuse-in-kundalini-yoga.com). There are summaries of audio in text form and video links to the important parts of some of the longer but important video interviews. This is well worth looking at.",
      "release": "2022-04-05T21:22:02Z",
      "duration": "00:03:41",
      "explicit": false,
      "youTubeId": "Ik9UHs8vTEM",
      "subjects": [
        "3HO"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ik9UHs8vTEM"
      }
    },
    {
      "id": "007aadef-ab83-4786-8875-28ef2c637407",
      "title": "Is Hare Krishna a Doomsday Cult?",
      "description": "In this video, an indoctrinated ISKCON member recalls the lunacy she heard directly from Prabhupada, the Hare Krishna cult founder. \n\nPrabhupada was known for spouting outrageous prophecies on his morning walks that never came to fruition. \n\nIf you are interested, this is a link to read more about Prabhupada and his failed prophecies. https://www.academia.edu/27449369/Prabhupada_in_His_Own_Words_False_Prophecies",
      "release": "2022-03-15T07:21:07Z",
      "duration": "00:02:17",
      "explicit": false,
      "youTubeId": "AdDVTJmS-os",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AdDVTJmS-os"
      }
    },
    {
      "id": "1813a62f-9ad1-415b-ba44-f386c7b5820f",
      "title": "Devi Mandir Cult Exposed: Punched In Face by Shree Maa",
      "description": "Video excerpt from Shreehariananda Saraswati exposing the Devi Mandir Hindu cult.",
      "release": "2021-11-02T00:48:20Z",
      "duration": "00:02:42",
      "explicit": false,
      "youTubeId": "SSLt13US3YY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SSLt13US3YY"
      }
    },
    {
      "id": "faa499c5-7351-4703-9529-8c9cf4ef9346",
      "title": "Shocking history of a Hare Krishna Swami (Lokanath Maharaj)",
      "description": "Exposing the disgusting history of Lokanath Swami Maharaj (ISKCON) Hare Krishna cult leader",
      "release": "2021-10-02T22:51:43Z",
      "duration": "00:00:56",
      "explicit": false,
      "youTubeId": "Qv-RsL691fE",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Qv-RsL691fE"
      }
    },
    {
      "id": "1ebceb1e-82ce-492b-b4d1-a40b2b15c3e5",
      "title": "Hare Krishna Science Denial: Atheist Response",
      "description": "Taken from the debate: Does The Accuracy of Vedic Cosmology Suggest Divine Origins @Tjump vs Sidarth Chhabra",
      "release": "2021-02-11T23:41:37Z",
      "duration": "00:02:37",
      "explicit": false,
      "youTubeId": "cVIHqFztIZA",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cVIHqFztIZA"
      }
    },
    {
      "id": "d8eda7d5-76fb-43c9-a6eb-029dbfd66eb2",
      "title": "Secrets of The Eckankar Cult Exposed...",
      "description": "According to Eck teachings, they believe they have ancient roots. Unfortunately much knowledge was lost to history until Paul Twitchell (Paulji) \u0022rediscovered it.\u0022 He founded Eckankar in 1965. Eckankar followers believe that he studied under two Eck Masters: Sudar Singh in Paris and India, and a elderly monk Rebazar Tarzs in Tibet. They believe that he received the title of the 971st Eck Master from Tarzs in 1965, thus becoming the latest in a series of Masters which began before recorded history. Some of the past Masters are known historical figures; most have been solitary practitioners or have taught small groups. Paul Twitchell apparently gained additional knowledge from Kirpal Singh, an Eastern Guru, founder of the Ruhani Satsang movement.\n\nAfter Paul Twitchell\u0027s death in 1971, Darwin Gross, the 972nd Eck Master became the Mahanta of Eckankar. (A Mahanta is the spiritual leader of Eckankar, a \u0022living manifestation of God\u0022). Subsequently, Sri Harold Klemp (1942-) became the 973rd Eck Master in 1981; he now heads the movement as its Mahanta.\n\nEckankar does not attempt to evangelize the world by aggressively converting individuals to their religion. They do not actively proselytize. However, they do advertise their presence and distribute literature to interested persons.\n\nMembers generally sing or chant a mantra for 20 to 30 minutes each day. HU (pronounced \u0022hue\u0022) is a common mantra; it is an ancient name for God, and is considered a love song to God.\n\nVarious spiritual exercises are promoted by the organization: chanting, contemplation, meditation, singing, trance work and visualization techniques are used to achieve soul travel. Travel during dreams is an area of growing importance in the movement. Dreams are regarded as an important teaching tool; a \u0022look into the heavenly worlds\u0022. Members are urged to keep a dream journal to facilitate study.\n\nWorship Services consist of a readings, singing \u0022HU\u0022, silent contemplation and an open discussion. It \u0022may also include music, group singing and talks\u0022.\n\nInitiations mark an individual\u0027s spiritual progress within Eckankar. At the Second Initiation, one makes a personal commitment. At the fifth initiation, one becomes a Mahdis (High Initiate) and a member of the ECK clergy.\n\nMembers who have reached the Second Initiation are urged to conduct a partial or full fast each Friday.\n\nEckankar considers abortion, divorce, sexual orientation, and a decision to terminate life to be personal matters. They discourage the use of tobacco, alcohol and other drugs. Many followers are active in a community service.\n\nCult Beliefs:\n\nThey believe that Sugmad is a sacred name of God; God is perceived as neither male nor female.\n \nThey believe an ECK Current connects every person with the Heart of Sugmad. It flows from the Creator to the lower levels of existence and then returns to God. It is often called the holy spirit. ECK manifests itself in two forms:\n\nan \u0022Inner Sound\u0022, the \u0022Voice of god calling us home\u0022. The Sound may be present as a sound of nature or as music.\n\nan \u0022Inner Light which is a beacon to light our way\u0022. During spiritual exercises, the light sometimes materializes as \u0022brightness or colors on your inner visual screen\u0022.\n \nEckankar believes in the duality of the soul and body. The soul is the inner, most sacred part of an individual. It is eternal, without beginning or end. It lives only in the present. One\u0027s soul can exist and travel separately from the body and even from the mind.\n \n\nA person is capable of exploring other planes of existence, through Soul Travel. Unlike \u0022Astral Projection\u0022 which is taught by other spiritual traditions, Soul Travel is not limited to the Astral Plane; it allows you to go further and explore any of the god worlds.\n \n\nEckankar has a concept of Karma which is somewhat similar to that found in Hinduism. Through attachment to the five passions (anger, greed, lust, undue attachment to the physical world and vanity) one\u0027s bad karma accumulates. This requires a person to be reincarnated at death, in order have an opportunity to work off the debt of karma in their next life. The goal of Eckists is to pay off all of this accumulated debt and achieve Self-Realization in their present life. Once this state is reached, at death one need not return and spend another lifetime on earth. One is freed from the endless cycles of reincarnation.\n\n\nEckankar is regarded by its followers as the best (but not the only) path to God-realization. Christianity is recognized as an alternate path that can aid a follower to achieve a degree of enlightenment. Christians, and others, may join Eckankar without renouncing their existing religion.",
      "release": "2020-10-24T02:09:44Z",
      "duration": "00:02:26",
      "explicit": false,
      "youTubeId": "FVA5CE3bwxs",
      "subjects": [
        "Eckankar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FVA5CE3bwxs"
      }
    },
    {
      "id": "11831717-1fcd-45f3-b181-538ade989e71",
      "title": "Universe People: the new age UFO Alien Cult invented by THIS man...",
      "description": "Universe People or Cosmic People of Light Powers (Czech: Vesmírní lidé sil světla) is a Czech and Slovak UFO religion founded in the 1990s and centered on Ivo A. Benda. Their belief system is based upon the existence of extraterrestrial civilizations communicating with Benda and other contactees since October 1997 telepathically and later even by direct personal contact. They are considered to be the most distinctive UFO religion in the Czech Republic.",
      "release": "2020-10-24T01:21:49Z",
      "duration": "00:07:17",
      "explicit": false,
      "youTubeId": "vdHexkJAD_g",
      "subjects": [
        "Universe People"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vdHexkJAD_g"
      }
    },
    {
      "id": "b5c3c315-dc4c-47a5-81c6-b2ca95b80a76",
      "title": "Crazy Hare Krishna Cosmology",
      "description": "Hare Krishna is an anti-science, supernatural belief system that encourages its adherents to believe in Hindu mythology as taught by the cult leader Swami Prabhupada. See for yourself the  Hare Krishna version of the solar system, compared to modern-day science.",
      "release": "2020-10-23T10:31:06Z",
      "duration": "00:04:48",
      "explicit": false,
      "youTubeId": "B-4YRMi4Xjs",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=B-4YRMi4Xjs"
      }
    },
    {
      "id": "abac7c6f-309e-4d5e-8877-e24a9ed991bf",
      "title": "Indian Rationalists: Debunking the Fake Supernatural Gurus and Godmen of India",
      "description": "On the road with famous skeptic and activist Sanal Edamaruku",
      "release": "2020-10-22T12:59:34Z",
      "duration": "00:06:14",
      "explicit": false,
      "youTubeId": "zcK5kjIFKwg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zcK5kjIFKwg"
      }
    },
    {
      "id": "090cc14f-52bb-4526-8f62-2f1846a03621",
      "title": "Inside Footage of a Crazy Hare Krishna Cult",
      "description": "Splinter group in Pyatigorsk, Russia",
      "release": "2020-10-22T11:24:45Z",
      "duration": "00:17:26",
      "explicit": false,
      "youTubeId": "PM2GO9imPJo",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PM2GO9imPJo"
      }
    },
    {
      "id": "d3f84e43-3b3c-41f5-8839-a805ac4098c8",
      "title": "Theology Unleashed \u0022preaching\u0022 isn\u0027t convincing anyone.",
      "description": "Theology Unleashed is a slimy attempt at preaching to an audience of atheists and as he calls \u0022the odd person in the audience\u0022 that will join his Hindu denomination (\u0022Hare Krishna\u0022/\u0022Krishna consciousness\u0022) \n\nThough he claims to be moderating debates, his real intention is to show his religion in a positive light thus hiding any comments made by myself or other channels pointing to the absurdity in these beliefs. \n \nThe following comment was left on this video that Arjuna has now hidden:\n\nThe Hare Krishna cult considers its “disciplic succession” of utmost importance. Followers are taught that the term indicates a true, unbroken chain of spiritual teachers, each a direct disciple of his predecessor. Without being a direct disciple of a teacher in such a succession, they claim, one cannot ever hope to please god and return to their version of heaven.\n\nThe founder makes it very clear in his writings that being connected to an authorized succession is required for a spiritual organization to be authentic and spiritually potent, and he claims that the Hare Krishna movement belongs to such a succession.\n\nSo what is an authorized succession, then?\n\nWell, for the Hare Krishna cult it mainly means that the succession must connect to one of four main successions mentioned in “the Puranas” or “Vedic scriptures.” Based on those references they believe that spiritual knowledge received outside of these successions is useless. The founder traces his succession to its Puranic roots through a line of teachers that links up with a medieval tradition, which in turn claims descent from one of these four main successions. As support for this lineage, the founder and his followers refer to a song written by the founder’s guru, Bhaktisiddhanta Sarasvati.[3]\n\nSo they’re authorized, right? Then what’s the problem?\n\nIn a tiny nutshell, the problem is threefold: 1) references to the four Puranic successions are questionable and those successions consist of mythological persons only, 2) the medieval succession has questionable roots, and 3) the later succession is largely made up.\n\nThe Hare Krishna cult is quick to counter opposition to its lineage with the claim that it is based on the propagation of teachings (siksha), rather than the formal links between its teachers through spiritual initiation (diksha). But the endless discussions about siksha and diksha make no difference,[4] as the core teachings of the Puranic, medieval, and current successions vary significantly in theory and practice anyway.\nIn India, localized genealogical, familial, historical, and circumstantial evidence from the pre-British era — all the way into the renaissance era and beyond — is primarily based on oral traditions and hagiographies. There is very, very little reliable information on actual dates and events, so claims of any spiritual lineage quickly become difficult or impossible to verify.\nLet’s start at the root, then. The existence and acceptance of the Puranic uber-successions is based primarily on a single reference ascribed to the Padma Purana:\n“Mantras that are without a disciplic succession do not bear fruit. Therefore the founders of four disciplic successions appeared in the age of Kali. Thus the four world purifying Vaishnavas like Sri (Lakshmi), Brahma, Rudra (Shiva) and Sanaka will appear in the age of Kali, out of Purushottama (Jagannatha Puri) in the land of Utkala (Orissa). Lakshmi accepted Ramanuja, Brahma (the four-faced) accepted Madhvacharya, Rudra accepted Vishnusvami and the four (Kumaras) accepted Nimbaditya.”\n\nThere is currently no existing version of the Padma Purana in which this verse can be found. The reference as it appears most commonly in the Hare Krishna cult actually comes from the Prameya-ratnavali (Chapter 1, verses 5 and 6) by Baladeva Vidyabhusana (who, in the early 1700s, was already desperately trying to establish the authenticity of the Renaissance-era succession[5]). Also, verse 6, the part of the alleged Padma Purana quotation that lists Ramanuja, Madhvacarya, Visnuswami and Nimbaditya, is not found in other instances of references to the Padma Purana, which makes a compelling case that it is an even later addition. Another reference detailing the four lineages and their seminal teachers is attributed to the Garga Samhita, Canto 10, chapter 61, verses 23 to 26. Few translations of this work are available and almost nothing is known about its origin.\n\nThe bottom line is that we simply do not know enough about the origins of the source texts, their manuscripts, their existing editions, evolution, dating, and historical context to say with certainty that they originate the verses as quoted. While this would be problematic in an academic context, or really for anyone concerned with verifiable facts, members of the Hare Krishna cult have a tendency to blindly accept and propagate anything that seems to support their ideologies.\n\nLearn more about what they believe: http://harekrishnathing.com/",
      "release": "2020-10-18T10:02:07Z",
      "duration": "00:01:00",
      "explicit": false,
      "youTubeId": "mk__IxLRBSU",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mk__IxLRBSU"
      }
    },
    {
      "id": "a487efed-51d4-4fb0-af79-24c5e99c85f8",
      "title": "Atheist Perspective: Experiences in Hare Krishna",
      "description": "From The Atheist Experience 24.39 with Matt Dillahunty \u0026 ObjectivelyDan. Full video:https://www.youtube.com/watch?v=idZpcunMak4",
      "release": "2020-10-15T13:21:35Z",
      "duration": "00:01:23",
      "explicit": false,
      "youTubeId": "hgWcNH8uDaA",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hgWcNH8uDaA"
      }
    },
    {
      "id": "3c64f77c-06cf-43dd-9c2b-37534d3228f2",
      "title": "Sexism and misogyny of Hare Krishna Gurus",
      "description": "Swami B.G. Narasingha, disciple of ISKCON founder A.C Bhaktivedanta Prabhupada displaying his complete lack of any actual philosophical understanding outside of his own theological fairy tales. Learn more about the sad reality for women in the Hare Krishna religion: https://www.youtube.com/watch?v=NNMmsqly674",
      "release": "2020-10-14T03:17:18Z",
      "duration": "00:01:24",
      "explicit": false,
      "youTubeId": "V_tb-MeNV7A",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V_tb-MeNV7A"
      }
    },
    {
      "id": "ae998dbc-6022-42e7-8e18-816d8cc07f8c",
      "title": "Srila Prabhupada on Oral Sᴇx and Brain Washing",
      "description": "Swami A.C. Bhaktivedanta Prabhupada, founder of ISKCON (Hare Krishna) in his own words. Hear the rest at https://vaniquotes.org/wiki/Our_civilization_is:_%22All_right,_you_are_attached_to_vagina-licking._Do_it_up_to_fifty_years._Then_give_it_up.%22_This_is_our_civilization",
      "release": "2020-10-13T02:35:32Z",
      "duration": "00:00:55",
      "explicit": false,
      "youTubeId": "2SyJPBC_6ak",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2SyJPBC_6ak"
      }
    },
    {
      "id": "62cfd59e-d7d0-46a4-91f3-4de05adb00d2",
      "title": "HH Bhakti Vidya Purna Swami Exposed for Sickening Treatment of Children",
      "description": "\u0022Bhakti Vidya Purna Maharaja (Alan Ross Wexler)  became a prominent figure of attack by the children who had been abused both by him, and others, at the Mayapur school.\u0022",
      "release": "2020-10-12T02:34:39Z",
      "duration": "00:01:38",
      "explicit": false,
      "youTubeId": "aU_zh8a8uSk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aU_zh8a8uSk"
      }
    },
    {
      "id": "48ab42a1-5e77-4a8d-aa1a-b3acd4820bb2",
      "title": "Srila Prabhupada Examples of Sexism and Misogyny",
      "description": "Prabhupada himself, though deified and worshipped by members, was openly a very bigoted, s*xist, and r*cist individual. His wife was 11 years old at the time of marriage, and he was 22. He is famously quoted as saying that women love men who are \u0022expert in r*pe\u0022. Prabhupada made multiple comments on women\u0027s inferiority to men, even claiming a woman\u0027s brain is half the size of a man\u0027s.",
      "release": "2020-10-11T23:42:09Z",
      "duration": "00:02:16",
      "explicit": false,
      "youTubeId": "IYZ-bB6lkm8",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IYZ-bB6lkm8"
      }
    },
    {
      "id": "985daf3d-5ce8-4dff-b358-893bc3a3d9ec",
      "title": "Secrets Exposed of the Krishna Cult (Short Film)",
      "description": "Accounts from victims of abuse by ISKCON, in boarding schools and in local Gurakulas. The victims in this video were paid out a large sum by ISKCON for the atrocities committed to them as children, all documents pertaining to the case can be found easily on google.",
      "release": "2020-10-11T10:52:58Z",
      "duration": "00:12:55",
      "explicit": false,
      "youTubeId": "gXXhubEmMbo",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gXXhubEmMbo"
      }
    },
    {
      "id": "8af106e5-3279-4365-a576-89d9a91e9fe1",
      "title": "Sad Reality for Women in the Hare Krishna Religion...",
      "description": "Reporter (3): (a woman) Where… Do women fit into this social structure? You keep referring to man.\nPrabhupada: Woman is not equally intelligent as a man.\nReporter (3): Equal in intelligence?\nPrabhupada: Not equal intelligence. In the psychology, practical psychology, they have found that the man’s brain has been found up to sixty-four ounce, woman… Sixty-four ounce, man’s brain. And woman’s brain has been found, thirty-six ounce. So therefore woman is not equally intelligent like man.",
      "release": "2020-10-11T07:04:52Z",
      "duration": "00:01:52",
      "explicit": false,
      "youTubeId": "NNMmsqly674",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NNMmsqly674"
      }
    },
    {
      "id": "590262db-5ab1-45bd-a02d-5c34bfccbd0d",
      "title": "Hare Krishna Founder Srila Prabhupada on Rαpe",
      "description": "Before joining the Hare Krishna cult, PLEASE independently research the history of their founder \u0022Prabhupada\u0022. There are countless examples of blatant bigotry, sexism, homophobia, racism, etc. This is information NOT provided to members when they are thinking of joining but it is only right for \u0022devotees\u0022 to know the truth about their founder who they worship as \u0022good as god\u0022.\n\nquotes from Hare Krishna cult founder AC Bhaktivedanta Swami: \n\n“In this regard, the word vikhyatam is very significant. A man is always famous for his aggression toward a beautiful woman, and such aggression is sometimes considered rαpe. Although rape is not legally allowed, it is a fact that a woman likes a man who is very expert at rαpe.”\n\n“Generally, when a woman is attacked by a man–whether her husband or some other man–she enjoys the attack, being too lusty.”\n\n\u0022When a husbandless woman is attacked by an aggressive man, she takes his action to be mercy.”\n\n\u0022Prabhupada: “Yes, that is law always. Rαpe means without consent, sex. Otherwise there is no rαpe. There was a rαpe case in Calcutta, and the lawyer was very intelligent. He some way or other made the woman admit, ‘Yes, I felt happiness.’ So he was released. ‘Here is consent.’ And that’s a fact. Because after all, sex, rαpe or no rαpe, they will feel some pleasure. So the lawyer by hook and crook made the woman agree, ‘Yes, I felt some pleasure.’ ‘Now, there is consent.’ So he was released. After all, it is an itching sensation. So either by force or by willingly, if there is itching, everyone feels relieved itching it. That’s a psychology. It is not that the woman do not like rαpe. They like sometimes. They willingly. That is the psychology. Outwardly they show some displeasure, but inwardly they do not. This is the psychology.” (Morning Walk — May 11, 1975, Perth)",
      "release": "2020-10-11T00:11:32Z",
      "duration": "00:02:16",
      "explicit": false,
      "youTubeId": "UKnKyxpdFAI",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UKnKyxpdFAI"
      }
    },
    {
      "id": "53efb4d5-dea5-4e89-bd02-3706d0d7d70b",
      "title": "Hare Krishna Paramadvaiti Swami Exposed on public television (with English subtitles)",
      "description": "Swami Bhakti Aloka Paramadvaiti, born Ulrich Harlan is a disciple of Bhaktivedanta Swami Prabhupada (ISKCON) and founder of the hare krishna splinter group VRINDA. Spending years masquerading as a \u0022renunciate\u0022 this so called swami has been exposed for continually abusing the emotional and physical trust of his disciples subjecting them to abhorrent treatment in the name of enlightenment. To read more: https://theparamadvaitisyndrome.blogspot.com/",
      "release": "2020-10-09T22:50:30Z",
      "duration": "00:11:49",
      "explicit": false,
      "youTubeId": "2Gnd1SWemvQ",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2Gnd1SWemvQ"
      }
    }
  ]
}