{
  "id": "853bee0e-fea9-4ad5-9839-d046bda49412",
  "name": "Sky News Australia",
  "youTubeChannelId": "UCO0akufu9MOzyz3nvGIXAAw",
  "episodes": [
    {
      "id": "3d12a54b-aaff-4271-9eec-052b29440847",
      "title": "Epstein-linked Andrew remains under investigation following humiliating arrest",
      "description": "Disgraced ex-Prince Andrew will remain under investigation following his arrest on suspicion of misconduct in public office.\n\nOn Thursday, Andrew Mountbatten-Windsor was arrested on his 66th birthday, marking the first time in modern history a Royal Family member was taken into custody.\n\nThe disgraced prince was arrested under suspicion that he shared sensitive information with paedophile Jeffrey Epstein when serving as a UK trade envoy.\n\nFollowing his arrest, UK police were seen searching Andrew’s Windsor Estate and the Wood Farm property, where he served as an envoy from 2001 to 2011.\n\nThe ex-prince has strongly denied any wrongdoing in connection with sex trafficker and paedophile, Epstein.",
      "release": "2026-02-20T02:49:18Z",
      "duration": "00:09:01",
      "explicit": false,
      "youTubeId": "UL88o8bghqE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UL88o8bghqE"
      }
    },
    {
      "id": "9d4ac4af-3602-46e1-a93f-1fb123bb2a6d",
      "title": "Andrew Mountbatten-Windsor released from police custody after arrest",
      "description": "Andrew Mountbatten-Windsor has been released from police custody in Norfolk after his arrest.\n\nThe former prince was arrested at his home on Sandringham Estate in Norfolk on his 66th birthday.\n\nAndrew Mountbatten-Windsor has always denied any wrongdoing regarding his relationship with Jeffrey Epstein.",
      "release": "2026-02-19T20:16:25Z",
      "duration": "00:03:28",
      "explicit": false,
      "youTubeId": "2kJH5mNzkfE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2kJH5mNzkfE"
      }
    },
    {
      "id": "5d7f3227-b49c-4251-a31c-e2e2cb54168e",
      "title": "Former prince Andrew could face ‘maximum sentence of life in prison’",
      "description": "Talk TV host Samara Gill reveals that there has not currently been any statement from the royal family after the arrest of former prince Andrew. \n\n“It was unmarked officers that went into his, almost holding pen that he’s in at the moment,” Ms Gill told Sky News host Caleb Bond.\n\n“They [the police] went in there, and they were seen taking laptops out and they’ve basically taken him.\n\n“If he’s proven guilty, then there’s a maximum sentence of life imprisonment for Andrew.”",
      "release": "2026-02-19T12:38:37Z",
      "duration": "00:09:00",
      "explicit": false,
      "youTubeId": "ESYdqlJQOcw",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ESYdqlJQOcw"
      }
    },
    {
      "id": "6dae8867-4968-497c-9532-ead9b1ad34eb",
      "title": "‘Now a proper criminal investigation’: Former prince Andrew arrested on his 66th birthday",
      "description": "ITV News Royal Editor Chris Ship details the alleged arrest of former prince Andrew.\n\n“Confirmation from one of our police forces, it’s Thames Valley Police, which is the police force which looks after Windsor, they’ve confirmed this morning that they have made an arrest of a man in his 60’s,” Mr Ship told Sky News host Paul Murray.\n\n“Guess whose birthday it is today? Andrew Mountbatten-Windsor is 66 years old today.\n\n“He’s been arrested on suspicion of misconduct in public office.\n\n“We have to be super careful when it comes to an active police investigation, and a man, the King\u0027s brother, is under arrest.\n\n“It is now a proper criminal investigation.”",
      "release": "2026-02-19T11:44:49Z",
      "duration": "00:04:18",
      "explicit": false,
      "youTubeId": "tgQh_J2PPsU",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tgQh_J2PPsU"
      }
    },
    {
      "id": "8d63e68f-6028-4551-8a55-eda3dc92c849",
      "title": "BREAKING: Shocking arrest of former prince Andrew",
      "description": "Reports have emerged the former Prince Andrew has been arrested by police at his home near the Sandringham Estate. \n\nThe BBC has reported eight officers arrived in six Metropolitan Police vehicles and have taken Andrew into custody. \n\nThe arrest is allegedly related to potential misconduct in public office during his time as a UK trade envoy, with suggestions that he may have improperly shared privileged information, potentially with Jeffrey Epstein.\n\nWhile the details are still unfolding, this development marks a significant turn in the ongoing scrutiny surrounding Andrew\u0027s ties to Epstein and the accusations against him.",
      "release": "2026-02-19T10:25:26Z",
      "duration": "00:05:00",
      "explicit": false,
      "youTubeId": "4ZXrsYXAQzY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4ZXrsYXAQzY"
      }
    },
    {
      "id": "ea29ffa7-7e33-4551-a7c6-5ebebe6f6d5a",
      "title": "Former Victoria’s Secret CEO Les Wexner questioned over Epstein links",
      "description": "The billionaire founder of Victoria\u0027s Secret Les Wexner has been questioned by members of the US House Oversight Committee over his ties to Jeffrey Epstein.\n\nLes Wexner\u0027s finances were handled by Mr Epstein, and despite never being charged, Mr Wexner has been named as a co-conspirator in recently revealed documents.\n\nMr Wexner denies any wrongdoing and says he ‘was not a participant’ in Jeffrey Epstein’s crimes.",
      "release": "2026-02-19T05:54:18Z",
      "duration": "00:01:55",
      "explicit": false,
      "youTubeId": "hxbIhE7LyqY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hxbIhE7LyqY"
      }
    },
    {
      "id": "0aa118dc-6a69-4b5a-8b0e-063700f1bd63",
      "title": "\u0027So cringy’: Whoopi Goldberg exposed in Epstein files after alleged ‘no thanks’ reply",
      "description": "Writer and comedian Michael Loftus ridicules ‘The View’ co-host Whoopi Goldberg, who has denied links to convicted sex offender Jeffrey Epstein after her name appeared in the recently released files.\n\n“This is so cringy … she wanted to be close with Jeffrey Epstein, she wanted in,” Mr Loftus told Sky News host Rita Panahi.\n\n“She doesn’t say his response, he just wrote back two words, no thanks.\n\n“Epstein turned her down; she\u0027s going to be going to therapy for years to get over that.”",
      "release": "2026-02-18T09:24:17Z",
      "duration": "00:07:52",
      "explicit": false,
      "youTubeId": "O0Iv_DrKeoc",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=O0Iv_DrKeoc"
      }
    },
    {
      "id": "e49cac61-f1a5-4915-a0ac-9ff99e2e28c4",
      "title": "Whoopi Goldberg on the Epstein files after demanding immediate release",
      "description": "Sky News host Chris Kenny says Whoopi Goldberg is on the Epstein files after she demanded the release of the documents. \n\n“While we\u0027re on leftist media, let me show you something quite delightful,” Mr Kenny said.\n\n“Remember when the loony lefties of The View, that’s that American show which is a TV version of the Teals. Well, when they thought the Epstein Files would do in Donald Trump, they just wanted everything revealed immediately.\n\n“Fast forward a little while, and guess who\u0027s turned up in the files, none other than Goldberg herself.”",
      "release": "2026-02-18T09:21:59Z",
      "duration": "00:01:39",
      "explicit": false,
      "youTubeId": "t4ZshXjnlWM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=t4ZshXjnlWM"
      }
    },
    {
      "id": "855eed93-7575-40ec-8a27-be2b18d5aadc",
      "title": "Hillary Clinton labelled ‘psychopath’ after ‘lying’ about her relationship with Jeffrey Epstein",
      "description": "Comedian Alex Stein reacts to former US first lady Hillary Clinton claiming she had no links to Jeffrey Epstein. \n\n“Hillary Clinton is a psychopath,” Mr Stein told Sky News host Rita Panahi. \n\n“She has the ability to lie better than any Hollywood actress.”",
      "release": "2026-02-18T08:51:12Z",
      "duration": "00:04:28",
      "explicit": false,
      "youTubeId": "e1d5Wz-iw0s",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e1d5Wz-iw0s"
      }
    },
    {
      "id": "b52f4860-8c61-4a98-90c2-cb44bb96a088",
      "title": "Hillary Clinton lies about ties to Epstein despite infamous Bill Clinton portrait",
      "description": "Sky News host Rita Panahi slams former US first lady Hillary Clinton for her “easy ability to lie with complete confidence” about her and her husband, former US president Bill Clinton’s “close relationship” with Jeffrey Epstein and Ghislaine Maxwell. \n\nMs Panahi also comments on Bill Clinton’s “bizarre relationship” with Jeffrey Epstein, since Mr Epstein hung a huge painting of Mr Clinton in his New York residence wearing the “infamous blue dress” Monica Lewinsky was rumoured to be wearing during her encounter with the former US president.\n\n“Here she explains to the BBC that her and her husband Bill Clinton had no relationship with Jeffrey Epstein and Ghislaine Maxwell,” Ms Panahi said. \n\n“Never mind the fact that Bill Clinton was a regular on the Lolita Express. \n\n“Hillary Clinton now claims there was no relationship, no links with Epstein and Maxwell and the Clintons.”",
      "release": "2026-02-18T08:49:26Z",
      "duration": "00:10:02",
      "explicit": false,
      "youTubeId": "dCiAniXNQbE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dCiAniXNQbE"
      }
    },
    {
      "id": "36550daf-d742-4cc5-a058-9d0929076514",
      "title": "Allegations suggest Sarah Ferguson embarrassingly begged Epstein for ‘house assistant’ job",
      "description": "Newly revealed emails tied to Jeffrey Epstein allege that Sarah Ferguson begged the paedophile for a job as she “desperately” needed money.\n\nThe email that exposed Ferguson’s latest embarrassing moment with the paedophile follows the latest release of files tied to Epstein.\n\n“But why I don\u0027t understand, don\u0027t you just get me to be your House Assistant,” Ferguson’s alleged email read.\n\n“I am the most capable and desperately need the money.\n\n\u0022Please Jeffrey think about it.”\n\nFollowing the alleged email sent by Ferguson resurfacing, royal experts lambasted the ex-wife of disgraced Prince Andrew Mountbatten-Windsor.\n\nHillary Fordwich blasted Ferguson for “begging” the paedophile for money, saying, “This is beyond the pale”.",
      "release": "2026-02-18T04:49:05Z",
      "duration": "00:04:19",
      "explicit": false,
      "youTubeId": "vZEK8q-6INU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vZEK8q-6INU"
      }
    },
    {
      "id": "64e555c2-3c63-4ff6-bb56-e95bf328da89",
      "title": "\u0027The View\u0027 co-host Whoopi Goldberg addresses links to paedophile Jeffrey Epstein",
      "description": "‘The View’ co-host Whoopi Goldberg has shut down links to paedophile Jeffrey Epstein after her name appeared in the recently released files.\n\nOn Tuesday, Goldberg revealed her name appeared in the files and claimed she was addressing it “in the name of transparency”.\n\nGoldberg\u0027s name was mentioned in a 2013 email, where an individual says she needs a plane to Monaco and that “John Lennon\u0027s charity is paying for it”.\n\nThe actress claimed that the email should have said Julian Lennon’s charity, adding that it went on to ask Epstein if he would offer his plane to Goldberg.\n\nFellow co-host Joy Behar claimed that “anybody can be on this list”, before Goldberg defended herself for appearing in the files.\n\nWell, this is my point. Because I’m telling you, when I tell you people are trying to turn me into, I wasn’t his girlfriend. I wasn’t his friend,” Goldberg said.",
      "release": "2026-02-18T00:01:44Z",
      "duration": "00:05:39",
      "explicit": false,
      "youTubeId": "J0JKV8qBGIQ",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J0JKV8qBGIQ"
      }
    },
    {
      "id": "b3272862-0683-4513-a7b4-5ac040ae7b2b",
      "title": "Hillary Clinton makes wild accusation against Trump admin ahead of Epstein deposition",
      "description": "Hillary Clinton is accusing the Trump administration of a cover-up over its handling of the Epstein files.\n\nMs Clinton is due to testify before a Congressional committee on the Epstein files on February 26, while her husband, former US president Bill Clinton, is set to appear on February 27.\n\nMs Clinton says they have both been cooperating with the investigation, but their order to appear in person is a distraction.\n\n“I just want it to be fair; I want everybody treated the same way. That’s not true for my husband and me because other witnesses were asked to testify, they gave written statements under oath,” she said.\n\n“We offered that. They want to pull us – why do they want to pull us into this? To divert attention from President Trump.”",
      "release": "2026-02-17T21:56:29Z",
      "duration": "00:00:50",
      "explicit": false,
      "youTubeId": "yNszb3oRd5I",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yNszb3oRd5I"
      }
    },
    {
      "id": "ff892760-ed51-4aad-bd9e-acaa53beede0",
      "title": "Andrew could face prison time over new shocking Epstein allegations",
      "description": "News Corp Columnist Angela Mollard weighs in on new allegations surrounding Andrew Mountbatten-Windsor and his ties to Jeffrey Epstein. \n\nNewly released Epstein files accuse the former prince of forwarding government documents to the convicted paedophile. \n\n“What we’re seeing now is allegations, coming through the Epstein files, that he was actually sharing this privileged information around itineraries, business deals with Epstein, things that could have had an impact on national security,” Ms Mollard told Sky News Digital Presenter Gabriella Power.\n\n“The implications of this, of course, is that if he is charged for misconduct in public office, that could potentially come with a prison sentence, so huge.\n\n“How the Palace handles this, there’s still a lot to run on this story.”",
      "release": "2026-02-17T07:39:08Z",
      "duration": "00:04:43",
      "explicit": false,
      "youTubeId": "3tbHN7-HKjo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3tbHN7-HKjo"
      }
    },
    {
      "id": "565f1eee-56e3-4bf9-be0e-4444a2ecee84",
      "title": "Pam Bondi releases shocking Epstein list of ‘prominent names’",
      "description": "‘Kinsey Schofield Unfiltered’ host Kinsey Schofield weighs in on Attorney General Pam Bondi releasing a list of “prominent names” in the Epstein files. \n\n“There are a lot of names on this list, and they are people that in no way, shape or form had anything to do with Jeffrey Epstein, so I would beg people to keep that in mind before judging someone because their name is on the list,” Ms Schofield told Sky News host Rita Panahi.\n\n“The real question investigators look for is evidence of criminal participation, not just association.\n\n“Yes, prominent names do appear on this list, but what matters legally is whether there’s proof tied to actual offences.”",
      "release": "2026-02-16T08:47:43Z",
      "duration": "00:04:44",
      "explicit": false,
      "youTubeId": "Dny6IEwGmqo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Dny6IEwGmqo"
      }
    },
    {
      "id": "d9f0e3b4-ace8-414c-927d-430d128428fc",
      "title": "Andrew torn into for allegedly making palace staff use ‘sick code names’ to let in young women",
      "description": "TalkTV host Samara Gill has reacted to a report on a disturbing code word allegedly used by Andrew Mountbatten-Windsor for palace staffers to let young women in for visits. \n\n“It’s irreprehensible behaviour from Andrew and he was able to get away with it for years,” she told Sky News host Danica De Giorgio. \n\n“I just feel sorry for those poor staff having to use those sick code names of ‘Mrs Windsor’.”",
      "release": "2026-02-16T03:31:30Z",
      "duration": "00:06:22",
      "explicit": false,
      "youTubeId": "CUbWkHZjzXA",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CUbWkHZjzXA"
      }
    },
    {
      "id": "2f7dc3a0-0cb0-4e2c-8579-798d8f02807d",
      "title": "Over 300 high-profile names shockingly listed in latest Jeffrey Epstein file release",
      "description": "US Attorney General Pam Bondi has released a list of over 300 high-profile individuals mentioned in the Jeffrey Epstein files.\n\nIn a letter penned by Bondi and Deputy Attorney General Todd Blanche, they announced “all” of the Epstein files have been released.\n\nBondi and Blanche did note that privileged material is still withheld due to government officials and “politically exposed” individuals appearing in the files.\n\n“In accordance with the requirements of the Act, and as described in various Department submissions to the courts of the Southern District of New York assigned to the Epstein and Maxwell prosecutions and related orders, the Department released all ‘records, documents, communications and investigative materials in the possession of the Department’ that ‘relate to’ any of nine different categories,” Bondi and Blanche wrote.\n\nIncluded in the list are names previously reported, such as US President Donald Trump, Bill Clinton, Bill Gates and Woody Allen.\n\nOther names not previously covered but that are listed include Barack and Michelle Obama, Kurt Cobain, Prince Harry, Robert De Niro and Bruce Springsteen.\n\nThe inclusion of these individuals in the files does not imply any wrongdoing or direct contact with Epstein.",
      "release": "2026-02-16T03:05:50Z",
      "duration": "00:08:09",
      "explicit": false,
      "youTubeId": "qZWC80Vww7A",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qZWC80Vww7A"
      }
    },
    {
      "id": "a4a3aa4b-cb40-477a-aea0-2709e11ca7d9",
      "title": "‘Sickly’ Epstein emails show Sarah Ferguson put daughters ‘almost in harm’s way’",
      "description": "TalkTV host Samara Gill claims Sarah Ferguson’s emails to Jeffrey Epstein are “sickly”. \n\n“Her emails are sickly towards Epstein,” she told Sky News host Danica De Giorgio. \n\n“She loved the lavish lifestyle that he provided so much so that yes, I would say she put her daughters ... almost in harm’s way and met up with him after he was convicted of paedophile offences.”",
      "release": "2026-02-16T02:33:40Z",
      "duration": "00:06:17",
      "explicit": false,
      "youTubeId": "jP2C5IUr6sA",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jP2C5IUr6sA"
      }
    },
    {
      "id": "839f04b3-5253-4542-b6f4-5d4af992964c",
      "title": "‘Sleazy’ Andrew’s ‘creepy code word’ for palace staff to let young girls in exposed",
      "description": "Sky News host Danica De Giorgio discusses a “creepy code word” Andrew Mountbatten-Windsor allegedly used when “ordering palace staff to let a string of young women in for visits”. \n\n“This is really shocking. He allegedly used a word – this is according to The Sun,” she said. \n\n“It says emails released as part of the Epstein files show several women entered the palace with the former prince’s permission after being supplied by his paedo pal. \n\n“Sources told The Sun a string of young women were invited to the palace by Andrew, and he made a specific passphrase. \n\n“This paraphrase Andrew is thought to have said to them: ‘Mrs Windsor will arrive shortly, please let her in and show her up’.” \n\nMs De Giorgio said surely Palace staffers would have seen Andrew’s “sleazy behaviour”.",
      "release": "2026-02-16T02:26:32Z",
      "duration": "00:06:11",
      "explicit": false,
      "youTubeId": "qam8Sa9NVtU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qam8Sa9NVtU"
      }
    },
    {
      "id": "21d80edf-0929-4e10-bd06-9abfae0bc9b4",
      "title": "‘I just really thought that I was going to die’: Epstein survivor details distressing experience",
      "description": "A woman who was trafficked from Cape Town to Jeffrey Epstein’s private island has revealed details of the sexual abuse she suffered.\n\nJuliette Bryant says she feared for her life, describing how she was trapped in the “invisible chains”.\n\n“I was really, really petrified, and it really changed me, you know, the whole thing going through this,” she said.\n\n“I just really thought that I was going to die.”",
      "release": "2026-02-16T01:58:01Z",
      "duration": "00:03:42",
      "explicit": false,
      "youTubeId": "YgRhF2f2Q2A",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YgRhF2f2Q2A"
      }
    },
    {
      "id": "08c03a02-5f94-4def-907d-4ece606b6879",
      "title": "‘Not the end of the story’: Many claim Epstein files still incomplete",
      "description": "Former White House chief of staff Mick Mulvaney claims he was “surprised” after Attorney General Pam Bondi announced all the Epstein files were released.\n\n“I’m not sure that’s the end of the story,” Mr Mulvaney told Sky News Australia.\n\n“I don’t see this going away.”",
      "release": "2026-02-16T01:49:49Z",
      "duration": "00:05:40",
      "explicit": false,
      "youTubeId": "iHGJFYmrQ6g",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iHGJFYmrQ6g"
      }
    },
    {
      "id": "f7a9162a-4004-4f34-9d2a-f085a50d6cbd",
      "title": "Full Epstein files release sees ‘heads roll’ and causes ‘ripple effect’ across the world",
      "description": "TalkTV host Samara Gill has praised US President Donald Trump for committing to his election promise to release the Jeffrey Epstein files.\n\nUS Attorney General Pam Bondi has released all of the Epstein files, including several redactions and a list of high-profile names appearing in the documents.\n\n“My God, what a ripple effect it has had on the world. We’ve seen heads rolling from Westminster to Florida to Washington to all over the world,” Ms Gill told Sky News host Danica De Giorgio.\n\n“I just really do think that we should commend Donald Trump for actually releasing them and Pam Bondi for doing her bit and putting the pressure on.”",
      "release": "2026-02-16T01:30:16Z",
      "duration": "00:23:37",
      "explicit": false,
      "youTubeId": "S1fpmdR0Hng",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S1fpmdR0Hng"
      }
    },
    {
      "id": "4824f165-70b6-4274-81f9-64e2e2db4039",
      "title": "Peter Mandelson asked to testify before US Congress over Epstein links",
      "description": "The former UK ambassador to the US Peter Mandelson has been seen in public for the first time since he was asked to testify in front of the US Congress over his links to convicted sex offender Jeffrey Epstein.\n\nHe has been given a deadline of February 27 to respond to Congress request for evidence.\n\nThis comes as the UK Metropolitan Police is investigating Mr Mandelson on suspicion of misconduct in public office following revelations from the latest release of documents from the Epstein files.",
      "release": "2026-02-14T19:56:59Z",
      "duration": "00:02:45",
      "explicit": false,
      "youTubeId": "OFBsCvxagI8",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OFBsCvxagI8"
      }
    },
    {
      "id": "9bd0b2df-a708-4e5b-8a8b-28c3ab3e828a",
      "title": "Peter Mandelson asked to give evidence into Jeffrey Epstein links",
      "description": "Democrats have written to Peter Mandelson asking him to give evidence in the ongoing Jeffrey Epstein investigation.\n\nThe Democrats of the Oversight Committee, the congressional committee on Capitol Hill investigating crimes involving Jeffrey Epstein, have called for those who have been mentioned in the files to come forward to the committee and tell them what they know.\n\nMr Mandelson has not responded at this stage, but they believe he has questions to answer on Capitol Hill.",
      "release": "2026-02-14T03:44:00Z",
      "duration": "00:01:16",
      "explicit": false,
      "youTubeId": "92E4xm7jOpU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=92E4xm7jOpU"
      }
    },
    {
      "id": "b34da82f-a261-4c3e-b541-17e9a071f7db",
      "title": "Epstein emails lifts lid on Ghislaine Maxwell’s ‘strong ties’ to the Clintons",
      "description": "Sky News host Rita Panahi analyses more emails from the Epstein files which shine a new light on the Clintons.\n\n“Now more on those emails in the Epstein files, which have also lifted the lid on Ghislaine Maxwell’s strong ties to the Clinton Global Initiative, one of Bill Clinton’s post-presidential projects,” she said.\n\n“Maxwell reportedly played a major role in funding and establishing the Clintons’ charity.”",
      "release": "2026-02-11T02:25:51Z",
      "duration": "00:04:43",
      "explicit": false,
      "youTubeId": "u87BesKwKvU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u87BesKwKvU"
      }
    },
    {
      "id": "c3703abc-b404-4000-856f-8f7cb7882de3",
      "title": "Andrew’s ‘huge abuse of his position’ after leaking confidential information to Epstein",
      "description": "GB News host Emily Carver claims the public wants to see “true accountability” from Andrew Mountbatten-Windsor following damning allegations in the Epstein files.\n\nThe Royal Family has been under scrutiny with King Charles heckled twice during his walkabouts over his brother’s friendship with Jeffrey Epstein and recent revelations he had been leaking confidential information to the convicted paedophile.\n\nThere’s no suggestion of any wrongdoing, and Mr Mountbatten-Windsor has always denied allegations against him.\n\n“The allegations are that he may have abused his role (as trade envoy) by sharing confidential reports with Jeffrey Epstein, which would be a huge abuse of his position,” Ms Carver told Sky News host Danica De Giorgio.",
      "release": "2026-02-11T02:14:53Z",
      "duration": "00:01:59",
      "explicit": false,
      "youTubeId": "BzPz22gN9JM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BzPz22gN9JM"
      }
    },
    {
      "id": "8a76839f-b1e4-464f-abe0-adceee280a0f",
      "title": "‘This is the smoking gun’: Andrew’s latest ‘dodgy’ move exposed",
      "description": "SkyNews.com.au columnist Louise Roberts says there is a lot of “anger” towards Andrew Mountbatten-Windsor as the public finds out he potentially traded top-secret information with Jeffrey Epstein when he was the trade envoy. \n\n“This is the smoking gun for Andrew,” Ms Roberts told Sky News Digital Presenter Gabriella Power. \n\n“The issue now is whether his official privilege extended to giving information to a convicted sex offender.\n\n“He has to answer for it because it\u0027s one thing to have dodgy friendships … he’s never really been held accountable for anything around that trade envoy role.\n\n“This is going to be a moment of reckoning for him.”",
      "release": "2026-02-10T05:28:32Z",
      "duration": "00:08:20",
      "explicit": false,
      "youTubeId": "Fi9ZYCEirns",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Fi9ZYCEirns"
      }
    },
    {
      "id": "29969d2f-e5c0-4b36-b092-1bb30a21758d",
      "title": "Epstein accomplice Ghislaine Maxwell cowardly pleads the Fifth Amendment during deposition",
      "description": "Jeffrey Epstein\u0027s accomplice, Ghislaine Maxwell, pleaded the Fifth Amendment during the House Oversight Committee\u0027s deposition.\n\nOn Monday, Maxwell appeared for a closed-door interview in a bipartisan probe by the House into the federal government’s handling of the Epstein files.\n\nBefore the deposition began, Maxwell’s lawyer asserted that Maxwell could not implicate US President Donald Trump and Bill Clinton of any wrongdoing.\n\nAccording to a statement by Maxwell’s attorney, David Oscar Markus, the sex trafficker will answer questions but only if President Trump reduces her sentence.\n\n“If this Committee and the American public truly want to hear the unfiltered truth about what happened, there is a straightforward path. Ms Maxwell is prepared to speak fully and honestly if granted clemency by President Trump,” Markus said.",
      "release": "2026-02-10T04:26:04Z",
      "duration": "00:06:16",
      "explicit": false,
      "youTubeId": "llonctkMmmQ",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=llonctkMmmQ"
      }
    },
    {
      "id": "71a35365-0d9e-4d90-8476-4fb9e036ba63",
      "title": "‘Phew, you still love me’: ‘Degenerate’ Fergie’s ‘desperate’ emails to Epstein exposed",
      "description": "Sky News host Rita Panahi claims emails revealed in the latest instalment of the Epstein files reveal Sarah Ferguson was “regularly chasing money and attention” from the convicted paedophile.\n\n“Former Duchess of York Sarah Ferguson has been labelled ‘desperate and a degenerate’ in the latest instalment of the Epstein files, with emails between her and Jeffrey Epstein revealing she was regularly chasing money and attention from the convicted paedophile,” she said.\n\n“The exchanges seemingly indicate that the disgraced ex-wife of Andrew Mountbatten-Windsor was very attached to Jeffrey Epstein, telling him he was her ‘pillar’.\n\n“There’s no coming back from this.”\n\nThere’s no suggestion of any wrongdoing, and Sarah Ferguson has yet to respond to any of the allegations from the Epstein files.",
      "release": "2026-02-10T02:39:51Z",
      "duration": "00:06:02",
      "explicit": false,
      "youTubeId": "JRjgeDSgS88",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JRjgeDSgS88"
      }
    },
    {
      "id": "c95590a6-2f97-42ba-b285-0d75150bdfcb",
      "title": "US congressman warns Epstein revelations could spell ‘the end’ of the British monarchy",
      "description": "Democrat Congressman Ro Khanna has warned that the fallout from the Jeffrey Epstein scandal could threaten the survival of the British monarchy.\n\n“This is the most vulnerable the British monarchy has ever been… maybe this will be the end of the monarchy,” Khanna said.\n\nHe also singled out Peter Mandelson, arguing he could “bring down” the entire UK government.\n\nKhanna called on King Charles to answer for what he knew about Prince Andrew and that stripping his title is “not enough.”\n\nThis comes as UK Prime Minister Keir Starmer faces calls to resign over Mandelson’s close ties to Epstein.",
      "release": "2026-02-10T02:28:21Z",
      "duration": "00:08:07",
      "explicit": false,
      "youTubeId": "Ow2VV6Oy1yE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ow2VV6Oy1yE"
      }
    },
    {
      "id": "ab285495-e6fa-4f06-949e-dc90bf54c468",
      "title": "Epstein’s ‘pretty harsh’ comment about Sarah Ferguson",
      "description": "Sky News host Rita Panahi has commented on a “pretty harsh” remark from Jeffrey Epstein about Sarah Ferguson.\n\n“Epstein was not so complimentary about Fergie,” she said.\n\n“In an email from September 2011 ... Epstein sends a link to the Daily Mail’s coverage of Princess Beatrice’s graduation from university, and he writes, ‘pic of F from Friday – F being Fergie – not the prettiest site’.\n\n“Gosh, yeah, it’s pretty harsh.”",
      "release": "2026-02-10T02:01:23Z",
      "duration": "00:02:20",
      "explicit": false,
      "youTubeId": "hzRipEHm6gE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hzRipEHm6gE"
      }
    },
    {
      "id": "07cc402b-ddd6-4123-a512-af8e4b9a933c",
      "title": "‘Actually gut-churning’: Sarah Ferguson’s ‘sickening’ emails to Epstein about her daughters",
      "description": "Broadcaster Dee Dee Dunleavy has reacted to some of the emails Sarah Ferguson sent to Jeffrey Epstein after he was convicted of being a paedophile.\n\n“Two days after he was released from prison, his assistant approached him and asked him would he pay for Sarah and for the girls to go to Miami. Now, we don’t know that he did pay for them,” she told Sky News host Rita Panahi.\n\n“Then we see other emails after that where he’s asking for his business contacts to be shown around Buckingham Palace by Sarah Ferguson, and would the girls be there; would the girls be able to show them around.\n\n“It’s almost like she’s pimping them out, and it’s actually gut-churning; it’s sickening.”\n\nThere’s no suggestion of any wrongdoing, and Sarah Ferguson has yet to respond to any of the allegations from the Epstein files.",
      "release": "2026-02-10T01:59:03Z",
      "duration": "00:03:24",
      "explicit": false,
      "youTubeId": "_lc3iyCWEEU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_lc3iyCWEEU"
      }
    },
    {
      "id": "0f38719b-08d8-4068-95b2-9cf6952aa41d",
      "title": "Shocking new emails reveal Andrew leaked ‘secret and confidential information’ to Epstein",
      "description": "Sky News contributor Sophie Elsworth claims new emails reveal Andrew Mountbatten-Windsor was allegedly giving “secret and confidential information” over to Jeffrey Epstein when he was the UK’s trade envoy.\n\n“This is deeply concerning for everyone involved here in the UK,” she told Sky News Australia.\n\n“Now, he has always, always denied any wrongdoing in relation to his connection with Jeffrey Epstein, but he hasn’t spoken publicly in recent times on these matters, and it’s unlikely that he will.”",
      "release": "2026-02-09T23:26:46Z",
      "duration": "00:03:15",
      "explicit": false,
      "youTubeId": "BlEY4HPJ2qg",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BlEY4HPJ2qg"
      }
    },
    {
      "id": "3aa6b0f7-634d-40ad-943a-a65d76779ee8",
      "title": "King Charles breaks silence over explosive Andrew-Epstein allegations",
      "description": "Buckingham Palace has released a statement over the allegations against Andrew Mountbatten-Windsor’s links to Jeffrey Epstein.\n\n“The King has made clear, in words and through unprecedented actions, his profound concern at allegations which continue to come to light in respect of Mr Mountbatten-Windsor’s conduct,” the statement read.\n\n“If we are approached by Thames Valley Police, we stand ready to support them.”\n\nThis comes after the Prince and Princess of Wales released a statement saying they were “deeply concerned” by the “continuing revelations” surrounding Jeffrey Epstein and his relationship with Andrew Mountbatten-Windsor.",
      "release": "2026-02-09T19:49:29Z",
      "duration": "00:02:59",
      "explicit": false,
      "youTubeId": "lFl63ikgd0M",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lFl63ikgd0M"
      }
    },
    {
      "id": "611ba8ac-00d2-4952-a391-2907c0d466af",
      "title": "Keir Starmer\u0027s chief of staff quits over Peter Mandelson appointment amid Epstein scandal",
      "description": "UK Prime Minister Keir Starmer is facing pressure to resign after ignoring evidence that Lord Peter Mandelson was closely associated with convicted pedophile Jeffrey Epstein.\n\nDespite this, Mr Starmer appointed Mandelson as the US ambassador. The Epstein files allegedly show Mandelson providing Epstein with inside information. \n\nInstead of taking responsibility for hiring Mandelson, Starmer has effectively fired his chief of staff, Morgan McSweeney, who was reportedly influential in the decision to appoint Mandelson.",
      "release": "2026-02-09T10:06:12Z",
      "duration": "00:06:31",
      "explicit": false,
      "youTubeId": "kMq4e0BWTNM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kMq4e0BWTNM"
      }
    },
    {
      "id": "54234b15-4137-48c9-a7ad-485f4a53a43f",
      "title": "Epstein files allege ex-Prince Andrew shared confidential reports with disgraced financier",
      "description": "‘Kinsey Schofield Unfiltered’ host Kinsey Schofield weighs in on recently released Epstein files showing former prince Andrew apparently passing on confidential reports to Jeffrey Epstein whilst he was the UK trade envoy.\n\n“Everyone keeps saying, \u0027 How did he [Jeffrey Epstein] make his money? By selling access at the highest level of politics, royalty, finance, and tech,” Ms Schofield told Sky News host Rita Panahi.\n\n“For Andrew, official guidance says trade envoys have a duty of confidentiality with sensitive commercial or political information.\n\n“He might really be in trouble here.”",
      "release": "2026-02-09T07:44:30Z",
      "duration": "00:03:18",
      "explicit": false,
      "youTubeId": "wMAyy2qm5rs",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wMAyy2qm5rs"
      }
    },
    {
      "id": "4be3ab23-224d-4cb5-8e05-4884ca35ccda",
      "title": "Footage from Epstein files shows Ghislaine Maxwell denying giving massages",
      "description": "Sky News host Rita Panahi blasts Ghislaine Maxwell for denying giving convicted paedophile Jeffrey Epstein a massage despite photographic evidence.\n\nFootage from newly released Epstein files shows the sworn deposition of Ghislaine Maxwell repeatedly denying giving massages.\n\n“We know that\u0027s not true, we’ve all seen her give the convicted paedophile a foot massage with her shirt undone,” Ms Panahi said.",
      "release": "2026-02-09T07:39:31Z",
      "duration": "00:08:06",
      "explicit": false,
      "youTubeId": "38r8w8RInBI",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=38r8w8RInBI"
      }
    },
    {
      "id": "8ee041d9-beb1-444c-953d-fc687a7d4f39",
      "title": "Bizarre revelation in Epstein case as official death announcement dated one day before paedo died",
      "description": "A bizarre inconsistency has surfaced in the Jeffrey Epstein case after millions of new files were released.",
      "release": "2026-02-09T02:33:06Z",
      "duration": "00:03:11",
      "explicit": false,
      "youTubeId": "Z0Or_worXD4",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Z0Or_worXD4"
      }
    },
    {
      "id": "7f1d7985-99ff-4f68-b921-66a75e854adc",
      "title": "‘Untenable’: Explosive Epstein scandal could be the ‘final nails in Starmer’s coffin’",
      "description": "Sky News host James Macpherson claims Keir Starmer’s leadership position “looks untenable” following revelations he appointed Peter Mandelson as the UK’s US ambassador despite knowing of his links to Jeffrey Epstein.\n\n“I do note that Mandelson denies any wrongdoing,” he said.\n\n“But a couple of things have happened over the past 24 hours to heap more pressure on Keir Starmer.”",
      "release": "2026-02-09T01:24:24Z",
      "duration": "00:02:56",
      "explicit": false,
      "youTubeId": "k1-bcbMV2Z8",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k1-bcbMV2Z8"
      }
    },
    {
      "id": "620368fc-e94e-4a10-8956-d2ffaf4d8bab",
      "title": "Royal Family knew of ‘very bad’ emails between Andrew and Epstein",
      "description": "deeply disgraced former prince Andrew was involved in his email exchanges with Jeffrey Epstein.\n\n“I can tell you already, the Palace had known that there are very, very bad emails,” Ms Barak told Sky News host Danica De Giorgio.\n\n“After I exposed Andrew’s lies, they stripped him from his duke title, and they knew how much damage was coming.”",
      "release": "2026-02-06T10:36:18Z",
      "duration": "00:08:40",
      "explicit": false,
      "youTubeId": "fOotdGsmkJM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fOotdGsmkJM"
      }
    },
    {
      "id": "bb248357-6088-49c5-aa9c-2594dcb59fc1",
      "title": "King Charles ignores question about Jeffrey Epstein investigation",
      "description": "King Charles chose not to react to a question put to him about the Jeffrey Epstein investigation whilst meeting the public today.\n\nThe King was on a visit to the Essex village of Dedham when a heckler shouted at him.\n\nLast year, King Charles stripped his brother Andrew Mountbatten-Windsor of his royal titles.",
      "release": "2026-02-05T20:01:47Z",
      "duration": "00:02:20",
      "explicit": false,
      "youTubeId": "hXxKUVA4JRQ",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hXxKUVA4JRQ"
      }
    },
    {
      "id": "44952281-1cf9-4d42-8131-963ff815b463",
      "title": "‘I am sorry’: Keir Starmer apologies to Jeffrey Epstein victims",
      "description": "UK Prime Minister Keir Starmer has apologised to the victims of Jeffrey Epstein for appointing Peter Mandelson as the country’s ambassador to the US.\n\nMr Starmer is battling for his political future as he struggles to maintain the scandal.\n\n“I am sorry, sorry for what was done to you. Sorry that so many people with power failed you. Sorry for having believed Mandelson’s lies and appointed him,” Mr Starmer said.",
      "release": "2026-02-05T19:59:37Z",
      "duration": "00:03:20",
      "explicit": false,
      "youTubeId": "9m-CazYF_RE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9m-CazYF_RE"
      }
    },
    {
      "id": "7ec592b3-9fef-4ffb-99ec-e314c84975b4",
      "title": "‘Unbelievable sadness’: Melinda Gates heartbreaking reaction to Bill Gates-Epstein allegations",
      "description": "Sky News Digital Presenter Gabriella Power has reacted to Melinda Gates\u0027 heartbreaking reaction to shocking allegations against Bill Gates in the new Epstein files.",
      "release": "2026-02-04T10:22:01Z",
      "duration": "00:02:44",
      "explicit": false,
      "youTubeId": "cUmU125cL4Y",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cUmU125cL4Y"
      }
    },
    {
      "id": "0cd5c35b-01a0-4be0-be66-7ef86939e29c",
      "title": "Second woman alleges she was sent to UK by Jeffrey Epstein for Andrew",
      "description": "UK Barrister Andrew Eborn comments on reports a second woman claims she was brought to the UK by Jeffrey Epstein for the disgraced former prince Andrew.\n\n“The amount of grace and favours and sort of benefits that Andrew used to give Epstein and the various people trafficked by Epstein … that’s what some of these three million documents have revealed is the extent of that access,” Mr Eborn told Sky News Digital Presenter Gabriella Power.\n\n“There’s a second woman, as predicted, and there will be more revelations, I can guarantee, as people continue to comb through those three million documents. \n\n“She says she was sent to the UK by Jeffrey Epstein for a sexual encounter with the then prince Andrew … they put the pressure on the King, the King Charles lawyer, to issue a real apology.\n\n“Questions need to be answered, who knew what, when, that needs to be looked at.”",
      "release": "2026-02-04T09:23:05Z",
      "duration": "00:15:00",
      "explicit": false,
      "youTubeId": "9OnvYrfW1p0",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9OnvYrfW1p0"
      }
    },
    {
      "id": "405d1f3c-09fd-4c42-bc62-852410c57842",
      "title": "‘Damage is already done’: Bill Gates attempts to erase latest Epstein claim in new interview",
      "description": "Writer Esther Krakue claims the “damage is already done” for Bill Gates after new allegations about him surfaced from the Epstein files. \n\n“The allegation that he presumably got an STD from a Russian prostitute that was associated with Jeffrey Epstein was actually written in a note by Jeffrey Epstein to himself,” Ms Krakue told Sky News host Chris Kenny. \n\n“So, it wasn’t actually a form of correspondence.\n\n“They’re allegations that he wrote that for the purpose of explicit blackmailing.”",
      "release": "2026-02-04T07:43:48Z",
      "duration": "00:01:53",
      "explicit": false,
      "youTubeId": "U5Vl8niRHsM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=U5Vl8niRHsM"
      }
    },
    {
      "id": "ed3df55e-b16b-4da2-ba5c-d1db6f0dec30",
      "title": "‘The brother I have always wished for’: Sarah Ferguson’s emails to Epstein released",
      "description": "The latest batch of documents released by the US Justice Department related to r Jeffrey Epstein includes emails and exchanges involving Prince Andrew and his ex-wife, Sarah Ferguson. \n\nThe files reveal an email exchange between Epstein and Andrew about a potential dinner companion.\n\nIn the files was also a message from Sarah Ferguson thanking Epstein for his support and kindness.",
      "release": "2026-01-30T21:22:43Z",
      "duration": "00:03:05",
      "explicit": false,
      "youTubeId": "NJPJyDJFTxg",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NJPJyDJFTxg"
      }
    },
    {
      "id": "c59b6564-8b2d-4b63-af90-b51131423a39",
      "title": "Shocking exchange of Epstein and former Prince Andrew discussing a Russian woman",
      "description": "The US Justice Department is releasing more than three million pages of documents related to the convicted sex offender Jeffrey Epstein.\n\nThis includes more than 2 thousand videos and 180 thousand images and includes never-before-seen correspondence between the sex offender and the former Prince Andrew. \n\nOne email exchange from August 2010 shows Epstein offering to introduce Andrew to a \u0027Russian\u0027 woman, to which Andrew replied positively. \n\nThe emails also suggest Andrew was frustrated about not being able to participate in certain opportunities.",
      "release": "2026-01-30T19:36:59Z",
      "duration": "00:03:44",
      "explicit": false,
      "youTubeId": "8XanT6d9ZBo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8XanT6d9ZBo"
      }
    },
    {
      "id": "af2fbfa2-39ce-4f42-9a8e-fff55d727b3e",
      "title": "House panel votes to hold Clintons in contempt over Epstein probe",
      "description": "The US House Oversight Committee has voted to hold former US president Bill Clinton and his wife Hillary in contempt of Congress.\n\nThe couple is refusing to meet the panel over its investigation into convicted sex offender Jeffrey Epstein.\n\nSome Democrats predict that potentially prosecuting a former president will backfire.",
      "release": "2026-01-22T05:37:51Z",
      "duration": "00:01:52",
      "explicit": false,
      "youTubeId": "o-xejG5EV20",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=o-xejG5EV20"
      }
    },
    {
      "id": "1a34f9e7-da55-4d9c-b511-ffddaa05aa97",
      "title": "Trump calls the Epstein Files a hoax",
      "description": "US President Donald Trump is blaming the Democrats for the latest Epstein files release and is accusing them of pushing a hoax.\n\n\u0022Now one million more pages on Epstein are found. DOJ is being forced to spend all of its time on this Democrat inspired Hoax,” Mr Trump said.\n\nAccording to the US government, the rest of the Epstein files will be released in the new year.",
      "release": "2025-12-27T07:06:23Z",
      "duration": "00:00:45",
      "explicit": false,
      "youTubeId": "dIr7QkRVl-Q",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dIr7QkRVl-Q"
      }
    },
    {
      "id": "b46b4988-2ec0-4e9a-96b0-aa46e4c2678a",
      "title": "Evidence against Ghislaine Maxwell to be released amid Epstein file drama",
      "description": "A federal judge in the US has ruled the Justice Department can publicly release hundreds of investigative documents from the sex trafficking case involving Ghislaine Maxwell.\n\nThe decision follows the passage of the Epstein Files Transparency Act, which was signed into law last month.\n\nThe ruling means the department can publicly release evidence gathered against Ghislaine Maxwell.",
      "release": "2025-12-09T22:27:02Z",
      "duration": "00:00:32",
      "explicit": false,
      "youTubeId": "HKDQ8bt4-yY",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HKDQ8bt4-yY"
      }
    },
    {
      "id": "d340c557-687f-49e7-bbf9-cb0bb131e852",
      "title": "Andrew \u0027avoiding the US like a plague\u0027 to avoid being compelled to testify about Epstein",
      "description": "‘Kinsey Schofield Unfiltered’ host Kinsey Schofield says “humiliating” Andrew Mountbatten Windsor will “avoid the United States like a plague”. \n\n“Pressure is mounting for him to testify before a key US congressional committee,” Ms Schofield told Sky News host Rita Panahi. \n\n“Members of the House Oversight Committee are urging him to disclose any information he may have about Jeffrey Epstein’s activities. \n\n“If Andrew travels to the United States, he would fall under congressional jurisdiction and could be compelled to testify.”",
      "release": "2025-11-06T07:21:39Z",
      "duration": "00:10:07",
      "explicit": false,
      "youTubeId": "mToANohfGT4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mToANohfGT4"
      }
    },
    {
      "id": "40600585-ad2d-459d-9acc-721f95ec59ec",
      "title": "Younger generation of royals ‘thoroughly repulsed’ by Prince Andrew allegations",
      "description": "Royal historian and writer Tessa Dunlop says younger generations of royals are feeling “thoroughly repulsed” by allegations against Prince Andrew.\n\nBuckingham Palace released a statement stating Prince Andrew’s new name will be Andrew Mountbatten Windsor.\n\nMs Dunlop told Sky News Australia that it “took a lot” for King Charles to remove Prince Andrew’s royal titles, despite years of controversy and allegations against him.",
      "release": "2025-10-31T01:05:11Z",
      "duration": "00:10:31",
      "explicit": false,
      "youTubeId": "0AcN9Vm6r1c",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0AcN9Vm6r1c"
      }
    },
    {
      "id": "77cb53f0-ad96-4486-ba6a-16ff44836b87",
      "title": "‘Regular old Andrew’: Buckingham Palace remove Prince Andrew’s royal titles",
      "description": "Sky News contributor Sophie Elsworth discusses the removal of Prince Andrew’s royal titles.\n\nBuckingham Palace released a statement stating Prince Andrew’s new name will be Andrew Mountbatten Windsor.\n\nMs Elsworth told Sky News Australia that he will now become “regular old Andrew”.",
      "release": "2025-10-30T20:41:25Z",
      "duration": "00:05:26",
      "explicit": false,
      "youTubeId": "f_SNj_VWn0k",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f_SNj_VWn0k"
      }
    },
    {
      "id": "6ad047ce-9785-4a34-9334-68d10dfd1c86",
      "title": "‘Typical way of a cult’: Australians ‘sick’ of being forced to adopt net zero",
      "description": "Former deputy prime minister Barnaby Joyce discusses the City of Melbourne’s CEO jetting to Cairo despite the City of Melbourne website pushing for citizens to walk and ride to work.\n\n“It’s the typical way of a cult,” Mr Joyce told Sky News host James Macpherson.\n\n“This always happens around these cults; the Australian people are sick of being in this cult.\n\n“Bowen, he lives in this alternate cultish universe.”",
      "release": "2025-07-31T10:03:40Z",
      "duration": "00:12:25",
      "explicit": false,
      "youTubeId": "dJakpLMDiM0",
      "subjects": [
        "Political Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dJakpLMDiM0"
      }
    },
    {
      "id": "94fdfe04-18ef-46eb-9e9b-0efd7797cc1b",
      "title": "‘Definition of a cult’: Australian Greens co-founder opens up about his expulsion from party",
      "description": "Greens co-founder Drew Hutton meets with Sky News host Chris Kenny to examine the reasoning behind his expulsion from the Australian Greens Party.",
      "release": "2025-07-22T08:08:33Z",
      "duration": "00:07:23",
      "explicit": false,
      "youTubeId": "iplsa2tinwk",
      "subjects": [
        "Political Cult",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iplsa2tinwk"
      }
    },
    {
      "id": "1dbbdd9f-840e-4e48-a740-eca6b3fb2d01",
      "title": "Victorian parliamentary hearing into cult groups commences",
      "description": "Psychologist and cult survivor Maria Esquerra has spoken on the “overdue” parliamentary hearing by the Victorian government into cults and fringe groups. \n\n“Myself with a lot of other people, mostly who grew up in cults, actually … we got together, and we made a bunch of submissions to Chris Couzens in Victoria in the legislative assembly, and that’s what’s triggered this,” Ms Esquerra told Sky News Australia. \n\nThis hearing states they are not judging people’s religious beliefs, but rather examining groups who harm others emotionally, financially, and physically. \n\nIf you or anyone you know needs help:\nKids Helpline – 1800 55 1800\nLifeline – 13 11 14\nBeyond Blue – 1300 22 4636",
      "release": "2025-05-11T08:22:00Z",
      "duration": "00:05:55",
      "explicit": false,
      "youTubeId": "oqwAZGBiQNg",
      "subjects": [
        "Legislation",
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oqwAZGBiQNg"
      }
    }
  ]
}