{
  "_ts": 0,
  "id": "4abd55bc-d8fb-47b9-9541-9934589c9594",
  "name": "Sliding Doors",
  "spotifyId": "1ulGR6xXrVXABE1kfbxtm4",
  "appleId": 1546497838,
  "episodes": [
    {
      "id": "09a88f1f-e0a8-48ae-bc79-f16b69ea4745",
      "title": "Cherry Healey: What if she hadn\u0027t met that BBC Director?",
      "description": "Cherry Healey is TV Presenter and Broadcaster best known for presenting Inside the Factory for 9 series and 10 Years Younger in 10 days. She began her onscreen career with numerous self-titled lifestyle documentaries series for BBC Three, focusing on life through her perspective as a woman, including studies on drinking, childbirth, body issues, dating and money. She has since presented BBC’s Supermarket Secrets, Sunday Morning Live and she took part in Celebrity MasterChef. In 2022 Cherry achieved a lifelong ambition by fronting \u0027Women’s Health: Breaking the Taboos\u0027- the first ever television programme to focus solely on women’s health, and she continues to advocate for investment and improvement in the sector. In this episode Cherry is open and honest about the ups and downs in her life and where her passion, motivation and dedication comes from in all aspects of her life. We delve in her spiritual beliefs and the magic of the universe when it comes to fate and luck! Her Sliding Doors Moment include: when she nearly joined a religious cult when she was younger that would have taken her down a totally different path, the chance meeting of a Director at the BBC that became a light bulb moment and was the catalyst to her career in TV, and a near death experience in Thailand. Follow the podcast to hear more amazing Sliding Doors Moments every week! To share your own sliding door moments, discuss your thoughts on episodes and enjoy bonus content, join us on Facebook and Instagram! @slidingdoorspod Hosted by: @jenbecks28 Guest: @cherryhealey Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-05-08T05:50:00Z",
      "duration": "01:06:59.5390000",
      "explicit": true,
      "spotifyId": "3lSdV0oUpnf8dtpOkmR4UQ",
      "appleId": 1000706766090,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3lSdV0oUpnf8dtpOkmR4UQ",
        "apple": "https://podcasts.apple.com/podcast/cherry-healey-what-if-she-hadnt-met-that-bbc-director/id1546497838?i=1000706766090"
      }
    }
  ]
}