{
  "id": "a69ec7c0-cd00-421e-9d5c-386d2494dbba",
  "name": "Smart Friends",
  "spotifyId": "1s5DQ6KDvA9thljJcTnIST",
  "appleId": 1549324835,
  "episodes": [
    {
      "id": "4b48e58c-68a5-439f-b3ce-487999c7c339",
      "title": "#092 Sarma Melngailis: Bad Vegan, Memoir as Recovery, and Reclaiming Your Story",
      "description": "Topics: (00:00:00) - Intro (00:01:37) - The Netflix documentary: Misrepresentation and struggles (00:03:19) - Writing the memoir (00:08:47) - The challenges of independent publishing (00:12:40) - The creative process and future plans (00:35:23) - Impact of the book on readers (00:36:04) - Scripted series and unused content (00:36:36) - New docuseries and correcting the narrative (00:37:04) - Psychological analysis in documentaries (00:40:13) - Challenges and rewards of writing (00:41:36) - Unexpected positive outcomes (00:45:38) - Vulnerability of publishing a memoir (00:49:44) - Future aspirations and business rebuilding (00:53:54) - Experience with Scribe Publishing (01:02:59) - Advice for aspiring authors Links: People: Andrew Huberman — https://hubermanlab.com/about David Goggins — https://davidgoggins.com Eric Jorgenson — https://www.ericjorgenson.com Mary Karr — https://english.utexas.edu/people/mary-karr Paul Millerd — https://www.pathlesspath.com Sarma Melngailis — https://thegirlandtheduck.com Tim Ferriss — https://tim.blog Podcasts: Huberman Lab — https://hubermanlab.com The Tim Ferriss Show — https://tim.blog/podcast Companies: Scribe — https://scribemedia.com Websites / Tools / Platforms: Scrivener — https://www.literatureandlatte.com/scrivener/overview The Girl and the Duck (Sarma’s memoir site) — https://thegirlandtheduck.com To support the costs of producing this podcast: \u003E\u003E Buy a copy of the Navalmanack: www.navalmanack.com/ \u003E\u003E Buy a copy of The Anthology of Balaji: https://balajianthology.com/ \u003E\u003E Sign up for my online course and community about building your Personal Leverage: https://www.ejorgenson.com/leverage \u003E\u003E Invest in early-stage companies alongside Eric and his partners at Rolling Fun: https://angel.co/v/back/rolling-fun \u003E\u003E Join the free weekly email list at ejorgenson.com/newsletter \u003E\u003E Text the podcast to a friend \u003E\u003E Or at least give the podcast a positive review to help us reach new listeners! We discuss: What the Netflix docuseries got wrong—and how she’s correcting it. The emotional and creative process of writing a 200,000-word memoir over eight years. How storytelling, honesty, and empathy can help others escape manipulative relationships. Quotes from Sam: “I was in a cult of one.” “People very often don\u0027t understand how this happens to someone who’s intelligent, who went to a good school, and started a business. But it does happen.” “I started writing immediately after I got out of jail.” “I had no editorial control... They basically changed the reality of what happened.” (on the Bad Vegan docuseries) “I didn’t want anybody telling me what I can and can’t put in there... I wanted to have control over my story.” “The book is long because I needed the reader to go through the psychological experience with me.” “I have all my receipts. I included actual journal entries, G-chats, texts, and emails.” “The writing was therapeutic, but also grueling. Sometimes I felt like I was crawling up the wall and slithering out of my skin.” “I want the story to be useful. That’s what I’ve wanted all along.” “People tell me, ‘I don’t read books anymore, but I read yours.’ That feels amazing.” “Even if you\u0027re never going to publish it, writing about what happened to you can bring real relief.” “I turned down a deal with a major studio because I didn’t want to give up control of my story again.” “It wasn’t about power—it was about protecting the integrity of the story.” “Someone told me they left a toxic relationship because of reading my book. That alone makes it all worth it.”",
      "release": "2025-08-05T15:35:00Z",
      "duration": "01:07:23.3110000",
      "explicit": false,
      "spotifyId": "2vSjXB9t9LhHcw9MQG2koc",
      "appleId": 1000720743865,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2vSjXB9t9LhHcw9MQG2koc",
        "apple": "https://podcasts.apple.com/podcast/sarma-melngailis-bad-vegan-memoir-as-recovery-and/id1549324835?i=1000720743865"
      }
    }
  ]
}