{
  "id": "3dbbe952-7f3a-4593-92fa-e24bbaf1c4c5",
  "name": "Smartest Year Ever",
  "appleId": 1788214819,
  "youTubeChannelId": "UCm3cQBZ7umKIU3oC5p2bQKg",
  "episodes": [
    {
      "id": "ffe5c68a-283a-47bd-b4b6-0045881ff17a",
      "title": "Cargo Cults: When WWII Supplies Became a Religion",
      "description": "During World War II, isolated island communities in the South Pacific witnessed something extraordinary: aircraft landing with radios, weapons, food, and medicine—then disappearing without explanation. When the war ended and the planes stopped coming, some local groups took a bold step.\nThey built imitation airstrips, crafted wooden radios, and created rituals to summon the cargo back.\n\nIn today’s episode, Gordy explores the strange, profound world of cargo cults—what they really were, how they started, and what they reveal about belief, colonialism, and the way we explain the unexplainable. From the mysterious figure of John Frum to modern-day uses of the phrase in science and tech culture, this story is far more relevant—and unsettling—than it seems.\nHow do people react when an alien world drops out of the sky… and then vanishes?\n\nWatch to the end to learn how a WWII legacy turned into ritual, mythology, and mimicry—and why the term “cargo cult” still echoes in conversations about science, programming, and even self-help culture.\n\nSources:\nWorsley, P. (1957). The Trumpet Shall Sound: A Study of \u0027Cargo\u0027 Cults in Melanesia. MacGibbon \u0026 Kee.\n\nLindstrom, L. (1993). Cargo Cult: Strange Stories of Desire from Melanesia and Beyond. University of Hawaii Press.\n\nKaplan, M. (1995). Neither Cargo Nor Cult: Ritual Politics and the Colonial Imagination in Fiji. Duke University Press.\n\nRynkiewich, M. A. (2004). “Where Are the Cargo Cults in Contemporary Anthropology?” Anthropology News, American Anthropological Association.\n\nFeynman, R. P. (1974). “Cargo Cult Science.” Engineering and Science, 37(7), 10–13.\n\n\n #WWIIHistory #Anthropology #Melanesia #JohnFrum #CargoCults #CulturalHistory\n Music thanks to Zapsplat.",
      "release": "2025-08-08T14:00:08Z",
      "duration": "00:05:59",
      "explicit": false,
      "appleId": 1000721194612,
      "youTubeId": "2cPKc-lH4No",
      "subjects": [
        "John Frum"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/cargo-cults-when-wwii-supplies-became-a-religion/id1788214819?i=1000721194612",
        "youtube": "https://www.youtube.com/watch?v=2cPKc-lH4No"
      }
    }
  ]
}