{
  "id": "d681ea82-fc56-4a97-bb54-d96e72ccdb70",
  "name": "...So Tell Me About Your Podcast (with Aldo B. Martin)",
  "spotifyId": "4GqQKvkIvFxRrLhZueaXqc",
  "episodes": [
    {
      "id": "c95d76c8-45b6-4a85-8ebb-417c598414c8",
      "title": "Episode 5 - The Cult Vault ",
      "description": "Today we speak with Kasey who is the host of \u0022The Cult Vault\u0022 podcast. \u0022The Cult Vault\u0022 is a long form interview based podcast that focuses on true testimonies of cult survivors and experts. You can also find the Cult Vault on all major podcast platforms and on Youtube. If you\u0027d like more information of would like to get in touch with Kasey, you can find her on twitter or email her at cultvaultpodcast@gmail.com.  More Podcasts By Aldo B. Martin: The ReclamationJammin\u0027 on the OneThe Fatherhood ProjectYALD. The PodcastFinding James Baldwin: The Magpie Years  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/aldo-b-martin/message",
      "release": "2023-05-03T00:00:00",
      "duration": "00:32:59.5940000",
      "explicit": false,
      "spotifyId": "43GWciLTWTUwYKM3VUZGja",
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/43GWciLTWTUwYKM3VUZGja"
      }
    },
    {
      "id": "8f343f47-3bcc-434d-9966-372929d5542e",
      "title": "Episode 11 - Andrew Pledger",
      "description": "In this episode we speak with Andrew Pledger who is the creator and host of Speaking Up and Surviving Bob Jones University. Andrew grew up in the Independent Fundamental Baptist Movement. He now considers his religious upbringing and the organization that he was a part of to be a religious cult. As a member of the LGTBQ community, Andrew describes the difficulty that he had with being accepted by the group that he was a part of. He created the Speaking Up podcast as a way to give a platform for others that have lived through religious abuse and religious trauma.  In doing such a project, he then created the Surviving Bob Jones University podcast where he explores the extreme teachings and behaviors of his former college.   Click here to find out more about Andrew Pledger.  More Podcasts By Aldo B. Martin: ⁠⁠The Reclamation⁠⁠⁠⁠⁠ ⁠Jammin\u0027 on the One⁠⁠⁠⁠⁠ ⁠The Fatherhood Project⁠⁠⁠⁠⁠ ⁠YALD. The Podcast⁠ ⁠⁠⁠⁠⁠Finding James Baldwin: The Magpie Years   ---   Send in a voice message: https://podcasters.spotify.com/pod/show/aldo-b-martin/message",
      "release": "2023-06-21T00:00:00",
      "duration": "00:32:30.4520000",
      "explicit": false,
      "spotifyId": "6rmBcvFJoIKKdTiDzV5lRt",
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6rmBcvFJoIKKdTiDzV5lRt"
      }
    }
  ]
}