{
  "id": "7885978a-7600-463b-b8d1-8f385cbbc3e1",
  "name": "Soberly Speaking Podcast",
  "spotifyId": "5L6HER07FkCgWjYUVqsnt1",
  "appleId": 1770685859,
  "youTubeChannelId": "UC6PxkdN4foktZBN4w2zWeKg",
  "episodes": [
    {
      "id": "e6752871-180c-4b10-8d43-fec2ce062712",
      "title": "Sex Work, Cults \u0026 Binge Eating: Bianca\u0027s Story",
      "description": "Trigger warning: This episode discusses eating disorders, substance abuse, domestic violence and pregnancy loss.\n\nBianca is a full-service sex worker addicted to feeling good. When she works, the urge for alcohol and drugs disappears, but for as long as she can remember, she has been chasing dopamine through binge eating, ice addiction, or sex. In this episode, we dive into how one addiction can replace another, her abusive past with men, and her accidental involvement with a Russian sex cult.\n\nReady to share your story? Email: ⁠⁠⁠⁠⁠hello@soberlyspeaking.com.au⁠⁠⁠⁠⁠\n\nDisclaimer: The stories and experiences shared in this episode are personal accounts told in good faith. While we strive to present these narratives accurately, the views and claims expressed are those of the individuals involved and have not been independently verified. Soberly Speaking and its host, Julia Rangiheuea, do not take responsibility for the accuracy or validity of the information shared. Listener discretion is advised.\n\nThe National Alcohol \u0026 Other Drug Hotline is a free and confidential 24/7 phone service that provides counselling, advice, and information for those struggling with addiction. Call 1800 250 015\n\n⁠⁠⁠⁠⁠https://toolkit.lifeline.org.au/articles/support/national-alcohol-other-drug-hotline⁠⁠⁠⁠⁠\n\n\nCreator \u0026 Host- ⁠⁠⁠⁠⁠Julia Rangiheuea⁠⁠⁠⁠⁠\n\nImage \u0026 Logo- ⁠⁠⁠⁠⁠Jasmine Rule⁠⁠⁠⁠⁠\n\n\nIn the spirit of reconciliation Soberly Speaking acknowledges the Traditional Custodians of Country throughout Australia and their connections to land, sea and community. We pay our respect to their Elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.",
      "release": "2025-10-26T11:41:51Z",
      "duration": "00:45:21",
      "explicit": false,
      "spotifyId": "7fhlD8qUO2iidK0kidG7mj",
      "appleId": 1000733576691,
      "youTubeId": "ash2BwESk5I",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7fhlD8qUO2iidK0kidG7mj",
        "apple": "https://podcasts.apple.com/podcast/sex-work-cults-binge-eating-biancas-story/id1770685859?i=1000733576691",
        "youtube": "https://www.youtube.com/watch?v=ash2BwESk5I"
      }
    }
  ]
}