{
  "_ts": 0,
  "id": "e45c653a-5e24-496b-9565-e66c192c014b",
  "name": "Sobriety Bestie Podcast",
  "spotifyId": "48bBadXm0tgvgbGzr6pDuF",
  "appleId": 1750328642,
  "youTubeChannelId": "UCWefB6bk8reofI7ZnXfPTNA",
  "episodes": [
    {
      "id": "e2eab310-fa6c-4f37-bd06-53acda749a6e",
      "title": "Ep 35 Finding A Good Therapist After AA",
      "description": "When you\u0027re deprogramming from Alcoholics Anonymous or any high-control group, finding the right therapist can make all the difference. In this episode of the Sobriety Bestie Podcast, I walk you through key questions to ask when choosing a therapist — based on advice from cult recovery expert Dr. Janja Lalich. This isn’t just about credentials. It’s about alignment, safety, and whether your therapist truly supports your freedom — not just your compliance. Read the list of Q\u0027s on Dr. Janja Lalich\u0027s website here . \u0026#x1fa77; It\u0027s safe to trust yourself \u0026#x1fa77; \u0026#x1f9d8;\u0026#x1f3fc;‍♀️ GO DEEPER WITH ONLINE COURSES \u0026#x1f447; \u0026#x1f300; Deprogram AA \u0026#x1f981; Liberated in Sober Skin \u0026#x1f680; Rocket Your Recovery \u0026#x1f48a; Digital Anxiety Pill \u0026#x1f4a5; Big Dream Energy \u0026#x1f497; Live Your Truth \u0026#x1f698; Driving Anxiety \u0026#x1f9d8;\u0026#x1f3fc;‍♀️ FREE RESOURCES to jumpstart your evolution \u0026#x1f447; \u0026#x1f4cd; Roadmap to Freedom Masterclass \u0026#x1f981; Sober Confidence Mini Course \u0026#x1f4d5; Self Love \u0026#43; Emotional Sobriety Book \u0026#x1f9e0; Neurodivergent Discovery Portal \u0026#x1f4fa; My TED talk on trauma \u0026#43; addiction \u0026#x1f4d6; 30 Signs You\u0027re Being Emotionally Manipulated guide \u0026#x1f4ac; Let’s Connect @SobrietyBestie DM me or reply to any post on IG or FB. I’m here for the conversation. Let’s get f*cking free.",
      "release": "2025-05-09T13:00:00Z",
      "duration": "00:07:44.1000000",
      "explicit": true,
      "spotifyId": "2kvJjIFQYT0AFhjjAZd8vW",
      "appleId": 1000706966005,
      "subjects": [
        "Cult Recovery",
        "Alcoholics Anonymous",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2kvJjIFQYT0AFhjjAZd8vW",
        "apple": "https://podcasts.apple.com/podcast/ep-35-finding-a-good-therapist-after-aa/id1750328642?i=1000706966005"
      }
    },
    {
      "id": "e528eb3f-4ca4-416d-bf38-6068816272a8",
      "title": "Ep 25 Is Alcoholics Anonymous a Cult?",
      "description": "The question so many of us wonder... Is Alcoholics Anonymous a Cult? We\u0027re pulling today\u0027s pod from Sobriety Bestie YouTube on.. is AA a cult. Listen in here or you can watch it on Sobriety Bestie Youtube. Based on my 10 years inside AA, 5 years outside AA, and everything I’ve learned since speaking publicly — I’m unpacking it all. Inside this episode: ✨ My first impressions of AA (hint: it wasn’t great) ✨ Love bombing, mind control, and \u0022friends with conditions\u0022 ✨ Why informed consent matters in recovery ✨ How the real whiplash hit AFTER I left ✨ Why speaking out is met with cult-like behavior ✨ And how my mind is still evolving on this question today This is about truth. freedom. critical thinking. If you’ve ever wondered: – \u0022What the hell did I just go through?\u0022 – \u0022Why does leaving AA feel so intense?\u0022 – \u0022Am I crazy for questioning it?\u0022 You are not alone. There are thousands of us silently thriving after leaving AA. It’s time to have the conversations that help us heal, evolve and move forward. \u0026#x1f517; Links \u0026#43; Resources Mentioned: \u0026#x1f4d8; Deprogramming AA Course — Evolving After Recovery A self-paced deprogramming journey to break free and rebuild your truth. → Enroll here \u0026#x1f4f2; Instagram — Come hang or DM me your thoughts, feels or story → @sobrietybestie \u0026#x1f4d8; Personal Facebook — Real talk and real freedom. → Connect here \u0026#x1f4fa; YouTube Playlist — Leaving Recovery More videos unpacking AA exit, dogma detox, and after-recovery life. → Watch here \u0026#x1f4ac; Let\u0027s Talk: Have you ever wondered if AA is a cult? What was your moment of doubt — or clarity? Send me a DM or leave a comment — let’s create a new kind of conversation: one based on truth, not silence. \u0026#x1f5a4;",
      "release": "2025-04-27T13:00:00Z",
      "duration": "00:36:22.0300000",
      "explicit": true,
      "spotifyId": "21jgUzCBvMukCHlRr1E0aB",
      "appleId": 1000705129386,
      "youTubeId": "753-KGkAcGI",
      "subjects": [
        "Alcoholics Anonymous"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21jgUzCBvMukCHlRr1E0aB",
        "apple": "https://podcasts.apple.com/podcast/ep-25-is-alcoholics-anonymous-a-cult/id1750328642?i=1000705129386",
        "youtube": "https://www.youtube.com/watch?v=753-KGkAcGI"
      }
    }
  ]
}