{
  "_ts": 0,
  "id": "4ed24424-3346-4b50-8c91-bc1de6f57d35",
  "name": "Soli",
  "spotifyId": "4m0aq6ojgGCcuhZ0Rzy44l",
  "appleId": 1447099791,
  "episodes": [
    {
      "id": "208d900d-688b-44f4-a145-748dcbfafbef",
      "title": "Ep. 14 | Guarire le ferite -  Amara Parte 2",
      "description": "di Roberta Lippi | Nella seconda parte della storia, Amara prende consapevolezza di quello che le è accaduto: è stata lentamente spinta verso il mondo della prostituzione. Non se ne è quasi accorta, perché quando è accaduto era solo un\u0027adolescente. Un\u0027adolescente che però diventa donna e fatica per anni a uscire da quel meccanismo che malsano. In questo episodio Amara ci racconta il suo difficile percorso verso la risalita, una vita felice e soddisfacente lontana dalla comunità, che però ha continuato a frequentare ancora per lungo tempo dopo aver abbandonato il mondo assurdo nel quale si è venduta. Oggi, tornata Sabine, ha ricevuto le risposte che cercava da anni nelle parole di altri testimoni del podcast e vuole raccontare come sono andate davvero le cose per lei e, ormai ne è certa, tante altre bambine e bambini sannyasin. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-02-08T06:00:02Z",
      "duration": "00:49:08.0220000",
      "explicit": false,
      "spotifyId": "4idmWcj2xB8zsCJSjepjtg",
      "appleId": 1000598588137,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4idmWcj2xB8zsCJSjepjtg",
        "apple": "https://podcasts.apple.com/podcast/ep-14-guarire-le-ferite-amara-parte-2/id1447099791?i=1000598588137"
      }
    },
    {
      "id": "eecb86b6-63af-448e-920b-17cc68b7af5d",
      "title": "Ep. 13 | Una storia tutta nuova - Amara Parte 1",
      "description": "di Roberta Lippi | Sabine è un\u0027adolescente come tante quando entra in contatto con il mondo sannyasin. Sono gli anni 80 e pur di restare accanto al gruppo decide di andarsene da casa, nonostante quello che le dicono i genitori. Diventa così Amara e deve imparare a mantenersi da sola per continuare a vivere la sua ricerca di spiritualità, soddisfare le aspettative della comunità e poter andare al Summer Festival in Oregon, la festa che riunisce i sannyasin di tutto il mondo da quando Osho ha deciso di creare la sua città ideale in America, in quel pezzo di terra che ha chiamato Rajneeshpuram. E così, tra scuola e comune, Amara viene lentamente introdotta a un modo molto semplice di fare soldi, ovvero fare quello che fanno già tante altre ragazze della comunità e che fino a oggi è stato solo accennato nei ricordi degli adulti e bambini sannyasin: vendersi. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-02-07T06:00:02Z",
      "duration": "00:34:06.7200000",
      "explicit": false,
      "spotifyId": "35A7oCbvxE8LSmk34jGOMy",
      "appleId": 1000598401949,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/35A7oCbvxE8LSmk34jGOMy",
        "apple": "https://podcasts.apple.com/podcast/ep-13-una-storia-tutta-nuova-amara-parte-1/id1447099791?i=1000598401949"
      }
    },
    {
      "id": "60df7058-7bdd-4900-9799-f296b2837498",
      "title": "Dragon Lady - Parte 6",
      "description": "di Roberta Lippi | Dopo anni di imposizioni e drammatica accettazione di un mondo totalmente fuori dalla realtà, Deeksha si rende conto di quanto il suo ruolo sia stato fondamentale per la nascita, la crescita e la caduta del mondo sannyasin. Troppe le voci di chi ha sofferto e di chi si è perso che sono rimaste in silenzio, troppe le violenze e i soprusi. Questa è la consegna definitiva della verità, perché la storia non si ripeta. Consigli di lettura sull\u0027argomento: Rajneeshpuram: Inside the Cult of Bhagwan and Its Failed American Utopia by Russell King Sins of My Father: A Daughter, a Cult, a Wild Unravelling by Lily Dunn Charisma and Control in Rajneeshpuram: A Community without Shared Values (American Sociological Association Rose Monographs) by Lewis F. Carter My Life in Orange: Growing Up with the Guru by Tim Guest Breaking the Spell: My life as a Rajneeshee, and the long journey back to freedom by Jane Stork The Guru Papers: Masks of Authoritarian Power by Joel Kramer and Diana Alstad Bounded Choice: True Believers and Charismatic Cults by Janja A. Lalich The Mother of God by Luna Tarlo Holy Hell: A Memoir of Faith, Devotion, and Pure Madness by Gail Tredwell Combating Cult Mind Control: The #1 Best-Selling Guide to Protection, Rescue, and Recovery from Destructive Cults by Steven Hassan, Daniel Greenberg, et al. Bhagwan: The God That Failed by Hugh Milne When she comes back By Ronit Plank Wild Wild Sheela - Le 100 cose che Wild Wild Country non vi ha detto e state cercando su Google Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-02T06:00:02Z",
      "duration": "01:21:11.3920000",
      "explicit": false,
      "spotifyId": "7xmWtkclSJ8e3sok0dRHtZ",
      "appleId": 1000584742875,
      "subjects": [
        "Bhagwan Shree Rajneesh",
        "Buddhafield",
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7xmWtkclSJ8e3sok0dRHtZ",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-parte-6/id1447099791?i=1000584742875"
      }
    },
    {
      "id": "9cdd6b65-899b-436c-8cce-9aff7ff90bfd",
      "title": "Dragon Lady - Parte 5",
      "description": "Deeksha dà seguito alle ultime richieste del guru, ma appena può fugge da Rajneeshpuram. Il suo nome ora rappresenta un pericolo per l\u0027intera comunità: riportarla dentro con ogni mezzo o fargliela pagare? Ma le intimidazioni non hanno presa sulla donna che decide di tornare a dare voce alla Dragon Lady che è in lei. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-10-19T05:00:02Z",
      "duration": "01:15:15.9180000",
      "explicit": false,
      "spotifyId": "5zaDs8wqDLeS4W2I4a3D28",
      "appleId": 1000583111516,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5zaDs8wqDLeS4W2I4a3D28",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-parte-5/id1447099791?i=1000583111516"
      }
    },
    {
      "id": "f011e57f-aff8-4a94-b52d-be9f356d121b",
      "title": "Dragon Lady - Parte 4",
      "description": "Nel New Jersey, Deeksha e Sheela assecondano i capricci del guru mentre cercano di dare vita alla nuova comune di Rajneeshpuram, ma all\u0027improvviso la storia prende una virata per una delle due: mentre Sheela asseconda Osho in tutto ciò che fa, chiede, insegna, Deeksha ha un\u0027illuminazione, ma non del tipo mistico: chi è realmente l\u0027uomo che credeva di aver conosciuto dieci anni prima e che ha sempre considerato un maestro? E cosa vuole veramente? Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-10-05T05:00:02Z",
      "duration": "01:19:13.1620000",
      "explicit": false,
      "spotifyId": "4L8b1vGsrq1o2lluNWnCl8",
      "appleId": 1000581632979,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4L8b1vGsrq1o2lluNWnCl8",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-parte-4/id1447099791?i=1000581632979"
      }
    },
    {
      "id": "326e21c9-52d8-4483-96af-7f6d82d740ca",
      "title": "Dragon Lady - Parte 3",
      "description": "La comunità è diventata così grande da essere quasi ingestibile, i pettegolezzi su quello che avviene nell\u0027ashram aumentano e strane vicende acuiscono i sospetti su quanto accade una volta varcati i cancelli dell’ashram di Puna. Sheela riesce a ottenere il potere che tanto ambisce e convince il guru a trasferirsi in America. Deeksha ha il compito di organizzare tutto in anticipo e parte per gli Stati Uniti. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-09-21T04:45:02Z",
      "duration": "01:05:49.2960000",
      "explicit": true,
      "spotifyId": "781osvx1SNS3paklPpeoYE",
      "appleId": 1000580144450,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/781osvx1SNS3paklPpeoYE",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-parte-3/id1447099791?i=1000580144450"
      }
    },
    {
      "id": "b7fa99cb-4600-40e5-934b-53b9a9c42700",
      "title": "Dragon Lady - Parte 2",
      "description": "Deeksha è diventata una delle persone più temute e rispettate della comunità. L\u0027ashram cresce a dismisura e lei lavora senza tregua. Forse è per questo che non ha neppure il tempo di rendersi conto che stanno accadendo tante, troppe strane cose all\u0027interno della comune, e che lei stessa ne è inevitabilmente coinvolta. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-09-07T05:00:03Z",
      "duration": "01:11:40.6950000",
      "explicit": true,
      "spotifyId": "6n4CJg4RoJSUUYPcBaptPf",
      "appleId": 1000578661670,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6n4CJg4RoJSUUYPcBaptPf",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-parte-2/id1447099791?i=1000578661670"
      }
    },
    {
      "id": "eef0042d-fd3d-489d-916f-a60ad7126272",
      "title": "Dragon Lady - Parte 1",
      "description": "Una giovane donna, colta e benestante, ha appena intrapreso un viaggio intorno al mondo dopo aver ricevuto un\u0027eredità. Il suo viaggio si fermerà a Bombay, dove un conoscente le dice che c\u0027è un maestro che deve proprio conoscere e dove inizierà a fare per lui proselitismo per portare nuovi adepti occidentali. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-09-07T04:45:01Z",
      "duration": "01:03:00.3620000",
      "explicit": false,
      "spotifyId": "4BNvAePNSnTg7XNgBdZ2KP",
      "appleId": 1000578657037,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BNvAePNSnTg7XNgBdZ2KP",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-parte-1/id1447099791?i=1000578657037"
      }
    },
    {
      "id": "567ddf67-dac2-433f-b3d9-0d79aa89e032",
      "title": "Ep. 12 | La cacciata degli dei",
      "description": "In questa seconda parte dell\u0027episodio dedicato a Siddharta continuiamo a conoscere la storia del Golden Boy, dei suoi viaggi alla ricerca di se stesso e del suo posto nel mondo senza mai dimenticare il Maestro, le sue visite a Rajneeshpuram, che Siddharta vede come la Terra Promessa, e i continui abusi e vessazioni che subisce da parte di Sheela. Chi è oggi Siddharta? Come ricorda quel periodo della sua vita e tutte le persone che, quando era solo un bambino, hanno fatto di tutto fuorché proteggerlo? Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-04-22T05:35:16Z",
      "duration": "00:30:14.9870000",
      "explicit": false,
      "spotifyId": "5slHtj95RrEwYxEoUzQEWG",
      "appleId": 1000518201774,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5slHtj95RrEwYxEoUzQEWG",
        "apple": "https://podcasts.apple.com/podcast/ep-12-la-cacciata-degli-dei/id1447099791?i=1000518201774"
      }
    },
    {
      "id": "d235eebd-b4ab-4ac8-b288-31fe82e7eab3",
      "title": "Ep. 11 | Siddharta, il Golden Boy",
      "description": "Non un bambino di Osho, ma IL bambino di Osho: il protagonista di questo doppio episodio di Soli è Siddharta, il Golden Boy, il bambino prediletto da Baghwan che instaura con lui un legame unico e speciale. Questo gli permetterà di diventare amico di tutti i membri della comunità, benvoluto e amato da tutti, ma anche parecchio odiato e maltrattato da Sheela: fino a dove può spingersi l\u0027invidia umana? E la resilienza di un bambino? Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-04-22T05:30:08Z",
      "duration": "00:35:19.5230000",
      "explicit": false,
      "spotifyId": "6Cf1c0ipVNHPJpBntZKrIp",
      "appleId": 1000518201773,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Cf1c0ipVNHPJpBntZKrIp",
        "apple": "https://podcasts.apple.com/podcast/ep-11-siddharta-il-golden-boy/id1447099791?i=1000518201773"
      }
    },
    {
      "id": "7c29a845-0cdd-4e5b-9ebb-ed6c8f1bf372",
      "title": "Ep. 10 | C\u0027è un\u0027altra verità",
      "description": "Continua il racconto intenso di Bindu, che ricorda la sua vita tra Ko Hsuan, la Svizzera, Puna in India e infine Londra: come vive oggi, che è madre, la sua storia di bambina sannyas? La sua prospettiva è cambiata? Quali tracce ha lasciato quell\u0027esperienza nella Bindu di oggi? Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-09-16T05:40:00Z",
      "duration": "00:36:19.4480000",
      "explicit": false,
      "spotifyId": "11AO7A6dgjkExe8KRW9MYH",
      "appleId": 1000491447915,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/11AO7A6dgjkExe8KRW9MYH",
        "apple": "https://podcasts.apple.com/podcast/ep-10-c%C3%A8-unaltra-verit%C3%A0/id1447099791?i=1000491447915"
      }
    },
    {
      "id": "98dda050-36b3-4860-9e0a-e79b6fe0c146",
      "title": "Ep. 09 | Sono solo Bindu",
      "description": "Dopo diversi mesi dalla pubblicazione di Soli, una nuova voce si unisce al coro delle testimonianze degli ex bambini di Osho: quella di Prem Bindu, nata nella comune di Puna e battezzata da Bhagwan in persona. La storia di Bindu è davvero incredibile: racconta della sua infanzia in India, del rapporto con i suoi genitori e di come è poi diventata attrice, regista e madre, tra la Svizzera e l\u0027Inghilterra. Sentimenti contrastanti emergono dal racconto di Bindu, che ci accompagna tra ricordi dolcissimi e dolorosi, ideali non sempre condivisi ma, in ogni caso, rispettati. La sua vicenda è ricca di riflessioni acute e aneddoti interessanti, tra cui uno, in particolare, che ci ha permesso - inaspettatamente - di chiudere il cerchio e tornare esattamente al punto da cui eravamo partiti all\u0027inizio del viaggio di Soli. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-09-16T05:30:00Z",
      "duration": "00:36:54.3730000",
      "explicit": false,
      "spotifyId": "2zDAupH4lWHYuL5NYg11qJ",
      "appleId": 1000491447914,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zDAupH4lWHYuL5NYg11qJ",
        "apple": "https://podcasts.apple.com/podcast/ep-09-sono-solo-bindu/id1447099791?i=1000491447914"
      }
    },
    {
      "id": "d2a42ca5-5ee7-45e7-bda4-b60ee2353106",
      "title": "Ep. 08 | Nessuno vuole parlare",
      "description": "di Roberta Lippi La messa online di Soli è stata notata dalla comunità dei sannyasin e persino Osho News le ha dedicato un lungo articolo. Abbiamo ascoltato molte storie, molte voci di ex bambini di Osho che negli anni \u002770 furono portati a vivere nelle comuni di Osho dai propri genitori. Ma alla nostra storia mancava ancora un capitolo. Un nuovo episodio di Soli, che è anche un riconoscimento sia a coloro che hanno scelto di condividere e rivivere un’esperienza che ha toccato profondamente le loro vite, sia a chi ha scelto di dimenticare. Protagonista di questo episodio è Maroesja Perizonius, regista olandese che nel 2004 dedica alla sua storia di ex bambina di Osho il documentario “Child of the commune”. Con lucidità e coraggio Maroeja fa i conti con la sua infanzia sannyasin, le scelte che le sono state imposte e la consapevolezza di fronte alla quale è stata messa durante il confronto diretto con gli adulti, che negano ogni responsabilità rispetto a quello che lei ha dovuto vivere. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-06-08T22:10:23Z",
      "duration": "00:30:06.0530000",
      "explicit": false,
      "spotifyId": "51CRsKdSv1KEEgfleCoFQX",
      "appleId": 1000440949460,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/51CRsKdSv1KEEgfleCoFQX",
        "apple": "https://podcasts.apple.com/podcast/ep-08-nessuno-vuole-parlare/id1447099791?i=1000440949460"
      }
    },
    {
      "id": "55f59aee-a6d8-4b67-961a-6ccdd325d5bd",
      "title": "Ep. 07 | Dopo la fuga",
      "description": "di Roberta Lippi Nello scorso episodio, abbiamo visto cosa ha significato per Camila vivere nelle comuni, quali sono stati per lei i momenti più belli e quelli più brutti. Ha descritto la difficoltà di appartenere a una famiglia spesso divisa e l\u0027incubo di dover a un certo punto finire in Inghilterra da sola, fino al giorno in cui i genitori decidono di riportarla a casa e di abbandonare per sempre il movimento sannyasin. Da quel momento in poi, Camila rientra nel mondo \u0022normale\u0022. Non c\u0027è più traccia di Kamla, la bambina che è stata per dieci anni, se non nella sua anima. È arrivato adesso il momento di confrontarsi con i suoi coetanei e tornare a fare le lezioni e la vita che fanno loro. Come affronterà Camila questo cambiamento? E cosa si porterà dentro di questa esperienza? Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-02-24T23:30:00Z",
      "duration": "00:31:18.6480000",
      "explicit": false,
      "spotifyId": "0X59nkqnpwc4Yn8oEknOe8",
      "appleId": 1000430535934,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0X59nkqnpwc4Yn8oEknOe8",
        "apple": "https://podcasts.apple.com/podcast/ep-07-dopo-la-fuga/id1447099791?i=1000430535934"
      }
    },
    {
      "id": "20e7b927-9924-4e49-8096-f1fa345167ed",
      "title": "Ep. 06 | Dov\u0027è mia madre?",
      "description": "di Roberta Lippi Come abbiamo visto, buona parte dei piccoli che hanno vissuto nelle comuni sannyasin oggi sembrano aver sviluppato potenzialità speciali. Una delle ex bambine che conferma questa teoria è Camila Raznovich, volto storico di MTV, conduttrice televisiva di successo, nata nel 1974 da un melting pot di culture: una madre cattolica italiana trapiantata in Argentina da piccolissima, un padre ebreo argentino con origini russe. Camila è stata una bambina sannyasin praticamente dal giorno in cui è nata. Come ha vissuto i primi dieci anni della sua vita? Come ha affrontato le esperienze e gli ostacoli che le si sono presentati? Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-02-24T23:25:00Z",
      "duration": "00:25:13.9000000",
      "explicit": false,
      "spotifyId": "4qJSLeziVqJpHQUipZCOwj",
      "appleId": 1000430536180,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4qJSLeziVqJpHQUipZCOwj",
        "apple": "https://podcasts.apple.com/podcast/ep-06-dov%C3%A8-mia-madre/id1447099791?i=1000430536180"
      }
    },
    {
      "id": "cccbaead-fe04-4614-b1fa-fa4d744be592",
      "title": "Ep. 05 | I giochi proibiti",
      "description": "di Roberta Lippi Osho veniva chiamato il Guru del sesso perché i suoi seguaci erano liberi di dare sfogo alle proprie pulsioni anche con più partner e, anzi, venivano invitati a farlo. Il Maestro non aveva sicuramente problemi a parlare di sesso e dava consigli molto concreti su come ottenere il meglio dall\u0027amplesso. Osho sostiene anche che bisogna essere sinceri, che bisogna dire ai bambini la verità, ma non faceva i conti con una cosa: i bambini imitano i grandi. Vogliono essere come loro, vogliono fare quello che fanno loro. E che succede dunque se quello che vogliono imitare è il sesso? Il protagonista di questo episodio è Swami Anand Satish, che racconta di quanto precoci siano state le sue esperienze all\u0027interno delle comunità sannyasin. Tutte, anche quelle sessuali. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-02-24T23:20:00Z",
      "duration": "00:20:25.4560000",
      "explicit": false,
      "spotifyId": "5srFbX6Dmm0RU35hxv3HmN",
      "appleId": 1000430536179,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5srFbX6Dmm0RU35hxv3HmN",
        "apple": "https://podcasts.apple.com/podcast/ep-05-i-giochi-proibiti/id1447099791?i=1000430536179"
      }
    },
    {
      "id": "607d934b-2102-4761-9a35-e2d8c26c25e9",
      "title": "Ep. 04 | Fuori dal comune",
      "description": "di Roberta Lippi Il protagonista di questo episodio è Massimo, che non è mai diventato sannyasin, ma che sa bene cosa significa esserlo, dal momento che ha vissuto la sua infanzia e giovinezza con una madre devota a Osho. Sua madre, come molti altri genitori, ha deciso di non partire, ma di provare a seguire gli insegnamenti del Maestro dalla sua casa, frequentando le comuni disseminate in tutta Italia: come è stata dunque l’infanzia di Massimo? Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-02-24T23:15:00Z",
      "duration": "00:25:55.2780000",
      "explicit": false,
      "spotifyId": "24y94w7goex3f6NGaqEqk7",
      "appleId": 1000430536177,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/24y94w7goex3f6NGaqEqk7",
        "apple": "https://podcasts.apple.com/podcast/ep-04-fuori-dal-comune/id1447099791?i=1000430536177"
      }
    },
    {
      "id": "597ffe51-65c3-437d-8e28-4831b66a270d",
      "title": "Ep. 03 | Medina: la comune dei bambini",
      "description": "di Roberta Lippi Continua il racconto dell\u0027avventura di Venu e Anugatha, madre e figlio, che per un periodo si dividono: dopo l\u0027apertura di Rajneeshpuram, in Oregon, tutti i bambini delle comuni sparse per il mondo vengono mandati in quella di Medina, in Inghilterra, da soli. Come vive Venu, a soli dieci anni, questo particolare periodo della sua vita, senza sua madre accanto? Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-02-24T23:10:00Z",
      "duration": "00:23:43.1510000",
      "explicit": false,
      "spotifyId": "4K9i2X7MZ4ZTzXi1MQrfUc",
      "appleId": 1000430536178,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4K9i2X7MZ4ZTzXi1MQrfUc",
        "apple": "https://podcasts.apple.com/podcast/ep-03-medina-la-comune-dei-bambini/id1447099791?i=1000430536178"
      }
    },
    {
      "id": "d81adb07-b0a0-48da-b135-ff0e962fbb99",
      "title": "Ep. 02 | Andiamo a Puna",
      "description": "di Roberta Lippi Il piccolo protagonista di questo episodio è Khrisna Venu, il cui nome sannyasin significa \u0022il flauto di Khrisna\u0022. Lo ha ricevuto all\u0027età di 4 anni e mezzo, in India. Sua madre si chiama Ma Prem Anugatha, che significa \u0022una piccola storia d’amore\u0022. Anche lei ha ricevuto il suo nome sannyasin in India, a Puna. È stato Osho in persona a iniziarli al loro cammino, a decidere quale sarebbe stato il loro nome da quel momento, quasi una nuova identità, che attraverso il suo significato definisce un destino. Anugatha e Venu, madre e figlio, sono profondamente legati: hanno vissuto un’esperienza unica, un’esperienza che li ha visti vicini e divisi allo stesso tempo. Questa è la loro storia. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-02-24T23:05:00Z",
      "duration": "00:17:57.1060000",
      "explicit": false,
      "spotifyId": "6PMO2pzjVfTQygtfux4ttr",
      "appleId": 1000430535935,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6PMO2pzjVfTQygtfux4ttr",
        "apple": "https://podcasts.apple.com/podcast/ep-02-andiamo-a-puna/id1447099791?i=1000430535935"
      }
    },
    {
      "id": "1f9e4e3d-3cf7-4fac-b124-137b1cf3f6fc",
      "title": "Ep. 01 | L\u0027antefatto",
      "description": "di Roberta Lippi Bhagwan Shree Rajneesh, poi noto come Osho, è un maestro spirituale indiano che inizia la sua attività negli anni Sessanta. A metà dei Settanta i suoi seguaci fondano per lui l’ashram di Puna, una comunità in India che presto inizia ad accogliere adepti da tutto il mondo. E così in molti si trasferiscono, lasciando tutto: quasi sempre vendono i loro possedimenti per devolvere i propri guadagni a sostegno della comune. Si tratta di giovani adulti, la maggior parte pervasi dalla cultura hippie, in piena ribellione dai conformismi. Molti di loro hanno figli piccoli che li seguiranno in quella che viene percepita come l’avventura più bella della loro vita. Ma la comune, lo dice la parola stessa, mette tutto in comune, anche i figli. E Osho ha le idee molto chiare sul tema: “L’idea che i bambini vi appartengano è sbagliata. I bambini appartengono a se stessi”. Cosa è successo al cuore e all’anima di quei ragazzi? Cosa sono diventati oggi, e perché? Lo scopriremo insieme in questo viaggio, attraverso le loro stesse parole e testimonianze. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-02-24T23:00:00Z",
      "duration": "00:14:53.6220000",
      "explicit": false,
      "spotifyId": "4vD3SINiU9wEW9XQdIOJdP",
      "appleId": 1000430535936,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vD3SINiU9wEW9XQdIOJdP",
        "apple": "https://podcasts.apple.com/podcast/ep-01-lantefatto/id1447099791?i=1000430535936"
      }
    }
  ]
}