{
  "_ts": 0,
  "id": "1c4f77ba-202c-48bb-b34c-1e3ffa7ae70b",
  "name": "Something You Should Know",
  "spotifyId": "0v9reyR22LeAMLQFvPpk6c",
  "appleId": 1150124880,
  "episodes": [
    {
      "id": "6a76f9ad-8df3-4c44-9134-3b61e6fd7c77",
      "title": "Why You Should Talk More Often \u0026 How People Get Brainwashed",
      "description": "Zoom and other platforms have made virtual meetings very convenient and allow people in different locations to gather together in one place. Still, virtual meetings can be inefficient and can waste a lot of time if people aren’t aware of some common don’ts. This episode starts with a list of things not to do or say that can streamline those meetings.  \n\nOne thing that sets us apart from all other animals is our ability to speak and communicate with a complex language. So, we talk. We talk to each other, to ourselves and to no one in particular. The process of creating speech is complicated and it turns out it does more than just communicate our thoughts. there are a lot of benefits to talking out loud and to ourselves.  We need to talk according to my guest Maryellen McDonald. She is a cognitive scientist and professor of psychology and language sciences at the University of Wisconsin−Madison. She is also author of the book  More Than Words: How Talking Sharpens the Mind and Shapes Our World  (https://amzn.to/44VKNZ5).\n\nYou often hear the term – “brainwashing” but what is it really? How does it work to get people to join a cult or believe some fringe theory that most people think is crazy? It’s interesting that we only think people have been brainwashed if what they believe differs from what we believe. Here to help us understand brainwashing is Rebecca Lemov. She is a historian of science at Harvard University and author of the book ok The Instability of Truth: Brainwashing, Mind Control, and Hyper-Persuasion (https://amzn.to/3Fw8Pzn).\n\nPrice optimization. It’s a term that describes why you may be paying more for car insurance than you need to even if you’ve been a loyal customer to your existing car insurer. Listen and you could end up saving a lot of money.  https://consumerfed.org/testimonial/consumer-federation-of-america-sends-letter-highlighting-opposition-to-price-optimization/\n\nPLEASE SUPPORT OUR SPONSORS!!!\n\nMINT MOBILE:  Ditch overpriced wireless and get 3 months of premium wireless service from Mint Mobile for 15 bucks a month at ⁠⁠⁠⁠⁠⁠⁠https://MintMobile.com/something⁠⁠⁠⁠⁠⁠⁠ !\n\nFACTOR: Eat smart with Factor!  Get 50% off at ⁠⁠⁠⁠⁠⁠⁠⁠⁠https://FactorMeals.com/something50off⁠⁠⁠⁠⁠⁠⁠⁠⁠\n\nROCKET MONEY:  Cancel your unwanted subscriptions and reach your financial goals faster!  Go to ⁠⁠⁠⁠https://RocketMoney.com/SOMETHING⁠⁠⁠⁠\n\nQUINCE:  Elevate your shopping with Quince!  Go to  ⁠⁠⁠⁠⁠⁠⁠⁠⁠https://Quince.com/sysk⁠⁠⁠⁠⁠⁠⁠⁠⁠ for free shipping on your order and 365 day returns!\n\nINDEED: Get a $75 sponsored job credit to get your jobs more visibility at ⁠⁠⁠⁠⁠⁠⁠⁠⁠https://Indeed.com/SOMETHING⁠⁠⁠⁠⁠⁠⁠⁠⁠ right now!\n\nDELL:  Introducing the new Dell AI PC .  It’s not just an AI computer, it’s a computer built for AI to help do your busywork for you!  Get a new Dell AI PC at https://Dell.com/ai-pc\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-06-02T07:00:00Z",
      "duration": "00:52:52",
      "explicit": false,
      "spotifyId": "5RLyWvA4O9A7pzvwTY6tUP",
      "appleId": 1000710831844,
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5RLyWvA4O9A7pzvwTY6tUP",
        "apple": "https://podcasts.apple.com/podcast/why-you-should-talk-more-often-how-people-get-brainwashed/id1150124880?i=1000710831844"
      }
    }
  ]
}