{
  "_ts": 0,
  "id": "90ef4471-c9e9-48c9-ac94-37e8d063e0e7",
  "name": "Some Dare Call It Conspiracy",
  "spotifyId": "4RJCyh4FEiQhZasSe7jHYk",
  "appleId": 1629532988,
  "episodes": [
    {
      "id": "724cc58a-3618-4fd1-94f4-907abd532330",
      "title": "Icke Vs Jones - Prophets, Popularity, Prima Donnas, Praise And Profits",
      "description": "Initiates! Hot off the press, your early access to our new episode! So many of you enjoyed Neil\u0027s analysis of David Icke\u0027s recent meltdown in \u0022Ex Son of God Covets Neighbours Sheep\u0022... so he\u0027s back with another one! This time, Neil hilariously deconstructs the David Icke and Alex Jones \u0022debate\u0022. Did Elon Musk really turn up? Let us know what you think! Enjoy! \u0026#x1f525;\u0026#x1f989;\u0026#x1f525; Some Dare Call It Conspiracy is produced entirely by Brent Lee and Neil Sanders. Consider supporting us and get access to AD FREE episodes, exclusive Patreon only episodes, bonus content and an invitation to our private Discord server by joining our Patreon. www.patreon.com/somedarecallitconspiracy Or support us by subscribing, sharing, liking or leaving a review wherever you\u0027re listening to us! Please visit our website for all of our social media links, email address and various press clippings! www.somedarecallitconspiracy.com \u0026#x1f525;\u0026#x1f989;\u0026#x1f525; Become a supporter of this podcast: https://www.spreaker.com/podcast/some-dare-call-it-conspiracy--5932731/support .",
      "release": "2024-02-21T00:10:28Z",
      "duration": "00:57:50.2620000",
      "explicit": false,
      "spotifyId": "3K2Pz9uCG6Q47GLHcsgi8S",
      "appleId": 1000646068745,
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3K2Pz9uCG6Q47GLHcsgi8S",
        "apple": "https://podcasts.apple.com/podcast/icke-vs-jones-prophets-popularity-prima-donnas-praise/id1629532988?i=1000646068745"
      }
    },
    {
      "id": "f684750d-2d8c-445b-b413-d6e912fb7333",
      "title": "Jon Ronson on the Allure of Conspiracies and the Culture War",
      "description": "Full transcript available at https://somedarecallitconspiracy.blogspot.com/2024/02/jon-ronson-interview-transcript.html Jon Ronson on the Allure of Conspiracies and the Culture War Welcome to an exclusive episode of \u0027Some Dare Call It Conspiracy,\u0027 where hosts Neil Sanders and Brent Lee navigate the murky waters of conspiracy theories with guest Jon Ronson, an accomplished author and documentarian. This discussion delved into Ronson\u0027s firsthand experiences with the controversial figure Alex Jones, the shifting landscape of the truth movement, and the thin line between skepticism and belief. Covid, Clots, and Conspiracy Theories Ronson\u0027s personal health scare, contracting Covid-19 and later developing a blood clot, brings a sobering reality to the conversation. It highlights the tangible consequences of the pandemic, contrasting with the rampant Covid denial and misinformation that has infiltrated conspiracy circles. The discussion pivots to the pathological persistence of some conspiracy theorists who refuse to acknowledge their role in spreading harmful misinformation. Examining Alex Jones: A Turn of Perspective Ronson provides a unique perspective on Alex Jones, painting a picture of a man who consistently doubles down on conspiracy theories, potentially for personal gain rather than seeking truth. His recount of the infamous Bohemian Grove event illustrates the complexities and the theatrics of conspiracy narratives. This segues into a discussion of how some figures within the conspiracy community, including Jones, monetize and weaponize uncertainty to their advantage. Cultural Wars and Class Struggles: The Role of Identity Politics The podcast also touches on the cultural wars that are fueled by identity politics and class struggles. The hosts and Ronson debate how these divisive issues distract from the underlying socioeconomic inequalities that benefit the wealthy. They discuss the often-misunderstood or overstated elements of the culture war, designed to generate conflict and division. The Hero\u0027s Journey of Conspiracy Theorists Joseph Campbell\u0027s hero\u0027s journey is a concept that resonates deeply with conspiracy theorists. Ronson\u0027s exploration of this narrative shows that many within the conspiracy community view themselves as reluctant heroes, engaged in an epic struggle against the perceived dragons of society, such as government overreach and hidden crimes. The Skeptic\u0027s Path: From Belief to Disillusionment Sanders and Lee, formerly firm believers in conspiracy theories, share their journeys towards skepticism. They explore the pivotal moments that altered their views, shedding light on the internal conflicts that challenge staunch conspiracy theorists. This transformation from believer to skeptic is rare in a community where doubling down is the norm, providing valuable insights into the psychology of belief systems. In the end, the conversation with Jon Ronson throws a spotlight on the complex, and often contradictory, world of conspiracy theories. Whether as pronounced heroes on a valiant quest or vilified purveyors of falsehoods, conspiracy theorists occupy a controversial space in the collective consciousness. \u0027Some Dare Call It Conspiracy\u0027 invites listeners to critically engage with these narratives and consider their profound impact on society. \u0026#x1f525;\u0026#x1f989;\u0026#x1f525; Some Dare Call It Conspiracy is produced entirely by Brent Lee and Neil Sanders. Consider supporting us and get access to AD FREE episodes, exclusive Patreon only episodes, bonus content and an invitation to our private Discord server by joining our Patreon. www.patreon.com/somedarecallitconspiracy Or support us by subscribing, sharing, liking or leaving a review wherever you\u0027re listening to us! Please visit our website for all of our social media links, email address and various press clippings! www.somedarecallitconspiracy.com \u0026#x1f525;\u0026#x1f989;\u0026#x1f525; Become a supporter of this podcast: https://www.spreaker.com/podcast/some-dare-call-it-conspiracy--5932731/support .",
      "release": "2024-02-13T23:28:14Z",
      "duration": "01:20:19.9830000",
      "explicit": false,
      "spotifyId": "3cHEjpbcn9oDsa4URf0KKz",
      "appleId": 1000645234463,
      "subjects": [
        "Qanon",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3cHEjpbcn9oDsa4URf0KKz",
        "apple": "https://podcasts.apple.com/podcast/jon-ronson-on-the-allure-of-conspiracies-and-the-culture-war/id1629532988?i=1000645234463"
      }
    },
    {
      "id": "49dcc9e5-12d6-413f-87c6-e92d4793941f",
      "title": "37: David Icke: Ex Son Of God Covets Neighbours Sheep by Neil Sanders",
      "description": "If you\u0027ve been following the antics of David Icke recently you may have seen he\u0027s been incredibly mad and jealous of many figures in the Alt Media - you probably haven\u0027t - but we have... we\u0027re a bit weird like that! He\u0027s been on a weird tirade ever since his embarrassing spat on X (Twitter) with Brent Lee. Since that humiliation, he\u0027s been calling out everyone from Russell Brand and Joe Rogan to Elon Musk and Jordan Peterson. And it\u0027s been very funny. Not as funny as this bonus episode written by Neil Sanders though! Enjoy! -------------------- Love our work? Want to support the show? Join us and become a member of our super secret club: The Shilluminati! Visit - http://www.somedarecallitconspiracy.com ‼️- Benefits include: ✅️ Enjoy every episode without annoying ads! ✅️ Early access to episodes! ✅️ Early access to every \u0022On Trial\u0022 series - All 8 parts on day one - NO waiting! ✅️ Exclusive *members only* episodes every month! ✅️ Handlers are now invited to join us live as audience members when we record! ✅️ Discord (coming soon) ‼️- Free gifts: ✅️ Brent Lee\u0027s discography (8 Albums/EPs) ✅️ Neil\u0027s books including: ✅️ Your Thoughts Are Not Your Own Volumes I \u0026 II (PDF) ✅️ Cambridge Analytica (PDF) ✅️ Now\u0027s The Only Thing That Is Real (PDF) ✅️ Audiobook of \u0022Your Thoughts Are Not Your Own Vol I\u0022 ✅️ Headache Comics Four (PDF) featuring Nicolas C Grey, Carl Youri , Alma Lefverstrom, Stephen Grey, Fritz Welch, Paul Jacksties, Daniel Watson ( crywank ), Jon Pogorelskin, Greta Pielage, Chan Phoun, Haider Ali Jan, R. Crumb - Some Dare Call It Conspiracy is produced entirely by Brent Lee and Neil Sanders. Consider supporting us by subscribing, sharing, liking or leaving a review wherever you\u0027re listening to us and visit us on: http://www.somedarecallitconspiracy.com to find our links across the Internet and other fun stuff! Become a supporter of this podcast: https://www.spreaker.com/podcast/some-dare-call-it-conspiracy--5932731/support .",
      "release": "2024-01-26T00:26:30Z",
      "duration": "00:32:00.0110000",
      "explicit": false,
      "spotifyId": "65Ps39jZtfcF6nZOYF7ilI",
      "appleId": 1000643002344,
      "subjects": [
        "Spiritual Narcissist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65Ps39jZtfcF6nZOYF7ilI",
        "apple": "https://podcasts.apple.com/podcast/37-david-icke-ex-son-of-god-covets-neighbours-sheep/id1629532988?i=1000643002344"
      }
    },
    {
      "id": "938c3453-64fc-4d56-82ac-b7156f43b476",
      "title": "Trolls Gone Wild (Pt 1) Nat\u0027s Story",
      "description": "We\u0027ve all had a run-in or two with conspiracy trolls for challenging disinformation, but what happens when it goes too far? We spoke with three victims of online stalking / harassment to share their stories.This is part one: Nat\u0027s story. Next week, we\u0027ll hear from CatherinePt 3 is on hold due to legal reasons. Hopefully this will be resolved soon and we can share the final story with you. S/O to Spencer Watson of the Truth Unrestricted podcast for helping with the editing of this series!  Love our work? Want to support the show? Join us and become a member of our super secret club: The Shilluminati!Visit - http://www.somedarecallitconspiracy.com ‼️- Benefits include:✅️ Enjoy every episode without annoying ads!✅️ Early access to episodes! ✅️ Early access to every \u0022On Trial\u0022 series - All 8 parts on day one - NO waiting! ✅️ Exclusive *members only* episodes every month! ✅️ Handlers are now invited to join us live as audience members when we record!✅️ Discord (coming soon)‼️- Free gifts:✅️ Brent Lee\u0027s discography (8 Albums/EPs)✅️ Neil\u0027s books including:✅️ Your Thoughts Are Not Your Own Volumes I \u0026 II (PDF)✅️ Cambridge Analytica (PDF)✅️ Now\u0027s The Only Thing That Is Real (PDF)✅️ Audiobook of \u0022Your Thoughts Are Not Your Own Vol I\u0022✅️ Headache Comics Four (PDF) featuring Nicolas C Grey, Carl Youri , Alma Lefverstrom, Stephen Grey, Fritz Welch, Paul Jacksties, Daniel Watson ( crywank ), Jon Pogorelskin, Greta Pielage, Chan Phoun, Haider Ali Jan, R. Crumb- Some Dare Call It Conspiracy is produced entirely by Brent Lee and Neil Sanders. Consider supporting us by subscribing, sharing, liking or leaving a review wherever you\u0027re listening to us and visit us on: http://www.somedarecallitconspiracy.com to find our links across the Internet and other fun stuff!This show is part of the Spreaker Prime Network, if you are interested in advertising on this podcast, contact us at https://www.spreaker.com/show/5932731/advertisement",
      "release": "2023-11-20T00:00:00",
      "duration": "00:45:03.0110000",
      "explicit": false,
      "spotifyId": "0lkiY62VJDaTtIJbI47GlH",
      "appleId": 1000635391232,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0lkiY62VJDaTtIJbI47GlH",
        "apple": "https://podcasts.apple.com/podcast/trolls-gone-wild-pt-1-nats-story/id1629532988?i=1000635391232"
      }
    }
  ]
}