{
  "id": "90ef4471-c9e9-48c9-ac94-37e8d063e0e7",
  "name": "Some Dare Call It Conspiracy",
  "spotifyId": "4RJCyh4FEiQhZasSe7jHYk",
  "appleId": 1629532988,
  "episodes": [
    {
      "id": "938c3453-64fc-4d56-82ac-b7156f43b476",
      "title": "Trolls Gone Wild (Pt 1) Nat\u0027s Story",
      "description": "We\u0027ve all had a run-in or two with conspiracy trolls for challenging disinformation, but what happens when it goes too far? We spoke with three victims of online stalking / harassment to share their stories.This is part one: Nat\u0027s story. Next week, we\u0027ll hear from CatherinePt 3 is on hold due to legal reasons. Hopefully this will be resolved soon and we can share the final story with you. S/O to Spencer Watson of the Truth Unrestricted podcast for helping with the editing of this series!  Love our work? Want to support the show? Join us and become a member of our super secret club: The Shilluminati!Visit - http://www.somedarecallitconspiracy.com ‼️- Benefits include:✅️ Enjoy every episode without annoying ads!✅️ Early access to episodes! ✅️ Early access to every \u0022On Trial\u0022 series - All 8 parts on day one - NO waiting! ✅️ Exclusive *members only* episodes every month! ✅️ Handlers are now invited to join us live as audience members when we record!✅️ Discord (coming soon)‼️- Free gifts:✅️ Brent Lee\u0027s discography (8 Albums/EPs)✅️ Neil\u0027s books including:✅️ Your Thoughts Are Not Your Own Volumes I \u0026 II (PDF)✅️ Cambridge Analytica (PDF)✅️ Now\u0027s The Only Thing That Is Real (PDF)✅️ Audiobook of \u0022Your Thoughts Are Not Your Own Vol I\u0022✅️ Headache Comics Four (PDF) featuring Nicolas C Grey, Carl Youri , Alma Lefverstrom, Stephen Grey, Fritz Welch, Paul Jacksties, Daniel Watson ( crywank ), Jon Pogorelskin, Greta Pielage, Chan Phoun, Haider Ali Jan, R. Crumb- Some Dare Call It Conspiracy is produced entirely by Brent Lee and Neil Sanders. Consider supporting us by subscribing, sharing, liking or leaving a review wherever you\u0027re listening to us and visit us on: http://www.somedarecallitconspiracy.com to find our links across the Internet and other fun stuff!This show is part of the Spreaker Prime Network, if you are interested in advertising on this podcast, contact us at https://www.spreaker.com/show/5932731/advertisement",
      "release": "2023-11-20T00:00:00",
      "duration": "00:45:03.0110000",
      "explicit": false,
      "spotifyId": "0lkiY62VJDaTtIJbI47GlH",
      "appleId": 1000635391232,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0lkiY62VJDaTtIJbI47GlH",
        "apple": "https://podcasts.apple.com/podcast/trolls-gone-wild-pt-1-nats-story/id1629532988?i=1000635391232"
      }
    }
  ]
}