{
  "id": "ffd5caa2-8930-4a41-b546-042531862fd8",
  "name": "Soul Bruises",
  "spotifyId": "32j6fX0zZ70vXWyYjSuTm2",
  "appleId": 1746432292,
  "youTubeChannelId": "UCVn9536zWDW9UEMNZQO8TJA",
  "episodes": [
    {
      "id": "8e56e9c0-5d91-4f15-9a7c-e49ed137c068",
      "title": "Episode 23 - My Analysis of the Documentary:  \u0022Evil Influencer - The Jodi Hildebrandt Story\u0022",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) SHOW NOTES: Evil Influencer: The Jodi Hildebrandt Story Trailer: https://www.youtube.com/watch?v=eMjsVQIepZw Dark Truth Behind Netflix\u0027s \u0027Evil Influencer: The Jodi Hildebrandt Story Law \u0026 Crime Network https://www.youtube.com/watch?v=BPipALF5glc Was Ruby Franke Brainwashed? - Jodi Hildebrandt\u0027s Tactics Dissected https://www.youtube.com/watch?v=BvvgHlPZFrM Some stories shock because they\u0027re new; this one shocks because it feels familiar. We dig into how a therapist wrapped control in spiritual language, turned doubt into \u0027distortion,\u0027 \u0026 built a closed system where obedience looked like healing \u0026 disagreement looked like moral failure. Using the Jodi Hildebrandt documentary as a case study, we trace the slow creep from guidance to coercion \u0026 outline the subtle tells—language shifts, isolation, \u0026 financial pressure—that signal spiritual abuse long before the headlines. We walk through the backstory of Connexions, the promise of moral clarity, \u0026 the way binaries like truth versus distortion hollow out a person\u0027s inner compass. You\u0027ll hear how clients were nudged to distrust their own signals, cut off outside support, \u0026 accept \u0027loving correction\u0027 as proof the process worked. Along the way, we connect these patterns to tactics common in high-control religious spaces: information control, shunning, \u0026 leader-centric authority dressed up as care. The goal isn\u0027t to sensationalize; it\u0027s to name the playbook so you can recognize it early—whether it shows up in therapy, church, parenting advice, or coaching. We also offer practical tools to test any authority: Who can ask questions here? What happens when someone disagrees? Are fees \u0026 expectations transparent? Does this space invite dialogue \u0026 referrals, or does it monopolize trust? Healthy authority connects rather than isolates, welcomes feedback, \u0026 never asks you to abandon yourself to belong. If your body says something is off, that signal matters. Your worth isn\u0027t measured by compliance, \u0026 choosing truth over loyalty is not a failure—it\u0027s healing. Listen, reflect, \u0026 share this conversation with someone who needs language for what they\u0027ve felt but couldn\u0027t name. \u0027Be Human, Be Kind, Be Both.\u0027",
      "release": "2026-01-04T04:00:00Z",
      "duration": "00:17:05.6320000",
      "explicit": false,
      "spotifyId": "3SG3OBxsVsDJ72M82xoFJV",
      "appleId": 1000743668160,
      "youTubeId": "tBkeKXEY0jE",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3SG3OBxsVsDJ72M82xoFJV",
        "apple": "https://podcasts.apple.com/podcast/episode-23-my-analysis-of-the-documentary/id1746432292?i=1000743668160",
        "youtube": "https://www.youtube.com/watch?v=tBkeKXEY0jE"
      }
    },
    {
      "id": "2fc8d392-cb8c-4f95-b290-e9a6ca300ffd",
      "title": "Episode 22 -  Your Nervous System Is Not Sinning; It Is Protecting You! - Understanding Fight, Flight, Freeze and Fawn through Spiritual Abuse",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) FREEZE YouTube Video of Bobi Gephart confronting Pastor John Lowe II (13:39) https://www.youtube.com/watch?v=p4Sh2-Peefo FIGHT YouTube Video of \u0027Remembering Jennifer Lyell\u0027 (5:37) https://www.youtube.com/watch?v=z7ekxdMchxA FLIGHT Who are the 2 x 2\u0027s? https://www.youtube.com/watch?v=83DZdzxpR84 (Short Version - 1:58) https://www.youtube.com/watch?v=1o_vTxBShFA (Long Version - 16:10) FAWN Mars Hill Pastor Mark Driscoll https://www.youtube.com/watch?v=RQopCn4MFwM (10:52) The Rise \u0026 Fall of Mars Hill Podcast (Episode 1) https://www.youtube.com/watch?v=4Cou36nSmJY \u0027When Religion Hurts You\u0027 Dr. Laura Anderson What is Religious Trauma? https://www.youtube.com/watch?v=EjdBoBOhXvA (short clip) 4 Trauma Responses (Dr. Alex Howard) https://www.youtube.com/watch?v=cVQDRrs-a8A (6:28) **************************************************************************************This episode of Soul Bruises explains how fight, flight, freeze, \u0026 fawn show up in faith spaces \u0026 why they are survival, not sin. We share real stories, practical regulation tools, \u0026 a path from shame to curiosity so survivors can rebuild safety, voice, \u0026 trust. • defining spiritual abuse \u0026 the autonomic nervous system • clear explanations of fight, flight, freeze \u0026 fawn • how churches mislabel trauma responses as moral failings • scenarios that map all 4 responses in a church conflict • whistleblowing, delayed disclosure \u0026 high control groups • tend \u0026 befriend versus fawning \u0026 why it matters • practical regulation skills \u0026 boundary setting • moving from survival to healing with supportive community • recommended reading: When Religion Hurts You by Dr Laura Anderson You can reach me at soulbruises@gmail.com or send me a message on Instagram at SoulBruises2023 \u0027Be Human, Be Kind, Be Both.\u0027",
      "release": "2025-11-29T05:00:00Z",
      "duration": "00:56:11.0280000",
      "explicit": false,
      "spotifyId": "0qkarUBYTwDIYUWITwnv13",
      "appleId": 1000738869094,
      "youTubeId": "jqZIdJWWpRs",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0qkarUBYTwDIYUWITwnv13",
        "apple": "https://podcasts.apple.com/podcast/episode-22-your-nervous-system-is-not-sinning-it-is/id1746432292?i=1000738869094",
        "youtube": "https://www.youtube.com/watch?v=jqZIdJWWpRs"
      }
    },
    {
      "id": "e6105c92-472b-4196-b7be-7fabf579f588",
      "title": "Episode 21 - Restoring the Flock: God’s Blueprint for Healing After Collective Trauma (Guest: Pastor Kayleigh Clark)",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) YOUTUBE LINK: https://youtu.be/4vBNSRvloQ8 In this podcast episode with our guest, Pastor \u0026 scholar Kayleigh Clark we explore how collective trauma reshapes churches, why language \u0026 listening matter, how sometimes the first step of finding healing a church is about asking the right questions, \u0026 how new shepherds can gather what harm scattered. She shares a path from lament to restoration with trauma-informed ministry, empathetic witness, \u0026 patient trust-building. Additional topics, references, website \u0026 terms mentioned below. • Defining collective trauma \u0026 loss of communality • The body of Christ keeps the score as a diagnostic lens • COVID\u0027s disruption, decision fatigue, \u0026 grief in congregations • Betrayal trauma \u0026 why defenses form around leaders • Jeremiah 23, negligent shepherds, \u0026 God\u0027s new shepherds • Using careful, descriptive language before hard labels • Pastors\u0027 secondary traumatic stress \u0026 pastoral self-care • After-pastors, church splits, \u0026 rebuilding safety • Theology that heals vs theologies that harm \u0026 shame • Shifting diagnosis from behaviors to \u0027what happened to us\u0027 • Revitalization \u0026 Reformation.... with Restoration as a third path to consider • Lament, middle-space testimonies, \u0026 empathetic witnessing • Reading scriptures through the eyes of the sufferer • Practical methods to restore trust \u0026 communality Check out Restor(y) resources at restorycenter.com Restor(y) is a nonprofit founded by Pastor Kayleigh Clark whose mission is to accompany churches through healing, restoration, \u0026 wholeness Link to article of \u0027New Shepherds For A Hurting Church https://www.restorycenter.com/blog/new-shepherds-for-a-hurting-church A Theological Framework for Religious Trauma (Short Video) https://www.youtube.com/watch?v=fSIpj-NhhnA Kayleigh\u0027s Blog on Restor(y) https://www.restorycenter.com/blog Jeremiah 23 NIV https://www.biblegateway.com/passage/search=Jeremiah%2023\u0026version=NIV (https://www.biblegateway.com/passage/?search=Jeremiah%2023\u0026version=NIV) TERMS Secondary Trauma https://en.wikipedia.org/wiki/Secondary_trauma DARVO is an acronym that describes a common pattern of behavior used by individuals—often abusers or manipulators—when they are confronted about their harmful actions. It stands for: D – Deny, A – Attack, RVO – Reverse Victim \u0026 Offender Soul Bruises Episode on DARVO https://www.buzzsprout.com/2240617/episodes/16013641 Collective trauma happens when a whole community or group of people goes through something deeply painful or disruptive—like abuse, conflict, disaster, or loss—and it impacts not just individuals, but the relationships, trust, \u0026 identity of the entire group. Betrayal trauma refers to the psychological harm that occurs when someone experiences a profound violation of trust or safety by a person or system they depend on for protection, care, or support. Communality refers to the quality or state of sharing things in common — a sense of belonging, mutual responsibility, \u0026 connection within a group or community \u0027Be Human, Be Kind, Be Both.\u0027",
      "release": "2025-10-12T02:00:00Z",
      "duration": "01:47:06",
      "explicit": false,
      "spotifyId": "62M3fc5fwVU0hSNaTmlKUg",
      "appleId": 1000731391709,
      "youTubeId": "eRjmVaMmOJQ",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/62M3fc5fwVU0hSNaTmlKUg",
        "apple": "https://podcasts.apple.com/podcast/episode-21-restoring-the-flock-gods-blueprint-for/id1746432292?i=1000731391709",
        "youtube": "https://www.youtube.com/watch?v=eRjmVaMmOJQ"
      }
    },
    {
      "id": "b4d299e0-1f13-46a7-a207-2e89552401f6",
      "title": "Episode 20 - Breaking Out Of The Cage: Rebellion, Misplaced Loyalty and Authentic Faith - Part 3 of 3 (Featuring Pastor/Chaplain Kristy Hodson)",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) What happens when your spirituality becomes a battleground? When your voice, appearance, \u0026 very humanity are treated as problems to be fixed rather than gifts to be celebrated? Pastor \u0026 Chaplain, Kristy Hodson takes us deep into her journey through high-control religion, revealing the subtle yet devastating ways spiritual abuse can damage our connection to both community \u0026 the divine. With remarkable honesty, she shares how attempting to create positive change from within left her \u0027bitter, resentful, \u0026 tired\u0027 as she faced resistance for simply refusing to make herself smaller. The conversation explores the unique challenges faced by women in patriarchal religious systems, where something as simple as correcting someone who addresses a room of pastors as \u0027gentlemen\u0027 can lead to being labeled a \u0027militant feminist.\u0027 Kristy explains how the box of conformity becomes a cage, trapping both those who perpetrate spiritual abuse \u0026 those who experience it. Most powerfully, Kristy offers a profound reframing of how we talk about spiritual abuse: \u0027My spirituality was abused by what you did. My soul was harmed \u0026 damaged.\u0027 This shift centers the impact rather than debating whether actions qualify as abuse, making space for true healing to begin. For anyone who has felt their authentic spiritual self diminished by religious control, this episode offers both validation \u0026 hope. Kristy\u0027s journey toward healing includes learning to trust herself again, finding supportive community, \u0026 remembering who she was \u0027before trauma gave me a detour.\u0027 Her message resonates with unmistakable clarity: You are not alone, your voice matters, \u0026 true faith gives you a voice, not a muzzle. Join us for this essential conversation about breaking free from spiritual control \u0026 rediscovering an authentic connection to faith that honors your whole being. Wherever you are on your spiritual journey, this episode invites you to remember that you belong \u0026 that your spirituality is worth defending. \u0027Be Human, Be Kind, Be Both.\u0027",
      "release": "2025-09-12T02:00:00Z",
      "duration": "01:11:55",
      "explicit": false,
      "spotifyId": "7aglqOjydnpNBd8h4vz4cw",
      "appleId": 1000726434512,
      "youTubeId": "G8c7tFx_R5o",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7aglqOjydnpNBd8h4vz4cw",
        "apple": "https://podcasts.apple.com/podcast/episode-20-breaking-out-of-the-cage-rebellion/id1746432292?i=1000726434512",
        "youtube": "https://www.youtube.com/watch?v=G8c7tFx_R5o"
      }
    },
    {
      "id": "af939c62-4835-4813-833f-4fdba1757253",
      "title": "Episode 19 - Breaking Out Of The Cage: Rebellion, Misplaced Loyalty and Authentic Faith - Part 2 of 3 (Featuring Pastor/Chaplain Kristy Hodson)",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) What parts of yourself have you cut off to fit into someone else\u0027s spiritual mold? In this raw \u0026 revealing conversation, Pastor Kristy Hodson shares her journey through a high-control religious environment where authenticity was often sacrificed on the altar of conformity. Drawing from Brené Brown\u0027s powerful distinction—\u0027Fitting in is about becoming who you need to be to be accepted. Belonging doesn\u0027t require us to change who we are; it requires us to be who we are\u0027 Kristy explores how religious systems can demand we amputate essential parts of ourselves to belong. Using the Brothers Grimm version of Cinderella as a striking metaphor, she describes how the stepsisters literally cut off toes to fit into the glass slipper, paralleling how believers are sometimes asked to cut away authentic pieces of themselves to fit religious expectations. The seemingly trivial battles over jewelry, coffee drinking, \u0026 social media posts mask deeper control mechanisms that stifle critical thinking \u0026 personal expression. Kristy\u0027s powerful question—\u0027How much about myself do you want me to lie about?\u0027—challenges us to consider the spiritual cost of conformity. Through her story, we witness the exhausting cycle of trying to change a system from within, only to discover that true freedom comes not from rebellion but from creating your own existence from scratch. This conversation isn\u0027t about abandoning faith but finding authentic expression within it. Whether you\u0027ve experienced spiritual abuse, felt like an outsider in religious spaces, or simply question whether you can be fully yourself while maintaining your faith, this episode offers healing perspectives on belonging without conforming. Join us as we explore how to embrace our whole selves—questions, uniqueness, \u0026 authentic expression—in our spiritual journeys. \u0027Be Human, Be Kind, Be Both.\u0027",
      "release": "2025-08-22T05:00:00Z",
      "duration": "01:45:28.8410000",
      "explicit": false,
      "spotifyId": "2JYIm28X8J7v6R4rDs6J8H",
      "appleId": 1000723050107,
      "youTubeId": "uXPD4XnvSDk",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2JYIm28X8J7v6R4rDs6J8H",
        "apple": "https://podcasts.apple.com/podcast/episode-19-breaking-out-of-the-cage-rebellion/id1746432292?i=1000723050107",
        "youtube": "https://www.youtube.com/watch?v=uXPD4XnvSDk"
      }
    },
    {
      "id": "6bf3863e-5235-47dd-87c0-aa0d6ad11f8e",
      "title": "Episode 18 - Breaking Out Of The Cage:  Rebellion, Misplaced Loyalty and Authentic Faith - Part 1 of 3 (Featuring Pastor/Chaplain Kristy Hodson)",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) \u0027Be Human, Be Kind, Be Both.\u0027",
      "release": "2025-07-30T02:00:00Z",
      "duration": "01:20:29",
      "explicit": false,
      "spotifyId": "2SyGsHpPANn19IyBH4QOGL",
      "appleId": 1000719732901,
      "youTubeId": "-TXvzQDKr6c",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2SyGsHpPANn19IyBH4QOGL",
        "apple": "https://podcasts.apple.com/podcast/episode-18-breaking-out-of-the-cage-rebellion/id1746432292?i=1000719732901",
        "youtube": "https://www.youtube.com/watch?v=-TXvzQDKr6c"
      }
    },
    {
      "id": "b8fcdc25-9927-4675-9592-93d167e51e78",
      "title": "Episode 17- Soul Cuffs: How Churches Turn Devotion Into Chains (Distorted Loyalty)",
      "description": "Send us a text What happens when your loyalty to God becomes twisted into a weapon against your own soul? In this deeply insightful exploration of distorted loyalty, we unravel how spiritual abuse manipulates our noblest virtues into chains of obligation and fear. Distorted loyalty isn\u0027t just about misplacing your allegiance—it\u0027s about how that loyalty functions internally, creating an agonizing inner turmoil that makes you stay in harmful religious environments despite recognizing the damage being done. This episode carefully distinguishes between healthy devotion and the twisted version that leaves you feeling trapped, silenced, and spiritually hostage. Through powerful real-life scenarios, we examine six harmful narratives where distorted loyalty manifests: refusing to address abuse to \u0022avoid division,\u0022 judging other Christians who don\u0027t conform to denominational expectations, equating leaving a church with betraying God, treating questioning as rebellion, reframing silence about wrongdoing as spiritual maturity, and merging personal identity so completely with group identity that departure feels like self-annihilation. Most dangerously, fear-based obedience replaces authentic faith, leading people to stay in abusive systems not from love but from terror of rejection, punishment, or eternal consequences. This distortion fuels what some call \u0022Spiritual Stockholm Syndrome,\u0022 where victims emotionally attach to and defend the very religious systems harming them. For anyone caught in these webs of twisted obligation, this episode offers profound validation and hope. You\u0027re not crazy for recognizing harm. You\u0027re not betraying God by protecting yourself. In fact, walking away from what damages your soul might be the first authentic step toward Him in a very long time. Because true loyalty should never demand the sacrifice of your conscience, dignity, or voice. Have you experienced distorted loyalty in your spiritual journey? How did you recognize it, and what helped you break free? Share your story and join our community working toward healthier, more honest expressions of faith. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2025-07-01T09:00:00Z",
      "duration": "00:35:35.4570000",
      "explicit": false,
      "spotifyId": "0OjT69nL4HFHF4wgVid3YL",
      "appleId": 1000715271629,
      "youTubeId": "-P8rzvFXb9I",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0OjT69nL4HFHF4wgVid3YL",
        "apple": "https://podcasts.apple.com/podcast/episode-17-soul-cuffs-how-churches-turn-devotion-into/id1746432292?i=1000715271629",
        "youtube": "https://www.youtube.com/watch?v=-P8rzvFXb9I"
      }
    },
    {
      "id": "5553c286-f5cf-4696-a125-dc3ed5b7e4d1",
      "title": "Episode 16 - Misplaced Loyalty: Are We Loyal to Christ, or Our Tribe?",
      "description": "Send us a text Misplaced loyalty in religious settings occurs when commitment to institutions trumps truth, justice, and human dignity. This harmful dynamic enables spiritual abuse by silencing those who recognize problems, creating environments where manipulation and control thrive under the guise of faithfulness. • Institutional cover-ups of abuse scandals (Catholic Church, Southern Baptist Convention) prioritize reputation over justice • Theological isolation creates echo chambers where learning from other traditions is discouraged • Gender-based restrictions in ministry show loyalty to tradition over recognizing spiritual gifts • Discouraging questions treats curiosity as rebellion and suppresses critical thinking • Refusing cross-denominational cooperation promotes division over unity in Christ\u0027s body • Elevating denominational rules over loving people creates legalistic environments • Silence about racism, sexism and abuse within churches to \u0022keep the peace\u0022 • Fear of leaving toxic religious environments due to identity entrapment and loss of community Join me for the next episode where we\u0027ll explore distorted loyalty and how these two concepts work together to create spiritually harmful environments. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2025-06-01T21:00:00Z",
      "duration": "00:38:50.3570000",
      "explicit": false,
      "spotifyId": "4F5c4JHKlyXFgIAxa89cBB",
      "appleId": 1000710778627,
      "youTubeId": "45H1XWvO-Ug",
      "subjects": [
        "Southern Baptist Convention",
        "Catholicism",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4F5c4JHKlyXFgIAxa89cBB",
        "apple": "https://podcasts.apple.com/podcast/episode-16-misplaced-loyalty-are-we-loyal-to-christ/id1746432292?i=1000710778627",
        "youtube": "https://www.youtube.com/watch?v=45H1XWvO-Ug"
      }
    },
    {
      "id": "dc5ea653-a5e7-41c2-a8ce-1d87ace8258e",
      "title": "Episode 15 - Your Mind Is Not Their Property: How High Controlled Groups Manipulate Thought - Spiritual Abuse Tactics \u0026 Behaviors 5 of 12 (Part 2)",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) Show Note Links: Allender Center: https://theallendercenter.org/ Allender Center Podcast: https://theallendercenter.org/category/podcast/ Restore Conference: https://julieroys.com/restore/ \u0027The Roys Report\u0027 Podcast: https://julieroys.com/podcast/ Steven Hassan\u0027s Influence Continuum: https://freedomofmind.com/cult-mind-control/influence-continuum/ Steven Hassans BITE Model of Authoritarian Control: https://freedomofmind.com/cult-mind-control/bite-model-pdf-download/ Dr. Janja Lalich website \u0026 resources: https://www.lalichcenter.org/ Description of the Episode: Mind control represents the most dangerous form of psychological manipulation in religious settings, designed to influence \u0026 dominate a person\u0027s thoughts, beliefs, \u0026 behaviors without their awareness. • Differences between Mind Control, Brainwashing, Thought Reform, \u0026 Bounded Choice • Steven Hassan\u0027s BITE model (Behavior, Information, Thought, Emotional control) explaining psychological control techniques • Historical examples of mind control including the Nazi regime, Scientology, \u0026 the Stanford Prison Experiment • How high-control groups exploit normal human desires for belonging \u0026 connection • Dr. Janja Lalich\u0027s Bounded Choice Theory explaining why people remain in controlling groups • Warning signs that a religious organization may be using mind control tactics • The importance of maintaining autonomy \u0026 critical thinking in spiritual contexts • Robert J. Lifton\u0027s 8 criteria for thought reform environments • Resources for those affected by spiritual abuse including the Allender Center \u0026 The Restore Conference Faith should not be about living in fear or control. Christ offers freedom, not bondage. Your spiritual journey belongs to you \u0026 you have the right to seek truth for yourself. \u0027Be Human, Be Kind, Be Both.\u0027",
      "release": "2025-04-18T14:00:00Z",
      "duration": "01:09:12.8410000",
      "explicit": false,
      "spotifyId": "3r21aoiQhHDlwfOr3BqaQr",
      "appleId": 1000704011461,
      "youTubeId": "AKnSKGa90IA",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3r21aoiQhHDlwfOr3BqaQr",
        "apple": "https://podcasts.apple.com/podcast/episode-15-your-mind-is-not-their-property-how-high/id1746432292?i=1000704011461",
        "youtube": "https://www.youtube.com/watch?v=AKnSKGa90IA"
      }
    },
    {
      "id": "48a7dd91-4925-4bc6-9c44-0cc9b5a1d9a1",
      "title": "Episode 14 - (VIDEO) Dr. Janja Lalich Interviewed by Soul Bruises",
      "description": "This is a video about Dr. Janja Lalich Interviewed by Soul Bruises\n\nCult expert Dr. Janja Lalich shares her personal journey as a former cult member and explains the psychological mechanisms that trap intelligent people in high-control groups. Her groundbreaking \u0022Bounded Choice\u0022 theory illuminates why seemingly rational individuals make decisions that outsiders find incomprehensible.\n\n• Defining characteristics of a cult: authoritarian leader, transcendent belief system, systems of control, and systems of influence\n• Charisma is not an innate quality but a social relationship where followers attribute power to a leader\n• Cults use loaded language to control thought and isolate members from outsiders\n• Children raised in cults miss crucial developmental stages and often lack basic life skills upon leaving\n• The key difference between cults and healthy religions is the freedom to question, leave, or criticize without severe consequences\n• Warning signs of indoctrination include inability to criticize leaders, lack of transparency, and high-arousal techniques that shut down critical thinking\n• Former members struggle with \u0022moral injury\u0022 – guilt over actions they took while indoctrinated\n• Recovery requires self-forgiveness rather than forgiving abusive leaders\n\nVisit the Lalich Center on Cults and Coercion at lallichcenter.org to learn more about cult awareness, recovery resources, and upcoming therapist training programs.",
      "release": "2025-03-21T22:26:25Z",
      "duration": "01:12:26",
      "explicit": false,
      "spotifyId": "0NsWGXzLqZAgj9MMMWdztD",
      "appleId": 1000700324737,
      "youTubeId": "HySb0luv4eY",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NsWGXzLqZAgj9MMMWdztD",
        "apple": "https://podcasts.apple.com/podcast/episode-14-understanding-cults-bounded-choice-a/id1746432292?i=1000700324737",
        "youtube": "https://www.youtube.com/watch?v=HySb0luv4eY"
      }
    },
    {
      "id": "c64f2719-9445-4b7c-947c-87d2c951859e",
      "title": "Episode 13 - Breaking the Chains of Indoctrination \u0026 Thought Suppression - Spiritual Abuse Tactic \u0026 Behavior 5 of 12 (Part 1) - Indoctrination \u0026 Thought Suppression",
      "description": "Send us a text This episode explores: * The troubling dynamics of indoctrination, thought suppression, and mind control within spiritual communities. * We emphasize the importance of nurturing critical thinking and personal autonomy to foster genuine spiritual growth. * Analysis of emotional and logical aspects of faith * The role of indoctrination in suppressing individual thought * Discussion on moral vs. spiritual education and their impacts * Examination of thought suppression tactics in faith settings * Insights on reactance theory and spiritual bypassing * Reflections on maintaining critical thinking in spirituality This is a link to Marlene Winell\u0027s website \u0026 the diagram that she created on childhood indoctrination https://www.journeyfree.org/author/marlene/ \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2025-01-06T15:00:00Z",
      "duration": "00:41:58.3080000",
      "explicit": false,
      "spotifyId": "6oFAKQGaRFA9ELQg3ijQ3s",
      "appleId": 1000682887274,
      "youTubeId": "HlZNWxo9BIc",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6oFAKQGaRFA9ELQg3ijQ3s",
        "apple": "https://podcasts.apple.com/podcast/episode-13-breaking-the-chains-of-indoctrination/id1746432292?i=1000682887274",
        "youtube": "https://www.youtube.com/watch?v=HlZNWxo9BIc"
      }
    },
    {
      "id": "2af43eea-b76c-49a1-b9c1-8adf6477fd55",
      "title": "Episode 12 - DARVO - The Manipulative Tactics Abusers Use To Avoid Responsibility",
      "description": "Send us a text Wade Mullen\u0027s RESTORE 2022 conference talk that mentions DARVO https://www.youtube.com/watch?v=-I-w6rPMy5M\u0026t=1933s Rachel Denhollander\u0027s trial transcript \u0026 verbal testimony Transcript: https://www.cnn.com/2018/01/24/us/rachael-denhollander-full-statement/index.html Testimony: https://www.youtube.com/watch?v=7CjVOLToRJk Spiritual abuse is an insidious force that can silence even the most courageous voices. Explore this hidden realm with me, Christie Hodson, as we uncover the manipulation tactic known as DARVO—Deny, Attack, and Reverse Victim and Offender. Originally identified by psychologist Jennifer Freyd, DARVO is a cunning strategy often used by abusers to twist the truth and avoid accountability. We’ll dissect how spiritual leaders and institutions wield this tactic to paint themselves as victims, thereby complicating the journey to justice for the true sufferers. Understanding the role of bystanders in abuse scenarios is crucial. Often bound by betrayal blindness, they may inadvertently support abusers through inaction. Through infamous cases like Larry Nassar and Bill Hybels, we\u0027ll reveal how abusers manipulate perceptions and how bystanders can break free from these psychological barriers. I challenge every listener to confront their biases and recognize the moral weight of standing up for those who are most vulnerable. Our journey doesn\u0027t stop with identifying the problem; it seeks to transform our spiritual spaces into sanctuaries of support and honesty. We’ll examine the allegations against Bill Hybels and the misuse of DARVO that followed, illustrating the necessity for transparency and accountability. By comparing these situations to how Grace Community Church handled similar accusations, we find a roadmap for creating healthier spiritual environments. Join me on Soul Bruises as we push for a future where awareness, kindness, and humanity reshape our communities. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2024-11-01T00:42:48Z",
      "duration": "00:43:19.4440000",
      "explicit": false,
      "spotifyId": "19VTEzWThq4rop8SR4VEie",
      "appleId": 1000675277914,
      "youTubeId": "H3r7hEj3nV0",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/19VTEzWThq4rop8SR4VEie",
        "apple": "https://podcasts.apple.com/podcast/episode-12-darvo-the-manipulative-tactics-abusers-use/id1746432292?i=1000675277914",
        "youtube": "https://www.youtube.com/watch?v=H3r7hEj3nV0"
      }
    },
    {
      "id": "88b68490-3506-4d9e-bdc3-efa7a79744b7",
      "title": "Episode 11 - Untangling the Web of  Spiritual Authority  - Spiritual Abuse Tactic \u0026 Behavior 4 of 12 - Authority, Spiritual Authority \u0026 Distorted Loyalty",
      "description": "Send us a text Spiritual abuse can shatter faith and trust in devastating ways. Imagine an environment where authority becomes a tool for manipulation rather than guidance. In this episode of Soul Bruises, we tackle the harrowing reality of spiritual abuse within religious settings, dissecting how authority and distorted loyalty can morph into instruments of harm. Learn how to differentiate between genuine spiritual authority and the misuse of power that leads to exploitation and suffering, and understand why speaking up is crucial for mental and spiritual well-being. Journey with us as we examine historical and modern figures like William Wilberforce, Pope Gregory the Great, Thomas Merton, Henry J. M. Nouwen \u0026 Jill \u0026 Jinger from the Duggar family, whose lives highlight the dual-edged nature of spiritual authority. By delving into their insights, we uncover the qualities of healthy leadership—humility, accountability, respect for autonomy, and community-building. Through personal stories and testimonies, we shed light on the dark corners of spiritual abuse, offering a pathway to reclaiming faith and trust. In our critical analysis of Bill Gothard\u0027s controversial teachings and the dynamics within his organization, we expose the dangers of absolute obedience and hierarchical control. Hear firsthand accounts from individuals like Jill Duggar Dillard and Jinger Duggar Vuolo, who bravely share their experiences of entrapment and the struggle for autonomy. We close with a hopeful vision for church communities, advocating for empathy and compassion, and highlighting real-world examples of churches making a positive impact. Join us in this candid and necessary conversation to foster safer, more supportive spiritual environments. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2024-09-30T16:00:00Z",
      "duration": "01:17:30.1090000",
      "explicit": false,
      "spotifyId": "4Z5oGRZJnnKVb8kZJsqDad",
      "appleId": 1000671111280,
      "youTubeId": "4YKMEkT2HgA",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Z5oGRZJnnKVb8kZJsqDad",
        "apple": "https://podcasts.apple.com/podcast/episode-11-untangling-the-web-of-spiritual/id1746432292?i=1000671111280",
        "youtube": "https://www.youtube.com/watch?v=4YKMEkT2HgA"
      }
    },
    {
      "id": "be23f38b-f054-4aee-9edb-16831998a20d",
      "title": "Episode 10 - BONUS EPISODE - Can We Skip to the Good Part?",
      "description": "Send us a text What if the pain you thought was just \u0022church hurt\u0022 was actually something much more severe? Today on the Soul Bruises podcast, we return from our hiatus to confront the unsettling reality of spiritual abuse head-on. We explore why it\u0027s critical to listen to the voices of those who\u0027ve endured this trauma, how the term \u0022abuse\u0022 carries a weight that \u0022church hurt\u0022 does not, and why skipping to the positives without addressing the harm is not an option. Victims deserve our attention, our belief, and our action. We delve into the importance of acknowledging these issues to mend broken institutions and facilitate collective healing. In our discussion on healing, we emphasize the need for proper church governance and law enforcement\u0027s role when criminal activities are involved. We explore the development of safety policies and the crucial contributions of organizations like GRACE and Ministry Safe in providing resources and training. We stress the importance of validating victims\u0027 experiences, recognizing religious trauma, and ensuring thorough investigations. Tune in to find out how you can stay connected with us on Instagram, Apple Podcasts, and YouTube and be part of this essential conversation. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2024-07-04T11:00:00Z",
      "duration": "00:40:35.8660000",
      "explicit": false,
      "spotifyId": "09KNRGMIuTqDUpuI98G71b",
      "appleId": 1000661139907,
      "youTubeId": "NLvEWByfztU",
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09KNRGMIuTqDUpuI98G71b",
        "apple": "https://podcasts.apple.com/podcast/episode-10-bonus-episode-can-we-skip-to-the-good-part/id1746432292?i=1000661139907",
        "youtube": "https://www.youtube.com/watch?v=NLvEWByfztU"
      }
    },
    {
      "id": "c3c751e5-e545-4775-8c5f-56bf725f1c52",
      "title": "Episode 9 - Dismantling the Illusion of Sacred Coercion - Spiritual Abuse Tactic \u0026 Behavior 3 of 12 - Control",
      "description": "Send us a text Ever felt the discomfort of a conversation that doesn\u0027t seem right in a spiritual setting? I, Christie, pull back the curtain on the darker side of faith communities, spotlighting the fine line between spiritual guidance and coercive control. With an eye on those who twist faith for their own benefit, Soul Bruises attempts to peel back the layers to reveal behaviors and tactics that harm and control, rather than heal and guide. With insights from author Amanda Montell, we delve into the power of language in high-control groups, showing how words can build walls around minds. Charismatic leaders, such as Jim Jones, used their oratory prowess to bind their followers in an alternate reality. I want this episode to equip you to recognize these patterns and resist their pull. This episode challenges the notion that only certain types of people are susceptible to cultish influence; it\u0027s not about intellect, but situation. Hear how thought-terminating clichés serve as red flags, and learn to navigate speech that\u0027s designed to end questioning. Ending on a note of empowerment, we navigate the treacherous waters of spiritual communities led by narcissistic individuals. The misuse of scripture and faith through intimidation and fear is laid bare, urging us to foster environments that welcome questions and personal growth. The touchstone for a healthy faith community, as we will explore, is the ability to engage openly with religious teachings and to prioritize individual discernment. Discover how to recognize spiritual abuse and the importance of reclaiming personal spiritual agency in a space that should champion exploration and diversity of thought. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2024-04-26T16:00:00Z",
      "duration": "01:02:53.7140000",
      "explicit": false,
      "spotifyId": "750DyElWhAp2m9TkdzaHa6",
      "appleId": 1000655618500,
      "youTubeId": "NpsKcnLn2kE",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/750DyElWhAp2m9TkdzaHa6",
        "apple": "https://podcasts.apple.com/podcast/episode-9-dismantling-the-illusion-of-sacred/id1746432292?i=1000655618500",
        "youtube": "https://www.youtube.com/watch?v=NpsKcnLn2kE"
      }
    },
    {
      "id": "6dddba62-782b-4c21-8240-d31d69fee07d",
      "title": "Episode 8 - What Is The Deadliest Toxin In A Church Soil? - Spiritual Abuse Tactic \u0026 Behaviors 2 of 12 - Power",
      "description": "Send us a text Have you ever considered the profound impact of power within your spiritual community? This episode pulls back the curtain on the often-invisible abuse of power, where control and authority can distort faith\u0027s nurturing environment. With the wisdom of Diane Langberg guiding us, we dissect the spiritual abuse triad – power, control, and authority – and investigate how these forces can either build or destroy. We draw parallels with historical figures like Lincoln, Pittacus and Fred Rogers, exploring the measure of character necessary to handle power justly and the crucial responsibility that comes with wielding it. The allure of charismatic leadership is a double-edged sword, one that can both inspire and devastate. We scrutinize the delicate balance of power in religious settings, particularly within patriarchal structures and traditional barriers against female ordination. The examination goes deeper as we uncover the intricate dance between vulnerability and power and the implications of this dynamic on the character of spiritual leaders. Through the tragic cautionary tale of Jim Jones, we illustrate our collective susceptibility to charming authority and underscore the necessity of discernment in spiritual guidance. As we wrap up this introspective journey, we turn the mirror on ourselves, asking how we individually engage with the power we possess. We reflect on the behaviors and tactics that emerge from wielding influence, stressing the importance of coupling power with compassion and humanity. This episode is not just a listening experience; it\u0027s an invitation to engage with us, to share your thoughts and continue the conversation. Together, let\u0027s navigate the delicate balance of power in our lives with intentionality and care, ensuring it becomes a force for good in our hands. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2024-03-22T04:00:00Z",
      "duration": "00:50:57.4650000",
      "explicit": false,
      "spotifyId": "77JNeAnLa8vqed6udWC73y",
      "appleId": 1000655618368,
      "youTubeId": "nTEXejXKc24",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/77JNeAnLa8vqed6udWC73y",
        "apple": "https://podcasts.apple.com/podcast/episode-8-what-is-the-deadliest-toxin-in-a-church/id1746432292?i=1000655618368",
        "youtube": "https://www.youtube.com/watch?v=nTEXejXKc24"
      }
    },
    {
      "id": "1a36644e-2c93-4600-a3d4-af89d4f0addb",
      "title": "Episode 7: BONUS EPISODE - What Is The Missing Stair?",
      "description": "Send us a text Have you ever navigated a staircase, wary of that one perilous step you know to skip? That\u0027s the essence of the \u0027missing stair\u0027, an analogy we explore in a special bonus episode of Soul Bruises, which casts light on the often unseen perils within our spiritual communities. We delve into the metaphor\u0027s origin and its startling relevance to spiritual abuse, illuminating the dangers of ignoring harmful behaviors that, like a literal missing stair, threaten our collective wellbeing. And for those who have encountered such unsettling realities, know that this discussion is a sanctuary where understanding and healing are at the forefront. Joining the conversation are the Silo Sisters, Phoebe Hunt, Bonnie Sims, and Melody Walker, whose moving lyrics in \u0022The Missing Stair\u0022 echo the whispers and warnings of communities that, instead of repairing what\u0027s broken, teach newcomers to simply tread carefully. As we unpack the song and its haunting depiction of overlooked hazards, we issue a resounding call to action. It\u0027s time to fix these stairs—to confront and correct the predators in disguise. This episode is more than a conversation; it\u0027s an invitation to become an active participant in the transformation of our spiritual spaces. YouTube link for the song \u0022The Missing Stair\u0022 by the Silo Sisters https://www.youtube.com/watch?v=gPNh-ZIdaYk \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2024-03-04T13:00:00Z",
      "duration": "00:17:18.5090000",
      "explicit": false,
      "spotifyId": "6nYuFWhWvbeTNrPJAOoea1",
      "appleId": 1000655618397,
      "youTubeId": "JALsSIPi4tU",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nYuFWhWvbeTNrPJAOoea1",
        "apple": "https://podcasts.apple.com/podcast/episode-7-bonus-episode-what-is-the-missing-stair/id1746432292?i=1000655618397",
        "youtube": "https://www.youtube.com/watch?v=JALsSIPi4tU"
      }
    },
    {
      "id": "4ef1073e-9444-48eb-a769-cd39903163ee",
      "title": "Episode 6: Dissecting the Shadows of Religious Facades - Spiritual Abuse Tactics \u0026 Behaviors 1 of 12 - Deception \u0026 Lies",
      "description": "Send us a text Step behind the curtain of spiritual trust with me as we unearth the dark intricacies of deception that plague the paths of the faithful. This Soul Bruises episode peels back the layers of deceit woven into the fabric of spiritual communities, using the enigmatic life of John Harvey Kellogg as a case study. As you listen, discover the subtle yet devastating ways that seemingly trustworthy figures mask their true intentions, and how these tactics shape the perilous dynamics of spiritual abuse. This episode brings attention to how crucial it is to differentiate between the outward appearances and the hidden truths, empowering you to stand against manipulation and preserve the sanctity of your spiritual haven. We must be ever vigilant against the \u0022wolves in sheep\u0027s clothing\u0022 that seek to lead us astray. This conversation is a rallying cry to uphold the integrity of our faith communities, drawing wisdom from scripture and historical insight. By educating ourselves we can start to identify the signs of deception and lies in the context of spiritual abuse, the significance of self-awareness, and the strategies for fortifying our defenses against false prophets. This podcast episode will share insights that will embolden you to protect your spiritual flock and emphasize the imperative need to confront those who wear the cloak of religious authority to deceive others. Concluding this episode journey into deception and lies, Soul Bruises shines a light on the essential quest for truth, examining how education, personal boundaries, and community support can safeguard against the shadows that seek to disorient our beliefs. The tale of lawyer F.E. Smith is recounted, whose cunningness in court, exemplifies the triumph of truth over falsehood. This episode is not just an exposé; it\u0027s a call to arms to join forces in the collective pursuit of enlightenment and integrity. Tune in and arm yourself with the knowledge to discern and dismantle the deceptive tactics that may lurk within your spiritual circles. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2024-02-10T17:00:00Z",
      "duration": "00:47:57.4910000",
      "explicit": false,
      "spotifyId": "50apswE12WSnP2OjZrLtbH",
      "appleId": 1000655618222,
      "youTubeId": "_nMA8-qoLGo",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/50apswE12WSnP2OjZrLtbH",
        "apple": "https://podcasts.apple.com/podcast/episode-6-dissecting-the-shadows-of-religious/id1746432292?i=1000655618222",
        "youtube": "https://www.youtube.com/watch?v=_nMA8-qoLGo"
      }
    },
    {
      "id": "befe6747-1604-431c-87d1-04f1c06efcfb",
      "title": "Episode 5: An Oxymoron Defined",
      "description": "Send us a text Have you ever felt the heavy burden of spiritual abuse within a faith community? Our journey into the shadows of spiritual manipulation begins here, where I hope to guide you through the often-misunderstood realm of spiritual abuse. We\u0027re not just scratching the surface; we\u0027re exposing the deep-rooted patterns of control that have caused generational hurt across all faith traditions. With the expertise of thought leaders like Jeff VanVonderen and James Rochford, we dissect the misuse of religious authority and differentiate between the healable missteps and the intentional harm that demands strong preventive action. Peering into the aftermath of spiritual abuse, we navigate the psychological maze with guidance from experts like Ron Enroth, Dr. Lisa Oakley, Justin Humphreys, and many more as we come to understand the profound impact of abuse on the soul. This episode isn\u0027t meant to merely inform; it\u0027s a call to arms for those within the Christian community and beyond to create a culture of prevention and healing. Soul Bruises confronts the controversies head-on, debating the adequacy of the term \u0027spiritual abuse\u0027 and the necessity of using precise language to give appropriate weight to these agonizing experiences. Our resolve is to empower and equip our listeners with the knowledge needed to shield our communities from spiritual predators. Organizations like GRACE are at the forefront, and Soul Bruises shares their mission to initiate a vital cultural shift within the church. Under the leadership of Pete Singer, GRACE\u0027s dedication to protecting the vulnerable highlights that change isn\u0027t just possible; it\u0027s imperative. By tuning in, you\u0027re taking the first step toward standing with the wounded and becoming an advocate for change. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2024-01-06T20:00:00Z",
      "duration": "00:53:20.5160000",
      "explicit": false,
      "spotifyId": "5bcN8GTONJlC8jHmG3vABI",
      "appleId": 1000655618316,
      "youTubeId": "Kau8z4tGChM",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5bcN8GTONJlC8jHmG3vABI",
        "apple": "https://podcasts.apple.com/podcast/episode-5-an-oxymoron-defined/id1746432292?i=1000655618316",
        "youtube": "https://www.youtube.com/watch?v=Kau8z4tGChM"
      }
    },
    {
      "id": "d38483e6-0052-4c93-977c-d80eabfbf003",
      "title": "Episode 4: Unspoken Soul Wounds",
      "description": "Send us a text As we start on this journey, I\u0027d like to echo the words of Elie Weisel: \u0022Neutrality helps the oppressor, never the victim. Silence encourages the tormentor, never the tormented.\u0022 With this episode, we\u0027re raising our voices against an oppressor that often goes unnoticed - spiritual abuse. Through personal experiences, insights from experts, and stories of those who\u0027ve survived, we\u0027ll navigate this often misunderstood, but deeply consequential issue. Specifically, we\u0027ll examine how the Christian community, the very sanctuary that should foster love and acceptance, can inadvertently become a breeding ground for such abuse. In the second half, we bring a ray of hope to those who\u0027ve been victimized, shedding light on the healing process. The existence of spiritual abuse, much like a bone bruise, might be discernible to only the one who experiences the pain. However, acknowledging the pain is the first step towards healing. Drawing parallels to medical wound debriefment, we\u0027ll understand the importance of exposing the injury. We\u0027ll disentangle the fear of harming reputations or the church\u0027s image, emphasizing that the highest service we can offer to God\u0027s kingdom is to ensure it\u0027s a safe space for all. Let\u0027s journey together in this episode as we work towards glorifying God, strengthening the church, and promoting healing for victims of spiritual abuse. \u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2023-12-01T07:00:00Z",
      "duration": "00:34:36.2890000",
      "explicit": false,
      "spotifyId": "3pQ485KYa5MUWys6pnsusv",
      "appleId": 1000655618398,
      "youTubeId": "H3VmdoGpj9A",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3pQ485KYa5MUWys6pnsusv",
        "apple": "https://podcasts.apple.com/podcast/episode-4-unspoken-soul-wounds/id1746432292?i=1000655618398",
        "youtube": "https://www.youtube.com/watch?v=H3VmdoGpj9A"
      }
    },
    {
      "id": "37e002f3-fbfd-4ba1-9de0-2ba847563621",
      "title": "Episode 3: Soul Bruises Introduction: Confronting Spiritual Abuse Together As We Journey Towards Healing",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) \n\n\nThis introductory episode of Soul Bruises sets the stage for the podcast\u0027s mission—to uncover the reality of spiritual abuse, understand its impact on individuals, and discuss ways to combat it. Your host, Christie emphasizes the importance of listener participation and involvement to this issue.\n\nChristie\u0027s personal motivation stems from witnessing far too many loved ones who have experienced  spiritual abuse and feeling compelled to speak out against this harm. Inspired by a podcast detailing abusive behavior within a religious community, she was motivated to move from a neutral stance to actively confronting the issue of spiritual abuse head on. This podcast aims to delve into the complexities of this subject, promising an honest examination without minimizing cases of abuse.\n\n\nIn the upcoming episodes, Christie plans to address questions surrounding spiritual abuse by examining its definitions and characteristics and promises to navigate the delicate balance of discussing abuse without blaming the entirety of the church or religion.\n\n The host pledges to vehemently call out cases of abuse without minimizing them and emphasizes support for victims and their healing journeys. Ultimately, the goal is to create awareness, foster empathy, and challenge the audience to actively stand against spiritual abuse, making churches and communities devoid of this harm. \n\nThis podcast episode concludes with an invitation for listeners to join the journey of discovery and healing, urging them to be part of the battle against spiritual abuse.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2023-11-28T04:00:00Z",
      "duration": "00:09:36.8220000",
      "explicit": false,
      "spotifyId": "0GbfRqKATo3eOmN2gllKGl",
      "appleId": 1000655618501,
      "youTubeId": "ze41HEluayw",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0GbfRqKATo3eOmN2gllKGl",
        "apple": "https://podcasts.apple.com/podcast/episode-3-soul-bruises-introduction-confronting-spiritual/id1746432292?i=1000655618501",
        "youtube": "https://www.youtube.com/watch?v=ze41HEluayw"
      }
    },
    {
      "id": "f61b0e60-8835-42b1-bd79-dfe13d76578d",
      "title": "Episode 2: Soul Bruises Disclaimer - A Sensitive Exploration and Call to Action",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) \n\n\nSpiritual abuse can be a very sensitive topic!  I felt it necessary to give a disclaimer, for anyone that might find the information shared on this podcast, to be triggering .  I do not want to cause any further trauma to anyone.  I understand if you are a victim of spiritual abuse that this may be the last thing you want to listen to.  If you can\u0027t, please encourage your friends and family to  listen to it instead.  You need all the support you can get from your fellow humankind.  If you DO listen, please do so at your comfort level, keeping in mind your mental, physical, emotional and spiritual health.  Also please let me know if there is ANYTHING you would add to this podcast to be more compassionate to the spiritual abuse survivor\u0027s reality.   \n\nSafety in our spiritual and religious spaces is EVERYONE\u0027S responsibility. Together, we can work to get rid of the darkness of abuse by shedding light on this difficult topic through empathy, love and kindness.  It begins with acknowledging the harsh realities of spiritual abuse by bringing it out from under the rug and into the open, to process, learn and ultimately heal.\n\n\n\u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2023-11-19T19:00:00Z",
      "duration": "00:03:23.2660000",
      "explicit": false,
      "spotifyId": "4TaFnq6QyxLx6vso8WX6ia",
      "appleId": 1000655618396,
      "youTubeId": "OB89vDXGMQI",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4TaFnq6QyxLx6vso8WX6ia",
        "apple": "https://podcasts.apple.com/podcast/episode-2-soul-bruises-disclaimer-a-sensitive/id1746432292?i=1000655618396",
        "youtube": "https://www.youtube.com/watch?v=OB89vDXGMQI"
      }
    },
    {
      "id": "26b0adf1-6cda-426f-af5d-8cb9c3a3f862",
      "title": "Episode 1: Soul Bruises Trailer - From Silence to Sanctuary: A Journey through Spiritual Abuse",
      "description": "Send us a text (https://www.buzzsprout.com/twilio/text_messages/2240617/open_sms) \n\n\nThe \u0022Soul Bruises\u0022 podcast, hosted by Christie Hodson, delves into the often ugly and concealed realities of spiritual abuse. It addresses the weariness and sadness that arise from hearing stories of abuse at the hands of spiritual leaders and the troubling absence of accountability for these abusers. The podcast seeks to shed light on the damage hidden behind the veils of religion, faith, and dogma.\n\n\nThrough candid conversations, powerful stories, and the wisdom of those who have experienced spiritual abuse, \u0022Soul Bruises\u0022 aims to educate its listeners about what spiritual abuse looks like and how it manifests in various aspects of our lives. It\u0027s a sanctuary of trust, a place of learning, and a platform for elevating the voices of survivors who have been silenced for too long.\n\n\nThe podcast is dedicated to building safe havens within religious spaces, homes, communities, and personal lives. It is committed to reclaiming the peace and solace that spirituality can provide and promoting decency and kindness toward fellow humans. \n\n\n\u0022Be Human, Be Kind, Be Both.\u0022",
      "release": "2023-10-17T21:00:00Z",
      "duration": "00:03:48.9920000",
      "explicit": false,
      "spotifyId": "65pKj5Fxbh539sXpPg2y1S",
      "appleId": 1000655618367,
      "youTubeId": "40oUFA2MjFQ",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65pKj5Fxbh539sXpPg2y1S",
        "apple": "https://podcasts.apple.com/podcast/episode-1-soul-bruises-trailer-from-silence-to-sanctuary/id1746432292?i=1000655618367",
        "youtube": "https://www.youtube.com/watch?v=40oUFA2MjFQ"
      }
    }
  ]
}