{
  "_ts": 0,
  "id": "9402d95a-f94e-4912-9016-cf1d56ccf853",
  "name": "Sounds Like A Cult",
  "spotifyId": "0podj5AKLOFvJAS1raltmw",
  "appleId": 1566917047,
  "youTubeChannelId": "UCmBvRbI_2XS4vEu8XZbSEtA",
  "episodes": [
    {
      "id": "23fb9418-87c7-49e3-8aec-b50048cb4d64",
      "title": "The Cult of Shen Yun",
      "description": "You’re walking through the mall or driving down the street, and there it is again: a pastel-colored poster featuring a leaping dancer. It reads: Shen Yun, China Before Communism. What even IS this lavish dance show whose advertisements haunt all our towns? Is it a religion? A political party? A theatre troupe? What is their mission? Is the dancing even good? And where does Shen Yun find the budget for all this marketing?? This week, Amanda is joined by special guests Liz and Brace of the TrueAnon podcast ( @trueanonpod ) to break down the culty undercurrents of Shen Yun, the ultra-mysterious, Falun Gong-backed dance company that’s less about “reviving ancient Chinese culture” and more about, oh, say, labor exploitation, emotional abuse, and apocalyptic doomsday beliefs. ALLEGEDLY. Tune in as we pirouette through the cultiest corners of this not-so-harmless night at the theater. \u0026#x1f3ad;\u0026#x1f4b8;✨ Subscribe to Sounds Like A Cult on Youtube ! Follow us on IG @soundslikeacultpod , @amanda_montell , @reesaronii , @chelseaxcharles . Thank you to our sponsors! Embrace your ritual with extraordinary hydration from Liquid I.V. Get 20% off your first order of Liquid I.V. when you go to https://LIQUIDIV.COM and use code CULT at checkout. Head to https://www.squarespace.com/CULT to save 10% off your first purchase of a website or domain using code CULT Find exactly what you’re booking for on https://Booking.com , Booking.YEAH! Please consider donating to those affected by the Los Angeles Fires. Some organizations that Team SLAC are donating to are: https://mutualaidla.org/ https://give.pasadenahumane.org/give/654134/#!/donation/checkout https://shorturl.at/SGW9w Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2025-02-11T08:00:00Z",
      "duration": "00:57:43.1310000",
      "explicit": true,
      "spotifyId": "1qGH5veGq1NEfzDh10mFmx",
      "appleId": 1000691039355,
      "youTubeId": "dlQUR2TBWGo",
      "subjects": [
        "Falun Gong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1qGH5veGq1NEfzDh10mFmx",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-shen-yun/id1566917047?i=1000691039355",
        "youtube": "https://www.youtube.com/watch?v=dlQUR2TBWGo"
      }
    },
    {
      "id": "e78ea217-7fbb-46e5-baa7-a5c7d0a53238",
      "title": "The Cult of Synanon, Part 2",
      "description": "Buy tickets to The Big Magical Cult Show in Vancouver, Canada on February 21, 2025! Time for Part 2! Father Craigo helps us wrap up 2024 with the rest of his brain-tangling life story in the cult that inspired this whole dang pod, Synanon. This week, he\u0027s answering unfiltered listener Qs, sharing the harrowing tale of Synanon\u0027s downfall, and leaving us all with some takeaways for how to stay culty but not too culty in 2025. We simply cannot WAIT for next year, when your shameless cult leader trio Amanda, Chelsea, and Reese return to cover a slew of long-awaited topics, including a certain cult-followed beauty retailer, a book series that\u0027s turned into a full-blown religion, a freakishly ritualistic education system, a \u0022nonprofit\u0022 \u0022performance troupe\u0022 run by a \u0022new religious movement,\u0022 and more! Thank you so much for tuning into another fanatical year, culties. See you in the next evolutionary level above human!!! Subscribe to Sounds Like A Cult on YouTube ! Follow us on IG @soundslikeacultpod @amanda_montell @reesaronii @chelseaxcharles Thank you to our sponsors! Go to squarespace.com/CULT to save 10% off your first purchase of a website or domain. Start earning points on rent you’re already paying by going to joinbilt.com/CULT Get 20% off your first order of Liquid I.V. when you go to LiquidIV.com and use code CULT at checkout. Visit BetterHelp.com/CULT today to get 10% off your first month.",
      "release": "2024-12-17T09:00:00Z",
      "duration": "00:48:34.6120000",
      "explicit": false,
      "spotifyId": "2Do0HXjrEyTXA9ovVJE9ze",
      "appleId": 1000680670478,
      "youTubeId": "XdFwIZ7ilMo",
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Do0HXjrEyTXA9ovVJE9ze",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-synanon-part-2/id1566917047?i=1000680670478",
        "youtube": "https://www.youtube.com/watch?v=XdFwIZ7ilMo"
      }
    },
    {
      "id": "42d0fb8e-7b01-4b2e-aa58-f16de0f1cfa9",
      "title": "The Cult of Synanon",
      "description": "Father is back!!! No, not Father Algorithm, but *actual* Father. Indeed, Amanda\u0027s sweetie dad, Craig Montell, returns to the pod after his featurette on last year\u0027s cult of Military Wives episode, for an extra-special end-of-year, two-part deep dive into the cult that he survived and that inspired this entire show: Synanon. Craigo brings his dad charm and cult experience to break down exactly how this well-intentioned drug rehabilitation program spiraled into a full-on \u002770s compound complete with paranoia, hypocrisy, and some very strange hairstyling choices. This \u0022classic cult\u0022 discussion may not be typical SLAC fodder, but the story is actually more relevant than ever. Craig is here not just to divulge his shocking past, but also to scrutinize how Synanon’s same rituals and methods of manipulation are alive and well in today\u0027s society, from our politics to our social media feeds. Cozy in for some culty parental wisdom, and stay tuned for Part 2 next week to hear the end of the tale! Subscribe to Sounds Like A Cult on YouTube ! Follow us on IG @soundslikeacultpod @amanda_montell @reesaronii @chelseaxcharles Thank you to our sponsors! Dipsea is offering an extended 30-day free trial when you go to DipseaStories.com/cult . Shop the SKIMS Holiday Shop at skims.com/cult . Cut your wireless bill to 15 bucks a month at MINTMOBILE.com/cult . Visit BetterHelp.com/CULT today to get 10% off your first month.",
      "release": "2024-12-10T09:00:00Z",
      "duration": "01:09:15.4010000",
      "explicit": false,
      "spotifyId": "3QlK1VMCxiijXtuUA6qfSz",
      "appleId": 1000679862046,
      "youTubeId": "1hKEghDLoEo",
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QlK1VMCxiijXtuUA6qfSz",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-synanon/id1566917047?i=1000679862046",
        "youtube": "https://www.youtube.com/watch?v=1hKEghDLoEo"
      }
    },
    {
      "id": "1fb0a401-32a3-4e69-b6c1-e1fe21eacf7c",
      "title": "The Cult of Twin Flames",
      "description": "New Age love \u0026 wellness influencers turned baby NXIVM: That\u0027s kinda the best way we can succinctly describe this week’s cult, Twin Flames Universe, one of the most chilling groups we’ve discussed on the pod thus far. Several months ago, Twin Flames survivor Jessi Hersey, whom you might recognize from the “Escaping Twin Flames” doc on Netflix, slid into our DMs and made a very generous and compelling argument as to why Twin Flames needed airtime on Sounds Like A Cult. After all, it’s important to represent the whole LYL, WYB, GTFO cult spectrum! This week, we\u0027re asking the fundamental questions: How did this niche online self-help “community” turn so destructive so fast, and how are its tenets low-key a threat to us all? Tune in to find out, and make sure to listen to the very end of the episode. We’re making a highly exciting announcement about the next season of SLAC… let’s just say there might be a couple new “cult leaders” (ahem, co-hosts) in your future! Follow us on IG @soundslikeacultpod @amanda_montell @reesaronii To order Amanda\u0027s new book, The Age of Magical Overthinking: Notes on Modern Irrationality, click here. To subscribe to Amanda\u0027s new Magical Overthinkers podcast and/or watch full episodes on YouTube, click here :) Thank you to our sponsors!! Visit BetterHelp.com/CULT today to get 10% off your first month. Dipsea is offering an extended 30-day free trial when you go to DipseaStories.com/cult . Head to Squarespace.com for a free trial, and when you’re ready to launch, go to https://www.squarespace.com/CULT to save 10% off your first purchase of a website or domain. Get 20% off your first order of Liquid I.V. when you go to LiquidIV.com and use code CULT at checkout Further reading: How ‘Twin Flames Universe’ YouTubers Monetized Heartbreak and Trauma “Everywhere I Went, They Went With Me, Because They Were on My Phone”: Inside the Always Online, All-Consuming World of Twin Flames Universe Why We Can\u0027t Get Enough of Cult Documentaries Twin Flames, Explained",
      "release": "2024-08-13T09:00:00Z",
      "duration": "01:10:56.4960000",
      "explicit": false,
      "spotifyId": "4Rmu2yqvu7AufXJDcBRuvR",
      "appleId": 1000665129660,
      "youTubeId": "hJKzulDJVAE",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Rmu2yqvu7AufXJDcBRuvR",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-twin-flames/id1566917047?i=1000665129660",
        "youtube": "https://www.youtube.com/watch?v=hJKzulDJVAE"
      }
    },
    {
      "id": "89544745-6eb9-44c9-9f2a-32878a85a585",
      "title": "The Cult of Reddit",
      "description": "Sounds Like A Cult has covered doomsday cults, political cults, religious cults ... and this week is where they all join forces – on the much requested: Cult of Reddit! Notorious for forming some of the most niche yet largely endorsed group-thinks on the internet, and even powerful enough to take down institutional pillars…is the Cult of Reddit a Live Your Life, Watch Your Back or a Get the Fuck Out Level Cult? This week, Isa welcomes friend, writer and soon-to-be co-host of their new podcast, Lydia Keating, to discuss the good, the bad and the rabbit whole that is The Cult of Reddit.  Head to Host Isa Medina\u0027s IG or website to learn more about her new podcast coming in 2024! Or to tell her where to perform stand up next! Thank you to our sponsor:   SKIMS Holiday Gift Shop is now open at SKIMS.com. Get free shipping on orders over seventy five dollars.  ",
      "release": "2023-11-28T00:00:00",
      "duration": "00:54:36.8520000",
      "explicit": false,
      "spotifyId": "5B8XQVwDkj3aktYSCw6ulr",
      "appleId": 1000636755860,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5B8XQVwDkj3aktYSCw6ulr",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-reddit/id1566917047?i=1000636755860"
      }
    }
  ]
}