{
  "id": "9402d95a-f94e-4912-9016-cf1d56ccf853",
  "name": "Sounds Like A Cult",
  "spotifyId": "0podj5AKLOFvJAS1raltmw",
  "appleId": 1566917047,
  "episodes": [
    {
      "id": "49663471-8edb-4360-bad4-9f78192e61e3",
      "title": "The Cult of Military Wives",
      "description": "At long last, the man/myth/legend, Amanda\u0027s dad, Craig Montell, whose riveting stories of his childhood spent in the Synanon cult planted her fascination with all things \u0022cultish,\u0022 joins as this week\u0027s guest. In this *extremely wholesome* episode, Amanda and her pop analyze a quartet of listener-submitted stories, documenting four firsthand experiences with “culty” groups (from military wives to Abercrombie \u0026 Fitch) comparing each one to the surreal mindfuckery and power dynamics Craig witnessed in Synanon. The episode mostly focuses on the “cult” of military spouses... faaaaascinating how closely it resembles a bonafide \u002770s-era cult. But is it a Life Your Life, Watch Your Back, or GTFO?? Tune in to find out. Thanks so much to all who wrote in their culty tales! To check out Amanda\u0027s new book, The Age of Magical Overthinking, click here!  The Magical Overthinkers newsletter can be found here. Follow us on IG @soundslikeacultpod  Thank you to our sponsors! The Cotton collection and more are available now at SKIMS.com. Go to betterhelp.com/cult to get 10% off your first month",
      "release": "2023-10-31T00:00:00",
      "duration": "01:03:11.8560000",
      "explicit": false,
      "spotifyId": "2H8sdwXxAlwRo4kCXi16fC",
      "appleId": 1000633196837,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2H8sdwXxAlwRo4kCXi16fC",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-military-wives/id1566917047?i=1000633196837"
      }
    },
    {
      "id": "793bff12-6f15-4f07-985a-176d55490f27",
      "title": "The Cult of Life Coaches",
      "description": "Why does it seem like certain \u0022life coaches\u0022 are exactly the kinda folks who shouldn\u0027t be giving life advice? The unregulated life coaching industry is perfectly set up to turn culty: It\u0027s rife with New Age quacks charging thousands to tell others how to live, but also... hiring a brainstorming partner to help you work through sh*t during times of uncertainty *does* sound beneficial? Tricky!! This week, Amanda and Isa are joined by comedian and host of the Self-Helpless podcast Kelsey Cook to unpack how much of a \u0022cult\u0022 the life coach space has really become. Click here to get tickets to Isa\u0027s NYC comedy show September 22nd or to tell her where to perform next! To check out Amanda\u0027s new book, The Age of Magical Overthinking, click here! Follow us on IG @soundslikeacultpod @isaamedinaa @amanda_montell Thank you to our sponsors! Go to RocketMoney.com/SLAC to cancel unwanted subscriptions! Go to BEISTRAVEL.com/CULT for 15% off your first purchase. The Cotton collection and more are available now at SKIMS.com.",
      "release": "2023-09-12T00:00:00",
      "duration": "00:50:42.5330000",
      "explicit": false,
      "spotifyId": "15s5BbDxlWFxgBjZtj3aFj",
      "appleId": 1000627580495,
      "urls": {
        "spotify": "https://open.spotify.com/episode/15s5BbDxlWFxgBjZtj3aFj",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-life-coaches/id1566917047?i=1000627580495"
      }
    },
    {
      "id": "e22a3080-f4b0-46b3-a939-71da4877c68b",
      "title": "The Cult of Spiritual Scammers (feat. Listener Stories!)",
      "description": "Time to spill some never-before-heard culty tales: This week, Amanda and Isa are reacting to shocking cult stories submitted by you listeners! Many thanks to those who wrote in to share their personal brushes with New Age scams, love-bombing strangers, elementary school rituals that seem sus in retrospect, and more. Traditional religion may be on the decline, but our cravings for meaning and magic are stronger than ever, which isn\u0027t necessarily a bad thing... that\u0027s why we\u0027re here to determine whether your culty experiences were a Life Your Life, a Watch Your Back, or GTFO!  To support Sounds Like A Cult on Patreon, keep up with our live show dates, see Isa\u0027s live comedy, buy a copy of Amanda\u0027s book Cultish, or visit our website, click here! Or follow us on IG @soundslikeacultpod @isaamedinaa @amanda_montell Thank you to our sponsors! New customers get $5 off a Lume Starter Pack with code CULT at LumeDeodorant.com Go to betterhelp.com/cult to get 10% off your first month Dipsea is offering our listeners a 30 day free trial when you go to dipseastories.com/cult",
      "release": "2023-08-15T00:00:00",
      "duration": "00:31:29.6710000",
      "explicit": false,
      "spotifyId": "7vlkdhlSwyI9UmiEc6mkw2",
      "appleId": 1000624498326,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vlkdhlSwyI9UmiEc6mkw2",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-spiritual-scammers-feat-listener-stories/id1566917047?i=1000624498326"
      }
    },
    {
      "id": "e2b49aa5-b6ab-4304-a237-07a5615fa42c",
      "title": "The Cult of Self-Help",
      "description": "In 2005, this week\u0027s guest Sarah Edmondson joined what she thought was a personal development program devoted to helping her overcome her \u0022limiting beliefs.\u0022 Little did she know it\u0027d turn out to be one of the most notorious and scrutinized groups of all time, NXIVM. \u0022Self-Help\u0022 is a distinctly optimistic American pursuit and a majorly profitable industry. Sooo many culty groups start out with the innocent promise of helping their members become their best self. This gray area between positive self-improvement program and dangerous sect is exactly what hosts Isa and Amanda discuss on this week\u0027s can\u0027t-miss episode with Sarah, host of the podcast A Little Bit Culty and star of The Vow on HBO (Season 2 streaming now!). To support Sounds Like A Cult on Patreon, keep up with our live show dates, see Isa\u0027s live comedy, buy a copy of Amanda\u0027s book Cultish, or visit our website, click here! Thank you to our sponsors! Get 10% off your first OSEA order sitewide with code CULT at OSEAMalibu.com Visit ritual.com/CULT to start Ritual or add Synbiotic\u002B to your subscription today. Sounds like a Cult is sponsored by BetterHelp. Visit BetterHelp.com/CULT today to get 10% off your first month.",
      "release": "2023-02-14T00:00:00",
      "duration": "00:57:37.3840000",
      "explicit": false,
      "spotifyId": "6oxG2YXNd4kN8Wm4zvAAmz",
      "appleId": 1000599536576,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6oxG2YXNd4kN8Wm4zvAAmz",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-self-help/id1566917047?i=1000599536576"
      }
    },
    {
      "id": "0fe8cad5-f680-4386-b111-44fb1b16f178",
      "title": "The Cult of Teal Swan",
      "description": "Known to her loyalists as the “spiritual catalyst” but to her critics as the “suicide catalyst,” New Age influencer Teal Swan is a controversial 30-something self-help guru who some say has saved lives and others say has ended them. Having launched a social media career in the mid-2000s (and still going strong), Swan doesn’t post about beauty products and travel inspo but rather spiritual-meets-“scientific” teachings on a wide range of topics from addiction to chakras to vaccines to suicide. Some of her most committed adherents follow her down to Costa Rica to experience her shady self-actualization techniques IRL. Swan is the subject of the new Hulu docuseries The Deep End, based on the fascinating 2018 podcast The Gateway, which was created and hosted by this week’s guest, Jennings Brown, who’s here to talk with Amanda and Isa about the fanatical “cult” Swan has built online.  Helix is offering up to 200 dollars off all mattress orders AND two free pillows for our listeners at HelixSleep.com/cult. For listeners of the show, Dipsea is offering an extended 30-day free trial when you go to DipseaStories.com/CULT. For listeners of the show, Everlywell is offering a special discount of 20% off an at-home lab test at Everlywell.com/CULT. ",
      "release": "2022-06-28T00:00:00",
      "duration": "01:01:16.4730000",
      "explicit": false,
      "spotifyId": "7diqjzjux2mq6b2XATxUd4",
      "appleId": 1000567970355,
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7diqjzjux2mq6b2XATxUd4",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-teal-swan/id1566917047?i=1000567970355"
      }
    },
    {
      "id": "5eb3eccc-985d-4e9d-9493-5efdd60c23a9",
      "title": "The Cult of Essential Oils",
      "description": "Lavender can cure headaches and tea tree oil can clear your acne (and heal Covid/your whole life)? The cult of essential oils blurs the line between fact and fiction and this week, Amanda and Isa team up with a special guest, Buzzfeed reporter Stephanie McNeal, to learn about these controversial little potions, their “cult following,” and the snake oil salespeople who weaponize them.  Head to MeritBeauty.com/CULT to get their free signature reusable makeup bag with your purchase.  Go to DailyHarvest.com/cult for up to forty dollars off your first box! Get Honey for FREE at JoinHoney.com/CULT Listeners get 10% off your first month by visiting our sponsor at BetterHelp.com/CULT  ",
      "release": "2022-04-19T00:00:00",
      "duration": "00:50:39.2420000",
      "explicit": false,
      "spotifyId": "7aMvWxAOR8ZsJuDOD0JJcN",
      "appleId": 1000558019889,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7aMvWxAOR8ZsJuDOD0JJcN",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-essential-oils/id1566917047?i=1000558019889"
      }
    },
    {
      "id": "32077810-b79f-4ad8-b030-bcfb062ec431",
      "title": "The Cult of LuLaRoe",
      "description": "In the wake of the zealously consumed LuLaRich docuseries on Amazon Prime, we’re releasing a bonus episode on the leggings multilevel marketing company that shook American suburban boss babes throughout the 2010s: LuLaRoe. Ex-MLMers (and fascinated docuseries viewers) keep saying LuLaRoe is nothing but a massive “cult”… but is it really? And if so, how bad is it? This week, we’re unpacking all the culty elements of this fanatically followed group with the help of a special guest: former LuLaRoe retailer Roberta Blevins, who identifies as the company’s “public enemy #1” and who you might recognize from the LuLaRich docuseries or her own “cult-followed” podcast Life After MLM. Follow us on socials! @soundslikeacultpod @amanda_montell  @isaamedinaa",
      "release": "2021-10-19T00:00:00",
      "duration": "00:33:38.9250000",
      "explicit": false,
      "spotifyId": "5HWB1Sx17BWGRoObd7J0nD",
      "appleId": 1000539054927,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5HWB1Sx17BWGRoObd7J0nD",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-lularoe/id1566917047?i=1000539054927"
      }
    },
    {
      "id": "a9acd4e9-3096-4cf2-b045-95e7bf315890",
      "title": "The Cult of Tony Robbins",
      "description": "Super-wealthy motivational speaker Tony Robbins physically towers over his thousands of adoring acolytes, boasting a booming voice and omniscient life advice about everything from love to business to trauma, which he espouses at his world-famous conferences… but in light of recent abuse allegations, his cult status is starting to look a lot more predatory than inspiring. Special guest Kate Kennedy of the Be There In Five podcast joins us this week to unpack the cult of motivational speaking and Tony Robbins, discussing peer pressure and forced vulnerability, the connection between Robbins and disgraced self-improvement star Rachel Hollis, and so much more.",
      "release": "2021-08-17T00:00:00",
      "duration": "00:37:58.9220000",
      "explicit": false,
      "spotifyId": "3AZBXG7ySoUtvksem7bc0S",
      "appleId": 1000532265843,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3AZBXG7ySoUtvksem7bc0S",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-tony-robbins/id1566917047?i=1000532265843"
      }
    },
    {
      "id": "674bf433-4aad-4388-b9ec-eb0b691e7b92",
      "title": "The Cult of Multi-Level Marketing",
      "description": "Ask and you shall receive! This week, we’re covering our single most listener-requested topic: The “cult” of multi-level marketing (aka MLMs). Most of us have a former high school classmate or two who got sucked into a pay-and-recruit organization like Amway, Mary Kay, or Young Living. MLMs are at once the butt of countless jokes about pyramid schemes and brainwashed #girlbosses, and yet they maintain a profound hold on a certain slice of aspiring entrepreneurs, who’ve been promised that some shadily structured “once-in-a-lifetime opportunity” will guarantee them the American Dream (and more). MLMs are certainly scammy, but are they culty? And if so, what kind of “cult” are they? In this episode, we attempt to find an answer...",
      "release": "2021-07-13T00:00:00",
      "duration": "00:34:34.5130000",
      "explicit": false,
      "spotifyId": "4gMXQCoRiafE7Q6FeLxGMQ",
      "appleId": 1000528729017,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4gMXQCoRiafE7Q6FeLxGMQ",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-multi-level-marketing/id1566917047?i=1000528729017"
      }
    }
  ]
}