{
  "id": "39d8e84b-25bc-4082-a929-b60fb7ae607a",
  "name": "Southern Mysteries Podcast",
  "spotifyId": "52srZdOQVTAZdFwV3wizkG",
  "appleId": 1298314174,
  "youTubeChannelId": "UCU3_OuCQMQAp54M4ZSHcw6A",
  "episodes": [
    {
      "id": "91195bf8-1ea9-4e20-9efb-426f9ae1494c",
      "title": "Episode 98 The Cult of the Unknown Tongues",
      "description": "In February 1933 a church service in a Kentucky mountain town ended with the death of 72 year old Lucinda Mills. Nine relatives would be accused of murder while the media labelled her death a human sacrifice. What happened in that cabin? Want more Southern Mysteries? Hear the Southern Mysteries show archive and immediately access exclusive content when you become a patron of the show. Join now at patreon.com/southernmysteries Connect Website: southernmysteries.com Facebook: Southern Mysteries Podcast Twitter: @ southernpod_ Instagram: @ explorethesouth Email: southernmysteriespodcast@gmail.com Episode Resources Laben T. Mills Obituary. Big Sandy News. July 31,1914 Lucinda Ward Mills. Find A Grave. [Lucinda’s age listed as 65 here but based off of census records she was believed to have been 72] Burning of Body on Altar Halted by Inez Police. The Owensboro Inquirer. February 9, 1933 Cult Victim Held Willing Sacrifice. The Courier-Journal. February 10, 1933 Insanity Plea Planned in Cult Slaying Case. The Courier-Journal. February 11, 1933 Bare Details of ‘Sacrifice’ Death Scene. Indianpolis Times. February 11, 1933 Mills Held Without Bond for Slaying Mother in Cult ‘Sacrifice’. The Lexington Herald. February 12, 1933 Nine Relatives of Cult Victim Are Indicted. The Owensboro Messenger. April 5, 1933 Insanity Held Slaying Cause. The Courier-Journal. April 7, 1933 Two Relative Freed In Cult Slaying Trial. The Lexington Leader. April 9, 1933 Prosecutor Contends Slayers of Mrs Mills Cold Blooded Murderers. The Courier-Journal. April 10, 1933 Mills Kneeling on Mother’s Body Fought Deputies. The Owensboro Inquirer. April 11, 1933 Cult Case Goes to Jury. The Courier Journal. April 12, 1933 Cult Leader Is Given Life Term for Matricide. The Courier-Journal. April 12, 1933 Blaine McGinnis is Given Pardon. Lexington Herald-Leader. November 3, 1933 The Mysterious “Order of the Odd Fellows” . Messy Nessy. January 2020. Odd Fellows Have Skeletons in Their Closets--and Their Walls and Attics. Los Angeles Times. April 2001. Episode Music Clean Soul, Concentration, Tranquility Base, Almost F in Tranquility, Drone in D and Loss by Kevin MacLeod. Licensed under a Creative Commons Attribution 4.0 license. Source: http://incompetech.com The Dark Glow of the Mountains and There’s Probably No Time by Chris Zabriske Licensed under Creative Commons Elegy by Asher Fulero Licensed under Creative Commons Theme Song “Dark \u0026 Troubled” by Pantherburn. Special thanks to Phillip St Ours for permission for use.",
      "release": "2021-10-11T07:00:00Z",
      "duration": "00:42:23.8040000",
      "explicit": false,
      "spotifyId": "4ln8KT1gnYOtqf2KHqPhjz",
      "appleId": 1000538182508,
      "youTubeId": "_t1lmYZD-7w",
      "subjects": [
        "John H Mills"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ln8KT1gnYOtqf2KHqPhjz",
        "apple": "https://podcasts.apple.com/podcast/episode-98-the-cult-of-the-unknown-tongues/id1298314174?i=1000538182508",
        "youtube": "https://www.youtube.com/watch?v=_t1lmYZD-7w"
      }
    }
  ]
}