{
  "_ts": 0,
  "id": "e2cb5231-abb6-4efa-ba77-e6aef741087a",
  "name": "Speaking Up: Surviving Religions and Cults",
  "spotifyId": "7gZldnfgcpu4O1JYtNv9iL",
  "appleId": 1620395336,
  "episodes": [
    {
      "id": "ad41f2de-e28d-4af6-b5a2-8cb2ea62113b",
      "title": "NEW PODCASTS",
      "description": "Speaking Up has ended, but I have two new podcasts out now. My new podcasts are \u0027 Surviving BJU: A Christian Cult\u0027 and \u0027 Beyond BJU: Exposing Fundamentalism \u0027. “ Surviving Bob Jones University: A Christian Cult ” is a limited podcast by Andrew Pledger. The show is a thought-provoking podcast that explores the fundamentalist Christian college BJU, which is located in Greenville, SC. The series covers the history of BJU, the psychology of fundamentalism, the criteria for cults, and survivors experiences. This limited series also features cult experts who offer their opinions on the university. ( Beyond BJU: Exposing Fundamentalism ) Join Andrew Pledger in exposing Bob Jones University, a school known for its culture of indoctrination and control. BJU is a fundamentalist Christian college with roots in white supremacy and authoritarianism. The podcast features survivors\u0027 stories from the university, and its affiliated churches, camps, and day schools. The show also explores BJU\u0027s influence beyond the university, focusing on Christian education, politics, Biblical counseling, and evangelical Christianity. This show is a continuation of the limited series \u0022Surviving BJU: A Christian Cult.” CHECK OUT MY NEW PODCASTS: https://andrewpledger.mypixieset.com/beyond-bju-podcast/ Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-06-12T23:59:51Z",
      "duration": "00:02:20.8780000",
      "explicit": false,
      "spotifyId": "5CTRYSS7il3Evutfy8QT7U",
      "appleId": 1000658845928,
      "subjects": [
        "Bob Jones University",
        "Evangelicalism",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5CTRYSS7il3Evutfy8QT7U",
        "apple": "https://podcasts.apple.com/podcast/new-podcasts/id1620395336?i=1000658845928"
      }
    },
    {
      "id": "d0db7421-efaa-4b1c-836c-0d3f26af111b",
      "title": "Finale",
      "description": "Get updates on my new project on Substack: https://speakingupandrewpledger.substack.com/ Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-09-01T00:00:00",
      "duration": "00:03:16.8840000",
      "explicit": false,
      "spotifyId": "0IxZ5q2xkrqxIKtBEMqxPM",
      "appleId": 1000626490996,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0IxZ5q2xkrqxIKtBEMqxPM",
        "apple": "https://podcasts.apple.com/us/podcast/finale/id1620395336?i=1000626490996\u0026uo=4"
      }
    },
    {
      "id": "a841bcc8-ffa2-4dc4-b65f-6e3bf48dc4ba",
      "title": "SAFER - Laura Padgett \u0026 Jenni Espinosa",
      "description": "Laura Padgett \u0026 Jenni Espinosa - Abuse Recovery Coaches, Policy Consultants, Domestic Violence AdvocatesLaura holds nearly two decades of public policy advocacy and cross-cultural ministry leadership experience. She has turned her passion for helping others heal into abuse recovery coaching through body-mind wellness, mindfulness, and therapeutic arts modalities.Jenni has devoted over 20 years of her life as an amazing educator and now has turned that devotion and experience toward domestic violence advocacy and abuse recovery. She holds a master\u0027s degree and deep expertise in church ministry leadership and navigating divorce.As abuse recovery coaches, both Laura and Jenni meet clients with compassionate wisdom learned through professional training, as well as many years of reclaiming their own lives from toxicity and abuse. Connect with them on their website, Instagram, Twitter, and Facebook Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-09-01T00:00:00",
      "duration": "00:52:24.6200000",
      "explicit": false,
      "spotifyId": "17EW7sSMUgVRkH56hQN69a",
      "appleId": 1000626489577,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/17EW7sSMUgVRkH56hQN69a",
        "apple": "https://podcasts.apple.com/us/podcast/safer-laura-padgett-jenni-espinosa/id1620395336?i=1000626489577\u0026uo=4"
      }
    },
    {
      "id": "68b31b29-685a-4e47-a1c7-ccd5de2f4f61",
      "title": "When Religion Hurts You - Dr. Laura Anderson",
      "description": "Dr. Laura Anderson is a therapist, trauma resolution and recovery coach, writer, educator, and creator who specializes in complex trauma with a focus on domestic violence, sexualized violence and religious trauma. She holds a Master’s degree in Marriage and Family Therapy and a PhD in Mind Body Medicine from Saybrook University with her research focusing on the experience of living in a healing body after sexual trauma. Laura has a private practice in Nashville, TN and is the founder and director of the Center for Trauma Resolution and Recovery, an online coaching company where she and the other practitioners work with clients who have experienced high demand/high control religions, adverse religious experiences, cults, and religious trauma. Her Book: Book | Religious Trauma Expert (drlauraeanderson.com)In 2019, Laura co-founded the Religious Trauma Institute with the goal of providing trauma-informed resources, consultation, and training to clinicians and other helping professionals who work with religious trauma survivors. Laura’s first book, “When Religion Hurts You: Healing From Religious Trauma and the Impact of High Control Religion”, is being released by Brazos press in Fall 2023. She lives with her dog, Phoebe, in Nashville, Tennessee.Connect with Dr. Laura Anderson on Instagram, and Tik Tok, Andrew\u0027s LinksBecome a Patreon member HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-09-01T00:00:00",
      "duration": "01:21:51.0460000",
      "explicit": true,
      "spotifyId": "7HWwgchMmehLqkz7EBJjSU",
      "appleId": 1000626489468,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7HWwgchMmehLqkz7EBJjSU",
        "apple": "https://podcasts.apple.com/us/podcast/when-religion-hurts-you-dr-laura-anderson/id1620395336?i=1000626489468\u0026uo=4"
      }
    },
    {
      "id": "a703fcb7-7c01-4094-95c6-b0d4d08794ed",
      "title": "Stumbling - Brandon Flanery",
      "description": "Brandon Flanery is an ex-pastor, ex-missionary, ex-evangelical who has been writing and researching the intersection of faith and sexuality, most recently why people are leaving Christianity. He’s been featured in Baptist News Global, the Colorado Springs Indy, and with the University of Colorado. His new book Stumbling: a sassy memoir about coming out of Evangelicalism debuts August 22 and is available for pre-order. You can learn more about Brandon and his writings by going to BrandonFlanery.com.Order his book: https://brandonflanery.com/book/Linkree: https://brandonflanery.com/link-tree/Andrew\u0027s LinksBecome a Patreon member HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-08-28T00:00:00",
      "duration": "00:53:09.6290000",
      "explicit": true,
      "spotifyId": "15HKTUkf4lFuQcv0i1M1Bn",
      "appleId": 1000625897386,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/15HKTUkf4lFuQcv0i1M1Bn",
        "apple": "https://podcasts.apple.com/podcast/stumbling-brandon-flanery/id1620395336?i=1000625897386"
      }
    },
    {
      "id": "93cd2685-fdea-4f29-a7d6-89c0a2670e97",
      "title": "My Deconversion - Dee Murphy - ARCHIVE",
      "description": "Listen to The Stacie\u0027s Mom Podcast: https://www.youtube.com/@thestaciesmompodcast/streamsDee Murphy from \u0022The Stacie\u0027s Mom Podcast\u0022 shares her upbringing and religious deconversion.Andrew\u0027s LinksBecome a Patreon member HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-08-21T00:00:00",
      "duration": "01:20:26.6180000",
      "explicit": false,
      "spotifyId": "2bCVeXToqEcWXdOd2uvIor",
      "appleId": 1000625091250,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bCVeXToqEcWXdOd2uvIor",
        "apple": "https://podcasts.apple.com/podcast/my-deconversion-dee-murphy-archive/id1620395336?i=1000625091250"
      }
    },
    {
      "id": "d4b069fb-3e87-40f6-947f-fd851a0539f7",
      "title": "Leaving the PCG - Hannah Strickland - ARCHIVE",
      "description": "Hannah Strickland grew up in the PCG from birth until the age of 15. The organization seemed truly malevolent to them, as it appeared to exploit the less fortunate to provide a lavish lifestyle for the leadership and their headquarters family. Over time, many from their generation decided to leave, but their family, with the exception of their mother, remained entrenched in the cult. The PCG functioned as a doomsday cult, fixated on the imminent return of Christ, using fear as a tool to enforce compliance and belief in their fabricated beliefs.Become a Patreon member HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-08-14T00:00:00",
      "duration": "01:42:43.0170000",
      "explicit": true,
      "spotifyId": "04YY9Xng27AxNPiEO3bIL7",
      "appleId": 1000624349877,
      "subjects": [
        "Philadelphia Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/04YY9Xng27AxNPiEO3bIL7",
        "apple": "https://podcasts.apple.com/podcast/leaving-the-pcg-hannah-strickland-archive/id1620395336?i=1000624349877"
      }
    },
    {
      "id": "6953a717-5c3f-4cfa-a278-0fd0e69edfd1",
      "title": "Surviving BJU: A Christian Cult - Trailer #2",
      "description": "Subscribe here to Surviving BJU: https://lnk.bio/survivingbjupod\u0022Surviving Bob Jones University: A Christian Cult” is a limited podcast by Andrew Pledger (COMING AUGUST 23, 2023). The show is a thought-provoking podcast series that explores the history of Bob Jones University, the psychology of fundamentalism, the criteria for cults, and survivors experiences. The series features diverse interviews with survivors, including queer individuals, BIPOC, women, and men, sharing their unique perspectives on the institution. Listeners gain insight into the strict rules, culture, and leadership of Bob Jones University and how its fundamentalist beliefs have contributed to a toxic environment. The podcast showcases stories of resilience, healing, and growth from survivors who have overcome trauma and abuse at the Christian college. It offers an eye-opening exploration of cults’ harmful impact on vulnerable individuals and communities. SUBSCRIBE to stay updated on the premiere of this podcast which is coming August 23, 2023.  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-08-07T00:00:00",
      "duration": "00:03:13.3840000",
      "explicit": false,
      "spotifyId": "29VbOrJNLVzsWMD8QWypOZ",
      "appleId": 1000623698883,
      "subjects": [
        "Bob Jones University",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/29VbOrJNLVzsWMD8QWypOZ",
        "apple": "https://podcasts.apple.com/podcast/surviving-bju-a-christian-cult-trailer-2/id1620395336?i=1000623698883"
      }
    },
    {
      "id": "ee031758-92ec-486e-a898-cdbe2fcd2163",
      "title": "007 - Silenced in Eden - Jo Lloyd Johnson",
      "description": "Jo Lloyd Johnson is a childhood sexual abuse survivor and deconverted Christian who just published her first book “Silenced in Eden.” Her book walks readers through her childhood, the realization of her repressed abuse, and the journey to begin healing. Her path to self-love and acceptance was her journey out of religion. Order her book here: https://www.amazon.com/Silenced-Eden-Jo-Lloyd-Johnson/dp/B0BV4GMV1MBecome a Patreon member HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-07-17T00:00:00",
      "duration": "01:13:08.3100000",
      "explicit": true,
      "spotifyId": "6CzmaSHtDo3Zbm27RSGwd6",
      "appleId": 1000621347027,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6CzmaSHtDo3Zbm27RSGwd6",
        "apple": "https://podcasts.apple.com/podcast/007-silenced-in-eden-jo-lloyd-johnson/id1620395336?i=1000621347027"
      }
    },
    {
      "id": "26dd614f-70bd-4fbc-838e-24a66c990f09",
      "title": "006 - From Skepticism to Acceptance - Kristina Mand-Lakhiani",
      "description": "Kristina Mand-Lakhiani is an international speaker, entrepreneur, artist, philanthropist, and mother of 2 kids. As a co-founder of Mindvalley, a leading publisher in the personal growth industry, Kristina dedicated the last 20 years of her career from teachers like Michael Beckwith, Bob Proctor, Lisa Nichols, and many more. She started her career in a government office in her native Estonia and, by her mid-20s, achieved a level of success mostly known to male politicians at the end of their careers. It was shortly after that Kristina and her then-husband Vishen founded Mindvalley. From a small meditation business operating out of the couple’s apartment in New York, the company quickly grew into a global educational organization offering top training for peak human performance to hundreds of thousands of students all around the world. Kristina believes life is too important to be taken seriously and makes sure to bring fun into every one of her roles: as a teacher, mother, entrepreneur, philanthropist, and world traveller. Kristina helps her students to virtually hack happiness by taking them through her unique framework - “Hacking happiness” - a unique framework of balancing your life, taking in every moment, and paying close attention to the small daily choices.  Kristina is also the author of three transformational quests - \u00227 Days To Happiness\u0022, \u0022Live By Your Own Rules.” and \u0022The Art of Being Flawesome\u0022. Kristina talks about personal transformation, authenticity, understanding and accepting oneself, and a path to happiness.In July 2023, with the help of Hay House Publishing, Kristina releases her very first book - \u0022Becoming Flawesome\u0022. In her book, Kristina shares her own journey from being on top of a personal growth empire like Mindvalley to stepping aside, conscious uncoupling from her husband, and walking her path towards being more honest with herself. You can find more information about Kristina here: Instagram, LinkedIn, Facebook, and website. https://kristinamand.com/Becoming Flawesome: https://www.amazon.com/Becoming-Flawesome-Living-Imperfectly-Authentic/dp/1401974341Support Andrew\u0027s work on Patreon HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-07-10T00:00:00",
      "duration": "00:34:28.0620000",
      "explicit": true,
      "spotifyId": "5TxkcpSxS6b2cz0xU9G3E8",
      "appleId": 1000620439033,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TxkcpSxS6b2cz0xU9G3E8",
        "apple": "https://podcasts.apple.com/podcast/006-from-skepticism-to-acceptance-kristina-mand-lakhiani/id1620395336?i=1000620439033"
      }
    },
    {
      "id": "02e761f4-23b2-4531-893e-e8ae7be3cddc",
      "title": "What is Truth? - PATREON BONUS PREVIEW",
      "description": "Listen to the full episode on my Patreon HERE: https://patreon.com/4ndrewpledgerIn this thought-provoking episode, we explore the significance, enigmatic nature, and profound impact that truth has on our understanding of the world. I dig into the psychology of mankind\u0027s search for truth, and how cults prey on this drive. Join me as I draw from the wisdom of ancient thinkers and modern philosophers to navigate the various theories of truth. Together, we will examine the notions of correspondence, coherence, and pragmatism, seeking to grasp the essence of what it truly means for a statement or belief to be considered true. We\u0027ll ponder the timeless questions: Can truth be objective, or is it a subjective construct? Does absolute truth exist, or is truth merely a product of our interpretations?Join Andrew\u0027s Patreon HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-07-09T00:00:00",
      "duration": "00:04:42.4090000",
      "explicit": false,
      "spotifyId": "3vYkzrsK8Xa1KLag2N3hsn",
      "appleId": 1000620413717,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vYkzrsK8Xa1KLag2N3hsn",
        "apple": "https://podcasts.apple.com/podcast/what-is-truth-patreon-bonus-preview/id1620395336?i=1000620413717"
      }
    },
    {
      "id": "72d31fdf-6bbb-45e2-b3ea-765b68e86a1a",
      "title": "Christian Entertainment w/ Ashleigh Doxtater - Patreon Bonus Preview",
      "description": "Listen to the full episode on my Patreon HERE: https://patreon.com/4ndrewpledgerIn this Patreon bonus episode, I talk with Ashleigh Doxtater about the Christian entertainment that we both grew up with. We discuss Veggie Tales, Bible Man, Adventures in Odyssey, and much more. Follow Ashleigh on TikTok HERE: https://www.tiktok.com/@ashedendox?_t=8ddKvNR3Zdr\u0026_r=1Support Andrew\u0027s work on Patreon HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-07-03T00:00:00",
      "duration": "00:50:14.7390000",
      "explicit": true,
      "spotifyId": "66lolWCzVtvyPxtoTd6Dou",
      "appleId": 1000619087199,
      "urls": {
        "spotify": "https://open.spotify.com/episode/66lolWCzVtvyPxtoTd6Dou",
        "apple": "https://podcasts.apple.com/podcast/christian-entertainment-w-ashleigh-doxtater-patreon/id1620395336?i=1000619087199"
      }
    },
    {
      "id": "d065a0c7-704a-4d45-b2ad-d736b176e5af",
      "title": "005 - Science and Faith - Haley the Scientist",
      "description": "Haley Cole is the podcast host of Divinely Modern, a blogger, and scientist with a mission to dismantle patriarchal theology, fight for justice, and discover a healthy spirituality after leaving toxic Christianity. She believes in approaching faith with critical thinking and open-mindedness. To read her blog or learn more about her and her platform, check out her website HaleyTheScientist.com. Or, check out her podcast Divinely Modern, which offers support and conversations for exploring faith in the modern world and finding divinity all around us.Connect with Haley through her websiteSupport Andrew\u0027s work on Patreon HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-07-03T00:00:00",
      "duration": "01:19:07.3370000",
      "explicit": true,
      "spotifyId": "0IZNznFF7szxaTHltA6Z6D",
      "appleId": 1000619084394,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0IZNznFF7szxaTHltA6Z6D",
        "apple": "https://podcasts.apple.com/podcast/005-science-and-faith-haley-the-scientist/id1620395336?i=1000619084394"
      }
    },
    {
      "id": "f1e29e93-ec52-4976-8ace-c215df38625f",
      "title": "004 - Crucifying the Bible - Deborah Grace",
      "description": "Deborah Grace spent the better part of her life writing for the legitimacy of the scriptures, but it was in those writings that the truth began to surface. Having been told numerous times over the years that she would one day write a book, Crucifying the Bible is her first published book and the last point of contention she ever imagined taking on. Although controversial, Grace found the process to be cathartic and another layer of closure to her past journey in faith; healing many old wounds inflicted by religion and finding a sense of validation as she connected with others who shared similar stories in her research. Deborah is currently writing her second book.As an INTJ, she is careful with her choices, detailed in her work, introspective in her personal growth, and strives to finish strong. Her tagline is to be a better person today than yesterday and an even better person tomorrow than today.Deborah with her husband Mark and Yorkie Tank in Georgia. In her spare time, and in addition to writing, she enjoys learning new things, traveling with her husband, and a good glass of Italian wine. Buy Crucifying the BibleConnect with Deborah GraceWebsite, Instagram, Twitter, Facebook, and YouTubeSupport Andrew\u0027s work on Patreon HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-06-26T00:00:00",
      "duration": "00:59:31.9050000",
      "explicit": true,
      "spotifyId": "5hC2YttxX52c2NLpzHfgLi",
      "appleId": 1000618306522,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5hC2YttxX52c2NLpzHfgLi",
        "apple": "https://podcasts.apple.com/podcast/004-crucifying-the-bible-deborah-grace/id1620395336?i=1000618306522"
      }
    },
    {
      "id": "fa51e138-edef-471c-811a-cc9f0acfc88c",
      "title": "003 - Exorcisms in a Catholic Cult - Ryan Hernandez",
      "description": "Ryan is still a practicing Catholic but the experiences of trauma he went through have left him wounded. He has been on a healing journey and has been active on a podcast to spread awareness of cult abuse and how religious people with good intentions can turn into fanatics. The name of his podcast is The Truth That Heals Podcast.Connect with Ryan Hernandez LinktreeInstagramSupport Andrew\u0027s work on Patreon HERE and access all bonus episodes \u002B other benefits. https://www.patreon.com/4ndrewpledgerConnect with Andrew Pledger through social media, and his website. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-06-19T00:00:00",
      "duration": "01:14:06.1710000",
      "explicit": true,
      "spotifyId": "5udupnMw5iUEajPvsN8Yox",
      "appleId": 1000617507417,
      "subjects": [
        "Alliance of the Holy Family International",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5udupnMw5iUEajPvsN8Yox",
        "apple": "https://podcasts.apple.com/podcast/003-exorcisms-in-a-catholic-cult-ryan-hernandez/id1620395336?i=1000617507417"
      }
    },
    {
      "id": "16e72822-60f5-471b-acbc-55f1dbf508a1",
      "title": "Christian Camp Stories - Patreon Bonus Preview",
      "description": "Listen to the full episode HERE for only $3 monthly \u002B access all bonus episodes. https://www.patreon.com/4ndrewpledger - I need your support to continue creating the podcast.In this Patreon bonus episode, I share stories of attending the Christian camp that my IFB church owned.Follow me on Social Media: https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-06-19T00:00:00",
      "duration": "00:04:19.3940000",
      "explicit": true,
      "spotifyId": "7aBNMfKG3zNz8fsXPOMuCP",
      "appleId": 1000617502797,
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7aBNMfKG3zNz8fsXPOMuCP",
        "apple": "https://podcasts.apple.com/podcast/christian-camp-stories-patreon-bonus-preview/id1620395336?i=1000617502797"
      }
    },
    {
      "id": "cde63ba5-2397-4f00-a7f5-b44d8e87bef0",
      "title": "The Cultiness of Chick-Fil-A - Patreon Bonus Preview",
      "description": "Listen to the full episode HERE for only $3 monthly \u002B access all bonus episodes. https://www.patreon.com/4ndrewpledger - I need your support to continue creating the podcast. In this Patreon bonus episode, I explore the cultiness of Chick-Fil- A and signs of a corporate cult. I worked for CFA for over 4 years, and I have some stories. The cognitive dissonance of being g@y and working at CFA. Follow me on Social Media Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-06-12T00:00:00",
      "duration": "00:04:41.9130000",
      "explicit": false,
      "spotifyId": "6BkVgHRwVoSkHfqhk73dB7",
      "appleId": 1000616565669,
      "subjects": [
        "Corporate Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6BkVgHRwVoSkHfqhk73dB7",
        "apple": "https://podcasts.apple.com/podcast/the-cultiness-of-chick-fil-a-patreon-bonus-preview/id1620395336?i=1000616565669"
      }
    },
    {
      "id": "67a4b320-b0d7-4cce-b8c0-6907cc59fefc",
      "title": "002 - From the Children of God to the Military - Daniella Mestyanek Young",
      "description": "DANIELLA MESTYANEK YOUNG is an American author and speaker who was raised in the religious cult, Children of God. She later served as an intelligence officer for the US Army for over six years, making the rank of Captain, and became one of the first women in US Army history to conduct deliberate ground combat operations when she volunteered to serve on a Female Engagement Team and received the Presidential Volunteer Service Award. Daniella lives with her husband and daughter in Maryland and holds a Master’s degree in Industrial and Organizational Psychology from the Harvard Extension School.Buy Daniella\u0027s memoir UnculturedConnect with Daniella on Instagram, Twitter and TikTokConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-06-05T00:00:00",
      "duration": "01:07:08.8390000",
      "explicit": true,
      "spotifyId": "3DmNbJqH4SOXmRRh6w4aE0",
      "appleId": 1000615651682,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3DmNbJqH4SOXmRRh6w4aE0",
        "apple": "https://podcasts.apple.com/podcast/002-from-the-children-of-god-to-the/id1620395336?i=1000615651682"
      }
    },
    {
      "id": "77f35841-5e97-4263-9fc3-d131130652ee",
      "title": "Shiny Happy People (My Thoughts) - Patreon Bonus Preview",
      "description": "Access this episode on Patreon HERE for only $3 a month! https://www.patreon.com/4ndrewpledgerIn this exclusive bonus episode, I share my thoughts on the documentary “Shiny Happy People: Duggar Family Secrets.” DEFINITELY SPOILERS - The docu-series explores the truth beneath the surface of reality TV\u0027s mega-family, The Duggars. The IBLP by Bill Gothard is exposed for creating abusive environments and perpetuating abuse. Bill Gothard himself is also exposed for the abuse that he committed. Follow me on Social Media Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-06-03T00:00:00",
      "duration": "00:10:47.1310000",
      "explicit": true,
      "spotifyId": "7Js0hLVOflmRVdS3e8kni7",
      "appleId": 1000615537312,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Js0hLVOflmRVdS3e8kni7",
        "apple": "https://podcasts.apple.com/podcast/shiny-happy-people-my-thoughts-patreon-bonus-preview/id1620395336?i=1000615537312"
      }
    },
    {
      "id": "c7f78830-4873-40f1-966e-7a69c8c9e341",
      "title": "Growing Up with the Duggars - Patreon Bonus Preview - Sydney Davis Jr. Jr.",
      "description": "Access the full episode on Patreon HEREAlso here: https://www.patreon.com/4ndrewpledgerSydney Davis Jr. Jr. has been performing standup comedy and storytelling for 15 years. She is the host of the podcast \u0022Growing Up Fundie,\u0022 as well as a faculty member of The Second City Training Center, and Third Coast Comedy Club. Her comedy special \u0022TRASH\u0022 is currently available on Amazon Prime. She lives in Nashville. Sydney comes back on the show to talk about her experiences of growing up with the Duggar family.Listen to Growing Up Fundie on Spotify, Apple Podcasts, or YouTubeSupport her podcast on PatreonMy Episode on Her Podcast: https://youtu.be/boEdq7QhlaAConnect with Sydney Davis Jr. Jr. Instagram, Facebook, and TwitterConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-05-29T00:00:00",
      "duration": "00:07:40.5120000",
      "explicit": true,
      "spotifyId": "6VblErdvI61je4XVqmzjN3",
      "appleId": 1000614820341,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6VblErdvI61je4XVqmzjN3",
        "apple": "https://podcasts.apple.com/podcast/growing-up-with-the-duggars-patreon-bonus-preview/id1620395336?i=1000614820341"
      }
    },
    {
      "id": "989681ae-7fef-4b0d-b847-d5e83424fb7f",
      "title": "001 - Growing Up Fundie - Sydney Davis Jr. Jr. - Crossover Episode",
      "description": "Sydney Davis Jr. Jr. has been performing standup comedy and storytelling for 15 years. She is the host of the podcast \u0022Growing Up Fundie,\u0022 as well as a faculty member of The Second City Training Center, and Third Coast Comedy Club. Her comedy special \u0022TRASH\u0022 is currently available on Amazon Prime. She lives in Nashville.Listen to Growing Up Fundie on Spotify, Apple Podcasts, or YouTubeSupport her podcast on PatreonMy Episode on Her Podcast: https://youtu.be/boEdq7QhlaAConnect with Sydney Davis Jr. Jr. Instagram, Facebook, and TwitterConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-05-29T00:00:00",
      "duration": "01:11:18.1510000",
      "explicit": true,
      "spotifyId": "4g9awtFmdWHteLn8lz5J87",
      "appleId": 1000614820309,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4g9awtFmdWHteLn8lz5J87",
        "apple": "https://podcasts.apple.com/podcast/001-growing-up-fundie-sydney-davis-jr-jr-crossover-episode/id1620395336?i=1000614820309"
      }
    },
    {
      "id": "3784548c-2e94-4ea6-9e24-f7eccbb38074",
      "title": "Asleep to My Own Magic - Nicole Zell - ARCHIVE",
      "description": "Singer-Songwriter Nicole Zell has finally found her voice on debut album, Asleep To My Own Magic, undoubtedly her most mature, enlightened work yet. After achieving minor success throughout her twenties such as touring nationally with American Wolves, fronting THRILLCHASER, co-billing with acts such as KT Tunstall and Vanessa Carlton, and being featured on numerous press outlets such as Billboard, Fuse TV, and TODAY with Hoda and Jenna, Nicole took a step back to \u0022evaluate my position around the age of 27\u0022 as she sings in \u00227 Years\u0022 - a song penned as an apology for not believing in her younger self. For an artist who was timid to release solo music for years, Nicole holds nothing back on this album. In songs like \u0022Cycle\u0022, Zell dares to confront generational cycles, childhood abuse, her religious upbringing, and even god himself. As the story reaches an end, it becomes apparent that Zell has tapped into the ability to turn darkness into light, struggle into success, trauma into triumph, and mayhem into magic. In \u0022Magic\u0022, the closing song on the album, Nicole can be heard joyfully singing a healing affirmation alongside a celestial choir, \u0022I am safe, I am loved, I am healing, I am light . . . because I am the magic.\u0022Listen to Nicole Zell\u0027s Music on Spotify, Apple Music, YouTube, or BandCampFollow Nicole on Instagram, and check out her LinktreeConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-05-22T00:00:00",
      "duration": "00:54:49.3910000",
      "explicit": true,
      "spotifyId": "42muA0SEUc6xGX59WK6cfc",
      "appleId": 1000613933002,
      "urls": {
        "spotify": "https://open.spotify.com/episode/42muA0SEUc6xGX59WK6cfc",
        "apple": "https://podcasts.apple.com/podcast/asleep-to-my-own-magic-nicole-zell-archive/id1620395336?i=1000613933002"
      }
    },
    {
      "id": "c1b95fff-5a97-4db1-ac06-1b4a561b06ec",
      "title": "Finding Meaning in Judaism - Kati Tovah - ARCHIVE",
      "description": "Kati Tovah comes on the show to share her experience of escaping a cultic environment and finding meaning in practicing Judaism.Connect with Katie Tovah LinktreeYouTubeInstagram FacebookConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-05-15T00:00:00",
      "duration": "00:51:03.4840000",
      "explicit": true,
      "spotifyId": "3Z5zXnY5SLrJNdWyq8bZfq",
      "appleId": 1000613014520,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Z5zXnY5SLrJNdWyq8bZfq",
        "apple": "https://podcasts.apple.com/podcast/finding-meaning-in-judaism-kati-tovah-archive/id1620395336?i=1000613014520"
      }
    },
    {
      "id": "62134a7d-f691-436d-9f64-89d0a0e24735",
      "title": "Conspiracy Theories and Christianity - Cynane - ARCHIVE",
      "description": "Cynane, a nuclear engineer in SC, escaped a special brand of Floridian white Christian nationalism. Her childhood normalized conspiracy theories, but 2020, with COVID and Q4n0n, finally made her realize something was deeply wrong. Now Cynane is writing a book, “Taking Off the Tinfoil Hat,” to process the deconstruction of her fundamentalist evangelicalism and propagandistic patriotism. From the IBLP cult to Jewish space lasers, she pulled the thread and cracked her faith.Connect with CynaneInstagram WebsiteConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-05-08T00:00:00",
      "duration": "01:01:43.7710000",
      "explicit": true,
      "spotifyId": "2RWZG8JV5ojKkXAZvg47LN",
      "appleId": 1000612122429,
      "subjects": [
        "Institute In Basic Life Principles",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2RWZG8JV5ojKkXAZvg47LN",
        "apple": "https://podcasts.apple.com/podcast/conspiracy-theories-and-christianity-cynane-archive/id1620395336?i=1000612122429"
      }
    },
    {
      "id": "2552f4e2-cf27-4b01-a76a-e7e3dc139a3b",
      "title": "Not Allowed to Think for Yourself - Keven Gilbert - ARCHIVE",
      "description": "Keven Gilbert was born in Washington, he is the son of two Indian Conservative parents. He is currently a college student and making money on the side. He shares his story of growing up in a strict Christian household.Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-05-01T00:00:00",
      "duration": "00:34:01.4430000",
      "explicit": true,
      "spotifyId": "0SFdAqUjcCcJZQRs2pHrhX",
      "appleId": 1000611261598,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0SFdAqUjcCcJZQRs2pHrhX",
        "apple": "https://podcasts.apple.com/podcast/not-allowed-to-think-for-yourself-keven-gilbert-archive/id1620395336?i=1000611261598"
      }
    },
    {
      "id": "ac03ee38-b72c-48b0-9c03-1cda3a62d110",
      "title": "Roles in a Religiously Addicted Family - Kit Morgan LMSW - ARCHIVE",
      "description": "Kit Morgan is a licensed social worker and therapist based in Upstate New York. Kit focuses their work with trauma survivors and those in the LGBTQIA\u002B community. Kit is a published author in academic journals regarding harm reduction methods for addictions treatment and a book on Amazon for those recovering from the trauma of living with a severe food allergy.Connect with Kit MorganInstagramConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-04-17T00:00:00",
      "duration": "01:03:18.0730000",
      "explicit": false,
      "spotifyId": "4LdJF5YiHjPD2mLlIPahMR",
      "appleId": 1000609231130,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LdJF5YiHjPD2mLlIPahMR",
        "apple": "https://podcasts.apple.com/podcast/roles-in-a-religiously-addicted-family-kit-morgan/id1620395336?i=1000609231130"
      }
    },
    {
      "id": "399c0344-21f7-49b3-96dd-6caa4784da9d",
      "title": "For My Mother - Ellis Arlo - ARCHIVE",
      "description": "Ellis is a young adult who started deconstructing within the past few years and has since come out as nonbinary and queer. They still live in their hometown and work their dream library assistant job. They participate in community theater in their free time, as the theater in their town is a queer safe space. They love movies, and books, and expressing themselves creatively through content creation on YouTube and Twitch.Connect with Ellis ArloLinktreeConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-04-10T00:00:00",
      "duration": "00:47:13.0310000",
      "explicit": true,
      "spotifyId": "1IvDznPYgDgyNsS0c45zYJ",
      "appleId": 1000608128934,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IvDznPYgDgyNsS0c45zYJ",
        "apple": "https://podcasts.apple.com/podcast/for-my-mother-ellis-arlo-archive/id1620395336?i=1000608128934"
      }
    },
    {
      "id": "c0734270-fce4-45c9-91db-72e0e8141cd7",
      "title": "The Recipe for an Abusive Relationship - Sarah Van Etten Leupold - ARCHIVE",
      "description": "Sarah Van Etten Leupold was raised in a conservative Evangelical non-denominational church. When she started to explore her beliefs she was spiritually abused and rejected from her church. As a result she has received a complex PTSD diagnosis. She has struggled with gender dysphoria and identifies as a queer woman. The spiritual abuse led to an abusive marriage and a divorce and years later her faith fell apart due to the church\u0027s response to her fiance\u0027s death. Today Sarah spends a lot of her free time writing about religious trauma as a way to support other survivors.Connect with SarahHer BlogConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-04-03T00:00:00",
      "duration": "01:02:09.5800000",
      "explicit": true,
      "spotifyId": "74gooTIepKfwNqNaIk6LFW",
      "appleId": 1000607054909,
      "subjects": [
        "Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/74gooTIepKfwNqNaIk6LFW",
        "apple": "https://podcasts.apple.com/podcast/the-recipe-for-an-abusive-relationship-sarah-van/id1620395336?i=1000607054909"
      }
    },
    {
      "id": "81887b8d-0b76-450a-bacc-3587dcfc493c",
      "title": "White Girl Learning - Marla Taviano - ARCHIVE",
      "description": "Marla Taviano is into books, love, justice, globes, anti-racism, blue, gray, rainbows, and poems. She reads and writes for a living (especially @whitegirllearning), wears her heart on her t-shirts, and is on a mission/quest/journey to live wholefarted (not a typo). She’s the author of unbelieve: poems on the journey to becoming a heretic. Marla lives in South Carolina with her four freaking awesome kids. Find out more at marlataviano.com.Connect with Marlo Taviano LinktreeWebsiteJaded - BookUnbelieve - BookConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-03-27T00:00:00",
      "duration": "01:05:19.7250000",
      "explicit": true,
      "spotifyId": "1ciBvdVncuxXlHelCd6lEe",
      "appleId": 1000606017845,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ciBvdVncuxXlHelCd6lEe",
        "apple": "https://podcasts.apple.com/podcast/white-girl-learning-marla-taviano-archive/id1620395336?i=1000606017845"
      }
    },
    {
      "id": "6307dd8f-2adc-40d5-b41a-c3653951f666",
      "title": "Consciousness and Trauma - Blaise Kennedy - ARCHIVE",
      "description": "About Blaise KennedyEverything exists within my consciousness. My body sits at the very centre of this reality. I live within my body, and my body lives within my consciousness. The purpose of my life is to bring coherence to the inner and outer lives of all beings, so that they may know themselves as the source of their consciousness. Blaise\u0027s work is the result of his personal transformation, which began in 2010 when he checked into a drug rehabilitation centre. At 24 years old, and after many years of avoidance, struggle, and difficulty, Blaise was finally ready to face reality. After 5 months of treatment Blaise saw tremendous benefits in every area of his life and experience. He left the treatment centre with one question. “How far and how deep can I take this?” How much transformation is possible? Every moment since then has been the fulfillment, the living answer to his question. Today Blaise shares the most valuable and essential elements of awakening and healing, so that you too may know how far and how deep your life can go.Connect with Blaise KennedyYouTubeLinktree Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-03-20T00:00:00",
      "duration": "01:02:04.0940000",
      "explicit": true,
      "spotifyId": "0RinmfZhAdYlaohc2iqUi9",
      "appleId": 1000604909440,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0RinmfZhAdYlaohc2iqUi9",
        "apple": "https://podcasts.apple.com/podcast/consciousness-and-trauma-blaise-kennedy-archive/id1620395336?i=1000604909440"
      }
    },
    {
      "id": "c224f209-a964-462a-954f-7a627015d60f",
      "title": "Healing Through Humor - Shannon Payton (Shanny Pants) - ARCHIVE",
      "description": "Shannon Payton, known as Shanny Pants by many, is a content creator and podcaster living in Rocklin, California. Her podcast, \u0022The Shanny Pants Show\u0022 is currently in its third season. In her interview-style podcast, Shannon shares her struggles of growing up in a cult, battles through years of infertility that ended in a hysterectomy, and finally her journey to parenthood through foster care and adoption. Shannon has been a guest on The Kelly Clarkson show and has appeared on local TV show GoodDay Sacramento multiple times. She enjoys sharing the struggles of life in a humorous way as part of her self-prescribed therapy and through this, has connected with her fans.Connect with Shannon PaytonInstagramTikTokYouTubeWebsitePodcastConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-03-10T00:00:00",
      "duration": "00:55:47.9570000",
      "explicit": true,
      "spotifyId": "4MPm8jGgV7OyEWEthu70N4",
      "appleId": 1000603541769,
      "subjects": [
        "Christian Fundamentalist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4MPm8jGgV7OyEWEthu70N4",
        "apple": "https://podcasts.apple.com/podcast/healing-through-humor-shannon-payton-shanny-pants-archive/id1620395336?i=1000603541769"
      }
    },
    {
      "id": "4aa1f16b-83cf-4473-aea8-6fa29eccef80",
      "title": "Stay-at-Home Daughter - Cait West - ARCHIVE",
      "description": "Cait West is a writer and editor in Grand Rapids, Michigan. Her work has been published in Religion Dispatches, Fourth Genre, and Hawai’i Pacific Review, and she writes about her journey out of the stay-at-home-daughter movement at caitwest.com. She currently serves on the editorial board of Tears of Eden, a nonprofit providing resources for survivors of spiritual abuse.Connect with Cait WestInstagramTikTokTwitterLinktreeWebsiteConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-02-27T00:00:00",
      "duration": "00:40:09.1950000",
      "explicit": true,
      "spotifyId": "69sikIaSMDsLMPpW8hdVqx",
      "appleId": 1000601763914,
      "subjects": [
        "Quiverfull",
        "Christian Fundamentalist",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/69sikIaSMDsLMPpW8hdVqx",
        "apple": "https://podcasts.apple.com/podcast/stay-at-home-daughter-cait-west-archive/id1620395336?i=1000601763914"
      }
    },
    {
      "id": "23097218-d570-4c5b-bc74-ab044d0d2906",
      "title": "#MeTooYoungLife - Erin Watts - ARCHIVE",
      "description": "Erin Watts grew up in an evangelical Christian home, went to Bible college, worked in full-time ministry, and dedicated her whole life to the faith until she turned 30. She survived #MeTooYoungLife and she appears on the show to share her story. Connect with Erin WattsInstagramMeToo Young Life - LinktreeMeToo Young Life - IGConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-02-20T00:00:00",
      "duration": "00:53:44.3460000",
      "explicit": true,
      "spotifyId": "3QY8sTUINUpgXexnBh3pWJ",
      "appleId": 1000600493733,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QY8sTUINUpgXexnBh3pWJ",
        "apple": "https://podcasts.apple.com/podcast/metooyounglife-erin-watts-archive/id1620395336?i=1000600493733"
      }
    },
    {
      "id": "b11f3e85-eb45-4cd6-8b87-b07a8b16bd75",
      "title": "Toxicity in Religion - Mary Burkhart - ARCHIVE",
      "description": "Mary Burkhart is a Religious Trauma Life Coach. She deeply desires to help people, who are on their journeys away from religion, or who find themselves questioning where they stand with regard to religion and doubt, to find or regain their identity, joy, and self-worth quickly after they have decided to leave. She had to go through the process on her own and it almost cost her her life. Connect with Mary BurkhartLinktree Website InstagramConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-02-13T00:00:00",
      "duration": "00:50:23.5420000",
      "explicit": false,
      "spotifyId": "3WvC5KvClbwo25w40oYpAn",
      "appleId": 1000599269455,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3WvC5KvClbwo25w40oYpAn",
        "apple": "https://podcasts.apple.com/podcast/toxicity-in-religion-mary-burkhart-archive/id1620395336?i=1000599269455"
      }
    },
    {
      "id": "5d7094ea-b2ad-45c3-9e1a-0278124f5fed",
      "title": "Intersexion - Cynthia Vacca Davis - ARCHIVE",
      "description": "Cynthia Vacca Davis is a semi-salty adjunct English professor with a trunk full of papers and snack wrappers. She holds an MFA in creative nonfiction, leads writing workshops, and has written hundreds of feature stories, and two independently published YA novels. She\u0027s the author of Intersexion: a Story of Faith, Identity, and Authenticity from Lake Drive BooksBook Description: \u0022Sometimes in life we reach an intersection where we must pick either safety or stepping into life as our true selves. It’s a moment of courage, vision, and finding our voice.Cynthia, an adjunct professor with a trunk full of ungraded papers and snack wrappers, has been an LGBTQIA\u002B ally for years—in convenient ways. She enjoys the company of her queer friends—but her support isn’t risky; it hasn’t cost her anything. Until she meets Danny. The youngest child in a conservative religious family, Danny played the role of dutiful daughter—Dani, with an “i”—which was safer than jeopardizing faith and family. Seemingly born female, yet desperate to be seen as the boy and then man he is, Danny kept playing along, until his life and health depended on one thing: the truth.Told in both Danny’s and Cynthia’s voices, Intersexion is a moving, hopeful exploration of the cost of being known—as an intersex minority, ally, or asker of difficult questions—and what it means to come into one’s own. It’s a book for anyone craving a more authentic life. It’s a story about the intersections we find ourselves in by no choice of our own, and the life-giving choices we can make.Named on the Top 34 LGTBQ Christian Books of 2022 by Q Spirit\u0022Connect with Cynthia Vacca DavisBookLinktreeInstagramConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-02-10T00:00:00",
      "duration": "00:34:08.4960000",
      "explicit": false,
      "spotifyId": "2lJuO8QROpW7przm9SKCnL",
      "appleId": 1000598979573,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2lJuO8QROpW7przm9SKCnL",
        "apple": "https://podcasts.apple.com/podcast/intersexion-cynthia-vacca-davis-archive/id1620395336?i=1000598979573"
      }
    },
    {
      "id": "a08863b1-13f3-493a-af7a-37266e100983",
      "title": "Ministry, Manipulation and MLMs! Oh My! - Hollyanne Simon - ARCHIVE",
      "description": "Hollyanne Simon did not grow up in the Church but made it her life beginning at age 13. She accepted Jesus in a moment of \u0022worship\u0022 at a Summer Camp, and when coming back home, she dove head first into all things Church. She began volunteering in the Children\u0027s Ministry, on the worship team, and in the office. By the age of 16, she was working in the Church as a Children\u0027s ministry intern, and worship intern, which later turned into full-time ministry positions. She worked on Church staff for a decade, six of those years being pastoral. Hollyanne comes on the podcast to share her deconstruction and healing journey.Connect with Hollyanne SimonLinktreeInstagramConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-02-06T00:00:00",
      "duration": "01:10:09.8150000",
      "explicit": true,
      "spotifyId": "1Li2sD0gqeZj0zAdeidaFi",
      "appleId": 1000598176135,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Li2sD0gqeZj0zAdeidaFi",
        "apple": "https://podcasts.apple.com/podcast/ministry-manipulation-and-mlms-oh-my-hollyanne-simon/id1620395336?i=1000598176135"
      }
    },
    {
      "id": "f3bacae9-d03c-48fd-b584-0d0d43b45381",
      "title": "Apostacie - ARCHIVE",
      "description": "Apostacie is a co-host for the Skeptic Haven show “Secular Soapbox” every Wednesday on YouTube at 5pm PST. Apostacie comes on the show to tell her story of publicly deconverting from Christianity and the aftermath.Connect with Apostacie Skeptic HavenInstagramLinktreeConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-01-30T00:00:00",
      "duration": "01:26:56.4700000",
      "explicit": false,
      "spotifyId": "1VU9lLEzBeK6bQgLyKqtHQ",
      "appleId": 1000597176870,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1VU9lLEzBeK6bQgLyKqtHQ",
        "apple": "https://podcasts.apple.com/podcast/apostacie-archive/id1620395336?i=1000597176870"
      }
    },
    {
      "id": "c0338b86-e450-4dff-a565-ac0a9a4a09c2",
      "title": "Christianity \u0026 Atheism - Jakub Ferencik - ARCHIVE",
      "description": "Jakub Ferencik is Slovakian Canadian who lived in England, Barcelona, and Warsaw. For much of his life, he was a firm believer in Christianity but I left it after his time in Oxford. After that, he moved on to study political science and philosophy at UBC. Presently he is working as a research assistant and doing his master\u0027s degree in the history of populism in the Visegrad states (Czechia, Poland, Slovakia, and Hungary).Connect with Jakub FerencikInstagramLinktreeHis BooksUp in The Air: Christianity, Atheism, and the Global Problems of the 21st CenturyBeyond Reason: Why We Fail at Understanding Each OtherConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-01-23T00:00:00",
      "duration": "00:47:25.9100000",
      "explicit": true,
      "spotifyId": "3nzudiQPqfGKSk7DQtgLaf",
      "appleId": 1000596000847,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3nzudiQPqfGKSk7DQtgLaf",
        "apple": "https://podcasts.apple.com/podcast/christianity-atheism-jakub-ferencik-archive/id1620395336?i=1000596000847"
      }
    },
    {
      "id": "727fcacf-a336-4e59-a584-c36875dcf445",
      "title": "Psychedelics and Religious Trauma - Andrew Jasko - ARCHIVE",
      "description": "Andrew Jasko, MDiv, MA in Counseling Psychology, Founder of Life After Dogma. As a former Princeton Seminary-educated minister, Andrew had to leave his religious faith and community because of the severe psychological trauma he experienced. After spending years healing his trauma and helping hundreds of people transform their lives, he is now considered an expert in healing religious trauma. Andrew’s clients hire him to heal and find a healthy, authentic spiritual or secular connection that suits them.Connect with Andrew Jasko WebsiteInstagramFB GroupConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-01-16T00:00:00",
      "duration": "00:55:02.0080000",
      "explicit": true,
      "spotifyId": "1lm6ZAYMs7FLo0sfAotP5u",
      "appleId": 1000594568844,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1lm6ZAYMs7FLo0sfAotP5u",
        "apple": "https://podcasts.apple.com/podcast/psychedelics-and-religious-trauma-andrew-jasko-archive/id1620395336?i=1000594568844"
      }
    },
    {
      "id": "cea40128-0865-4262-a43b-46d6ff080277",
      "title": "Church Sanctioned Abuse - Tia Levings - ARCHIVE",
      "description": "Tia Levings is a writer, creator, and content specialist. Her work explores the female narrative in patriarchal spaces. She has a memoir releasing in 2024 through St. Martin\u0027s Press.Her videos on social media have millions of views. Through the lens of her personal experience, she connects entertainment, news headlines, and current events to fundamentalist influences and strategy. She writes about religious trauma and Christian fundamentalism to educate, validate, and empower those who feel smashed by the patriarchy. She does it to create something beautiful from pain.And, because when she went through the hell of church-sanctioned violence, she felt alone. She wants you to know you aren’t alone. And even if the church condones and shelters it, abuse is never okay. Connect with Tia Levings LinktreeWebsiteIGTikTokHer ColumnHer Fundie CheatsheetConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-01-09T00:00:00",
      "duration": "00:57:36.4440000",
      "explicit": true,
      "spotifyId": "4XOLwHBcHafiH2hsmGW9S5",
      "appleId": 1000593076575,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4XOLwHBcHafiH2hsmGW9S5",
        "apple": "https://podcasts.apple.com/podcast/church-sanctioned-abuse-tia-levings-archive/id1620395336?i=1000593076575"
      }
    },
    {
      "id": "239e206b-5d86-479f-a3a4-9351f5836635",
      "title": "Give Me Liberty! - Dr. Wilson - ARCHIVE",
      "description": "Dr. Wilson has finished his interdisciplinary Ph.D. in Comparative Studies at Florida Atlantic University. His academic work has appeared in Canadian Jewish Studies, Flannery O’Connor Review, and in edited collections published by The MLA, SUNY Press, and DIO Press. He has a forthcoming article in The Journal of Jewish Identities and a forthcoming book chapter about Liberty University’s gay conversion therapy program. His work has appeared in The Advocate, Queerty, LGBTQ Nation, and Religion Dispatches. He is currently a Sessional Lecturer at the University of Toronto.Connect with WilsonAcademia profile: https://ucalgary.academia.edu/LucasWilsonIG: https://instagram.com/lukeslamdunkwilson?igshid=YmMyMTA2M2Y=Twitter: https://twitter.com/wilson_fw?s=21\u0026t=nGMNBNzVWH-K0EhN0p5n6QConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-12-12T00:00:00",
      "duration": "01:00:15.7380000",
      "explicit": true,
      "spotifyId": "1eF81uTaouDIv0FFmw6sRV",
      "appleId": 1000589806101,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1eF81uTaouDIv0FFmw6sRV",
        "apple": "https://podcasts.apple.com/podcast/give-me-liberty-dr-wilson-archive/id1620395336?i=1000589806101"
      }
    },
    {
      "id": "62ef0d95-143c-43b7-82a4-8db69aae0f91",
      "title": "Handing the Shame Back - Gloria Masters - ARCHIVE",
      "description": "Gloria Masters is a Survivor, Author and Advocate of all things CSA and speaks from 16 years of lived experience. She has managed to turn the final corner of healing into giving back, through highlighting the issue of child sexual abuse to help other survivors. She has written two books, the first her memoir On Angels Wings - My flight from trauma to grace. The second is Flightpath to Healing - A Guide for Child Sexual Abuse (CSA) Survivors. The intent with this one is to support other survivors in their healing and recovery. She believes there is a way through, and she wants to help others by sharing what worked for her.Connect with Gloria MastersHer Show: https://youtube.com/@handingtheshamebackHer Books: https://gloriamasters.com/paperback/Her Website: https://gloriamasters.comIG: https://instagram.com/handingtheshameback?igshid=YmMyMTA2M2Y=FB: https://www.facebook.com/Gloria.Masters.Com16?mibextid=LQQJ4dTwitter: https://twitter.com/handinshameback?s=21\u0026t=O7POc3oVumKME9AEstapDwConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-12-08T00:00:00",
      "duration": "00:42:45.2760000",
      "explicit": false,
      "spotifyId": "3KoGj85wzqPNbFujScNeDP",
      "appleId": 1000589340608,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3KoGj85wzqPNbFujScNeDP",
        "apple": "https://podcasts.apple.com/podcast/handing-the-shame-back-gloria-masters-archive/id1620395336?i=1000589340608"
      }
    },
    {
      "id": "d7d58f38-754c-406a-baab-f8434f747edc",
      "title": "Release the Women - Elizabeth Endara - ARCHIVE",
      "description": "Elizabeth Endara is a writer living in Chicago with her husband and their dog and two cats. She has a Masters in International Educational Development from Columbia University and is also trained as a trauma-informed yoga teacher, full-spectrum doula, and sexual assault intervention advocate. She works full-time as a nonprofit writer and runs the page @releasethewomen where she posts about religious trauma, reproductive justice, and recovering from purity culture.Connect with Elizabeth EndaraLinktree: https://linktr.ee/releasethewomenIG: https://instagram.com/releasethewomen?igshid=YmMyMTA2M2Y=Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-12-05T00:00:00",
      "duration": "00:48:35.1860000",
      "explicit": false,
      "spotifyId": "55SopyfV5Z4d4jBnhfSXTQ",
      "appleId": 1000588807534,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/55SopyfV5Z4d4jBnhfSXTQ",
        "apple": "https://podcasts.apple.com/podcast/release-the-women-elizabeth-endara-archive/id1620395336?i=1000588807534"
      }
    },
    {
      "id": "ccb2f763-1aeb-4ede-9738-f3eed49f48cd",
      "title": "Religion Was My Crutch - Morgan Chantelle - ARCHIVE",
      "description": "Morgan Chantelle is a mom, trauma-informed life coach, breathwork practioner in Northern California. She works with many people healing from spiritual abuse and is also an exvangelical and purity culture survivor. When not working you can usually find Morgan at a coffee shop or outdoors.Connect with Morgan Chantellehttps://linktr.ee/morganchantellehttps://instagram.com/morganchantelle?igshid=YmMyMTA2M2Y=Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-28T00:00:00",
      "duration": "00:51:26.7330000",
      "explicit": true,
      "spotifyId": "7bAsDtBgvmNt3uwOctXOQW",
      "appleId": 1000587655102,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7bAsDtBgvmNt3uwOctXOQW",
        "apple": "https://podcasts.apple.com/podcast/religion-was-my-crutch-morgan-chantelle-archive/id1620395336?i=1000587655102"
      }
    },
    {
      "id": "b85724c1-1a25-4ee0-946f-19f302c0594a",
      "title": "Legal Aspects of Church Abuse - Jane Ridley - ARCHIVE",
      "description": "Jane Ridley is a lawyer focusing on getting justice for religious abuse victims.(LLM International Human Rights Law and Practice.) Previously worked for Sound Choices Coalition based in Utah which is now closed. She comes on the show to discuss how the legal system fails survivors of religious abuse and what needs to be changed.Fight for Children\u0027s Rights: Congress Needs to Pass Children\u0027s Rights ActConnect with Jane RidleyIG: https://instagram.com/j_xo298?igshid=YmMyMTA2M2Y=Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-14T00:00:00",
      "duration": "00:30:44.5840000",
      "explicit": true,
      "spotifyId": "31TpBbzuc9C5CW4xGr9ClZ",
      "appleId": 1000586059104,
      "urls": {
        "spotify": "https://open.spotify.com/episode/31TpBbzuc9C5CW4xGr9ClZ",
        "apple": "https://podcasts.apple.com/podcast/legal-aspects-of-church-abuse-jane-ridley-archive/id1620395336?i=1000586059104"
      }
    },
    {
      "id": "7b1e5999-4db4-45fe-8f4f-7d3e021cf0a8",
      "title": "Divorcing Religion - Janice Selbie - ARCHIVE",
      "description": "Janice Selbie was raised evangelical and turned to closed Mennonite (Holdeman/Church of God in Christ Mennonite) during her husband\u0027s bible college years. She homeschooled her children, wore a head covering, and was very conservative. Her marriage was difficult and got harder as the years went on. Eventually, they had a series of tragedies strike that she could not explain if there was indeed a loving or omniscient God. This plunged her into a time of existential crisis. She divorced her husband and religion, went back to school to become a registered professional counselor, and connected with Dr. Marlene Winell who coined the term Religious Trauma (Dr. Winell is now her friend and mentor). Then she founded the Conference on Religious Trauma (CORT) and this October the Shameless Sexuality: Life After Purity Culture online conference.Fight for Children\u0027s Rights: Congress Needs to Pass Children\u0027s Rights ActConnect with Janice SelbieHer Podcast: https://www.divorcing-religion.com/religious-trauma-podcastWebsite: https://www.divorcing-religion.comIG: https://instagram.com/wisecounsellor?igshid=YmMyMTA2M2Y=TikTok: https://www.tiktok.com/@janiceselbie?_t=8UZKbpvXcHG\u0026_r=1Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-07T00:00:00",
      "duration": "01:22:20.2250000",
      "explicit": true,
      "spotifyId": "2DgRZBrDetvy6T4SZE6SCg",
      "appleId": 1000585270815,
      "subjects": [
        "Mennonite",
        "Evangelicalism",
        "The Church Of God In Christ",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2DgRZBrDetvy6T4SZE6SCg",
        "apple": "https://podcasts.apple.com/podcast/divorcing-religion-janice-selbie-archive/id1620395336?i=1000585270815"
      }
    },
    {
      "id": "9e474a1e-7bc4-46c7-85a0-c5db3048c15d",
      "title": "As Familiar As Family - Nicki Pappas - ARCHIVE",
      "description": "Nicki Pappas comes back on the show to talk about her memoir, As Familiar As Family. I experienced abuse as love from a young age. In As Familiar as Family, I explore and examine the ways in which I was groomed for unhealthy relationships and toxic religion.Book Description by Nicki Pappas I experienced abuse as love from a young age. In As Familiar as Family, I explore and examine the ways in which I was groomed for unhealthy relationships and toxic religion. This book chronicles my journey to find my voice — and a way out — which began once I understood how the spiritual abuse, power dynamics, narcissism, and emotional detachment in the church were as familiar as family. By sharing my story, I hope to empower others to leave anything toxic in their own lives.Buy Book HereCONNECT WITH NICKIInstagram (https://instagram.com/broadeningthenarrative?igshid=YmMyMTA2M2Y=)Blog (http://broadeningthenarrative.blogspot.com/2018/01/why-should-we-broaden-narrative.html?m=1)Tik Tok (https://vm.tiktok.com/ZTdVcBhBF/)Linktree (https://linktr.ee/broadeningthenarrative)Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-03T00:00:00",
      "duration": "01:10:08.8220000",
      "explicit": true,
      "spotifyId": "4mAvk9XnbKuoFG4CRqO1If",
      "appleId": 1000584887905,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mAvk9XnbKuoFG4CRqO1If",
        "apple": "https://podcasts.apple.com/podcast/as-familiar-as-family-nicki-pappas-archive/id1620395336?i=1000584887905"
      }
    },
    {
      "id": "49f5c21d-0356-4636-9e3f-f8426cc18140",
      "title": "My Mom was My Trafficker - Isami Daehn - ARCHIVE",
      "description": "TRIGGER WARNING - This episode mentions trauma, sexual abuse, and other hard topics.Isami Daehn was born in Japan and eventually moved to the US. She was raised by fake missionaries who stole money from churches under the guise of “missionary” work. Isami grew up in the IFB cult and regularly experienced verbal, physical, sexual, and spiritual abuse. For years, she was trafficked by her mother. Isami recounts how her mother would bring her to a piano teacher who would sexually assault her every week. Isami talks about the work she’s doing now due to her childhood. She’s a speaker who brings awareness to trafficking, sexual abuse, and how to see the warning signs. She speaks at churches, schools, and other venues. Book Here: https://www.isamidaehn.com/Connect with Isami DaehnIG: https://instagram.com/isami_daehn?igshid=YmMyMTA2M2Y=TikTok: https://www.tiktok.com/@isami_daehn?_t=8UZJOpLbENP\u0026_r=1Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-24T00:00:00",
      "duration": "01:54:16.7240000",
      "explicit": true,
      "spotifyId": "30CvMidTWKLAsIxpMyJMXU",
      "appleId": 1000583643941,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/30CvMidTWKLAsIxpMyJMXU",
        "apple": "https://podcasts.apple.com/podcast/my-mom-was-my-trafficker-isami-daehn-archive/id1620395336?i=1000583643941"
      }
    },
    {
      "id": "e0e4321c-8eb8-429a-94b2-09226802bc17",
      "title": "Discussion: Purity Culture - Julia Capizzi - ARCHIVE",
      "description": "This is a DISCUSSION episode where I interview a professional on a specific subject. Julia Capizzi is an engagement journalist looking to serve the informational needs of the deconstruction community. She comes on the show to discuss her mission and the issues of purity culture.Connect with Julia CapizziSIGN UP for her newsletter “Unpure”: https://unpure.substack.com?r=1jgmm7\u0026utm_medium=iosPurity Culture Survey: https://docs.google.com/forms/d/e/1FAIpQLSfPPL2Sp3v4PQ_wkJGwqWqiQ3gEtoSFeXIP8arX2q7cJ7wAfA/viewformIG: https://instagram.com/julia_capizzi?igshid=YmMyMTA2M2Y=Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-17T00:00:00",
      "duration": "00:54:52.4470000",
      "explicit": true,
      "spotifyId": "4uL6QtOYePMPHs2XD1Df5M",
      "appleId": 1000582850803,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4uL6QtOYePMPHs2XD1Df5M",
        "apple": "https://podcasts.apple.com/podcast/discussion-purity-culture-julia-capizzi-archive/id1620395336?i=1000582850803"
      }
    },
    {
      "id": "46fc3004-bdf6-4ff5-bd4b-c1dc67afdb41",
      "title": "Broke the Bread, Spilled the Tea - Mitchell Kesller - ARCHIVE",
      "description": "Mitchell Kesller was born in Minas Gerais, Brazil, and later moved to Boston, MA. Raised Bostonian, he moved to Orlando, FL, fell in love with it, and refused to leave.Mitchell believes in a world where those of faith can find comfort in who they are and continuously contribute their tithes to organizations like the Trevor Project, which support the rights and well-being of the LGBT\u002B community. He recently published his book “Broke the Bread, Spilled the Tea” which digs into the context behind verses used against the LGBTQ\u002B community.BUY BOOK: Amazon.com: Broke the Bread, Spilled the Tea: 9798985785418: Kesller, Mitchell, Ross, Leslie M: BooksConnect with Mitchell InstagramConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-26T00:00:00",
      "duration": "00:35:45.4100000",
      "explicit": true,
      "spotifyId": "2D9O4S4rT4Ldn3mmrrXG7H",
      "appleId": 1000580615664,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2D9O4S4rT4Ldn3mmrrXG7H",
        "apple": "https://podcasts.apple.com/podcast/broke-the-bread-spilled-the-tea-mitchell-kesller-archive/id1620395336?i=1000580615664"
      }
    },
    {
      "id": "e2214812-6e42-4e5f-be28-14f21a30224a",
      "title": "The New Evangelicals - Tim Whitaker - ARCHIVE",
      "description": "Tim Whitaker started “The New Evangelicals” account on social media and has gained a large following. He also hosts a podcast of the same name. The purpose of his social media presence is to help push the Evangelical church forward and re-think how it approaches cultural issues. Tim comes on the podcast to tell his story and discuss the SCOTUS religious agenda.Connect with TimWebsite: https://www.thenewevangelicals.com/Linktree: https://drum.io/thenewevangelicalsPodcast: https://open.spotify.com/show/1czIuPbjXFt50L2fxHmdUe?si=infR7erRQ06-yMm6uMQ3jgSCOTUS Decision on Prayer: https://open.spotify.com/episode/6jxQxW5D3ODF5TUdw1kPIT?si=OZJrkA54T6iKohOHKER38wBooks MentionedJesus and John Wayne:https://kristindumez.com/books/jesus-and-john-wayne/The Color of Compromise: https://www.thriftbooks.com/w/the-color-of-compromise-the-truth-about-the-american-churchs-complicity-in-racism_jemar-tisby/18963528/#isbn=0310113601Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-19T00:00:00",
      "duration": "00:57:48.9300000",
      "explicit": true,
      "spotifyId": "2SgFeoQESp7Sz12TpQdZ0c",
      "appleId": 1000579884154,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2SgFeoQESp7Sz12TpQdZ0c",
        "apple": "https://podcasts.apple.com/podcast/the-new-evangelicals-tim-whitaker-archive/id1620395336?i=1000579884154"
      }
    },
    {
      "id": "92061c8d-205a-4c92-93e2-1fa9f1900b05",
      "title": "Courage 365 - Ashley Easter - ARCHIVE",
      "description": "Ashley Easter is a cult survivor turned Intuitive Master who helps people escape self-doubt and harness their Intuition so they can take control of their destiny by becoming Intuitive AF. She is also the founder of Courage 365, a non-profit for abuse survivors, and a television producer focused on highlighting stories meaning and mission. She is an intuition coach, survivor advocate, television producer, author, and proud dyslexic. She authored the books \u0022The Courage Coach\u0022, \u0022Cults Hidden in Plain Sight\u0022 and is the creator of courses \u0022Intuition Mastery\u0022 and \u0022Intuitive Success Membership\u0022.Connect with Ashley EasterRegister for 30 Days of Courage (FREE): https://www.courage365.org/thirtyWebsite: https://www.ashleyeaster.com/IG: https://www.instagram.com/iamashleyeaster/FB: https://www.facebook.com/ashleymeasterCourage 365: https://www.courage365.org/Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-15T00:00:00",
      "duration": "01:15:46.3510000",
      "explicit": true,
      "spotifyId": "2NTB4FyaoS0kFpiDqpLIFf",
      "appleId": 1000579533714,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NTB4FyaoS0kFpiDqpLIFf",
        "apple": "https://podcasts.apple.com/podcast/courage-365-ashley-easter-archive/id1620395336?i=1000579533714"
      }
    },
    {
      "id": "3fac7cd8-c98c-4632-a76a-4ea6a91fa0af",
      "title": "Church of C*nts - Ashley Robbins - ARCHIVE",
      "description": "Lola (Ashley) Robbins is an exvanglical, cult survivor. She advocates for body positivity, LGBTQIA, and destroying women’s oppression (especially in the church). She began faith deconstruction in 2019 and has been pursuing a life of freedom and joy ever since. Connect with Lola Robbins Podcast: https://open.spotify.com/show/7sKJcAewUJxSksHgOqTyZi?si=g63r9j8nQSygbgkm_OrL4wIG: https://instagram.com/spellbound_shears?igshid=YmMyMTA2M2Y=FB: https://www.facebook.com/profile.php?id=100075353155419Tik Tok: https://www.tiktok.com/@hellotherelola?_t=8UXRfeCesbW\u0026_r=1Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-12T00:00:00",
      "duration": "00:55:13.7110000",
      "explicit": true,
      "spotifyId": "06zEbVtSTf1wEGeCHaFixu",
      "appleId": 1000579147881,
      "urls": {
        "spotify": "https://open.spotify.com/episode/06zEbVtSTf1wEGeCHaFixu",
        "apple": "https://podcasts.apple.com/podcast/church-of-c-nts-ashley-robbins-archive/id1620395336?i=1000579147881"
      }
    },
    {
      "id": "2047c569-3036-4274-9a15-cc39e398f6aa",
      "title": "Why I Became a Cult Expert - Rachel Bernstein LMFT - ARCHIVE",
      "description": "Rachel Bernstein, therapist, and world-renowned cult expert shares her story for the first time. Rachel is the host of the “IndoctriNation” podcast. For 30 years, she has helped former cult members and those who have loved ones in cults and highly manipulative relationships. Rachel has helped people from over 300 cults throughout her career. She provides individual counseling, family counseling, and, when possible, group therapy for former cult members. She also helps families trying to reach out to their loved ones in the cult.She has led workshops and classes at USC in the School of Social Work and the Department of Psychiatry, at California State University at Northridge, and at various colleges and universities in the New York area. She is also a yearly presenter at the International Cultic Studies Association conferences and was a guest lecturer for the Clergy Emergency League and Wisconsin Council of Churches. She has presented at the Pacific Rim Conference for people in Australia, New Zealand, Japan, South Korea, and China who are affected by cults and relationships with narcissists, and, with colleagues, developed the program \u0022Stronger After\u0022, a free 5-session program for initial support and education for people newly out of highly controlling, abusive, and restrictive environments.Connect with Rachel BernsteinHer Podcast: https://open.spotify.com/show/1prXo4iIxUfjYpfX671cUD?si=KOWPMrAsROyysB1vXNu3dwSupport Her Work: https://www.patreon.com/indoctrination?utm_campaign=creatorshare_fanLinktree: https://linktr.ee/indoctrinationIG: https://instagram.com/indoctrinationpodcast?igshid=YmMyMTA2M2Y=Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-08T00:00:00",
      "duration": "01:51:47.7220000",
      "explicit": true,
      "spotifyId": "0dVNicFlHewlYnqV4vHwmw",
      "appleId": 1000578784998,
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dVNicFlHewlYnqV4vHwmw",
        "apple": "https://podcasts.apple.com/podcast/why-i-became-a-cult-expert-rachel-bernstein-lmft-archive/id1620395336?i=1000578784998"
      }
    },
    {
      "id": "70250db3-c6d7-492d-bf68-dfdf87eda2ee",
      "title": "DISCUSSION on Deconstruction - Phil Drysdale - ARCHIVE",
      "description": "Phil Drysdale is a public speaker, podcaster, researcher, and guide specializing in the area of deconstruction. For the last decade, he’s helped people navigate the painful journey away from their faith tradition. He researches the deconstruction community through The Deconstruction Network, runs a regular podcast about Deconstruction, and provides free resources to help people on their journeys.Connect with Phil Drysdale Linktree: https://linktr.ee/phildrysdale IG: https://instagram.com/phildrysdale?igshid=YmMyMTA2M2Y= FB: https://www.facebook.com/PhilDrysdaleMinistries Twitter: https://twitter.com/phildrysdale?s=21\u0026t=cXkzV1gXTHeRvkO3UBMkmgConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-05T00:00:00",
      "duration": "00:56:38.3730000",
      "explicit": true,
      "spotifyId": "4InMoVM7st4eWVkdPdaKWy",
      "appleId": 1000578375083,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4InMoVM7st4eWVkdPdaKWy",
        "apple": "https://podcasts.apple.com/podcast/discussion-on-deconstruction-phil-drysdale-archive/id1620395336?i=1000578375083"
      }
    },
    {
      "id": "f68676f8-067f-41c9-8034-914637cc3f4a",
      "title": "Cult Awareness Month - Janja Lalich - ARCHIVE",
      "description": "Janja Lalich, Ph.D., Professor Emerita of Sociology, is an international authority on cults and coercion. Researcher, author, and educator, she specializes in recruitment, indoctrination, and methods of influence and control. She has been studying the social psychology of controversial groups and abusive relationships for 35 years. Dr. Lalich is the author and/or coauthor of six books, including the classic Take Back Your Life: Recovering from Cults and Abusive Relationships, and Escaping Utopia: Growing Up in a Cult, Getting Out and Starting Over. Her book Bounded Choice: True Believers and Charismatic Cults has been recognized as the first original theoretical contribution to the field of cultic studies in decades. In addition to working with survivors and their families, she leads workshops and educational sessions for government agencies, international intelligence agencies, private companies, educational institutions, nonprofit organizations, and leads online psychoeducational courses for trauma survivors, families, and mental-health professionals. She has also served as an expert witness in civil and criminal legal cases. A frequent keynoter or presenter at domestic and international conferences, her work has been translated into German, Italian, Spanish, Chinese, Japanese, Turkish, Russian, Serbo-Croatian, and Polish, and many other languages.Connect with Janja LalichWebsite: https://janjalalich.com/Books: https://janjalalich.com/blog/category/books/Cult Education: https://janjalalich.com/blog/category/cults-the-basics/Cult Awareness Month Information: https://internationalcultawareness.org/Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-08-17T00:00:00",
      "duration": "01:14:38.2490000",
      "explicit": false,
      "spotifyId": "6QjOFhiKR63Lq8OX67NcKI",
      "appleId": 1000576375519,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6QjOFhiKR63Lq8OX67NcKI",
        "apple": "https://podcasts.apple.com/podcast/cult-awareness-month-janja-lalich-archive/id1620395336?i=1000576375519"
      }
    },
    {
      "id": "3843c66a-20b3-463e-9e40-1e52c5bb863f",
      "title": "PCC Poster Child - Ashleigh Doxtater - ARCHIVE",
      "description": "Ashleigh Doxtater tells her story of growing up in the IFB and attending Pensacola Christian College for six years. She talks about the pressure she felt to conform to a certain standard. She recounts the control PCC had over her life. Connect with Ashleigh Doxtater IG: https://instagram.com/ashedendox?igshid=YmMyMTA2M2Y= FB: https://www.facebook.com/chiqong Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-08-15T00:00:00",
      "duration": "02:02:29.4460000",
      "explicit": false,
      "spotifyId": "4QVCL8prVGmw9kess7NqpS",
      "appleId": 1000576078521,
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4QVCL8prVGmw9kess7NqpS",
        "apple": "https://podcasts.apple.com/podcast/pcc-poster-child-ashleigh-doxtater-archive/id1620395336?i=1000576078521"
      }
    },
    {
      "id": "82ea7839-9e8b-4028-b45c-9c472f9b3131",
      "title": "Naked Pastor - David Hayward - ARCHIVE",
      "description": "David Hayward (aka Naked Pastor) was a pastor for thirty years until deconstructing and leaving Christianity. For over ten years, David has been expressing his criticism and questioning evangelicalism through his cartoons. He comes on the show to talk about his deconstruction journey and where he is now.  Purchase David Hayward’s NEW BOOK “Flip it Like This” which features a collection of his favorite original cartoons.  BUY HERE: https://www.amazon.com/Flip-Like-This-David-Hayward/dp/1506484727/ref=asc_df_1506484727?tag=bingshoppinga-20\u0026linkCode=df0\u0026hvadid=80745511361682\u0026hvnetw=o\u0026hvqmt=e\u0026hvbmt=be\u0026hvdev=c\u0026hvlocint=\u0026hvlocphy=\u0026hvtargid=pla-4584345034125083\u0026psc=1Connect with David Hayward Website: https://nakedpastor.com  IG: https://www.instagram.com/nakedpastor/FB Page: https://www.facebook.com/nakedpastor/  FB Profile: https://www.facebook.com/davehayward  YouTube: https://youtube.com/c/DavidHaywardNakedpastor  TikTok: https://www.tiktok.com/t/ZTR8r3PEC/: Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-08-01T00:00:00",
      "duration": "00:46:01.1950000",
      "explicit": true,
      "spotifyId": "6tfrTZZi75umdElytkIo2l",
      "appleId": 1000574569685,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6tfrTZZi75umdElytkIo2l",
        "apple": "https://podcasts.apple.com/podcast/naked-pastor-david-hayward-archive/id1620395336?i=1000574569685"
      }
    },
    {
      "id": "5f061aa4-c103-4d67-a0fe-21445df84f08",
      "title": "Dangers of Biblical Counseling - Lee Foster - ARCHIVE",
      "description": "Lee Foster talks about attending the notorious Christian college Bob Jones University. She studied Biblical Counseling there for eight years, and renounced the practice soon after graduation. After finding out her Masters in Biblical Counseling was useless she decided to get a Masters in Clinical Mental Health to become a therapist. Lee is now on a mission to spread awareness of the dangers of biblical counseling. Connect with Lee Foster IG: https://instagram.com/lee_foster91?igshid=YmMyMTA2M2Y= FB: https://www.facebook.com/deleah.foster Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-07-25T00:00:00",
      "duration": "00:58:18.8140000",
      "explicit": true,
      "spotifyId": "1QeYVXqZpf8DXME0rVyOs2",
      "appleId": 1000571096127,
      "subjects": [
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1QeYVXqZpf8DXME0rVyOs2",
        "apple": "https://podcasts.apple.com/podcast/dangers-of-biblical-counseling-lee-foster-archive/id1620395336?i=1000571096127"
      }
    },
    {
      "id": "c58832ad-3f8c-423b-a9b7-ae5b4f811bad",
      "title": "I Escaped BJU - Emma Pope - ARCHIVE",
      "description": "Emma Pope attended Bob Jones University for three years and left in May 2022. This is a fundamentalist Christian college in Greenville,SC. This school is notorious for lifting its interracial dating ban in 2000! Emma was born into a non-religious family, but was recruited into fundamentalist Christianity through a local church. This involvement got her connected with “The Wilds Christian Camp” where she met BJU students. This is a Christian camp well known in conservative Christian circles. She felt peer pressure to conform to fundamentalist ideology and her friends convinced her to attend Bob Jones. In this episode, she talks about how she became aware of the indoctrination and toxicity of BJU. Connect with Emma IG: https://instagram.com/emma.lynn01?igshid=YmMyMTA2M2Y= FB: https://www.facebook.com/profile.php?id=100007217474703 Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-07-11T00:00:00",
      "duration": "00:53:15.8460000",
      "explicit": true,
      "spotifyId": "1TCQRBd5dEzXAEHraKOH2Z",
      "appleId": 1000569483971,
      "subjects": [
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1TCQRBd5dEzXAEHraKOH2Z",
        "apple": "https://podcasts.apple.com/podcast/i-escaped-bju-emma-pope-archive/id1620395336?i=1000569483971"
      }
    },
    {
      "id": "f1dfe54e-629b-4340-87ac-aa5682227b8d",
      "title": "Control Freaks - Eleanor Skelton - ARCHIVE",
      "description": "Eleanor Skelton grew up in fundamentalist Christianity. Specifically, the IFCA, and IFB church (Independent Fundamental Churches of America; Independent Fundamental Baptist). She was expected to attend a Christian college and conform to strict gender roles. When she refused to enroll in a Christian college her parents became more controlling. Every aspect of her life was under control and she details the power her parents had over her. Eleanor talks about her journey of walking away and helping others escape toxic religion. Connect with Eleanor SkeltonIG: https://instagram.com/eleanorwritesthings?igshid=YmMyMTA2M2Y= FB: https://www.facebook.com/EleanorKSkelton Linktree: https://linktr.ee/eleanorwritesthings Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-07-04T00:00:00",
      "duration": "01:49:54.3510000",
      "explicit": true,
      "spotifyId": "6L1OjyvBucUXzyO2vUrsGB",
      "appleId": 1000568732774,
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6L1OjyvBucUXzyO2vUrsGB",
        "apple": "https://podcasts.apple.com/podcast/control-freaks-eleanor-skelton-archive/id1620395336?i=1000568732774"
      }
    },
    {
      "id": "3d70cac3-95c3-44bc-a0ef-e18a01b7fc08",
      "title": "It\u0027s Not the End of the World - Judah Kreinbrook - ARCHIVE",
      "description": "Judah Kreinbrook grew up in a high-control religious environment. His parents were obsessive and certain about when the world would end. Judah’s dad was prepared for the apocalypse, but his mom seemed to have doubts. Judah talks about his experiences growing up in religion and his parent\u0027s beliefs about alternative medicine. Connect with Judah Facebook: https://www.facebook.com/judah.kreinbrook IG: https://www.instagram.com/jakambudriver/ Blog: https://jmedic.medium.com/Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-06-27T00:00:00",
      "duration": "00:53:09.4980000",
      "explicit": true,
      "spotifyId": "4eePWUOSBVqFECnOdFgHKn",
      "appleId": 1000567846005,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4eePWUOSBVqFECnOdFgHKn",
        "apple": "https://podcasts.apple.com/podcast/its-not-the-end-of-the-world-judah-kreinbrook-archive/id1620395336?i=1000567846005"
      }
    },
    {
      "id": "6b715798-fb42-4223-84e2-a311fec28fcd",
      "title": "What is \u0022God\u0022? - Christopher Eaker - ARCHIVE",
      "description": "Christopher Eaker was raised in a Southern Baptist church. He felt pressure to conform to a certain standard. When he became an adult he grappled with the faith he grew up in. He did not like how the church presented itself as some kind of spectacle. For years, Christopher and his wife attended a house church. After that church disbanded, they went to an Anglican church where they were soon asked to conform to their doctrine. Christopher talks about why they left the Anglican church. In this episode, we talk about what is the definition of \u0022God\u0022 and look back on church history and how the doctrines have constantly changed. Connect with Christopher HERE: https://www.facebook.com/profile.php?id=100079128872069Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-06-20T00:00:00",
      "duration": "01:11:40.6690000",
      "explicit": true,
      "spotifyId": "1jFBNxmJwMxpSVebWCKimB",
      "appleId": 1000567131805,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1jFBNxmJwMxpSVebWCKimB",
        "apple": "https://podcasts.apple.com/podcast/what-is-god-christopher-eaker-archive/id1620395336?i=1000567131805"
      }
    },
    {
      "id": "10e71970-3f30-4b40-8cb7-4df3f0608b06",
      "title": "The King of Queens - Jegaysus - ARCHIVE",
      "description": "JeGaysus is a Tik Tok personality who teaches alternate theology and ways to look at religion and non-religion. They share their story of surviving a toxic religion and the work they\u0027re doing now. Connect with JeGaysus https:/https://www.tiktok.com/@jegaysus/video/7084406621706865966/www.jegaysus.com IG: https://www.instagram.com/jegaysus/ Website: https://www.jegaysus.com/ Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-05-23T00:00:00",
      "duration": "01:06:05.8310000",
      "explicit": true,
      "spotifyId": "4XPBsothH0FTioahLyiSPr",
      "appleId": 1000563280971,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4XPBsothH0FTioahLyiSPr",
        "apple": "https://podcasts.apple.com/podcast/the-king-of-queens-jegaysus-archive/id1620395336?i=1000563280971"
      }
    },
    {
      "id": "f87df9ec-27f2-4c5d-854a-61e7e957cda1",
      "title": "Rethinking Jesus - Danny Daniels - ARCHIVE",
      "description": "Danny was a Bible believing Christian with an instilled fear of not questioning adopted beliefs but by his mid-forties Christianity wasn’t working so he left the church and Jesus. He started exploring eastern religions, new age, yoga, meditation, and Shamanism. He runs a YT channel called “Rethinking Jesus” where he challenges the narrative of Jesus and Christianity presented to us. Danny has discovered through his deconstruction that Jesus and Christianity is an invention to control people. CONNECT WITH DANNY - YouTube (https://youtu.be/_paEE0610oU)Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-05-09T00:00:00",
      "duration": "01:20:30.7720000",
      "explicit": true,
      "spotifyId": "3uc4B3vdVsMsLzhLlRAkZD",
      "appleId": 1000560056586,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uc4B3vdVsMsLzhLlRAkZD",
        "apple": "https://podcasts.apple.com/podcast/rethinking-jesus-danny-daniels-archive/id1620395336?i=1000560056586"
      }
    },
    {
      "id": "de53a92c-d7b4-4913-8ccc-2071cb0f650a",
      "title": "Burn the Patriarchy - Nicki Pappas - ARCHIVE",
      "description": "Nicki Pappas is an emerging writer currently working on her first memoir, As Familiar As Family. In the book, she talks about how she was groomed for toxic religion and how she escaped. In August of 2020, she started the “Broadening the Narrative” podcast where she talks with people who are broadening narrow narratives she learned in evangelicalism. She experienced many kinds of abuse growing up and was spiritually abused at her church. Let’s welcome Nicki. - CONNECT WITH NICKI - Instagram (https://instagram.com/broadeningthenarrative?igshid=YmMyMTA2M2Y=) - Blog (http://broadeningthenarrative.blogspot.com/2018/01/why-should-we-broaden-narrative.html?m=1) Tik Tok (https://vm.tiktok.com/ZTdVcBhBF/) Linktree (https://linktr.ee/broadeningthenarrative)Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-05-02T00:00:00",
      "duration": "01:19:39.9370000",
      "explicit": false,
      "spotifyId": "5j7HgsfRgbOiKA7HTgeGrO",
      "appleId": 1000559345344,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5j7HgsfRgbOiKA7HTgeGrO",
        "apple": "https://podcasts.apple.com/podcast/burn-the-patriarchy-nicki-pappas-archive/id1620395336?i=1000559345344"
      }
    },
    {
      "id": "d012aee3-7a5f-4222-b9ec-a201699920ab",
      "title": "What is Religious Trauma? - ARCHIVE",
      "description": "Religious Trauma Syndrome (RTS) is a group of symptoms that arise in response to traumatic or stressful religious experiences. Learn More Here. (Source: Religious Trauma \u0026 Transitions — RESTORATION COUNSELING (restorationcounselingseattle.com)Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-04-29T00:00:00",
      "duration": "00:02:47.5490000",
      "explicit": false,
      "spotifyId": "0n82UqDFXtJNj905tZvPTt",
      "appleId": 1000559146237,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0n82UqDFXtJNj905tZvPTt",
        "apple": "https://podcasts.apple.com/podcast/what-is-religious-trauma-archive/id1620395336?i=1000559146237"
      }
    },
    {
      "id": "8c90de37-6ea3-4661-b722-ad9bef4f88dd",
      "title": "Queer and Christian - Brandan Robertson - ARCHIVE",
      "description": "Brandan Robertson is a progressive gay Christian minister and activist. He helps those from traumatic religious backgrounds rethink what faith and spirituality can look like. His biggest platform is TikTok where he engages regularly with questions. He has been featured on the GMA website and Rolling Stone Magazine. He is also an author that addresses Christianity and LGBTQIA\u002B issues. Brandan is speaking up by using his story to help LGBTQ\u002B youth. Connect with Brandan RobertsonInstagram https://instagram.com/brandanrobertson?igshid=YmMyMTA2M2Y= Tik Tok - https://vm.tiktok.com/ZTdXK4rdW/ YouTube - https://youtube.com/channel/UCxgWtkq0pgBhBeSwwCGTNTA Twitter - https://twitter.com/brandanjr?s=21\u0026t=jAS5wExnXpvfNmlKmm3fJg Website - https://www.brandanrobertson.comConnect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-04-25T00:00:00",
      "duration": "01:10:26.9770000",
      "explicit": true,
      "spotifyId": "0Kk6nYhbwj2jPhULWHvGaa",
      "appleId": 1000558614846,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Kk6nYhbwj2jPhULWHvGaa",
        "apple": "https://podcasts.apple.com/podcast/queer-and-christian-brandan-robertson-archive/id1620395336?i=1000558614846"
      }
    },
    {
      "id": "57446706-703b-4597-8ead-b3f4092ff14e",
      "title": "My Story - IFB Cult - Andrew Pledger - ARCHIVE",
      "description": "My name is Andrew Pledger and this is my story. I grew up in the IFB cult and was homeschooled my whole life. I ended up attending Bob Jones University for several years and was expelled before graduation. The expulsion was a result of sharing my story publicly. I\u0027m a religious trauma survivor who brings awareness to RT, spiritual abuse, and mental health. Being a part of the LGBTQ\u002B community, and experiencing religious trauma has inspired me to pursue psychology to help survivors of religious abuse. In the meantime, I\u0027m a religion recovery coach, I help people grapple with life after religion. I am an influencer on the rise and my vocation started with a controversial interview with Josh Harris (Kissed Dating Goodbye, author). I\u0027ve appeared on several podcasts like Preacher Boys, This Little Light of Mine, Cheers to Leaving, and Divinely Modern. I\u0027m now on a mission to spread awareness of these issues by using social media platforms.Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-04-22T00:00:00",
      "duration": "01:00:12.2640000",
      "explicit": true,
      "spotifyId": "3QhAnrmC8HSFJLM4qu47Sx",
      "appleId": 1000558330453,
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QhAnrmC8HSFJLM4qu47Sx",
        "apple": "https://podcasts.apple.com/podcast/my-story-ifb-cult-andrew-pledger-archive/id1620395336?i=1000558330453"
      }
    },
    {
      "id": "4d69e171-0b75-4e7e-a757-568269357823",
      "title": "Speaking Up: TRAILER",
      "description": "Speaking Up w/ Andrew Pledger is a show that offers a platform for people to share their stories of surviving toxic religious environments. ---Connect with Andrew PledgerLinktreeSupport on PatreonInstagramTikTokTwitterYouTubeWebsite Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-04-21T00:00:00",
      "duration": "00:02:01.3120000",
      "explicit": false,
      "spotifyId": "2SY86Ny67num6tsmaMsi0z",
      "appleId": 1000558280098,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2SY86Ny67num6tsmaMsi0z",
        "apple": "https://podcasts.apple.com/podcast/speaking-up-trailer/id1620395336?i=1000558280098"
      }
    }
  ]
}