{
  "id": "9cf2785b-353d-43b3-9ba5-7e44d7e5a4e1",
  "name": "Speaking From The Heart",
  "spotifyId": "4lcFO7jBUqnTHBE7NvcBj7",
  "appleId": 1690257565,
  "episodes": [
    {
      "id": "f43a8bb9-113c-4e35-89ef-31af42a3c680",
      "title": "Episode #86 - The Truth Will Set You Free: An Interview With Katherine Spallino",
      "description": "There is much to be said about telling the truth and being able to share that truth with others. However, what if you weren\u0027t able to learn the truth until someone exposed you to it? What would it take for it to set you completely free? Today\u0027s riveting interview with a former member of the Church of Scientology, Katherine Spallino, will leave you speechless with the number of different atrocities that are committed and are not well-known to the public. With this first-hand account, Katherine explains not only what it has meant to go through this experience, but it really means to continue to explore the truth, even when it is not easy to see and attempts are made to show it differently than what appears. We all have the capability to seek out the support that is needed, but it takes a special kind of persistence to be able to explore and recognize what we can accomplish with that truth in hand. Guest Bio Katherine grew up on a secluded ranch within the Cadet organization, the Church of Scientology’s Sea Org school for children. At a young age, Katherine began to journal about her day-to-day life, capturing the thoughts and experiences of a child coming of age in a cult. Katherine’s background offers the rare opportunity to tell the story of the hundreds of children who rarely saw their parents and were indoctrinated to become future Sea Org members. Katherine is no longer a Scientologist and lives in Minneapolis with her husband, happily raising three rambunctious boys. YouTube: https://youtube.com/@Thebadcadet?si\u0026#61;45BmHzRfLdC_EWmG @Badcadet on Twitter @Badcadet on Instagram Visit Our Website: https://speaking-from-the-heart.captivate.fm/ Visit Our Business Website: https://www.yourspeakingvoice.biz Support The Mission Of The Business! Donate Here: https://speaking-from-the-heart.captivate.fm/support Intro/Outro By: Michael Dugan, Podcast Host: Voice4Chefs",
      "release": "2024-02-15T11:00:00Z",
      "duration": "00:46:41.0310000",
      "explicit": true,
      "spotifyId": "4vnVhznpd6QO6HXk2SxWHl",
      "appleId": 1000645436121,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vnVhznpd6QO6HXk2SxWHl",
        "apple": "https://podcasts.apple.com/podcast/episode-86-the-truth-will-set-you-free-an/id1690257565?i=1000645436121"
      }
    }
  ]
}