{
  "_ts": 0,
  "id": "e1c6b90d-74e4-4ab7-9592-c64bb115ca59",
  "name": "Spirit Levels",
  "spotifyId": "2PRF5K49qQcpARbjYffvcz",
  "appleId": 1707996069,
  "episodes": [
    {
      "id": "9cfd0b0f-0fb9-4b22-a3cd-4a3dfe038dfb",
      "title": "Life Coach Cults",
      "description": "If your life coach is a psychopath, is that necessarily a bad thing? Coaching is marketed to wannabes as a luxury, business-class lifestyle that grants you total freedom and easy money. (And oh yeah, you might have to deal with some clients in crisis, too.) You’ve just got to learn how to hustle, which means paying a whoop-load of cash to other coaches to get \u0027the codes\u0027. Possibly for the rest of your life. This episode, Frank and Jenny revisit their favourite topic, piggybacking off the Netflix UK documentary Psychopath Life Coach. We ask our guest Danielle Ryan – a former life coach who now makes explainer videos dissecting the scammier side of the industry – what trends she’s seeing. These range from the escalating industry of coaches coaching coaches, to the ‘fitness coach to business coach pipeline’, to business coaches rebranding as spiritual coaches. Along the way, Frank and Jenny discuss Matthew McConaughey’s infiltration into coaching, sweat-lodge disaster guy James Arthur Ray, NLP, Landmark and Dale Carnegie. We also get Jenny’s Indonesian language teacher Jamsen on the show, to talk about how life coaches are taking over Bali and his take on whether that’s all bad. By the way, if you dig this episode, you’ll love our eps Make Me a Life Coach and also the episode Energy Healing, Manifesting and The Placebo Effect . LINKS Danielle Ryan on the most common business coaching scams . Danielle Ryan’s videos on NLP, part one and part two . Jenny’s Bahasa teacher, Jamsen . Hire him! Jenny talking about life coaching on ABC radio and Disrupt radio (scroll down to Mar 12). Further reading: Is Life Coaching Just Modern Sophistry? (Quillette) Life Coaching Industry Scams (BBC). The Cult-like Language That’s Coursing Through Business (Inc). Jay Shetty’s monk back-story questioned (The Guardian). Leave us a voice message for a future episode on Speakpipe . Spirit Levels on Instagram . Our newsletter . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-03-25T09:55:04Z",
      "duration": "01:06:19.7020000",
      "explicit": true,
      "spotifyId": "6EXBDTTWCdkSoGugf6BkMC",
      "appleId": 1000650344995,
      "subjects": [
        "Cult Psychology",
        "Spiritual Narcissist",
        "Landmark",
        "James Arthur Ray"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6EXBDTTWCdkSoGugf6BkMC",
        "apple": "https://podcasts.apple.com/podcast/life-coach-cults/id1707996069?i=1000650344995"
      }
    }
  ]
}