{
  "_ts": 0,
  "id": "5cb2658e-be49-4763-af7f-34fc408ba95a",
  "name": "Spirit, State, and Society Podcast",
  "spotifyId": "7k6kYNkFIlkT1TMJBuY0G9",
  "youTubeChannelId": "UCg1iGewURbw0G1Ggfo0I7fA",
  "youTubePlaylistId": "PLpBDHBQghi1DR-UGmd-kfnl6a0ry2zIGR",
  "episodes": [
    {
      "id": "162d89cc-8414-4678-8202-516e2e592c47",
      "title": "Before the Fire: Pentecostal Pioneers",
      "description": "In this episode, we delve into the lives of Charles Parham and William Seymour, uncovering their spiritual journeys, theological tensions, and the revival they sparked that transformed global Christianity through the birth of Pentecostalism.\n\nPlease note that we will be off in the months of July and August, but back in September. Have a great summer!\n\nSources and other references:\n\nGastón Espinosa, William J. Seymour and the Origins of Global Pentecostalism: A Biography and Documentary History (Durham, NC: Duke University Press, 2014).\n\nJames R. Goff, Jr. Fields White Unto Harvest: Charles F. Parham and the Missionary Origins of Pentecostalism (Fayetteville, AR: University of Arkansas Press, 1988).\n\nLarry Martin, Charles Fox Parham: The Unlikely Father of Modern Pentecostalism (New Kensington, PA: Whitaker House, 2022).\n\nCecil M. Robeck, Jr., The Azusa Street Mission And Revival: The Birth Of The Global Pentecostal Movement (Nashville: Thomas Nelson Publishers, 2006).\n\nVinson Synan, The Holiness-Pentecostal Tradition: Charismatic Movements in the Twentieth Century (Grand Rapids, MI: Eerdmans, 1997).",
      "release": "2025-06-17T00:28:34Z",
      "duration": "00:22:19.9070000",
      "explicit": false,
      "spotifyId": "3AJvThonawIkujyjTNGDBz",
      "youTubeId": "RpHny2O_w2s",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3AJvThonawIkujyjTNGDBz",
        "youtube": "https://www.youtube.com/watch?v=RpHny2O_w2s"
      }
    },
    {
      "id": "7dc66988-096a-45d6-b911-3ce6876423ac",
      "title": "Beyond Words: Speaking in Tongues and the Pentecostal Experience",
      "description": "In this episode, we dive into the practice of speaking in tongues (glossolalia) within the Pentecostal tradition. By examining biblical examples and contemporary significance, we highlight why many Pentecostals view speaking in tongues as the initial evidence of the Baptism in the Holy Spirit.",
      "release": "2025-06-04T13:15:22Z",
      "duration": "00:17:38.8290000",
      "explicit": false,
      "spotifyId": "1eIHFL2iC0drQnRsMJDXDt",
      "youTubeId": "zpGwiTDkSbM",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1eIHFL2iC0drQnRsMJDXDt",
        "youtube": "https://www.youtube.com/watch?v=zpGwiTDkSbM"
      }
    },
    {
      "id": "c0fec3bf-2e62-4545-a293-b3f52afaa63c",
      "title": "Mapping the Global Spectrum of Pentecostal Movements",
      "description": "In this episode, we explore the diverse landscape of Pentecostalism across the globe, examining the various expressions that define the movement today. From Classical Pentecostals to the Charismatic Renewal, and from Old Independent churches to Neo-Pentecostals, we delve into the rich variety shaping Pentecostalism worldwide. Resources: Allen H. Anderson, Spreading Fires. The Missionary Nature of Early Pentecostalism. Orbis Books, 2007. Allen H. Anderson, To the Ends of the Earth. Pentecostalism and the Transformation of World Christianity, Oxford, 2013. Josh Brahinsky, “Pentecostal Body Logics: Cultivating a Modern Sensorium.” Cultural Anthropology 27.2 (2012): 215-238. Walter. J. Hollenweger, “An Introduction to Pentecostalisms.” Journal of Beliefs \u0026 Values 25.2 (2004): 125-137. Todd M. Johnson and Gina A. Zurlo, Introducing Spirit-Empowered Christianity: The Global Pentecostal \u0026 Charismatic Movements in the 21st Century, ORU Press, 2020. Joel Robbins, “The Globalization of Pentecostal and Charismatic Christianity.” Annual Review of Anthropology 33 (2004): 117-143. Gina A. Zurlo, ed. World Christian Database, Brill, 2025.",
      "release": "2025-05-21T13:15:06Z",
      "duration": "00:24:07.3690000",
      "explicit": false,
      "spotifyId": "0PPJ4jNnNPsT8H6KsOx7Xb",
      "youTubeId": "iQedA197J8I",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PPJ4jNnNPsT8H6KsOx7Xb",
        "youtube": "https://www.youtube.com/watch?v=iQedA197J8I"
      }
    },
    {
      "id": "380fcb5b-6374-4fa6-94f1-1d56087198dd",
      "title": "Welcome to the Spirit, State, and Society Podcast",
      "description": "In the first episode, we ask why understanding Pentecostalism matters, define what is meant by “pentecostal,” and explain our approach to the study of these movements.",
      "release": "2025-05-07T22:42:39Z",
      "duration": "00:18:39.4340000",
      "explicit": false,
      "spotifyId": "4VEJEfV0lBwmNVaAJfl2gr",
      "youTubeId": "MYDkM1u2zwI",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VEJEfV0lBwmNVaAJfl2gr",
        "youtube": "https://www.youtube.com/watch?v=MYDkM1u2zwI"
      }
    }
  ]
}