{
  "id": "5cb2658e-be49-4763-af7f-34fc408ba95a",
  "name": "Spirit, State, and Society Podcast",
  "spotifyId": "7k6kYNkFIlkT1TMJBuY0G9",
  "youTubeChannelId": "UCg1iGewURbw0G1Ggfo0I7fA",
  "youTubePlaylistId": "PLpBDHBQghi1DR-UGmd-kfnl6a0ry2zIGR",
  "episodes": [
    {
      "id": "33a6665f-ef57-4f3d-9fb3-ec55918f9869",
      "title": "Faith, Media, and Martyrdom: The Politics of Charlie Kirk’s Death (bonus episode)",
      "description": "In this bonus episode, we unpack the media frenzy surrounding Charlie Kirk’s assassination and how it has been transformed into a potent narrative of martyrdom. We explore how AI technologies have amplified and reshaped this story, casting Kirk as a symbol in a broader battle between good and evil. Through the lens of biblical martyrdom, we examine how this framing mobilizes the Christian right, blurs the line between faith and politics, and becomes a rallying point for the U.S. political class.",
      "release": "2025-11-03T17:33:15Z",
      "duration": "00:22:08.3440000",
      "explicit": false,
      "spotifyId": "3WpUXNgaEK6ORtmLJCHUKh",
      "youTubeId": "P8v96it_DYg",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3WpUXNgaEK6ORtmLJCHUKh",
        "youtube": "https://www.youtube.com/watch?v=P8v96it_DYg"
      }
    },
    {
      "id": "86e72307-7afb-4d81-8095-7907b5ed9ee3",
      "title": "The \u0022Jesus Only\u0022 Movement",
      "description": "What is the “Jesus Only” movement, and how does it view the traditional doctrine of the Trinity? In this episode, we explore the origins, core beliefs, and rapid growth of Oneness Pentecostalism. From early 20th-century revivals to thriving global churches today, discover the unique faith and passion that define this growing movement.",
      "release": "2025-10-20T17:22:25Z",
      "duration": "00:23:27.4070000",
      "explicit": false,
      "spotifyId": "0VKA7Z6pnnFSnMRNJZkpwU",
      "youTubeId": "4OBOs9Eheo8",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0VKA7Z6pnnFSnMRNJZkpwU",
        "youtube": "https://www.youtube.com/watch?v=4OBOs9Eheo8"
      }
    },
    {
      "id": "ef8edf3d-ec55-4db1-b9f1-dd93575b0d50",
      "title": "Spiritual Gifts Under Watch: Navigating Charisma and Control",
      "description": "In this follow-up to our previous conversation, we’re back with Dr. Gagné as he reflects on his time as an assistant pastor in the Pentecostal Assemblies of Canada (PAOC). This episode focuses on two challenges he faced in ministry: how spiritual gifts were regulated in the church, and the often complex question of whether salvation can truly be secure. Dr. Gagné shares personal insights and experiences that offer a thoughtful examination of how faith, leadership, and theology intersect in real-life church settings.",
      "release": "2025-10-08T00:00:00",
      "duration": "00:15:01.6300000",
      "explicit": false,
      "spotifyId": "3VsLq9Mk8KUx1s66PlL9tj",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3VsLq9Mk8KUx1s66PlL9tj"
      }
    },
    {
      "id": "47116767-63ef-4e12-bf03-27f7c7e82818",
      "title": "Finished-Work Pentecostalism: AoG and PAOC in Focus",
      "description": "In this episode, we dive into the heart of “Finished-Work Pentecostalism,” exploring how the Assemblies of God (USA) and the Pentecostal Assemblies of Canada (PAOC) emerged, grew, and shaped global Pentecostalism. We trace their shared theological roots, key historical moments, and lasting impact on Pentecostal belief and practice today. The conversation also includes Dr. Gagné’s personal reflections on his years as a former PAOC pastor, adding a unique insider’s perspective to the discussion.",
      "release": "2025-09-24T00:00:00",
      "duration": "00:20:52.7160000",
      "explicit": false,
      "spotifyId": "6CcQ7L0j7TIFZDfK5ewF2w",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6CcQ7L0j7TIFZDfK5ewF2w"
      }
    },
    {
      "id": "ca6fef08-ae9c-46d9-8300-3cd84560b103",
      "title": "Works of Grace and Spirit-Baptism: The Holiness Roots of Pentecostalism",
      "description": "We’re thrilled to be back after a refreshing two-month summer break! A heartfelt welcome to all our loyal and new podcast listeners. In this exciting episode, we delve into the impact of the Holiness movement, highlighting its focus on sanctification and spiritual renewal, which laid the groundwork for Spirit-Baptism and the vibrant growth of Pentecostalism. If you enjoy the podcast, please take a minute to give us a rating!",
      "release": "2025-09-10T00:00:00",
      "duration": "00:24:37.1370000",
      "explicit": false,
      "spotifyId": "5GGyFz8Xp9i5HlfKdViuvG",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GGyFz8Xp9i5HlfKdViuvG"
      }
    },
    {
      "id": "162d89cc-8414-4678-8202-516e2e592c47",
      "title": "Before the Fire: Pentecostal Pioneers",
      "description": "In this episode, we delve into the lives of Charles Parham and William Seymour, uncovering their spiritual journeys, theological tensions, and the revival they sparked that transformed global Christianity through the birth of Pentecostalism.\n\nPlease note that we will be off in the months of July and August, but back in September. Have a great summer!\n\nSources and other references:\n\nGastón Espinosa, William J. Seymour and the Origins of Global Pentecostalism: A Biography and Documentary History (Durham, NC: Duke University Press, 2014).\n\nJames R. Goff, Jr. Fields White Unto Harvest: Charles F. Parham and the Missionary Origins of Pentecostalism (Fayetteville, AR: University of Arkansas Press, 1988).\n\nLarry Martin, Charles Fox Parham: The Unlikely Father of Modern Pentecostalism (New Kensington, PA: Whitaker House, 2022).\n\nCecil M. Robeck, Jr., The Azusa Street Mission And Revival: The Birth Of The Global Pentecostal Movement (Nashville: Thomas Nelson Publishers, 2006).\n\nVinson Synan, The Holiness-Pentecostal Tradition: Charismatic Movements in the Twentieth Century (Grand Rapids, MI: Eerdmans, 1997).",
      "release": "2025-06-17T00:28:34Z",
      "duration": "00:22:19.9070000",
      "explicit": false,
      "spotifyId": "3AJvThonawIkujyjTNGDBz",
      "youTubeId": "RpHny2O_w2s",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3AJvThonawIkujyjTNGDBz",
        "youtube": "https://www.youtube.com/watch?v=RpHny2O_w2s"
      }
    },
    {
      "id": "7dc66988-096a-45d6-b911-3ce6876423ac",
      "title": "Beyond Words: Speaking in Tongues and the Pentecostal Experience",
      "description": "In this episode, we dive into the practice of speaking in tongues (glossolalia) within the Pentecostal tradition. By examining biblical examples and contemporary significance, we highlight why many Pentecostals view speaking in tongues as the initial evidence of the Baptism in the Holy Spirit.",
      "release": "2025-06-04T13:15:22Z",
      "duration": "00:17:38.8290000",
      "explicit": false,
      "spotifyId": "1eIHFL2iC0drQnRsMJDXDt",
      "youTubeId": "zpGwiTDkSbM",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1eIHFL2iC0drQnRsMJDXDt",
        "youtube": "https://www.youtube.com/watch?v=zpGwiTDkSbM"
      }
    },
    {
      "id": "c0fec3bf-2e62-4545-a293-b3f52afaa63c",
      "title": "Mapping the Global Spectrum of Pentecostal Movements",
      "description": "In this episode, we explore the diverse landscape of Pentecostalism across the globe, examining the various expressions that define the movement today. From Classical Pentecostals to the Charismatic Renewal, and from Old Independent churches to Neo-Pentecostals, we delve into the rich variety shaping Pentecostalism worldwide. Resources: Allen H. Anderson, Spreading Fires. The Missionary Nature of Early Pentecostalism. Orbis Books, 2007. Allen H. Anderson, To the Ends of the Earth. Pentecostalism and the Transformation of World Christianity, Oxford, 2013. Josh Brahinsky, “Pentecostal Body Logics: Cultivating a Modern Sensorium.” Cultural Anthropology 27.2 (2012): 215-238. Walter. J. Hollenweger, “An Introduction to Pentecostalisms.” Journal of Beliefs \u0026 Values 25.2 (2004): 125-137. Todd M. Johnson and Gina A. Zurlo, Introducing Spirit-Empowered Christianity: The Global Pentecostal \u0026 Charismatic Movements in the 21st Century, ORU Press, 2020. Joel Robbins, “The Globalization of Pentecostal and Charismatic Christianity.” Annual Review of Anthropology 33 (2004): 117-143. Gina A. Zurlo, ed. World Christian Database, Brill, 2025.",
      "release": "2025-05-21T13:15:06Z",
      "duration": "00:24:07.3690000",
      "explicit": false,
      "spotifyId": "0PPJ4jNnNPsT8H6KsOx7Xb",
      "youTubeId": "iQedA197J8I",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PPJ4jNnNPsT8H6KsOx7Xb",
        "youtube": "https://www.youtube.com/watch?v=iQedA197J8I"
      }
    },
    {
      "id": "380fcb5b-6374-4fa6-94f1-1d56087198dd",
      "title": "Welcome to the Spirit, State, and Society Podcast",
      "description": "In the first episode, we ask why understanding Pentecostalism matters, define what is meant by “pentecostal,” and explain our approach to the study of these movements.",
      "release": "2025-05-07T22:42:39Z",
      "duration": "00:18:39.4340000",
      "explicit": false,
      "spotifyId": "4VEJEfV0lBwmNVaAJfl2gr",
      "youTubeId": "MYDkM1u2zwI",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VEJEfV0lBwmNVaAJfl2gr",
        "youtube": "https://www.youtube.com/watch?v=MYDkM1u2zwI"
      }
    }
  ]
}