{
  "_ts": 0,
  "id": "e523a893-f668-4501-b703-2c6d3222c1cd",
  "name": "Spiritually Inspired: thought-provoking show that explores spirituality, consciousness, and energy healing",
  "spotifyId": "3qKUi9qcs9ycuP5u4pv1l0",
  "appleId": 1551504146,
  "episodes": [
    {
      "id": "bd3c1fd7-f239-4356-8b5d-cc4a7ce42a09",
      "title": "Leaving the messianic cult was not easy - Isabella Young | Spiritually Inspired #216",
      "description": "Send us a text\nFifteen years ago, I escaped from a messianic cult after my son was murdered to prevent the cult leader (my ex-husband) from being exposed as a pedophile, rapist, and conman.\nOnce I was free, I focused on healing my emotional wounds, freeing my mind from cult programming, spending time in Nature, expanding my consciousness, and learning about cults and cult programming. Now that I am free from self hatred and suffering, I understand that what I experienced in that cult on the cul de sac was a miniaturization of what is happening to humanity  - a microcosm of the macrocosm. I recognize the fear-based mind control, brainwashing, gaslighting, savior programming, and psyops to keep people ignorant, fearful, confused, and enslaved.  \nMy first book, Putting on the Armor of God: A survival handbook for the Great Awakening and New Earth exposes the war on humanity and what we can do to protect and empower ourselves. My second book, New Human New Earth, offers readers hundreds of natural medicines, body technologies, and spiritual technologies to optimize physical and mental health, expansion of consciousness, multidimensionality, sovereignty. and co-creation.\nwww.feelingbetternaturally.love\n\n\nResources:\nwww.soulawakeningstore.com\nwww.claudiumurgan.com\nclaudiu@claudiumurgan.com\nhttps://spirituallyinspired.buzzsprout.com\n\nSubscribe for more videos! youtube.com/channel/UC6RlLkzUK_LdyRSV7DE6obQ\nSupport the show",
      "release": "2025-05-06T05:00:00Z",
      "duration": "00:48:26",
      "explicit": false,
      "spotifyId": "2HgDdju9kbCP4dCaE28356",
      "appleId": 1000706479401,
      "subjects": [
        "Louix Dor Dempriey"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2HgDdju9kbCP4dCaE28356",
        "apple": "https://podcasts.apple.com/podcast/leaving-the-messianic-cult-was-not-easy-isabella/id1551504146?i=1000706479401"
      }
    }
  ]
}