{
  "_ts": 0,
  "id": "25809dc9-cd8b-4dd8-9ab3-c1b4b03ce5de",
  "name": "Spiritual Files",
  "youTubeChannelId": "UCwotA1fPay1HGGpD763Ofyg",
  "episodes": [
    {
      "id": "078bd646-efac-41ab-baff-7fe931f1d30e",
      "title": "15 Times Celebrities Messed With the Wrong Cults",
      "description": "🎬 15 Times Celebrities Messed with the Wrong Cults | Dark Truths Hollywood Tried to Hide\nWhen fame collides with fanaticism, the results are often disturbing—and irreversible. In this gripping documentary, we reveal 15 unbelievable times celebrities got entangled with dangerous cults. These aren’t your everyday controversies. These are life-altering decisions, twisted belief systems, and the heavy price of silence. From mind control to psychological scars that last a lifetime, this is the dark side of Hollywood they never wanted you to see.\n\n🌟 What This Documentary Exposes:\n\nThe real reason why Tom Cruise\u0027s career and personal life have been dominated by his loyalty to Scientology, and the chilling backlash after his infamous Matt Lauer interview.\n\nHow John Travolta’s unimaginable personal tragedy raised serious questions about the Church’s opposition to medical treatment—and the possible consequences it had on his son’s life.\n\nThe heartbreaking story of Lisa Marie Presley, forced into Scientology at age 10, manipulated through her darkest moments, and how she finally broke free from its grip before her untimely death.\n\nHow Allison Mack of Smallville went from rising star to convicted cult recruiter in the notorious NXIVM sex trafficking ring, and why Hollywood insiders ignored the red flags for years.\n\nWhy Elvis Presley, despite being spiritually curious, called Scientology a \u0022rip-off\u0022—and what that decision cost his legacy and his family.\n\nRose McGowan’s unfiltered recount of surviving the Children of God cult as a child, and how her family escaped after discovering unspeakable abuse.\n\nThe haunting parallels in Joaquin Phoenix and River Phoenix’s childhoods under the same cult—and how their pain translated into iconic, emotional performances.\n\nThe story of Christopher Owens, a musician who sacrificed family ties to escape the cult that controlled every word he spoke and every note he played.\n\nGlenn Close\u0027s trauma inside Moral Re-Armament, and how it shaped her mental health advocacy work decades later.\n\nHow Leah Remini’s defiance against Scientology sparked a war of smear campaigns—and how her courage exposed the organization\u0027s most guarded secrets.\n\nNeil Young’s dangerous brush with Charles Manson, who once sought a record deal from the rock legend before becoming one of America’s most infamous murderers.\n\nOscar-winner Adrien Brody’s childhood in a commune that restricted media, education, and outside thought—and how that isolation helped him channel dark, powerful performances.\n\nThe shocking truth behind Winona Ryder’s early years in the Rainbow Commune and how it triggered a lifelong obsession with cults and the psychology of control.\n\nAnd finally, how a 20-year-old Michelle Pfeiffer nearly starved herself under the influence of the Breatharian cult, believing humans could survive on air alone—until a film project saved her life.\n\n💔 These aren’t just celebrities. These are survivors, rebels, and sometimes, victims of ideological abuse that hides in plain sight.\n\n🔥 Why You Should Watch This\nIf you’ve ever wondered why cults are obsessed with recruiting the famous, or how power structures within Hollywood enable spiritual manipulation, this video is your deep dive into the horrifying truth. These cults weren’t fringe movements—they operated in the heart of entertainment, cloaked in spirituality, self-help, or alternative healing.\n\n🔍 Search Terms \u0026 Topics Covered:\nHollywood cults, Scientology secrets, NXIVM breakdown, Children of God cult, Tom Cruise controversy, Lisa Marie Presley Scientology, Rose McGowan cult, Joaquin Phoenix trauma, River Phoenix overdose, Michelle Pfeiffer Breatharian, Glenn Close cult story, Leah Remini Scientology war, Charles Manson music career, Adrien Brody upbringing, Winona Ryder commune childhood, dark celebrity secrets, cult survivor stories, psychological manipulation in fame\n\n💬 Engage With the Story\nWhich story shocked you the most? Do you think these celebrities were exploited—or do some share responsibility for promoting cult ideologies to millions? Drop your thoughts in the comments and be part of the discussion. This topic is too important to be ignored.\n\n🔔 Subscribe for More\nWe release weekly deep-dive documentaries that explore celebrity psychology, unsolved mysteries, and the chilling truths behind public fame. Don’t miss out—hit Subscribe and tap the bell icon to get notified the moment a new story drops.\n\n📢 Share This Video\nIf you believe in exposing truth and protecting others from psychological control, please share this video. One share could help someone recognize manipulation before it’s too late.",
      "release": "2025-04-16T03:15:04Z",
      "duration": "00:22:01",
      "explicit": false,
      "youTubeId": "QxFEd46GAlc",
      "subjects": [
        "Scientology",
        "Moral Re-Armament",
        "NXIVM",
        "Children Of God",
        "Inedia",
        "Jasmuheen",
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QxFEd46GAlc"
      }
    }
  ]
}