{
  "_ts": 0,
  "id": "5cb2658e-be49-4763-af7f-34fc408ba95a",
  "name": "Spirit, State, and Society Podcast",
  "spotifyId": "7k6kYNkFIlkT1TMJBuY0G9",
  "youTubeChannelId": "UCg1iGewURbw0G1Ggfo0I7fA",
  "youTubePlaylistId": "PLpBDHBQghi1DR-UGmd-kfnl6a0ry2zIGR",
  "episodes": [
    {
      "id": "c0fec3bf-2e62-4545-a293-b3f52afaa63c",
      "title": "Mapping the Global Spectrum of Pentecostal Movements",
      "description": "In this episode, we explore the diverse landscape of Pentecostalism across the globe, examining the various expressions that define the movement today. From Classical Pentecostals to the Charismatic Renewal, and from Old Independent churches to Neo-Pentecostals, we delve into the rich variety shaping Pentecostalism worldwide. Resources: Allen H. Anderson, Spreading Fires. The Missionary Nature of Early Pentecostalism. Orbis Books, 2007. Allen H. Anderson, To the Ends of the Earth. Pentecostalism and the Transformation of World Christianity, Oxford, 2013. Josh Brahinsky, “Pentecostal Body Logics: Cultivating a Modern Sensorium.” Cultural Anthropology 27.2 (2012): 215-238. Walter. J. Hollenweger, “An Introduction to Pentecostalisms.” Journal of Beliefs \u0026 Values 25.2 (2004): 125-137. Todd M. Johnson and Gina A. Zurlo, Introducing Spirit-Empowered Christianity: The Global Pentecostal \u0026 Charismatic Movements in the 21st Century, ORU Press, 2020. Joel Robbins, “The Globalization of Pentecostal and Charismatic Christianity.” Annual Review of Anthropology 33 (2004): 117-143. Gina A. Zurlo, ed. World Christian Database, Brill, 2025.",
      "release": "2025-05-21T13:15:06Z",
      "duration": "00:24:07.3690000",
      "explicit": false,
      "spotifyId": "0PPJ4jNnNPsT8H6KsOx7Xb",
      "youTubeId": "iQedA197J8I",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PPJ4jNnNPsT8H6KsOx7Xb",
        "youtube": "https://www.youtube.com/watch?v=iQedA197J8I"
      }
    },
    {
      "id": "380fcb5b-6374-4fa6-94f1-1d56087198dd",
      "title": "Welcome to the Spirit, State, and Society Podcast",
      "description": "In the first episode, we ask why understanding Pentecostalism matters, define what is meant by “pentecostal,” and explain our approach to the study of these movements.",
      "release": "2025-05-07T22:42:39Z",
      "duration": "00:18:39.4340000",
      "explicit": false,
      "spotifyId": "4VEJEfV0lBwmNVaAJfl2gr",
      "youTubeId": "MYDkM1u2zwI",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VEJEfV0lBwmNVaAJfl2gr",
        "youtube": "https://www.youtube.com/watch?v=MYDkM1u2zwI"
      }
    }
  ]
}