{
  "id": "d08e1c41-82b5-4839-bb6b-a6b9da63e711",
  "name": "Squirrel Brain Stories",
  "spotifyId": "3ExeitUrpNJD0f8gEyQwNv",
  "appleId": 1851877715,
  "youTubeChannelId": "UCa6-lAOj5NWrkhXjs-nTWPQ",
  "episodes": [
    {
      "id": "ef323db0-e917-466f-b2a7-702ee165b4b6",
      "title": "Episode 18: By Their Fruits – Institutional Failure and the Illusion of Justice",
      "description": "Welcome back to Squirrel Brain Stories, hosted by Angela and her co-host Buck. Episode 18 shifts from survival inside abuse to the events following escape. This retrospective revisits Episodes 14 through 16, examining court proceedings, bail decisions, and systemic failures that allowed a violent offender to remain free. It explores how institutions designed for protection can become procedural and indifferent.\n\nFrom Institutional Cult to Domestic Cult Angela and Buck discuss the transition from a religious cult to a \u0022domestic cult.\u0022 While the theology vanished, the power structure remained. Scripture previously justified hierarchy; afterward, control continued via manipulation and fear. The episode examines how control persists as a behavior even after doctrine fades.\n\nDoctrine vs. Reality Buck notes the gap between preached honesty and private exploitation. Angela describes her conditioning to remain silent despite recognizing wrongdoing. The discussion reframes indoctrination not as blind belief, but as selective enforcement where submission is prioritized over accountability.\n\nEndurance as Conditioning Angela internalized the belief that maintaining her family was a moral obligation. Shame and fear of spiritual failure turned endurance into a survival reflex. The episode questions how religious language about “enduring all things” can increase a victim’s tolerance for abuse.\n\nPlanning an Exit Escape was logistical, not emotional. Angela opened a secret bank account, diverting small amounts from her paycheck. This was necessary as her income was controlled under the guise of \u0022retirement investments.\u0022 Leaving required strategy and secrecy; it was a slow construction project, not a single event.\n\nEscalation After Return In Oregon, volatility intensified. Increased alcohol use signaled existing anger. Angela hid daily decisions to avoid triggering rage, living under constant vigilance. Communication was impossible, and control was maintained through intimidation.\n\nThe Bail Timeline Following a restraining order violation and serious charges, bail was set at $500,000. Paying 10% allowed the offender to flee the country. After extradition, bail was again set at $500,000. Angela and Buck question why a proven flight risk remained eligible for release, causing renewed fear for the survivors. The episode asks what threshold triggers detention over financial release.\n\nEvidence and Self-Advocacy Angela emphasizes meticulous record-keeping. While civil disputes often value evidence, criminal matters involving violence can stall. Survivors must often act as their own archivists to ensure their documentation is not dismissed.\n\nBy Their Fruits Referencing Matthew 7:15-16, the episode evaluates institutions by their outcomes. The cult produced trauma; the legal system produced repeated releases and prolonged danger. Results reveal the truth behind claims of authority.\n\nWhat Comes Next Episode 18 expands the lens to include other survivors. Future episodes will explore additional perspectives, including Niko’s. Squirrel Brain Stories remains a project dedicated to documentation and transparency.\n\nContent Warning This episode discusses domestic violence, sexual assault, child endangerment, coercive control, kidnapping, and systemic failure. Listener discretion is advised.",
      "release": "2026-02-16T21:51:59Z",
      "duration": "00:56:59",
      "explicit": false,
      "spotifyId": "6cK0LNAly5n7JCtYNxBKzs",
      "appleId": 1000750039033,
      "youTubeId": "yFIqfjZnYkI",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cK0LNAly5n7JCtYNxBKzs",
        "apple": "https://podcasts.apple.com/podcast/episode-18-by-their-fruits-institutional-failure-and/id1851877715?i=1000750039033",
        "youtube": "https://www.youtube.com/watch?v=yFIqfjZnYkI"
      }
    },
    {
      "id": "2233f659-f97a-4a66-92ec-670b4c67d7c8",
      "title": "Episode 17: Conditioned to Obey - When Control Follows You Out",
      "description": "In Episode 17 of Squirrel Brain Stories, Angela and her husband Buck step back and examine the long shadow of indoctrination. This retrospective episode revisits Episodes 11, 12, and 13, not to retell the events, but to analyze how cult conditioning, religious doctrine, and enforced obedience continued to shape Angela’s decisions long after she physically left the compound.\n\nThe conversation breaks down how submission-based theology normalized abuse, erased red flags, and carried forward into later relationships. Buck draws direct connections between scripture commonly used to enforce female subservience and the psychological framework that made coercion, silence, and compliance feel like moral obligations rather than warning signs.\n\nThe episode explores pivotal moments that only make sense in hindsight: lying to immigration under pressure, witnessing intimidation framed as “protection,” and becoming entangled in escalating criminal behavior without fully realizing the danger. From sparkplug intimidation tactics to the Molotov cocktail incident in Mexico, Angela reflects on how fear, conditioning, and survival instincts blurred the line between victim and accomplice.\n\nThis episode also interrogates institutional failure. Angela and Buck discuss immigration enforcement inconsistencies, the role of federal agents, repeated bail decisions, and how systems designed to protect instead enabled continued harm. The discussion underscores how abusers weaponize victim narratives, chaos, and authority to maintain control, while survivors are left navigating legal and psychological fallout.\n\nEpisode 17 serves as a critical pause in the series, connecting past episodes with deeper psychological clarity and setting the stage for the final breakdown of Angela’s escape, cooperation with authorities, and the unraveling of the system that failed to stop her abuser.\n\nContent warning: This episode includes discussions of religious abuse, domestic violence, immigration fraud, attempted murder, and systemic failures.",
      "release": "2026-02-10T22:13:18Z",
      "duration": "00:55:09.0340000",
      "explicit": true,
      "spotifyId": "6Z6ndSJ4uvUOy8d6vO9d5z",
      "appleId": 1000749145508,
      "youTubeId": "2iHWFCtD3j4",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Z6ndSJ4uvUOy8d6vO9d5z",
        "apple": "https://podcasts.apple.com/podcast/episode-17-conditioned-to-obey-when-control-follows-you-out/id1851877715?i=1000749145508",
        "youtube": "https://www.youtube.com/watch?v=2iHWFCtD3j4"
      }
    },
    {
      "id": "d762d7de-79ca-4fbd-aa0d-4d4f62f48181",
      "title": "Episode 16: No Safe Distance – When Protection Fails and Survival Becomes the Job",
      "description": "In Episode 16 of Squirrel Brain Stories, Angela reaches the most dangerous and destabilizing chapter of her story. Juan is no longer living in the house, but he is far from gone. What follows is a relentless pattern of stalking, threats, restraining order violations, and systemic failure that leaves Angela and her children unprotected at every level. This episode exposes what happens when the legal system acknowledges danger but still refuses to stop it. Bail Paid, Justice Skipped: Angela reveals that she paid $12,500 in bail to get Juan out of jail after his arrest, money she never recovered because he skipped court entirely. This would not be the last time he was arrested, nor the last time he was inexplicably released. Despite clear patterns of flight and violence, Juan is repeatedly granted bail. Restraining Orders That Don’t Restrain: Angela secures restraining orders. Juan violates them repeatedly. He approaches her in public, tells her he loves her, tries to kiss her. Police are called. He is arrested, fined, and released. The violations continue. Six violations total. Nothing meaningfully changes. Following the Children: Angela believes Juan followed her daughters home from school to locate their new apartment. He later approaches them in public spaces, ignoring active no-contact orders. One incident escalates when he forces one daughter and her friend into his truck, drives them away, confiscates their phones, and terrifies them. She later calls Angela from a McDonald’s and says plainly: “Juan kidnapped me.” Again, nothing happens. Threats of Murder: Juan sends messages claiming Angela is on a hit list and that someone is going to kill her. The district attorney acknowledges he is dangerous. They pay for Angela and the children to stay in a hotel for safety. They install a panic button in her home. But they do not jail him. Kidnapping, Sexual Abuse, and Prosecutorial Failure: Angela details that Juan sexually assaulted her twice. He sexually abused one of their daughters during a kidnapping incident. Despite multiple restraining order violations, child abuse, and animal abuse, the district attorney only pursues two rape charges and one assault charge. Everything else is dropped. A System That Shrugs: Angela and Adria confront the central question of the episode: what is the point of restraining orders when they are violated repeatedly with no consequences? The justice system knows Juan is dangerous. They say it out loud. And still, they allow him to walk free. Flight, Extradition, and More Bail: Juan flees to Mexico after skipping court. U.S. Border Patrol later arrests him crossing back into the U.S. with warrants in both Mexico and Oregon for homicide and rape. He is extradited back to Oregon. And then granted another $500,000 bail. He flees again. The Cost to the Children: The episode culminates in Angela reading a letter written by her daughter in fourth grade. The letter documents self-harm, suicidal ideation, physical abuse, fear, and grief over Juan’s violence toward her and the family dog. The pain is raw. Thedamage is undeniable. The letter ends with a single line: “One day it will change.” Closing the Chapter: Angela makes it clear. Juan is not a father. He is a sperm donor. This episode closes the chapter on his presence in their lives, even as the legal system continues to fail to hold him accountable. What remains is survival, resilience, and the slow work of healing after years stolen by fear. Content Warning: This episode contains discussions of domestic violence, stalking, kidnapping, sexual assault, child abuse, animal abuse, suicide ideation, self-harm, and systemic legal failure. Listener discretion is strongly advised.",
      "release": "2026-02-02T00:50:09Z",
      "duration": "00:58:56.2560000",
      "explicit": true,
      "spotifyId": "2svT7QrlIstC1mEugibJ4r",
      "appleId": 1000747622125,
      "youTubeId": "e92-56HanJU",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2svT7QrlIstC1mEugibJ4r",
        "apple": "https://podcasts.apple.com/podcast/episode-16-no-safe-distance-when-protection-fails-and/id1851877715?i=1000747622125",
        "youtube": "https://www.youtube.com/watch?v=e92-56HanJU"
      }
    },
    {
      "id": "23877b37-28a4-4d1d-9142-51ec5a2b630d",
      "title": "Episode 15: Still Trapped – Control, Surveillance, and Escalating Abuse",
      "description": "Welcome back to Squirrel Brain Stories, hosted by Angela and her co-host Adria.\n\nIn Episode 15, Angela exposes the dangerous illusion that escape had already happened. Despite moments that looked like progress from the outside, control never loosened. Instead, abuse intensified, becoming more invasive, more calculated, and more terrifying.\n\nThis episode centers on how power, manipulation, and fear persist long after violence is exposed and how systems repeatedly fail to intervene until the damage becomes undeniable.\n\nWhen Control Replaces Safety:\nAfter years of instability, Angela attempts to create structure through work and a family business. But behind the appearance of productivity, Juan tightens his grip. Financial dependence, exhaustion, and constant pressure become tools of control rather than paths toward stability.\n\nThe House Becomes a Prison:\nJuan’s behavior escalates from emotional abuse to total surveillance. Cameras are installed throughout the home, including the children’s spaces. Angela describes the terror of being watched, monitored, and controlled remotely, with no privacy and no refuge.\n\nFear Taught and Shared:\nAngela reflects on how Juan’s presence reshaped the emotional climate of the household. The sound of his footsteps triggered panic. Her children learned fear by watching her brace herself. Home was no longer a place of rest but a constant state of alert.\n\nSexual Violence and Power:\nWhen Angela forces Juan to leave, he returns under the cover of night and rapes her. She explains the impossible calculations survivors make in moments like these, choosing silence to protect her children from further harm.\n\nPunishment for Protecting Her Children:\nAs Angela responds to her daughter’s self-harm with care and medical intervention, Juan reacts with cruelty and rage. He dismisses her child’s pain, encourages self-destruction, and lashes out when Angela refuses to comply. This moment becomes a turning point, the first time Angela fully defies him.\n\nSystems That Watch But Don’t Act:\nDHS becomes involved, not as immediate protection, but as observers of a situation already spiraling. Even as evidence of abuse mounts, Angela is left navigating impossible choices alone, balancing safety against retaliation.\n\nControl Without Presence:\nEven after Juan is removed, the abuse does not stop. He continues to exert power through constant phone calls, financial manipulation, intimidation, and legal chaos. His influence stretches across borders, legal systems, and institutions that repeatedly fail to hold him accountable.\n\nSurviving the Escalation:\nThe episode closes with Angela confronting a painful truth. Leaving is not a single act. It is a prolonged, dangerous process that unfolds in stages, often while the abuser becomes more desperate and more violent.\nSurvival, once again, is not about freedom yet. It is about staying alive long enough for control to finally break.\n________________________________________\nContent Warning:\nThis episode contains discussions of domestic abuse, sexual assault, child endangerment, coercive control, surveillance, self-harm, and systemic failure. Listener discretion is strongly advised.",
      "release": "2026-01-25T16:41:49Z",
      "duration": "00:46:04",
      "explicit": false,
      "spotifyId": "3hKON5TKsH53NcCBhEAtxc",
      "appleId": 1000746572981,
      "youTubeId": "j8ESf8rCJSw",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hKON5TKsH53NcCBhEAtxc",
        "apple": "https://podcasts.apple.com/podcast/episode-15-still-trapped-control-surveillance-and/id1851877715?i=1000746572981",
        "youtube": "https://www.youtube.com/watch?v=j8ESf8rCJSw"
      }
    },
    {
      "id": "5886c526-a915-4a2c-8a5d-622c5ce13205",
      "title": "Episode 14: Built to Obey – Fraud, Control, and a Life Inside Constant Illegality",
      "description": "Welcome back to Squirrel Brain Stories, hosted by Angela and her co-host Adria.\nIn Episode 14, Angela exposes how abuse is not only personal, but systemic. This episode details the relentless control exerted by Juan through fear, fraud, religious indoctrination, and constant criminal behavior. What looks like stability fromthe outside is, in reality, a life built on illegality, intimidation, and enforced obedience.\nThis is the episode where the pattern becomes undeniable.\nA Foundation Built on Submission:\nAngela explains how the cult’s teachings created the blueprint for abuse. “Obey your husband” and “be submissive” were not metaphors, they were rules. These beliefs shaped Juan’s sense of entitlement to control every aspect of her life, from money to movement to emotion.\nFinancial Fraud as Control:\nJuan’s involvement with sketchy home loan companies and fraudulent financial activity keeps Angela trapped in fear. Mortgages, paperwork, and debt become weapons.She describes living inside constant anxiety, knowing that exposure could destroy what little stability she was trying to build.\nWorking With the FBI:\nAs Juan’s illegal activity escalates, Angela cooperates with federal authorities. She describes the terror of working with the FBI while still living under the same roof as the man she is helping investigate. The danger is no longer theoretical, it is immediate and constant.\nViolence in the Home:\nJuan’s control turns physical. Angela recounts his violence toward her older sons and the family dog, moments that shatter any remaining illusion that the abuse is contained or manageable. Protection becomes impossible when the threat lives inside the home.\nControl Through Humiliation:\nAngela describes how Juan polices even joy. Christmas gifts are returned because he disapproves. Vacations are ruined by his rage, restrictions, and constant monitoring. Celebration itself becomes a violation of his authority.\nA Double Life:\nJuan spends extended time away, particularly in Portland, leaving Angela to suspect infidelity while she manages the household alone. His absence does not bring relief. It brings abandonment layered on top of control.\nSan Francisco: Alone in Everything:\nAngela details the move to San Francisco, where she handles childcare, a new job, and daily survival in a hostile, unfamiliar neighborhood while Juan remains behind. She is functionally a single parent, yet still subject to his demands, criticism, and manipulation from afar.\nIllegality as Atmosphere:\nWhat emerges is a life lived inside nonstop wrongdoing. Fraud, threats, infidelity, violence, intimidation, and religious justification overlap until fear becomes the norm. Angela reflects on how living inside constant illegality distorts reality, making survival feel like compliance.\nWhen Obedience Starts to Crack:\nThe episode closes as Angela begins to recognize the lie she was taught. Submission was never protection. Obedience never stopped the violence. And staying compliant has cost more than leaving ever could.\nContent Warning:\nThis episode contains discussions of domestic abuse, coercive control, financial fraud, religious indoctrination, violence toward children and animals, infidelity, intimidation, and systemic failure. Listener discretion is strongly advised.",
      "release": "2026-01-19T04:13:47Z",
      "duration": "00:51:11",
      "explicit": false,
      "spotifyId": "0a0sljG1G1IVDTtjZvRHfa",
      "appleId": 1000745687972,
      "youTubeId": "HJgT104wR4M",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0a0sljG1G1IVDTtjZvRHfa",
        "apple": "https://podcasts.apple.com/podcast/episode-14-built-to-obey-fraud-control-and-a/id1851877715?i=1000745687972",
        "youtube": "https://www.youtube.com/watch?v=HJgT104wR4M"
      }
    },
    {
      "id": "8fedcb29-4e68-44a8-86f2-109fcf9171f5",
      "title": "Episode 13: No Protection – Cult Conditioning, Illegality, and Abuse at Home",
      "description": "Welcome back to Squirrel Brain Stories, hosted by Angela and her co-host Adria.\n\nIn Episode 13, Angela exposes how leaving a cult did not mean leaving control behind. This episode traces the direct line between cult indoctrination, immigration vulnerability, and the abusive marriage that followed. What replaces religious authority is not freedom, but a different man enforcing the same rules through fear, illegality, and violence.\n\nThis episode reveals how abuse thrives when systems are afraid to look too closely.\n\nBuilt by the Cult:\nAngela explains how the cult’s teachings laid the groundwork for everything that came next. Obedience, submission, and silence were not abstract values, they were survival requirements. These beliefs shaped her expectations of marriage, normalized control, and trained her to endure harm without questioning it.\n\nIllegality as Environment:\nFrom the beginning, Angela’s life with Juan is surrounded by constant illegal activity. Immigration fraud, undocumented family members, and criminal associations become routine. Fear of law enforcement is ever-present, ensuring silence even when abuse escalates.\n\nCoyotes and Human Smuggling:\nAngela recounts Juan’s involvement in arranging coyotes to bring family members across the border. When one brother is held hostage at a safe house, ransom demands follow. Smuggling, extortion, and risk are treated as logistical problems, not moral lines.\n\nImmigration Fraud and Betrayal:\nAn “immigration friend” is used to manipulate the system. Coyotes are turned in mid-transaction. Family members skip court, violate release conditions, and re-enter the country illegally after deportation. Loyalty is nonexistent. Survival is transactional.\n\nGiving Birth Alone:\nJuan does not show up for the birth of their daughter, choosing sleep over support. Angela gives birth alone, surrounded by coworkers who know she should not be. The humiliation and abandonment leave a permanent mark.\n\nControl After Childbirth:\nWhen Angela is discharged from the hospital, Juan immediately reasserts control. Instead of rest or care, she is ordered to go home and cook dinner. Hunger, pain, and recovery are irrelevant. Obedience is expected even after childbirth.\n\nViolence in the Home:\nJuan’s abuse is not evenly distributed. Angela describes how her older sons are physically abused, while his biological children are spared. Violence becomes normalized, labeled as “bearable” because it does not always leave visible damage.\n\nSurveillance and Psychological Abuse:\nAngela lives under constant monitoring. She must be home by exact times. Traffic delays trigger rage. Her phone use, household cleanliness, and daily movements are controlled. Peace exists only when she is compliant.\n\nFraud as a Way of Life:\nInsurance fraud schemes circulate among Juan’s associates. Staged accidents and scams are discussed casually. Criminal behavior is normalized and considered a viable solution to financial stress.\n\nSurvival Mode:\nBy the end of the episode, Angela describes living entirely in avoidance. Her goal is not happiness or safety, but keeping the peace. Abuse is constant. Drama is inevitable. Survival means staying small, quiet, and alert.\n\nThe episode closes with a realization that leaving the cult never dismantled the system that controlled her. It simply changed who held the power.\n________________________________________\nContent Warning:\nThis episode contains discussions of cult indoctrination, domestic abuse, physical violence toward children, coercive control, immigration fraud, human smuggling, postpartum neglect, medical trauma, and systemic failure. Listener discretion is strongly advised.\n________________________________________\nConnect \u0026 Follow:\nFacebook: https://www.facebook.com/SquirrelBrainStories\nInstagram: https://www.instagram.com/squirrelbrainstories\nTikTok: https://www.tiktok.com/@squirrelbrainstories\nEmail: squirrelbrainstories@gmail.com",
      "release": "2026-01-11T18:35:31Z",
      "duration": "00:48:43.0930000",
      "explicit": true,
      "spotifyId": "5yknOC2BMVQW4PWbqJvF1n",
      "appleId": 1000744703313,
      "youTubeId": "TzXFYOzDoYc",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5yknOC2BMVQW4PWbqJvF1n",
        "apple": "https://podcasts.apple.com/podcast/episode-13-no-protection-cult-conditioning-illegality/id1851877715?i=1000744703313",
        "youtube": "https://www.youtube.com/watch?v=TzXFYOzDoYc"
      }
    },
    {
      "id": "abf40a4e-1dae-4b60-b75e-cdd1ef2f31bb",
      "title": "Episode 12: No Safe Border – Escape, Corruption, and the Cost of Survival",
      "description": "Welcome back to Squirrel Brain Stories, hosted byAngela and her co-host Adria.\nIn this devastating continuation, Angela recounts theaftermath of extreme violence and the reality of survival when escape does not lead to safety. Episode 12 exposes how corruption, fear, and institutional failure followed Angela across borders, forcing impossible choices that no oneshould ever have to make.\n\nWhen Chaos Becomes Normal:Angela describes being pregnant, barefoot, and holding an AK-47 as an angry crowd gathered outside her home. What should have been unthinkable had become routine. Survival instincts replace fear when danger is constant andunavoidable.\n\nThe Violence Comes Into Focus:The story unfolds to reveal the full scope of what had occurred. An attempted murder using a Molotov cocktail, enraged neighbors, corrupt police, and a frantic escape through backyards with small children. Angela recounts narrowly avoiding a shootout that would have almost certainly killed them.\n\nHiding Is Not Safety:While in hiding in Mérida, Angela’s young daughter becomes critically ill after exposure to rotavirus. Angela navigates a medical system that requires payment before release, even as her child is hospitalized. With no money and no options, she sells her jewelry to leave the hospital with her daughter alive.\n\nCorruption at Every Level:Angela exposes how deeply corruption ran through family, legal systems, and government institutions. Lawyers and officials who should have intervened instead helped hide a violent fugitive, creating layers of protection for someone who should have been stopped long before.\n\nAn Impossible Choice:Desperate to escape, Angela returns alone to the United States while heavily pregnant, leaving her children behind in hiding. She describes overstaying her visa, paying steep fines, and navigating immigration systems that offered no flexibility or compassion.\n\nLuck Replaces Justice:The return to the U.S. hinges not on accountability, but on luck. Temporary plexiglass replaces shattered windows. Border agents overlook expired documents. A single phone call clears a man with a history of extreme violence and attempted murder, highlighting how easily systems bend for the wrongpeople.\n\nNo Resolution, Only Survival:Back in Portland, Angela describes starting over without stability, finding housing while unemployed, and entering another phase of chaos. Violence does not disappear, it simply changes form. What once felt intolerable now feels survivable by comparison, a reflection of how trauma reshapes boundaries.\n\nRefusing Silence:The episode closes with reflection rather than closure. Angela speaks openly about the emotional toll of telling this story and the decision to stop protecting those who caused harm by staying quiet. Survival, she explains, is not a single escape, but a series of impossible choices made inside systems that repeatedly fail.\nContent Warning:This episode contains discussions of domestic abuse,  attempted murder, firearms, child endangerment, medical trauma, immigration violations, and systemic corruption. Listener discretion is strongly advised.\nConnect \u0026 Follow:\nFacebook: https://www.facebook.com/SquirrelBrainStoriesInstagram: https://www.instagram.com/squirrelbrainstoriesTikTok: https://www.tiktok.com/@squirrelbrainstoriesEmail: squirrelbrainstories@gmail.com",
      "release": "2026-01-05T06:07:26Z",
      "duration": "00:43:43",
      "explicit": false,
      "spotifyId": "0Q4aZoUGmsC10akWEeXACg",
      "appleId": 1000743771765,
      "youTubeId": "noc1GlqAG-U",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Q4aZoUGmsC10akWEeXACg",
        "apple": "https://podcasts.apple.com/podcast/episode-12-no-safe-border-escape-corruption-and-the/id1851877715?i=1000743771765",
        "youtube": "https://www.youtube.com/watch?v=noc1GlqAG-U"
      }
    },
    {
      "id": "9e473fe6-f0e7-4abd-9f71-57d7b8e7c842",
      "title": "Episode 11: Crossing the Line – Violence, Survival, and the Illusion of Safety",
      "description": "Welcome back to Squirrel Brain Stories.\nIn Episode 11, Angela and her co-host Adria move deeper intoone of the most volatile and dangerous chapters of Angela’s life: her second marriage and the slow realization that what once looked like protection was actually another form of control.\nPicking up after Angela’s escape from her pre-arrangedmarriage, this episode follows her vulnerable transition into what she believed was safety. A man who initially appeared protective and supportive soon revealed a pattern of escalating violence, criminal behavior, and chaos thatwould ultimately place Angela and her children in constant danger.\nThe Savior Illusion:Angela reflects on how easy it was to mistake aggression for protection after years of abuse. For the first time, someone was standing up for her, retaliating against her abuser, and making her feel defended. But underneath that “savior” role was a growing pattern of cruelty, impulsive violence, and acomplete disregard for collateral damage.\nEscalation and Red Flags:As the relationship progresses, Angela recounts increasingly alarming behavior: stalking, vandalism, weapon intimidation, and reckless acts carried out under the guise of loyalty and love. These moments mark the beginning of a realization that this relationship was not safer, just different.\nFlight to Mexico:Believing distance would bring peace, Angela agrees to relocate to Mexico. Instead, the danger intensifies. She describes living under constant threat, harassment by corrupt authorities, armed confrontations, and violent retaliation involving multiple parties. Angela was pregnant, isolated, andresponsible for protecting her children in an environment where law enforcement offered no protection.\nSurvival Mode:This episode captures what it means to live in prolonged survival mode. Angela explains how extreme stress, normalized chaos, and learned tolerance for danger kept her functioning even as her safety steadily eroded. What might seem unimaginable from the outside had become routine to someone conditioned by years of trauma.\nSetting the Stage:Episode 11 ends with Angela and Adria pausing just before one of the most pivotal moments yet, an act of violence that will force everything to change. \nThe story continues in the next episode.\n\nContent Warning\nThis episode contains discussions of domestic abuse, sexualviolence, firearms, criminal behavior, threats to children, and systemic failure to protect victims. Listener discretion is strongly advised.\n\nConnect \u0026 Follow:\nFacebook: https://www.facebook.com/SquirrelBrainStories\nInstagram: https://www.instagram.com/squirrelbrainstories\nTikTok: https://www.tiktok.com/@squirrelbrainstories\nEmail: squirrelbrainstories@gmail.com",
      "release": "2025-12-28T23:59:52Z",
      "duration": "00:52:20",
      "explicit": false,
      "spotifyId": "506XCWZzzIN1qxDe6WdUKq",
      "appleId": 1000742988851,
      "youTubeId": "dZsuGaqSZzs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/506XCWZzzIN1qxDe6WdUKq",
        "apple": "https://podcasts.apple.com/podcast/episode-11-crossing-the-line-violence-survival/id1851877715?i=1000742988851",
        "youtube": "https://www.youtube.com/watch?v=dZsuGaqSZzs"
      }
    },
    {
      "id": "8b5d5e21-c103-4571-b5b5-8a1565b38a5e",
      "title": "Episode 10: The Christmas Episode: Breaking the Cycle",
      "description": "Welcome to a very special episode of Squirrel Brain Stories, hosted by Angela and Adria.\n\nAs we navigate the holiday season, we take a moment to reflect on the emotional and psychological reality of life after the cult. This episode serves as both a \u0022Christmas Special\u0022 and a deep-dive into the \u0022why\u0022 behind this entire project.\n\nThe Holiday Contrast: Angela discusses the surreal experience of celebrating Christmas as a survivor—navigating the transition from a world where joy was controlled to a world where she creates it for her family.\n\nThe Ultimate Gift: Clarity: The heart of this episode is Angela\u0027s children. We explore how this podcast isn\u0027t just for the public—it\u0027s a historical record for her kids to understand the parts of their lives (and hers) that they were too young to remember (46:17).\n\nBreaking the Generational Chain: Angela and Adria discuss the heavy lifting required to ensure the trauma of the cult and the \u0022Predators\u0022 ends with this generation.\n\nA Community of Healing: A heartfelt thank you to the listeners and fellow survivors who have reached out, proving that while the cult thrived on isolation, recovery thrives on community (05:40).\n\nThis episode is a testament to resilience and a reminder that the truth is the only way to truly \u0022adult\u0022 after a life of captivity.\n\nContent Warning: This episode discusses emotional abuse, family betrayal, and the psychological impact of cult life on parenting.\n\nConnect \u0026 Follow:\nFacebook: https://www.facebook.com/SquirrelBrainStories\nInstagram: https://www.instagram.com/squirrelbrainstories\nTikTok: https://www.tiktok.com/@squirrelbrainstories\nEmail: squirrelbrainstories@gmail.com",
      "release": "2025-12-23T18:25:41Z",
      "duration": "00:47:23",
      "explicit": false,
      "spotifyId": "5JhftYpmhRiXTNa4h4EysW",
      "appleId": 1000742497857,
      "youTubeId": "-Af7SP3S2Ks",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5JhftYpmhRiXTNa4h4EysW",
        "apple": "https://podcasts.apple.com/podcast/episode-10-the-christmas-episode-breaking-the-cycle/id1851877715?i=1000742497857",
        "youtube": "https://www.youtube.com/watch?v=-Af7SP3S2Ks"
      }
    },
    {
      "id": "0fdaf059-e330-444c-b56b-7d1a27386b4e",
      "title": "Episode 9: Dear Dick: A Response to Your Temper Tantrum",
      "description": "Welcome back to Squirrel Brain Stories, hosted by Angela and Adria.\nIn this special episode, we address the \u0022elephant in the room.\u0022 After several episodes exposing the inner workings of the cult and the personal abuse Angela endured, a certain individual—referred to here as \u0022Dick\u0022—has attempted to use intimidation and legal threats to shut us down.\n\nIt didn\u0027t work.\n\nThe \u0022Cease and Desist\u0022 Fallacy: Angela and Adria discuss the recent attempts to silence the podcast and why these \u0022temper tantrums\u0022 only reinforce the necessity of telling the truth (01:45).\n\nThe \u0022Prearranged\u0022 vs. The \u0022Ex\u0022: We clarify the distinction between the first (prearranged) husband and the second (ex) husband, and why his specific brand of psychological control is no longer effective (05:22).\n\nIdentity Reclaimed: Angela speaks directly to her former abuser, explaining that while he spent years trying to make her feel like \u0022nothing,\u0022 her voice is now louder than his fear (15:30).\n\nNot For You, But For Us: A firm reminder that this podcast is not an invitation for a debate—it is a memoir for the survivor and a lighthouse for those still trapped in high-control groups (19:50).\n\nUnshakable Resolve: \u0022Intimidate me all you want... I\u0027m going to continue telling my story whether you like it or not\u0022 (20:14).\n\nThis episode is about the power of the word \u0022No\u0022 and the refusal to let an abuser edit your history.\n\nContent Warning: This episode discusses legal intimidation, emotional abuse, and the psychological tactics used by narcissists to silence victims.\n\nConnect \u0026 Follow:\nFacebook: https://www.facebook.com/SquirrelBrainStories\nInstagram: https://www.instagram.com/squirrelbrainstories\nTikTok: https://www.tiktok.com/@squirrelbrainstories\nEmail: squirrelbrainstories@gmail.com",
      "release": "2025-12-22T23:12:46Z",
      "duration": "00:21:22",
      "explicit": false,
      "spotifyId": "5hUyR89zrpiuWdyUr2WvOb",
      "appleId": 1000742388614,
      "youTubeId": "RUK4Gp_vVJ4",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5hUyR89zrpiuWdyUr2WvOb",
        "apple": "https://podcasts.apple.com/podcast/episode-9-dear-dick-a-response-to-your-temper-tantrum/id1851877715?i=1000742388614",
        "youtube": "https://www.youtube.com/watch?v=RUK4Gp_vVJ4"
      }
    },
    {
      "id": "7cd21f10-74ee-4e38-a653-8c689a9efc6d",
      "title": "Episode 8: The Broken Dam - Reclaiming Identity, Learned Helplessness, and The Journey to Adulthood",
      "description": "Welcome back to Squirrel Brain Stories, hosted byAngela and her husband, Buck. In this crucial episode, Angela and Buck shift focus fromthe trauma of the past to the psychological reality of the present, exploring the complex journey of healing and self-discovery after years in a high-control cult. The Safe Space: Angela shares why she brought Buckinto the conversation: his role as a safe, non-dictatorial partner was essential for her to finally feel safe enough to heal and \u0022expand her wings\u0022 (00:46). Identity Stripped: The hosts discuss how totalsurveillance (cameras in bedrooms) and dictatorial marriages left Angela feeling like a \u0022prisoner\u0022 who did not know her own identity, interests, or autonomy (01:38). Repetition Compulsion \u0026 Learned Helplessness:Buck introduces key psychiatric concepts to explain the cycle: Repetition Compulsion (the unconscious drive to return to a familiar, controlling situation) and Learned Helplessness (the inability to make decisions due to conditioning) (21:30 - 25:00). The Emotional Breakthrough: Angela describes the \u0022Broken Dam\u0022 moment—the terrifying rush of bottled-up anger, grief, and shame that finally broke open when she realized she could tell her story. This emotional processing is the true starting point of her recovery (16:01). Adulting 101: They conclude by comparing thechallenge of recovery to that of an individual released from prison: having to \u0022adult one on one\u0022 and discover basic life skills and interests (like making soap or planning a vineyard) for the very first time. Content Warning: This episode discusses severe emotional processing, deep-seated trauma, and psychological concepts related to abuse survival. Please practice self-care. Connect \u0026 Follow: Facebook: https://www.facebook.com/SquirrelBrainStories Instagram: https://www.instagram.com/squirrelbrainstories TikTok: https://www.tiktok.com/@squirrelbrainstories Email: squirrelbrainstories@gmail.com",
      "release": "2025-12-20T21:52:56Z",
      "duration": "00:43:35.8720000",
      "explicit": true,
      "spotifyId": "4mZaxcK2cIKW1BW1t3dFkO",
      "appleId": 1000742146481,
      "youTubeId": "grUMttFWlrs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mZaxcK2cIKW1BW1t3dFkO",
        "apple": "https://podcasts.apple.com/podcast/episode-8-the-broken-dam-reclaiming-identity-learned/id1851877715?i=1000742146481",
        "youtube": "https://www.youtube.com/watch?v=grUMttFWlrs"
      }
    },
    {
      "id": "9594ec7d-dd6b-4196-8c7a-e451cee08891",
      "title": "Episode 7: RICO, Smuggling, and Sexual Assault: Why Did Authorities Ignore the Cult\u0027s Criminal Empire?",
      "description": "Welcome back to Squirrel Brain Stories, hosted byAngela and Buck. In this pivotal episode, we pivot from personal trauma toinstitutional failure, revealing the explosive public documents that validate Angela\u0027s story. The Paper Trail of Felonies: We examine newspaperclippings (on-screen!) confirming that cult leaders were federally charged with alien smuggling, and the primary leader was indicted for sexual assault (03:02). The RICO Question: Buck and Angela discuss the depthof the criminal enterprise, outlining how the fraud (forgery, tax evasion), human smuggling, and sexual exploitation should have warranted a massive RICO (Racketeering) investigation but were treated as minor crimes (04:19,13:26). Institutional Betrayal: Angela and Buck expose themonumental failure of Immigration and Customs Enforcement (ICE), which used Angela as a confidential informant against her First Husband (Luis Rojas), and then allowed The Oregonian newspaper to print her name,putting her life in immediate danger (34:36). The Danger of the Border: We discuss how the cult leveraged unregulated border crossings to recruit new members into a system of indentured servitude and exploitation, capitalizing on the migrants’ fear of deportation (39:04). Content Warning: This episode contains explicit discussion of organized crime, sexual assault, human smuggling, institutional failure, and threats of violence. Please exercise extreme caution and seek professional support if needed. Connect \u0026 Follow: Facebook: https://www.facebook.com/SquirrelBrainStories Instagram: https://www.instagram.com/squirrelbrainstories TikTok: https://www.tiktok.com/@squirrelbrainstories Email: squirrelbrainstories@gmail.com",
      "release": "2025-12-13T23:35:36Z",
      "duration": "00:54:48.7460000",
      "explicit": true,
      "spotifyId": "766FUvis6v1DWG3zXX30dC",
      "appleId": 1000741169450,
      "youTubeId": "-J6h_eXeLgU",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/766FUvis6v1DWG3zXX30dC",
        "apple": "https://podcasts.apple.com/podcast/episode-7-rico-smuggling-and-sexual-assault-why-did/id1851877715?i=1000741169450",
        "youtube": "https://www.youtube.com/watch?v=-J6h_eXeLgU"
      }
    },
    {
      "id": "06686d58-3055-4eae-9e15-e188f5123e12",
      "title": "Episode 6: The Cult\u0027s Cash Cow: Smuggling, Indentured Servitude, and The $450 Tithe",
      "description": "Welcome back to Squirrel Brain Stories, hosted byAngela and Adria. In this explosive episode, Angela reveals the financial andcriminal mechanisms that powered the cult\u0027s rapid expansion from three unassuming houses in Portland to operations in Seattle and Hawaii. Cult Logistics \u0026 Finances: Angela details the group\u0027s hierarchy, the constantly changing names (Messengers of the Cross, Our Daily Bread), and the system where each working member paid a mandatory $450 - $500 monthly tithe (09:41), providing the capital to purchase multiple homes. Human Smuggling Racket: The episode exposes theorganization\u0027s involvement in human trafficking and indentured servitude (30:38). Leaders would orchestrate smuggling trips to bring new, non-English-speaking members across the border, immediately placing them in debt to the cult. The New Predator: Despite successfully divorcing herfirst abuser (the \u0022Smurf\u0022), Angela immediately falls into the hands of a second, more violent partner—a man she viewed as a \u0022safe person\u0022 (47:20) who was also associated with the cult. The Cycle of Control: The hosts analyze how years ofconditioning forced Angela to seek a new authoritarian \u0022safe space\u0022 rather than true independence, leading her into the hands of a man who got her pregnant within a month and continued the cycle of financial, physical, emotional abuse and total control. This episode is a stark look at how cults operate ascriminal enterprises, using shame, poverty, and isolation to maintain absolute control. Content Warning: This episode contains explicitdiscussion of organized crime, human trafficking, financial abuse, and sexual abuse themes. Please exercise extreme caution and seek professional support if needed.",
      "release": "2025-12-07T20:00:00Z",
      "duration": "00:50:44.9700000",
      "explicit": true,
      "spotifyId": "5e5LRmkZhrDYiFH6Id3Gs6",
      "appleId": 1000739052935,
      "youTubeId": "xOb4Kp5tSlo",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5e5LRmkZhrDYiFH6Id3Gs6",
        "apple": "https://podcasts.apple.com/podcast/episode-6-the-cults-cash-cow-smuggling-indentured/id1851877715?i=1000739052935",
        "youtube": "https://www.youtube.com/watch?v=xOb4Kp5tSlo"
      }
    },
    {
      "id": "c2063d31-cbfb-48db-85d5-9694b26c4ae0",
      "title": "Episode 5: Married Life at 16 - Abuse, Pregnancy, and the Hospital’s Failure",
      "description": "Welcome back to Squirrel Brain Stories, hosted by Angela and Adria. In this pivotal, heart-stopping episode, Angela recounts the darkest period of her arranged marriage: the psychological and physical abuse she endured while pregnant and postpartum, revealing the failures of systems meant to protect her. Abuse During Pregnancy: Angela details the extreme violence she faced during pregnancy, including physical assaults and spousal rape (13:16). She shares the terrifying moments of contemplating suicide as her only escape (26:34). Institutional Failure: The hosts discuss how hospital nurses and medical staff at Legacy Good Samaritan Hospital saw visible finger-mark bruises on Angela\u0027s arms but failed to intervene privately, forcing her to lie in front of her abuser and risking further harm (27:20). The Financial Trap: The husband enforced financial slavery, leaving Angela pregnant with only instant noodles and expired conchas for food and zero access to the money she earned (37:16). The Path to Freedom: Angela reveals the non-single event that finally broke the cycle: the chilling realization that her husband posed a risk to her son, prompting her resourceful and secretive plan to save $20 from every paycheck to pay for her divorce lawyer (36:29, 46:16). This episode is a raw look at survival, a call for mandatory reporting and awareness, and the incredible, persistent strength required to break the chain of abuse. Content Warning: This episode contains explicit discussion of domestic violence, sexual assault, suicidal ideation, child abuse themes, and medical/institutional failure. Please exercise extreme caution and seek professional support if needed.",
      "release": "2025-11-30T19:41:28Z",
      "duration": "00:48:36.3730000",
      "explicit": true,
      "spotifyId": "7cr9frEPrSVuxDPM4gX6GX",
      "appleId": 1000739024390,
      "youTubeId": "OlG3VpEJBy4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7cr9frEPrSVuxDPM4gX6GX",
        "apple": "https://podcasts.apple.com/podcast/episode-5-married-life-at-16-abuse-pregnancy-and/id1851877715?i=1000739024390",
        "youtube": "https://www.youtube.com/watch?v=OlG3VpEJBy4"
      }
    },
    {
      "id": "aaf7964b-8173-4dfa-b792-22ccb3dc4eab",
      "title": "Episode 4: Strangled on the Wedding Night: Child Marriage, Cultural Erasure, and the Idaho Loophole",
      "description": "Welcome back to Squirrel Brain Stories, hosted byAngela and Adria. In this pivotal, heart-wrenching episode, Angela recountsher forced transition from the cult\u0027s house into an arranged marriage that quickly became abusive. This story reveals how her identity was systematically stripped away by the group: This is a powerful story of survival, resourcefulness, andthe enduring fight against control. Find and Connect with Squirrel Brain Stories Listen on Major Platforms: Spotify, YouTube and Apple Podcasts. Connect \u0026 Follow: Find us on Facebook, Instagram, TikTok and X email: squirrelbrainstories@gmail.com",
      "release": "2025-11-23T18:49:08Z",
      "duration": "00:46:08.4480000",
      "explicit": true,
      "spotifyId": "2t79Gax6IR0KADbG8OxvCn",
      "appleId": 1000738017724,
      "youTubeId": "VieQQFmpR2o",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2t79Gax6IR0KADbG8OxvCn",
        "apple": "https://podcasts.apple.com/podcast/episode-4-strangled-on-the-wedding-night-child/id1851877715?i=1000738017724",
        "youtube": "https://www.youtube.com/watch?v=VieQQFmpR2o"
      }
    },
    {
      "id": "3b0094d6-4e54-4123-acf7-8a49c476faf6",
      "title": "Episode 3: Cult Control: The Junk Food Diet, Dehumanizing Schedule, and Brothers Creepers",
      "description": "Welcome back to Squirrel Brain Stories. In this deeply disturbing episode, Angela and Adria dive into the daily operational mechanics of the cult and how a lack of structure in childhood was weaponized into extreme control. This episode reveals the shocking realities of life inside the multi-house compound: The Food Weapon: Angela details how abundant donations of junk food (muffins, sheet cakes) were used to create a cycle of shame and dependency, leading to rapid weight gain and psychological degradation, while necessary protein was scarce (07:01). The Schedule of Erasure: The hosts discuss the exhausting, non-stop schedule of Bible study and labor, designed to keep members compliant, exhausted, and unable to think clearly (10:42). There was virtually no personal time (28:46). Sexual Misconduct \u0026 Brothers Creepers: Angela bravely recounts specific, horrifying incidents of sexual harassment and assault by older men (the \u0022Brothers Creepers\u0022) within the cult, including why she froze and why other members, conditioned by the leadership, failed to intervene (35:03). The Illusion of Protection: The episode confronts the cult’s psychological abuse, particularly the trauma of making the victims feel that the abuse was their fault—a form of psychological torture and victim blaming that kept the structure intact (41:19). Content Warning: This episode contains explicit discussion of childhood neglect, sexual harassment, abuse, and cult-related trauma. Please practice self-care, stay hydrated, and pause if needed.",
      "release": "2025-11-16T19:41:22Z",
      "duration": "00:45:53.0020000",
      "explicit": true,
      "spotifyId": "7LmqSIeJOcbyCa9DpCkw7g",
      "appleId": 1000736984355,
      "youTubeId": "A8hWbJYLRlM",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7LmqSIeJOcbyCa9DpCkw7g",
        "apple": "https://podcasts.apple.com/podcast/episode-3-cult-control-the-junk-food-diet/id1851877715?i=1000736984355",
        "youtube": "https://www.youtube.com/watch?v=A8hWbJYLRlM"
      }
    },
    {
      "id": "74742fe8-8fba-4969-b007-6f77631bc66e",
      "title": "Episode 2: Dropped Off and Powerless",
      "description": "Ange and Adria continue the story immediately after Ange is taken from school. The conversation details the chilling moment she was dropped off at a religious cult by her mother and stepfather, armed with nothing but a school backpack and no explanation. Ange shares the overwhelming shock of facing an extreme language barrier (95% Spanish-speaking community) and the instant realization of being completely powerless. She recalls the first words spoken to her: \u0022No, you don\u0027t. Not anymore,\u0022 regarding her bedtime. The episode outlines the rigid daily routine of constant Bible study (morning, personal, afternoon, and evening) that replaced her schooling. Finally, Ange discusses the long-term impact of this survival mode, how she finally began to process the grief of her lost childhood and estranged relationships, and why she is speaking out now: to dismantle the harmful narrative that asks, \u0022Why didn\u0027t you just leave sooner?\u0022",
      "release": "2025-11-09T20:37:34Z",
      "duration": "00:56:37.1620000",
      "explicit": true,
      "spotifyId": "5GvUt8CzYOJREaUhC77P3a",
      "appleId": 1000736003627,
      "youTubeId": "jHtxkXQh8QM",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GvUt8CzYOJREaUhC77P3a",
        "apple": "https://podcasts.apple.com/podcast/episode-2-dropped-off-and-powerless/id1851877715?i=1000736003627",
        "youtube": "https://www.youtube.com/watch?v=jHtxkXQh8QM"
      }
    },
    {
      "id": "9f2f4d73-b35b-4096-8267-ecfeaa8196d2",
      "title": "Episode 1: \u0022Feral Child\u0022 and The Butcher Knife",
      "description": "Hosts Ange and Adria begin the series by laying the groundwork for Ange’s journey: growing up as a \u0022feral child\u0022 who essentially raised herself while her mother was mostly absent. They discuss a childhood defined by a lack of adult supervision, learning to cook for herself as soon as she could read a brownie box, and her mother\u0027s tumultuous relationships. The conversation delves into deeply troubling events, including: * An incident where a stepfather attacked the blanket covering Ange with a butcher knife while she slept.* Encounters with dangerous individuals, including a creepy neighbor who attempted to coerce her.* A bizarre situation where Ange and her brother were kidnapped by their mother from a babysitter and later sent back home by police on an airplane. The episode concludes with the escalating conflict that led to Ange hitting her mother and the subsequent decision to send her away to a \u0022cult\u0022. (Content Warning: This episode discusses child neglect, abuse, and trauma. Please prioritize your mental health before listening.)",
      "release": "2025-11-02T20:37:03Z",
      "duration": "00:51:51.3600000",
      "explicit": true,
      "spotifyId": "4tBt2WTBeoTIEEczxyF1oG",
      "appleId": 1000736003376,
      "youTubeId": "fD9MPHWGpYQ",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4tBt2WTBeoTIEEczxyF1oG",
        "apple": "https://podcasts.apple.com/podcast/episode-1-feral-child-and-the-butcher-knife/id1851877715?i=1000736003376",
        "youtube": "https://www.youtube.com/watch?v=fD9MPHWGpYQ"
      }
    }
  ]
}