{
  "id": "d08e1c41-82b5-4839-bb6b-a6b9da63e711",
  "name": "Squirrel Brain Stories",
  "spotifyId": "3ExeitUrpNJD0f8gEyQwNv",
  "appleId": 1851877715,
  "youTubeChannelId": "UCa6-lAOj5NWrkhXjs-nTWPQ",
  "episodes": [
    {
      "id": "8b5d5e21-c103-4571-b5b5-8a1565b38a5e",
      "title": "Episode 10: The Christmas Episode: Breaking the Cycle",
      "description": "Welcome to a very special episode of Squirrel Brain Stories, hosted by Angela and Adria.\n\nAs we navigate the holiday season, we take a moment to reflect on the emotional and psychological reality of life after the cult. This episode serves as both a \u0022Christmas Special\u0022 and a deep-dive into the \u0022why\u0022 behind this entire project.\n\nThe Holiday Contrast: Angela discusses the surreal experience of celebrating Christmas as a survivor—navigating the transition from a world where joy was controlled to a world where she creates it for her family.\n\nThe Ultimate Gift: Clarity: The heart of this episode is Angela\u0027s children. We explore how this podcast isn\u0027t just for the public—it\u0027s a historical record for her kids to understand the parts of their lives (and hers) that they were too young to remember (46:17).\n\nBreaking the Generational Chain: Angela and Adria discuss the heavy lifting required to ensure the trauma of the cult and the \u0022Predators\u0022 ends with this generation.\n\nA Community of Healing: A heartfelt thank you to the listeners and fellow survivors who have reached out, proving that while the cult thrived on isolation, recovery thrives on community (05:40).\n\nThis episode is a testament to resilience and a reminder that the truth is the only way to truly \u0022adult\u0022 after a life of captivity.\n\nContent Warning: This episode discusses emotional abuse, family betrayal, and the psychological impact of cult life on parenting.\n\nConnect \u0026 Follow:\nFacebook: https://www.facebook.com/SquirrelBrainStories\nInstagram: https://www.instagram.com/squirrelbrainstories\nTikTok: https://www.tiktok.com/@squirrelbrainstories\nEmail: squirrelbrainstories@gmail.com",
      "release": "2025-12-23T18:25:41Z",
      "duration": "00:47:23",
      "explicit": false,
      "spotifyId": "5JhftYpmhRiXTNa4h4EysW",
      "appleId": 1000742497857,
      "youTubeId": "-Af7SP3S2Ks",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5JhftYpmhRiXTNa4h4EysW",
        "apple": "https://podcasts.apple.com/podcast/episode-10-the-christmas-episode-breaking-the-cycle/id1851877715?i=1000742497857",
        "youtube": "https://www.youtube.com/watch?v=-Af7SP3S2Ks"
      }
    },
    {
      "id": "0fdaf059-e330-444c-b56b-7d1a27386b4e",
      "title": "Episode 9: Dear Dick: A Response to Your Temper Tantrum",
      "description": "Welcome back to Squirrel Brain Stories, hosted by Angela and Adria.\nIn this special episode, we address the \u0022elephant in the room.\u0022 After several episodes exposing the inner workings of the cult and the personal abuse Angela endured, a certain individual—referred to here as \u0022Dick\u0022—has attempted to use intimidation and legal threats to shut us down.\n\nIt didn\u0027t work.\n\nThe \u0022Cease and Desist\u0022 Fallacy: Angela and Adria discuss the recent attempts to silence the podcast and why these \u0022temper tantrums\u0022 only reinforce the necessity of telling the truth (01:45).\n\nThe \u0022Prearranged\u0022 vs. The \u0022Ex\u0022: We clarify the distinction between the first (prearranged) husband and the second (ex) husband, and why his specific brand of psychological control is no longer effective (05:22).\n\nIdentity Reclaimed: Angela speaks directly to her former abuser, explaining that while he spent years trying to make her feel like \u0022nothing,\u0022 her voice is now louder than his fear (15:30).\n\nNot For You, But For Us: A firm reminder that this podcast is not an invitation for a debate—it is a memoir for the survivor and a lighthouse for those still trapped in high-control groups (19:50).\n\nUnshakable Resolve: \u0022Intimidate me all you want... I\u0027m going to continue telling my story whether you like it or not\u0022 (20:14).\n\nThis episode is about the power of the word \u0022No\u0022 and the refusal to let an abuser edit your history.\n\nContent Warning: This episode discusses legal intimidation, emotional abuse, and the psychological tactics used by narcissists to silence victims.\n\nConnect \u0026 Follow:\nFacebook: https://www.facebook.com/SquirrelBrainStories\nInstagram: https://www.instagram.com/squirrelbrainstories\nTikTok: https://www.tiktok.com/@squirrelbrainstories\nEmail: squirrelbrainstories@gmail.com",
      "release": "2025-12-22T23:12:46Z",
      "duration": "00:21:22",
      "explicit": false,
      "spotifyId": "5hUyR89zrpiuWdyUr2WvOb",
      "appleId": 1000742388614,
      "youTubeId": "RUK4Gp_vVJ4",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5hUyR89zrpiuWdyUr2WvOb",
        "apple": "https://podcasts.apple.com/podcast/episode-9-dear-dick-a-response-to-your-temper-tantrum/id1851877715?i=1000742388614",
        "youtube": "https://www.youtube.com/watch?v=RUK4Gp_vVJ4"
      }
    },
    {
      "id": "7cd21f10-74ee-4e38-a653-8c689a9efc6d",
      "title": "Episode 8: The Broken Dam - Reclaiming Identity, Learned Helplessness, and The Journey to Adulthood",
      "description": "Welcome back to Squirrel Brain Stories, hosted byAngela and her husband, Buck. In this crucial episode, Angela and Buck shift focus fromthe trauma of the past to the psychological reality of the present, exploring the complex journey of healing and self-discovery after years in a high-control cult. The Safe Space: Angela shares why she brought Buckinto the conversation: his role as a safe, non-dictatorial partner was essential for her to finally feel safe enough to heal and \u0022expand her wings\u0022 (00:46). Identity Stripped: The hosts discuss how totalsurveillance (cameras in bedrooms) and dictatorial marriages left Angela feeling like a \u0022prisoner\u0022 who did not know her own identity, interests, or autonomy (01:38). Repetition Compulsion \u0026 Learned Helplessness:Buck introduces key psychiatric concepts to explain the cycle: Repetition Compulsion (the unconscious drive to return to a familiar, controlling situation) and Learned Helplessness (the inability to make decisions due to conditioning) (21:30 - 25:00). The Emotional Breakthrough: Angela describes the \u0022Broken Dam\u0022 moment—the terrifying rush of bottled-up anger, grief, and shame that finally broke open when she realized she could tell her story. This emotional processing is the true starting point of her recovery (16:01). Adulting 101: They conclude by comparing thechallenge of recovery to that of an individual released from prison: having to \u0022adult one on one\u0022 and discover basic life skills and interests (like making soap or planning a vineyard) for the very first time. Content Warning: This episode discusses severe emotional processing, deep-seated trauma, and psychological concepts related to abuse survival. Please practice self-care. Connect \u0026 Follow: Facebook: https://www.facebook.com/SquirrelBrainStories Instagram: https://www.instagram.com/squirrelbrainstories TikTok: https://www.tiktok.com/@squirrelbrainstories Email: squirrelbrainstories@gmail.com",
      "release": "2025-12-20T21:52:56Z",
      "duration": "00:43:35.8720000",
      "explicit": true,
      "spotifyId": "4mZaxcK2cIKW1BW1t3dFkO",
      "appleId": 1000742146481,
      "youTubeId": "grUMttFWlrs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mZaxcK2cIKW1BW1t3dFkO",
        "apple": "https://podcasts.apple.com/podcast/episode-8-the-broken-dam-reclaiming-identity-learned/id1851877715?i=1000742146481",
        "youtube": "https://www.youtube.com/watch?v=grUMttFWlrs"
      }
    },
    {
      "id": "9594ec7d-dd6b-4196-8c7a-e451cee08891",
      "title": "Episode 7: RICO, Smuggling, and Sexual Assault: Why Did Authorities Ignore the Cult\u0027s Criminal Empire?",
      "description": "Welcome back to Squirrel Brain Stories, hosted byAngela and Buck. In this pivotal episode, we pivot from personal trauma toinstitutional failure, revealing the explosive public documents that validate Angela\u0027s story. The Paper Trail of Felonies: We examine newspaperclippings (on-screen!) confirming that cult leaders were federally charged with alien smuggling, and the primary leader was indicted for sexual assault (03:02). The RICO Question: Buck and Angela discuss the depthof the criminal enterprise, outlining how the fraud (forgery, tax evasion), human smuggling, and sexual exploitation should have warranted a massive RICO (Racketeering) investigation but were treated as minor crimes (04:19,13:26). Institutional Betrayal: Angela and Buck expose themonumental failure of Immigration and Customs Enforcement (ICE), which used Angela as a confidential informant against her First Husband (Luis Rojas), and then allowed The Oregonian newspaper to print her name,putting her life in immediate danger (34:36). The Danger of the Border: We discuss how the cult leveraged unregulated border crossings to recruit new members into a system of indentured servitude and exploitation, capitalizing on the migrants’ fear of deportation (39:04). Content Warning: This episode contains explicit discussion of organized crime, sexual assault, human smuggling, institutional failure, and threats of violence. Please exercise extreme caution and seek professional support if needed. Connect \u0026 Follow: Facebook: https://www.facebook.com/SquirrelBrainStories Instagram: https://www.instagram.com/squirrelbrainstories TikTok: https://www.tiktok.com/@squirrelbrainstories Email: squirrelbrainstories@gmail.com",
      "release": "2025-12-13T23:35:36Z",
      "duration": "00:54:48.7460000",
      "explicit": true,
      "spotifyId": "766FUvis6v1DWG3zXX30dC",
      "appleId": 1000741169450,
      "youTubeId": "-J6h_eXeLgU",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/766FUvis6v1DWG3zXX30dC",
        "apple": "https://podcasts.apple.com/podcast/episode-7-rico-smuggling-and-sexual-assault-why-did/id1851877715?i=1000741169450",
        "youtube": "https://www.youtube.com/watch?v=-J6h_eXeLgU"
      }
    },
    {
      "id": "06686d58-3055-4eae-9e15-e188f5123e12",
      "title": "Episode 6: The Cult\u0027s Cash Cow: Smuggling, Indentured Servitude, and The $450 Tithe",
      "description": "Welcome back to Squirrel Brain Stories, hosted byAngela and Adria. In this explosive episode, Angela reveals the financial andcriminal mechanisms that powered the cult\u0027s rapid expansion from three unassuming houses in Portland to operations in Seattle and Hawaii. Cult Logistics \u0026 Finances: Angela details the group\u0027s hierarchy, the constantly changing names (Messengers of the Cross, Our Daily Bread), and the system where each working member paid a mandatory $450 - $500 monthly tithe (09:41), providing the capital to purchase multiple homes. Human Smuggling Racket: The episode exposes theorganization\u0027s involvement in human trafficking and indentured servitude (30:38). Leaders would orchestrate smuggling trips to bring new, non-English-speaking members across the border, immediately placing them in debt to the cult. The New Predator: Despite successfully divorcing herfirst abuser (the \u0022Smurf\u0022), Angela immediately falls into the hands of a second, more violent partner—a man she viewed as a \u0022safe person\u0022 (47:20) who was also associated with the cult. The Cycle of Control: The hosts analyze how years ofconditioning forced Angela to seek a new authoritarian \u0022safe space\u0022 rather than true independence, leading her into the hands of a man who got her pregnant within a month and continued the cycle of financial, physical, emotional abuse and total control. This episode is a stark look at how cults operate ascriminal enterprises, using shame, poverty, and isolation to maintain absolute control. Content Warning: This episode contains explicitdiscussion of organized crime, human trafficking, financial abuse, and sexual abuse themes. Please exercise extreme caution and seek professional support if needed.",
      "release": "2025-12-07T20:00:00Z",
      "duration": "00:50:44.9700000",
      "explicit": true,
      "spotifyId": "5e5LRmkZhrDYiFH6Id3Gs6",
      "appleId": 1000739052935,
      "youTubeId": "xOb4Kp5tSlo",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5e5LRmkZhrDYiFH6Id3Gs6",
        "apple": "https://podcasts.apple.com/podcast/episode-6-the-cults-cash-cow-smuggling-indentured/id1851877715?i=1000739052935",
        "youtube": "https://www.youtube.com/watch?v=xOb4Kp5tSlo"
      }
    },
    {
      "id": "c2063d31-cbfb-48db-85d5-9694b26c4ae0",
      "title": "Episode 5: Married Life at 16 - Abuse, Pregnancy, and the Hospital’s Failure",
      "description": "Welcome back to Squirrel Brain Stories, hosted by Angela and Adria. In this pivotal, heart-stopping episode, Angela recounts the darkest period of her arranged marriage: the psychological and physical abuse she endured while pregnant and postpartum, revealing the failures of systems meant to protect her. Abuse During Pregnancy: Angela details the extreme violence she faced during pregnancy, including physical assaults and spousal rape (13:16). She shares the terrifying moments of contemplating suicide as her only escape (26:34). Institutional Failure: The hosts discuss how hospital nurses and medical staff at Legacy Good Samaritan Hospital saw visible finger-mark bruises on Angela\u0027s arms but failed to intervene privately, forcing her to lie in front of her abuser and risking further harm (27:20). The Financial Trap: The husband enforced financial slavery, leaving Angela pregnant with only instant noodles and expired conchas for food and zero access to the money she earned (37:16). The Path to Freedom: Angela reveals the non-single event that finally broke the cycle: the chilling realization that her husband posed a risk to her son, prompting her resourceful and secretive plan to save $20 from every paycheck to pay for her divorce lawyer (36:29, 46:16). This episode is a raw look at survival, a call for mandatory reporting and awareness, and the incredible, persistent strength required to break the chain of abuse. Content Warning: This episode contains explicit discussion of domestic violence, sexual assault, suicidal ideation, child abuse themes, and medical/institutional failure. Please exercise extreme caution and seek professional support if needed.",
      "release": "2025-11-30T19:41:28Z",
      "duration": "00:48:36.3730000",
      "explicit": true,
      "spotifyId": "7cr9frEPrSVuxDPM4gX6GX",
      "appleId": 1000739024390,
      "youTubeId": "OlG3VpEJBy4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7cr9frEPrSVuxDPM4gX6GX",
        "apple": "https://podcasts.apple.com/podcast/episode-5-married-life-at-16-abuse-pregnancy-and/id1851877715?i=1000739024390",
        "youtube": "https://www.youtube.com/watch?v=OlG3VpEJBy4"
      }
    },
    {
      "id": "aaf7964b-8173-4dfa-b792-22ccb3dc4eab",
      "title": "Episode 4: Strangled on the Wedding Night: Child Marriage, Cultural Erasure, and the Idaho Loophole",
      "description": "Welcome back to Squirrel Brain Stories, hosted byAngela and Adria. In this pivotal, heart-wrenching episode, Angela recountsher forced transition from the cult\u0027s house into an arranged marriage that quickly became abusive. This story reveals how her identity was systematically stripped away by the group: This is a powerful story of survival, resourcefulness, andthe enduring fight against control. Find and Connect with Squirrel Brain Stories Listen on Major Platforms: Spotify, YouTube and Apple Podcasts. Connect \u0026 Follow: Find us on Facebook, Instagram, TikTok and X email: squirrelbrainstories@gmail.com",
      "release": "2025-11-23T18:49:08Z",
      "duration": "00:46:08.4480000",
      "explicit": true,
      "spotifyId": "2t79Gax6IR0KADbG8OxvCn",
      "appleId": 1000738017724,
      "youTubeId": "VieQQFmpR2o",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2t79Gax6IR0KADbG8OxvCn",
        "apple": "https://podcasts.apple.com/podcast/episode-4-strangled-on-the-wedding-night-child/id1851877715?i=1000738017724",
        "youtube": "https://www.youtube.com/watch?v=VieQQFmpR2o"
      }
    },
    {
      "id": "3b0094d6-4e54-4123-acf7-8a49c476faf6",
      "title": "Episode 3: Cult Control: The Junk Food Diet, Dehumanizing Schedule, and Brothers Creepers",
      "description": "Welcome back to Squirrel Brain Stories. In this deeply disturbing episode, Angela and Adria dive into the daily operational mechanics of the cult and how a lack of structure in childhood was weaponized into extreme control. This episode reveals the shocking realities of life inside the multi-house compound: The Food Weapon: Angela details how abundant donations of junk food (muffins, sheet cakes) were used to create a cycle of shame and dependency, leading to rapid weight gain and psychological degradation, while necessary protein was scarce (07:01). The Schedule of Erasure: The hosts discuss the exhausting, non-stop schedule of Bible study and labor, designed to keep members compliant, exhausted, and unable to think clearly (10:42). There was virtually no personal time (28:46). Sexual Misconduct \u0026 Brothers Creepers: Angela bravely recounts specific, horrifying incidents of sexual harassment and assault by older men (the \u0022Brothers Creepers\u0022) within the cult, including why she froze and why other members, conditioned by the leadership, failed to intervene (35:03). The Illusion of Protection: The episode confronts the cult’s psychological abuse, particularly the trauma of making the victims feel that the abuse was their fault—a form of psychological torture and victim blaming that kept the structure intact (41:19). Content Warning: This episode contains explicit discussion of childhood neglect, sexual harassment, abuse, and cult-related trauma. Please practice self-care, stay hydrated, and pause if needed.",
      "release": "2025-11-16T19:41:22Z",
      "duration": "00:45:53.0020000",
      "explicit": true,
      "spotifyId": "7LmqSIeJOcbyCa9DpCkw7g",
      "appleId": 1000736984355,
      "youTubeId": "A8hWbJYLRlM",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7LmqSIeJOcbyCa9DpCkw7g",
        "apple": "https://podcasts.apple.com/podcast/episode-3-cult-control-the-junk-food-diet/id1851877715?i=1000736984355",
        "youtube": "https://www.youtube.com/watch?v=A8hWbJYLRlM"
      }
    },
    {
      "id": "74742fe8-8fba-4969-b007-6f77631bc66e",
      "title": "Episode 2: Dropped Off and Powerless",
      "description": "Ange and Adria continue the story immediately after Ange is taken from school. The conversation details the chilling moment she was dropped off at a religious cult by her mother and stepfather, armed with nothing but a school backpack and no explanation. Ange shares the overwhelming shock of facing an extreme language barrier (95% Spanish-speaking community) and the instant realization of being completely powerless. She recalls the first words spoken to her: \u0022No, you don\u0027t. Not anymore,\u0022 regarding her bedtime. The episode outlines the rigid daily routine of constant Bible study (morning, personal, afternoon, and evening) that replaced her schooling. Finally, Ange discusses the long-term impact of this survival mode, how she finally began to process the grief of her lost childhood and estranged relationships, and why she is speaking out now: to dismantle the harmful narrative that asks, \u0022Why didn\u0027t you just leave sooner?\u0022",
      "release": "2025-11-09T20:37:34Z",
      "duration": "00:56:37.1620000",
      "explicit": true,
      "spotifyId": "5GvUt8CzYOJREaUhC77P3a",
      "appleId": 1000736003627,
      "youTubeId": "jHtxkXQh8QM",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GvUt8CzYOJREaUhC77P3a",
        "apple": "https://podcasts.apple.com/podcast/episode-2-dropped-off-and-powerless/id1851877715?i=1000736003627",
        "youtube": "https://www.youtube.com/watch?v=jHtxkXQh8QM"
      }
    },
    {
      "id": "9f2f4d73-b35b-4096-8267-ecfeaa8196d2",
      "title": "Episode 1: \u0022Feral Child\u0022 and The Butcher Knife",
      "description": "Hosts Ange and Adria begin the series by laying the groundwork for Ange’s journey: growing up as a \u0022feral child\u0022 who essentially raised herself while her mother was mostly absent. They discuss a childhood defined by a lack of adult supervision, learning to cook for herself as soon as she could read a brownie box, and her mother\u0027s tumultuous relationships. The conversation delves into deeply troubling events, including: * An incident where a stepfather attacked the blanket covering Ange with a butcher knife while she slept.* Encounters with dangerous individuals, including a creepy neighbor who attempted to coerce her.* A bizarre situation where Ange and her brother were kidnapped by their mother from a babysitter and later sent back home by police on an airplane. The episode concludes with the escalating conflict that led to Ange hitting her mother and the subsequent decision to send her away to a \u0022cult\u0022. (Content Warning: This episode discusses child neglect, abuse, and trauma. Please prioritize your mental health before listening.)",
      "release": "2025-11-02T20:37:03Z",
      "duration": "00:51:51.3600000",
      "explicit": true,
      "spotifyId": "4tBt2WTBeoTIEEczxyF1oG",
      "appleId": 1000736003376,
      "youTubeId": "fD9MPHWGpYQ",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4tBt2WTBeoTIEEczxyF1oG",
        "apple": "https://podcasts.apple.com/podcast/episode-1-feral-child-and-the-butcher-knife/id1851877715?i=1000736003376",
        "youtube": "https://www.youtube.com/watch?v=fD9MPHWGpYQ"
      }
    }
  ]
}