{
  "id": "6559c199-91e8-43d9-8ae1-08b30375f111",
  "name": "Stand Up! with Pete Dominick",
  "spotifyId": "4Fyet1LNfHugLTCBsyijSu",
  "appleId": 1485475085,
  "youTubeChannelId": "UC8foguc8nT-bvRo7HEsn-ZA",
  "episodes": [
    {
      "id": "de442383-c651-4329-8001-8c52149a4d42",
      "title": "1291 Dr Steven Hassan Cult Expert on The Trump of Cult",
      "description": "Stand Up is a daily podcast that I book,host,edit, post and promote new episodes with brilliant guests every day. Please subscribe now for as little as 5$ and gain access to a community of over 700 awesome, curious, kind, funny, brilliant, generous souls Check out StandUpwithPete.com to learn more GET TICKETS TO PODJAM II In Vegas March 27-30 Confirmed Guests! Professor Eric Segall, Dr Aaron Carroll, Maura Quint, Tim Wise, JL Cauvin, Ophira Eisenberg, Christian Finnegan and More! Dr. Steven Hassan’s unwavering passion for helping individuals who have experienced cults and mind control is deeply rooted in his own personal journey. As a former member of the notorious Moonies cult in the 1970s, Dr. Hassan experienced firsthand the devastating effects of undue influence and coercion. His escape from the Moonies and subsequent recovery process inspired him to dedicate his life to understanding and exposing the deceptive tactics used by cults and manipulative groups. Dr. Hassan’s courage in sharing his own story and using his expertise to empower others has made him a beacon of hope for individuals who have been affected by cults and coercive persuasion. With his extensive knowledge, compassionate approach, and unwavering commitment to promoting freedom of thought and autonomy, Dr. Steven Hassan has become a respected figure in the field of cult awareness and recovery. His dedication to helping individuals break free from the grip of manipulation and regain their independence is a testament to his unwavering resolve to make a positive impact on the lives of others. Pete on Blue Sky Pete on Threads Pete on Tik Tok Pete on YouTube Pete on Twitter Pete On Instagram Pete Personal FB page Stand Up with Pete FB page All things Jon Carroll Follow and Support Pete Coe Buy Ava\u0027s Art Hire DJ Monzyk to build your website or help you with Marketing Gift a Subscription https://www.patreon.com/PeteDominick/gift",
      "release": "2025-02-09T15:19:44Z",
      "duration": "00:32:13.0800000",
      "explicit": false,
      "spotifyId": "6xuZHFDIrFUoqwY9DMnhvr",
      "appleId": 1000690598974,
      "youTubeId": "2fal-bl8FBo",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6xuZHFDIrFUoqwY9DMnhvr",
        "apple": "https://podcasts.apple.com/podcast/1291-dr-steven-hassan-cult-expert-on-the-trump-of-cult/id1485475085?i=1000690598974",
        "youtube": "https://www.youtube.com/watch?v=2fal-bl8FBo"
      }
    }
  ]
}