{
  "id": "9a316b12-2217-48c2-8f14-f19070db90fd",
  "name": "Stanley Foss",
  "youTubeChannelId": "UCWGvYQGgNWMD9yeYUnRTSxQ",
  "episodes": [
    {
      "id": "8769e39c-e51d-4f02-847c-b13c67edba05",
      "title": "How Charles Manson Built a Cult in the Middle of 1960s San Francisco",
      "description": "In 1967, while San Francisco’s Haight-Ashbury neighborhood was becoming the global symbol of peace, love, and counterculture, a recently released ex-con named Charles Manson arrived with very different intentions. This video explores how Manson used the Summer of Love, LSD, and the hippie movement to begin building what would become the infamous Manson Family.\n\nJoin me as we visit real Haight-Ashbury locations connected to Manson’s early days in San Francisco — from communal crash pads to the Haight-Ashbury Free Medical Clinic — and examine how a small-time criminal reinvented himself as a spiritual guru. Along the way, we’ll look at Manson’s relationship with his parole officer, his early followers, and the counterculture environment that allowed him to thrive.\n\nWe’ll also explore the controversial and unsettling connections between Manson, government-funded psychological research, and the CIA’s secret MKULTRA mind-control experiments — including the presence of researchers studying LSD, hypnosis, and behavioral manipulation in the very places Manson frequented.\n\nWas Charles Manson simply a master manipulator who exploited lost young people? Or was he shaped — and possibly enabled — by a much darker chapter of 1960s American history?\n\nThis video is part pop-culture history, part true crime, and part Hollywood-era mythology — all centered on the streets of San Francisco where it began.\n\n🎬 Topics Covered\n\nCharles Manson’s arrival in San Francisco (1967)\n\nHaight-Ashbury during the Summer of Love\n\nEarly members of the Manson Family\n\nLSD, counterculture, and cult manipulation\n\nThe Haight-Ashbury Free Medical Clinic\n\nCIA-funded research and MKULTRA connections\n\nHollywood, music, and Manson’s quest for fame\n\n📍 Filming Locations \u0026 Real Places\n\nHaight-Ashbury neighborhood\n\n636 Cole Street\n\nHaight-Ashbury Free Medical Clinic\n\nSan Francisco counterculture landmarks\nhttps://ko-fi.com/stanleyfoss\nMusic by Uppbeat",
      "release": "2026-01-20T16:34:52Z",
      "duration": "00:16:29",
      "explicit": false,
      "youTubeId": "Tck9erwqR70",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Tck9erwqR70"
      }
    }
  ]
}