{
  "_ts": 0,
  "id": "3c9e8a78-fc6a-413d-b42c-f41f40363ea2",
  "name": "Stephen Meagher",
  "youTubeChannelId": "UCFurQSUhTxjUBbgStuDVu2A",
  "episodes": [
    {
      "id": "f65b82bf-560b-4478-b7fa-6168bb73c37b",
      "title": "The Dark History of The Catholic Church",
      "description": "A lot of people find their meaning and vocation through a place like the Vatican but that being said there are some things that the Popes and Vatican City has done that are little less than morally good to say the least. So in today’s video I want to explore some of the darker side of the Catholic Church and cover some of the darker sides of their history. There is surprisingly a lot of darkness buried in their long history, a lot more than I was expecting but I’m going to focus on two areas I personally find the most abhorrent. The church\u0027s agreement with the Nazi \u0026 Facist goverment - Hitler and Mussolini and their approach towards the Holocaust. As well as child abuses and the concurring cover ups of said crimes over the years.\n\nThe catholic church has done both good and bad in this world.\n\nWhat do you think?\n\nThanks for watching!\n\nPlease like, share \u0026 subscribe.\n\n#catholicchurch #vthevatican #popefrancis",
      "release": "2025-03-26T12:01:03Z",
      "duration": "00:14:28",
      "explicit": false,
      "youTubeId": "gt4tUmzoLVM",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gt4tUmzoLVM"
      }
    },
    {
      "id": "c72c2508-18d3-4940-bad5-936bfc9b7624",
      "title": "The Tragic Story of Heaven\u0027s Gate",
      "description": "Possibly one of the biggest cult stories in America, Heavens gate convinced its members using a mix of Christian millenarianism new age and ufology with classic brainwashing and manipulation leading to the mass suicide of it’s members in 1997. \n\nMarshall H Applewhite, the founder believed Jesus was an extraterrestrial who came to Earth to teach humanity how to transcend their physical bodies. He saw himself as the reincarnation of Jesus, returning to complete the work of spiritual evolution and help believers ascend to the Next Level.\n\nThroughout the 70\u0027s he recruited 100\u0027s of people with help from his friend Bonnie. He and Bonnie concluded they were the two endgame witnesses mentioned in Revelation 11. \n\nUnlike other cults there isn’t much documented physical or sexual abuse among its members but of course there was mental manipulation and control that can be classified as emotional and mental abuse which prevented members to use critical thinking and be easily controlled. \n\nIn March 1997, police entered a mansion in Rancho Sante Fe in San Diego California, discovering the 39 victims of mass suicide, 21 women and 18 men. They were all found lying peaceably in matching dark clothes and Nike sneakers and had no noticeable signs of blood or trauma.\n\nIt’s a stark reminder to all of us weaponised religion with charismatic leaders and the power of belief can easily influence others.\n\nThanks for watching!\n\nPlease like, share and subscribe.\n\n#heavensgate #cult #religion",
      "release": "2024-09-25T11:00:34Z",
      "duration": "00:10:24",
      "explicit": false,
      "youTubeId": "PtHCmHcxV58",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PtHCmHcxV58"
      }
    },
    {
      "id": "ae56bdc7-8c4c-4775-a75f-754a083a4f7a",
      "title": "These Crazy Pastors are Complete Frauds",
      "description": "Bonus video this week! I decided to look at some pastors from Africa and react to some of the craziest miracles these pastors claim to heal. It\u0027s insanity and it\u0027s another example of people using religion for money and power. It\u0027s also hilarious to watch some of the claims these pastors make! \n\nIt healed my depression and I hope it helps you too!\n\nThanks for Watching!\n\n#pastor #frauds #religion",
      "release": "2024-06-28T09:00:07Z",
      "duration": "00:16:46",
      "explicit": false,
      "youTubeId": "3Zh_S9K6Sfg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3Zh_S9K6Sfg"
      }
    },
    {
      "id": "8c6fcc78-6c7f-4220-a6c6-8e7da72d1d1d",
      "title": "The Horrifying Abuse in The Children of God Cult",
      "description": "In 1968 preacher David Brandt Berg founded a group called Teens for Christ which at first consisted of young runaways and hippies who were so called born again hippies. Over time the church would become the children of god  (now known as the Family International at its peak had 150,000 members around the world.) At the height of its popularity it had members such as River and Joaquin Phoenix, Rose McGowan and Jeremy Spencer who was a founding member of Fleetwood Mac that left the band in 1971 to join the cult. \n\nBerg promotes love and sex with children as young as 5 years of age and committed multiple abuses against his members especially the children.\n\nIn 1976 as an attempt to entice more members, he would use sex to show Gods love and mercy. As a result over 223,989 people were fished and over 10,000 babies were born through cult woman from 1971 to 2001 according to records from the cult and also hilariously enough caused a spread of herpes throughout the cult.  \n\nWoman of the cult were forced to do this whether they wanted to or not.  It was so engrained in their doctrine to do so to spread gods love.\n\nIt was a vile a disgusting cult.\n\nThanks for watching.\n\nPlease like, share and subscribe.\n\n#cult #childrenofgod #religion",
      "release": "2024-06-26T11:00:12Z",
      "duration": "00:13:58",
      "explicit": false,
      "youTubeId": "8g0vAZ4dHwU",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8g0vAZ4dHwU"
      }
    },
    {
      "id": "3beeae47-2baa-41ca-9e78-4f5143956561",
      "title": "The Richest Pastor in The World",
      "description": "Americans know better than anyone what its like to sit down in-front of their TV set and see a pastor passionately tell them, the end is near, God is watching, homosexuality is a sin and more commonly and how imperative it is for them to donate money to their church. \n\nThis phenomenon is known as Televangelism and this tool has been used in attempt to exploit and control since the 1970s. It allowed these pastors into the home of their faithful followers allowing them to reach audiences at unprecedented numbers. \n\nThere are many examples of corrupt pastors who used this medium to extract as much money as possible from their followers. But to me, the most corrupt, disgusting and vile of them all is a man by the name of Kenneth Copeland.\n\nThanks for watching!\n\nPlease like, share and subscribe.\n\n#KCN #pastor #kennethcopeland #christianity",
      "release": "2024-04-17T11:00:26Z",
      "duration": "00:11:37",
      "explicit": false,
      "youTubeId": "YuA9_7epW0k",
      "subjects": [
        "Kenneth Copeland"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YuA9_7epW0k"
      }
    },
    {
      "id": "94f34ba9-c964-4c9d-bba9-5017923c9c03",
      "title": "The Curse of Scientology",
      "description": "Scientology has to be one of the most talked about cult like religions in the world. I would find it hard to believe that their are many people who have not heard of a religion that has one of the biggest celebrities in the world connected to it - Tom Cruise.\n\nScientology is infamous for harassing ex members and pretty much anyone who openly critiques them.  They use psychological warfare to control their members, gaslighting them and manipulating every aspect of their lives. They have vast tax free wealth, in which they use to buy property all over the world. Some would say their power and influence could match that of the Catholic Church.\n\nThanks for watching.\n\n\nSources:\nhttps://www.youtube.com/watch?v=j956WEPpNwE\u0026t=2s\nhttps://www.youtube.com/watch?v=oM-FrI5Hqto\u0026t=1s\nhttps://www.youtube.com/watch?v=oM-FrI5Hqto\u0026t=1s\\\n\nMusic:  https://www.youtube.com/watch?v=svFAjtzijsU\n\n#scientology #tomcruise",
      "release": "2024-03-02T19:58:43Z",
      "duration": "00:12:26",
      "explicit": false,
      "youTubeId": "mXJWX68cQcI",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mXJWX68cQcI"
      }
    },
    {
      "id": "f9c2cd93-b4c7-448b-816e-83579e330dac",
      "title": "Jim Jones \u0026 The Jonestown Massacre",
      "description": "In this video I wanted to focus on Jim Jones, an American who created the The Peoples Temple which would lead to the deaths of over 900 Americans.  \n\nJones instilled fear in his followers through various means, including public humiliations, threats of violence, and staged loyalty tests. Members were made to believe that terrible consequences awaited them if they disobeyed or left the group.\n\nThis would lead to the horrible mass murder of over 900 people in one of the biggest civilian causulties in American history.\n\nThanks for watching.\n\nPlease like, share and subscribe.\n\n#jimjones #peoplestemple #jonestownmassacure",
      "release": "2024-01-26T18:00:29Z",
      "duration": "00:09:05",
      "explicit": false,
      "youTubeId": "yDSHRl3a0MU",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yDSHRl3a0MU"
      }
    },
    {
      "id": "82d72f7a-7cb2-420e-97c8-6b5af3383508",
      "title": "The Westboro Baptist Church is Pure Evil",
      "description": "I think it’s safe to say the Westboro baptist church has had more than a few controversies in their time. The Topeka, Kansas based church has a well earned reputation as Americas most hateful group. The homophobic group stage highly public protests against any group that supports homosexuality.  They also seem to enjoy protesting funerals of dead soldiers, which I think we can all agree is disgusting and vile. \n\n But who are they ?\n\nThanks for watching.\n\nPlease like, share and subscribe.\n\nMusic:  https://www.youtube.com/watch?v=svFAjtzijsU\n\n\n#westborobaptistchurch #religion #hate",
      "release": "2024-01-19T18:00:15Z",
      "duration": "00:12:15",
      "explicit": false,
      "youTubeId": "GbhDjPfZGiI",
      "subjects": [
        "Westboro Baptist Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GbhDjPfZGiI"
      }
    },
    {
      "id": "f7b22e33-1538-4aab-8360-8bfe8baa7061",
      "title": "The Dark Truth of Jehovah\u0027s Witnesses",
      "description": "When I think of Jehovah\u0027s Witnesses I imagine my door bell ringing and someone asking me if I have accepted  Jesus Into my life. They love to share the word of God and the bible with anyone willing to listen.  They also don’t agree with blood transfusions but Jehovah\u0027s Witnesses do not reject transfusion of whole autologous blood so long as it is not stored prior to surgery, are anti abortion, anti gay marriage and see mental health issues as weakness in spirituality. There is sexual abuse cover, shunning of old members, and a hierarchy you dont question and must follow.\n\nSo who is Jehovah? And what did their followers witness? \n\nThanks for watching.\n\nPlease like share and subscribe.\n\nMusic: https://www.youtube.com/watch?v=svFAjtzijsU\n\n#jehovahswitness #jehovah #jesus",
      "release": "2024-01-13T18:00:11Z",
      "duration": "00:12:43",
      "explicit": false,
      "youTubeId": "U1PRIgJ1GF8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=U1PRIgJ1GF8"
      }
    },
    {
      "id": "4500f23a-9f14-4ee3-862b-3065ee038d9e",
      "title": "Mormonism is a Strange Religion",
      "description": "Mormonism has always been a strange but interesting believe system in Christianity to me. For many reasons. Back in 2020 I was approached by one, asking me if I found Christ, I told him respectfully I didn’t nor was I interested and he was somwhat respectful but pushy. But first, what exactly is Mormonism? \n\nTo me it\u0027s more of a cult masquerating as a Church.\n\nThanks for watching.\nPlease like, share and subscribe.\n\nMusic: https://www.youtube.com/watch?v=svFAjtzijsU\n\n#mormon #latterdaysaints  #mormonchurch",
      "release": "2024-01-05T18:00:01Z",
      "duration": "00:11:52",
      "explicit": false,
      "youTubeId": "afnvZynq-7w",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=afnvZynq-7w"
      }
    },
    {
      "id": "5588840a-926e-4335-9193-cc27fb0a4da7",
      "title": "QAnon | America’s Strangest Conspiracy Theory",
      "description": "QAnon is a far-right conspiracy theory that originated on internet message boards in October 2017. It centres around an anonymous individual known as \u0022Q\u0022 who claims to have insider knowledge of a secret global conspiracy involving high-ranking officials and politicians, which they refer to as the \u0022deep state\u0022 or \u0022cabal\u0022. QAnon followers believe that this conspiracy is working to undermine and overthrow the U.S. government, and that Donald Trump is secretly working to expose and defeat it.\n\nThe conspiracy theory is based on a series of cryptic messages posted by \u0022Q\u0022 on internet message boards, which followers interpret as clues to unraveling the supposed conspiracy. QAnon has been linked to several real-world incidents, including the storming of the U.S. Capitol on January 6, 2021, and has been classified by the FBI as a domestic terrorist threat.\nIt\u0027s important to note that QAnon is not based on any credible evidence or facts, and has been widely debunked by experts and fact-checkers. It promotes dangerous and false information, and can lead to real-world harm.\n\nThanks for watching.\n\nPlease like, share and subscribe!\n#conspiracy #trump #documentary #critique",
      "release": "2023-03-19T17:18:46Z",
      "duration": "00:16:16",
      "explicit": false,
      "youTubeId": "TpWj5uyJxB8",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TpWj5uyJxB8"
      }
    },
    {
      "id": "48016e25-3c53-402b-916b-b1c257319e0e",
      "title": "The Story of Andrew Tate",
      "description": "Recently banned from all major platforms, Tate was everywhere online. Until his anti woman views got him banned. This is his story.\n\nDoes he deserve his ban? Let me know in the comments!\n\nThanks for watching!\n\nLike and share and don\u0027t forget to subscribe!\n\n#andrewtate #andrewtatearrest #hustleruniversity",
      "release": "2022-10-04T21:30:18Z",
      "duration": "00:10:07",
      "explicit": false,
      "youTubeId": "b9t0VEJy4xg",
      "subjects": [
        "Hustler\u0027s University"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=b9t0VEJy4xg"
      }
    }
  ]
}