{
  "id": "811b9d9f-0dcd-4805-b414-dd5bb39556fb",
  "name": "Stories that Shaped Me with Avram Gonzales",
  "spotifyId": "5iytrnyfHOz6BJer6ny8k9",
  "appleId": 1859237429,
  "episodes": [
    {
      "id": "864f525e-5ae5-4339-9c05-dc134e48d081",
      "title": "E21: That Time I Pissed Off a Cult and They Came After Me",
      "description": "In Episode 21, Avram Gonzales shares one of the most intense and eye-opening stories of his life: the time he left a spiritual organization—only to find himself publicly targeted by it. In his early twenties, driven by a passion for personal development and New Age spirituality, Avram became deeply involved in a group called Access Consciousness. What started as fascination quickly escalated into influence, visibility, and paid work using his marketing skills to help grow the organization. But behind the scenes, things weren’t what they seemed. After witnessing ruthless behavior and power dynamics at the top, Avram made the decision to leave. What followed was unexpected and extreme: public accusations, global telecalls warning thousands of people about him, online harassment, and former friends turning into vocal enemies almost overnight. This episode explores what happens when belief systems are threatened, why people will fiercely defend what they identify with, and the real cost of choosing to walk away from something that once defined your community. A raw, cautionary story about identity, loyalty, and the consequences of standing on your own truth.",
      "release": "2025-12-13T13:00:19Z",
      "duration": "00:03:00.0740000",
      "explicit": false,
      "spotifyId": "1S54nZ0CUppwFNa7K0BnDw",
      "appleId": 1000741121461,
      "subjects": [
        "Access Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1S54nZ0CUppwFNa7K0BnDw",
        "apple": "https://podcasts.apple.com/podcast/e21-that-time-i-pissed-off-a-cult-and-they-came-after-me/id1859237429?i=1000741121461"
      }
    }
  ]
}