{
  "_ts": 0,
  "id": "3bc2d766-7415-4a14-9f6e-cdf23ca3a784",
  "name": "Storytellers Grove",
  "spotifyId": "768VHq0BHXOAgLnOhS5DdZ",
  "appleId": 1768788212,
  "episodes": [
    {
      "id": "b988ea84-dcad-4b40-8f30-ed68fc3c1b72",
      "title": "21. Gaslighting, Cults and Clickbait: How to Navigate the Headlines",
      "description": "I don’t know about you, but I’m pretty freaked out by the growing \u0022manarchy,\u0022 and I think it’s time we use our voices to embody the change we want to see in the world. One of the most insidious things cult leaders do is make you believe that you need them to achieve your goals or that you’re powerless to make a difference. But that couldn’t be further from the truth. If you take anything away from my brand, I hope it’s this: You are more powerful than you think, and the answers you seek externally can be found within. At this critical time in history, we need leadership that puts humanity above all else. Let’s build a culture that treats every living being with the dignity and respect they deserve—including Mama Earth. Coming together in community, like we saw after the fires in LA, is what will sustain us. But we also need more action on a governmental level. It’s deeply unfortunate that Trump pulled us out of the Paris Climate Agreement—talk about selfishness. While the outlook may feel bleak, I’m choosing to hope for the best. In this episode we\u0027re chatting: The disturbing parallels between the Jerry Springer show and today’s media landscape How billionaires like Elon Musk and Mark Zuckerberg manipulate public perception Recognizing cult-like tactics in politics and the media What the Justin Baldoni and Blake Lively controversy reveals about PR and public narratives The difference between valid and sound arguments and why it matters now more than ever Why critical thinking is essential in the age of misinformation Resources mentioned: Marianne Williamson for DNC How to Stand Up to a Dictator Enough by Cassidy Hutchinson Connect with me: Website Instagram LinkedIn Check out my services Episodes you may like: Heart Chakra Meditation: A Prayer for the World How Can I Make a Difference in my Community: Actionable Tips with Ali Eslamifar",
      "release": "2025-01-22T09:00:00Z",
      "duration": "00:30:40.3290000",
      "explicit": false,
      "spotifyId": "2JmvLLgXenTHevzhEK1W9I",
      "appleId": 1000684967110,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2JmvLLgXenTHevzhEK1W9I",
        "apple": "https://podcasts.apple.com/podcast/21-gaslighting-cults-and-clickbait-how-to-navigate/id1768788212?i=1000684967110"
      }
    }
  ]
}