{
  "_ts": 0,
  "id": "879a67a5-f2f1-49c2-b43f-ffdba51f7563",
  "name": "StoryComic",
  "spotifyId": "4znHk9UTgwN0vu4YHglZyE",
  "appleId": 1499273750,
  "youTubeChannelId": "UCm6frhFag219q2lHM7Fa4qQ",
  "episodes": [
    {
      "id": "fbbae919-1e4e-4644-babd-e14127f11543",
      "title": "Breaking Free: Tamara Mathieu Reveals Life Inside a Cult",
      "description": "#TamaraMathieu #TwelveTribes #CultSurvivor #TrueStories #EscapeCult #Memoir #SurvivalStory #CultRecovery #AuthorInterview #StorycomicPresents\n\nIn Episode 378 of Storycomic Presents, we welcomed Vermont-based author Tamara Mathieu, who shared her compelling memoir, \u0022All Who Believed,\u0022 with our audience. This episode offered a deep dive into her personal journey and the powerful themes of her book, which chronicles her life within the Twelve Tribes community—a journey that spanned over a decade and profoundly shaped her perspective on freedom and self-discovery.\n\nTamara\u0027s story is both heart-wrenching and enlightening, depicting her young family\u0027s initial search for a community that promised peace and spiritual fulfillment, only to find themselves ensnared in a reality marked by control and abuse. Her narrative is a poignant exploration of the human desire for belonging and the resilience required to break free from manipulation.\n\nListeners of Storycomic Presents were treated to an intimate account of Tamara\u0027s experiences, from the challenging dynamics within the Twelve Tribes to her courageous escape and the subsequent challenges of reintegrating into society. Her story is an inspiration, highlighting her transformation from a seeker of external validation to a beacon of strength and self-assurance.\n\nTamara\u0027s discussions on the podcast were not only a reflection of her personal growth but also an educational journey into the realities of life in a cult-like setting. Her insights are invaluable for anyone interested in the complexities of religious communities, the psychology of belonging, and the enduring strength of the human spirit to overcome adversity.\n\nThe Title sequence was designed and created by Morgan Quaid. \nSee more of Morgan’s Work at: https://morganquaid.com/\n\nStorycomic Logo designed by Gregory Giordano\nSee more of Greg’s work at: https://www.instagram.com/gregory_c_giordano_art/\n\nWant to start your own podcast?  Click on the link to get started:\nhttps://www.podbean.com/storycomic\n\nFollow us: \nAre you curious to see the video version of this interview?  It\u0027s on our website too! www.storycomic.com\nwww.patreon.com/storycomic\nwww.facebook.com/storycomic1\nhttps://www.instagram.com/storycomic/\nhttps://twitter.com/storycomic1\nFor information on being a guest or curious to learn more about Storycomic? Contact us at info@storycomic.com \n\nThank you to our Founders Club Patrons, Michael Winn, Higgins802, Von Allan, Stephanie Nina Pitsirilos, Marek Bennett, Donna Carr Roberts, Andrew Gronosky, and Matt \u0026 Therese. Check out their fantastic work at:\nhttps://marekbennett.com/\nhttps://www.hexapus-ink.com/\nhttps://www.stephanieninapitsirilos.com/\nhttps://www.vonallan.com/\nhttps://higgins802.com/\nhttps://shewstone.com/\nhttps://mrfuzzyears.com/\nAlso to Michael Winn who is a member of our Founders Club!",
      "release": "2024-08-22T04:00:28Z",
      "duration": "00:31:54",
      "explicit": false,
      "spotifyId": "3YLdJujcD7mPQVxOAOz0YE",
      "appleId": 1000666198976,
      "youTubeId": "nMP5cAln590",
      "subjects": [
        "Twelve Tribes",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3YLdJujcD7mPQVxOAOz0YE",
        "apple": "https://podcasts.apple.com/podcast/episode-378-breaking-free-tamara-mathieu-reveals-life/id1499273750?i=1000666198976",
        "youtube": "https://www.youtube.com/watch?v=nMP5cAln590"
      }
    }
  ]
}