{
  "_ts": 0,
  "id": "69a6fac0-ccc6-4de8-94a3-301c1814b315",
  "name": "Straight Up",
  "spotifyId": "5pHIL2NSEvQ3wSx6W2HcNf",
  "appleId": 1487387104,
  "episodes": [
    {
      "id": "d7b03acd-0462-4068-9086-d1794b3a0ddf",
      "title": "Cults, Kate Middleton and the monarchy vs the media",
      "description": "Next up is Ellie’s favourite new podcast discovery, Sounds Like A Cult, about the modern day cults we all follow. A tale of Lululemon leggings and murder ensues, followed very fittingly by Kathleen’s review of Netflix’s new true crime drama The Program: Cons, Cults and Kidnapping. A shocking look at ‘disciplinary schools’, we found this especially fascinating considering our recent dive into Paris Hilton’s mission to have the industry shut down. Recs discussed: Sounds like a Cult podcast The Program on Netflix The Disney Adult Industrial Complex, New Statesman The Pulling, by Adele Dumont Thanks so much to our partners: Innermost Nutrition, our favourite new plant protein that\u0027s actually really good for you, full of immune-boosting mushrooms, a whopping 31g of plant protein and no nasty additives. It\u0027s stocked in Ocado, John Lewis, and Soho House, or visit LiveInnermost.com @flareaudio makes the best earplugs for light sleepers: tiny, unobtrusive, with memory foam balls that perfectly moulds to your ear, and they don\u0027t fall out! Grab a pair at ⁠⁠⁠⁠⁠⁠⁠⁠flareaudio.com⁠⁠⁠⁠⁠⁠⁠⁠ London Nootropics, our fave adaptogenic coffee that naturally actually boosts mental clarity and physical energy, while also easing anxiety, all without any of coffee\u0027s usual jitters. We are obsessed and you will be too! Get 20% OFF YOUR BOX with the DISCOUNT CODE straightup at ⁠⁠⁠⁠⁠⁠⁠⁠ ⁠⁠londonnootropics.com⁠⁠⁠⁠⁠⁠⁠⁠",
      "release": "2024-03-28T01:00:00Z",
      "duration": "01:14:32.5550000",
      "explicit": false,
      "spotifyId": "5IKoU20sjZjBVcsAPMbTqK",
      "appleId": 1000650675407,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5IKoU20sjZjBVcsAPMbTqK",
        "apple": "https://podcasts.apple.com/podcast/cults-kate-middleton-and-the-monarchy-vs-the-media/id1487387104?i=1000650675407"
      }
    }
  ]
}