{
  "id": "6e37a622-e85f-4df5-95dd-7b4b2b9777ad",
  "name": "Straight White American Jesus",
  "spotifyId": "2FzTHBHfnGvZsdhsaUVo19",
  "appleId": 1441649707,
  "episodes": [
    {
      "id": "c13a44e2-82cf-445b-bf46-3dff3f5318f1",
      "title": "Special Episode: Is Pope Leo Really Dissolving Opus Dei?",
      "description": "This episode delves into the recent controversies surrounding Opus Dei, a secretive and influential organization within the Catholic Church. According to a report from Infovaticana, Opus Dei faces a significant internal rupture that could see it fragmented into three distinct bodies, effectively dissolving its current structure. Annika Brockschmidt guest hosts in conversation with journalist Gareth Gore, author of \u0027Opus: The Cult of Dark Money, Human Trafficking, and Right-Wing Conspiracy inside the Catholic Church.\u0027 Gareth elaborates on the historical context and modern operations of Opus Dei, including its recruitment and coercive practices. He also highlights the organization\u0027s conflicts with the Vatican and ongoing abuse allegations. Opus by Gareth Gore: https://www.simonandschuster.com/books/Opus/Gareth-Gore/9781668016152 Subscribe for $5.99 a month to get bonus content most Mondays, bonus episodes every month, ad-free listening, access to the entire 850-episode archive, Discord access, and more: https://axismundi.supercast.com/ \u0026#xfeff;Linktree: https://linktr.ee/StraightWhiteJC Order Brad’s book: https://bookshop.org/a/95982/9781506482163 Subscribe to Teología Sin Vergüenza Subscribe to American Exceptionalism Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-10-23T21:21:00Z",
      "duration": "00:38:51.2450000",
      "explicit": false,
      "spotifyId": "3lBHnrEiHEk3AYJYbhKf66",
      "appleId": 1000733213079,
      "subjects": [
        "Catholicism",
        "Human Trafficking",
        "Opus Dei"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3lBHnrEiHEk3AYJYbhKf66",
        "apple": "https://podcasts.apple.com/podcast/special-episode-is-pope-leo-really-dissolving-opus-dei/id1441649707?i=1000733213079"
      }
    },
    {
      "id": "b546c7d6-1f10-46b8-877b-b1b7984b34b5",
      "title": "Talking to Red-Pilled Friends and Loved Ones with Dr. Steven Hassan",
      "description": "Brad welcomes Dr. Steven Hassan to discuss strategies for talking to red-pilled relatives who have gone down the rabbit holes of MAGA-ism, Q-Anon, and other forms of high-control religion and conspiracy. The author of the Cult of Trump and Combating Cult Mind Control, Dr. Hassan was member of the notorious Unification Church in the 1970s. Dr. Hassan experienced firsthand the devastating effects of undue influence and coercion. His escape from the church and subsequent recovery process inspired him to dedicate his life to understanding and exposing the deceptive tactics used by cults and manipulative groups. Subscribe for $5.99 a month to get bonus episodes, ad-free listening, access to the entire 500-episode archive, Discord access, and more: https://axismundi.supercast.com/ Linktree: https://linktr.ee/StraightWhiteJC Order Brad\u0027s book: https://www.amazon.com/Preparing-War-Extremist-Christian-Nationalism/dp/1506482163 Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-02-26T08:00:00Z",
      "duration": "00:30:16.6070000",
      "explicit": false,
      "spotifyId": "7j8xYcG70FvWjSbxblBmYU",
      "appleId": 1000646846743,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7j8xYcG70FvWjSbxblBmYU",
        "apple": "https://podcasts.apple.com/podcast/talking-to-red-pilled-friends-and-loved-ones-with/id1441649707?i=1000646846743"
      }
    }
  ]
}