{
  "_ts": 0,
  "id": "414ca5bb-2457-4ed2-9a3f-4bba0e13b22d",
  "name": "Stressed But Well Dressed hosted by Dahlia Stroud",
  "spotifyId": "1O8gEfYbvKbGNDI4lE7Fls",
  "appleId": 1725889381,
  "episodes": [
    {
      "id": "a2fd62d8-ee60-4f59-a4dc-221c44dbdf62",
      "title": "Stressed But Well Dressed Bonus Episode: Clothes and Confidence (Part 3)",
      "description": "A collection of stories from a variety of Stressed But Well Dressed guests looking at how clothes influence how we feel and how we act. Tune in for a reflection on the link between Clothes, Confidence and a Positive Mindset and ask yourself: Are you stressed or well dressed? Guests included in this episode: Paula Grizzard: Season 1, Episode 3 \u0027Stand out for success\u0027 Carolyn Mair: Season 1, Episode 5 \u0027The psychology of fashion\u0027 Alistair Vince: Season 2, Episode 8 \u0027The power of perspective\u0027 Lynsey Donoughue: Season 3, Episode 3 \u0027Trailblazer\u0027 Julia Hotz: Season 3, Episode 5 \u0027Hotz Thoughts on Stress, Dress and Social Prescribing for Wellness\u0027 Sarah Edmondson: Season 3, \u0027Episode 10 Cult Fashion\u0027 Visha Kudhail: Season 4, Episode 2 \u0027What to wear to spark joy\u0027 Paula Zucotti: Season 4, Episode 4 \u0027What to wear to predict the future\u0027 Kate Ball: Season 4, Episode 5 \u0027What to wear to be a life saver\u0027 Nikki Alderson: Season 4, Episode 9 \u0027What to wear to predict the future\u0027",
      "release": "2024-10-06T16:00:00Z",
      "duration": "00:15:45.9640000",
      "explicit": false,
      "spotifyId": "4xNa9rBzV7VBUCyxxjbrAo",
      "appleId": 1000671966520,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xNa9rBzV7VBUCyxxjbrAo",
        "apple": "https://podcasts.apple.com/podcast/stressed-but-well-dressed-bonus-episode-clothes-and/id1725889381?i=1000671966520"
      }
    },
    {
      "id": "4d0df478-d730-45a1-a0cc-1cb91e6e6f5b",
      "title": "Season 3, Episode 10: Cult Fashion (with guest Sarah Edmondson)",
      "description": "Dahlia is joined by guest Sarah Edmondson to discuss what to wear when you are in a cult. Sarah describes the twelve years of her life involved in what she initially thought was an Executive Leadership Programme - that transpired to be a sex trafficking cult. Sarah and her husband were two of the whistleblowers of the NXIVM cult and have been on a journey of recovery and realisation over the last few years. Part of this journey has included building the podcast \u0027A Little Bit Culty\u0027, writing the book \u0027Scarred\u0027 and being part of the HBO show \u0027The Vow\u0027 to expose cult mentality. Dahlia and Sarah look at the link between fashion and belonging - and the influence that style had on Sarah during her time in NXIVM. They discuss some of the clothes used to denote hierarchy in the cult and what those items came to mean to her over time. Sarah reflects on her personal style since leaving the cult and how she has redefined who she is. This episode is an incredible insight into the danger of being part of a cult, the importance of knowing who you are and the balance between belonging and conforming. Thank you Sarah for letting me share your story.",
      "release": "2024-05-24T04:00:00Z",
      "duration": "00:45:53.6760000",
      "explicit": true,
      "spotifyId": "7AuMzJaXzjnssdJ4hzDi49",
      "appleId": 1000656594527,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7AuMzJaXzjnssdJ4hzDi49",
        "apple": "https://podcasts.apple.com/podcast/season-3-episode-10-cult-fashion-with-guest-sarah-edmondson/id1725889381?i=1000656594527"
      }
    }
  ]
}