{
  "_ts": 0,
  "id": "414ca5bb-2457-4ed2-9a3f-4bba0e13b22d",
  "name": "Stressed But Well Dressed hosted by Dahlia Stroud",
  "spotifyId": "1O8gEfYbvKbGNDI4lE7Fls",
  "appleId": 1725889381,
  "episodes": [
    {
      "id": "4d0df478-d730-45a1-a0cc-1cb91e6e6f5b",
      "title": "Season 3, Episode 10: Cult Fashion (with guest Sarah Edmondson)",
      "description": "Dahlia is joined by guest Sarah Edmondson to discuss what to wear when you are in a cult. Sarah describes the twelve years of her life involved in what she initially thought was an Executive Leadership Programme - that transpired to be a sex trafficking cult. Sarah and her husband were two of the whistleblowers of the NXIVM cult and have been on a journey of recovery and realisation over the last few years. Part of this journey has included building the podcast \u0027A Little Bit Culty\u0027, writing the book \u0027Scarred\u0027 and being part of the HBO show \u0027The Vow\u0027 to expose cult mentality. Dahlia and Sarah look at the link between fashion and belonging - and the influence that style had on Sarah during her time in NXIVM. They discuss some of the clothes used to denote hierarchy in the cult and what those items came to mean to her over time. Sarah reflects on her personal style since leaving the cult and how she has redefined who she is. This episode is an incredible insight into the danger of being part of a cult, the importance of knowing who you are and the balance between belonging and conforming. Thank you Sarah for letting me share your story.",
      "release": "2024-05-24T04:00:00Z",
      "duration": "00:45:53.6760000",
      "explicit": true,
      "spotifyId": "7AuMzJaXzjnssdJ4hzDi49",
      "appleId": 1000656594527,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7AuMzJaXzjnssdJ4hzDi49",
        "apple": "https://podcasts.apple.com/podcast/season-3-episode-10-cult-fashion-with-guest-sarah-edmondson/id1725889381?i=1000656594527"
      }
    }
  ]
}