{
  "id": "9b040939-72d8-41ed-a302-74ace52577ae",
  "name": "Stuff They Don\u0027t Want You To Know",
  "spotifyId": "5N6g8n6084T5D6Q67yGCUX",
  "appleId": 732915228,
  "youTubeChannelId": "UCrrOic-og4HzhleZqOq4L-A",
  "episodes": [
    {
      "id": "795a769f-5194-4083-ae2b-31d1f3cdb335",
      "title": "The Terrifying Tale of Aum Shinrikyo, Chapter Two: \u0022Save The World By Ending It\u0022",
      "description": "As the Aum Shinrikyo movements gains national, then global, attention, the founder Shoko Asahara begins to move his followers in a darker direction. Convinced that the world can only truly be saved through mass casualty events, Asahara first predicts massive disasters -- and then orders his followers to create these events themselves. In chapter two of this strange two-part series, Ben and Matt learn how Aum committed multiple acts of terror, murder, extortion and fraud leading up to their infamous sarin attacks on the Tokyo subway... and what happened to the cult in the aftermath.\nThey don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/\nSee omnystudio.com/listener for privacy information.",
      "release": "2025-07-04T09:00:00Z",
      "duration": "00:58:59",
      "explicit": false,
      "spotifyId": "0ueeiSMNiPEJ0z4EUipgyn",
      "appleId": 1000715709737,
      "youTubeId": "xr7eP6x9AOQ",
      "subjects": [
        "Aum Shinrikyo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ueeiSMNiPEJ0z4EUipgyn",
        "apple": "https://podcasts.apple.com/podcast/the-terrifying-tale-of-aum-shinrikyo-chapter-two/id732915228?i=1000715709737",
        "youtube": "https://www.youtube.com/watch?v=xr7eP6x9AOQ"
      }
    },
    {
      "id": "ebcb5abc-c93e-4c25-a03a-b446326cc40e",
      "title": "The Terrifying Tale of Aum Shinrikyo, Chapter One: The Rise of a Cult Leader",
      "description": "Modern-day Japan is often lauded as one of the safest countries on the planet -- but that doesn\u0027t make this nation immune to the danger of cults. In the first chapter of this special two-part series, Ben and Matt explore the bizarre, conspiratorial rise of the organization known as Aum Shinrikyo. They don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/ See omnystudio.com/listener for privacy information.",
      "release": "2025-07-02T22:33:10Z",
      "duration": "01:23:44.2350000",
      "explicit": false,
      "spotifyId": "2WiQgJKjHXX3XAbT8E7qcW",
      "appleId": 1000715509580,
      "youTubeId": "OeLW-paw58w",
      "subjects": [
        "Aum Shinrikyo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2WiQgJKjHXX3XAbT8E7qcW",
        "apple": "https://podcasts.apple.com/podcast/the-terrifying-tale-of-aum-shinrikyo-chapter-one/id732915228?i=1000715509580",
        "youtube": "https://www.youtube.com/watch?v=OeLW-paw58w"
      }
    },
    {
      "id": "e1d68122-7d18-4c0b-8680-19676f971d7d",
      "title": "Cults You\u0027ve Never Heard Of, Part II: Rise of the Zizians",
      "description": "Nowadays, the \u0022C-word\u0022 can be pretty tricky. The word \u0022cult\u0022 is usually applied by outsiders toward some group of individuals existing in opposition to a larger society. Most times, these folks are harmless -- eccentric, perhaps, but not dangerous. In fact, we often don\u0027t hear about them until they cross a threshold into violent, criminal acts. In tonight\u0027s episode, Ben, Matt and Noel explore more cults you\u0027ve never heard of. They don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/ See omnystudio.com/listener for privacy information.",
      "release": "2025-06-20T19:26:42Z",
      "duration": "01:09:44.5810000",
      "explicit": false,
      "spotifyId": "7DiP3XewQTkmudDKtV6ErK",
      "appleId": 1000713875837,
      "youTubeId": "a_B5_lqNVoY",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7DiP3XewQTkmudDKtV6ErK",
        "apple": "https://podcasts.apple.com/podcast/cults-youve-never-heard-of-part-ii-rise-of-the-zizians/id732915228?i=1000713875837",
        "youtube": "https://www.youtube.com/watch?v=a_B5_lqNVoY"
      }
    },
    {
      "id": "80adbe51-1d39-4046-bb49-87ed783e8def",
      "title": "Inside Scientology with Mike Rinder, Part I: An Origin Story",
      "description": "Founded in 1953 by L. Ron Hubbard, the Church of Scientology describes itself as a religion that puts its adherents on a path toward complete and certain understanding of one\u0027s true spiritual nature. In the first part of this two-part series, Ben, Matt and Noel are joined by Mike Rinder, a former senior official of the Church and cohost of Scientology: Fair Game, for a first-hand, inside look at the organization in this classic interview segment. They don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/ See omnystudio.com/listener for privacy information.",
      "release": "2025-01-21T20:30:00Z",
      "duration": "01:08:14.0400000",
      "explicit": false,
      "spotifyId": "72UP6AahVXKjeFCcIrmHPP",
      "appleId": 1000684896813,
      "youTubeId": "lNs14R92pfc",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/72UP6AahVXKjeFCcIrmHPP",
        "apple": "https://podcasts.apple.com/podcast/inside-scientology-with-mike-rinder-part-i-an-origin-story/id732915228?i=1000684896813",
        "youtube": "https://www.youtube.com/watch?v=lNs14R92pfc"
      }
    },
    {
      "id": "5011d69c-fd01-4ca9-bc44-643d83bd6e95",
      "title": "Cults and Catholicism: The Story of Sodalitium Christianae Vitae",
      "description": "The Catholic Church is, by any measure, one of the largest religious forces on the planet. Throughout its long, at-times troubled history, it has weathered numerous scandals: accusations of abuse, crime, and cover-ups. In tonight\u0027s episode, Ben, Matt, and Noel explore the story of a still-unfolding case regarding an apostolic organization called Soladitium Christianae Vitae. Based in Peru, this group billed itself as a wholesome initiative to spread the work of Christ through engagement with the young and the poor. As the guys dig deeper, they uncover a vast, intergenerational conspiracy of abuse. They don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/ See omnystudio.com/listener for privacy information.",
      "release": "2025-01-17T19:38:09Z",
      "duration": "01:15:40.1600000",
      "explicit": false,
      "spotifyId": "2qvNrOLuvnFzWfbFwRguNa",
      "appleId": 1000684421053,
      "youTubeId": "4YCgATxDjVw",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qvNrOLuvnFzWfbFwRguNa",
        "apple": "https://podcasts.apple.com/podcast/cults-and-catholicism-the-story-of/id732915228?i=1000684421053",
        "youtube": "https://www.youtube.com/watch?v=4YCgATxDjVw"
      }
    },
    {
      "id": "977c2e56-21ea-4ee9-88d6-ff4462b892d1",
      "title": "CLASSIC: What is the Finders cult?",
      "description": "On Thursday, February 5, 1987, two men were arrested on suspicion of kidnapping six children and transporting them to Tallahassee, Florida. While the children were reportedly filthy and hungry, initial reports of abuse didn’t hold up. The mothers confirmed they knew the men, and the charges were eventually dropped. But this isn’t how the story ends -- instead, this is where the story of the Finders cult begins. They don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/ See omnystudio.com/listener for privacy information.",
      "release": "2024-06-25T15:00:00Z",
      "duration": "01:13:32.5770000",
      "explicit": false,
      "spotifyId": "7fwLbhdf0kfThVJCQwUzUM",
      "appleId": 1000660194719,
      "youTubeId": "d8cGEk_tKFA",
      "subjects": [
        "The Finders"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7fwLbhdf0kfThVJCQwUzUM",
        "apple": "https://podcasts.apple.com/podcast/classic-what-is-the-finders-cult/id732915228?i=1000660194719",
        "youtube": "https://www.youtube.com/watch?v=d8cGEk_tKFA"
      }
    },
    {
      "id": "48fb3684-2668-480a-8e59-f5741bb0f637",
      "title": "CLASSIC: Sex Cults and Rocket Science: The Jack Parsons Story",
      "description": "Jack Parsons was a rocket engineer and rocket propulsion researcher responsible for astonishing breakthroughs in his field. However, Parsons had a double life -- a private passion for the occult that led him to eventually join Aleister Crowley\u0027s new Thelemite religion, attempt the Babalon Working and hobknob with L. Ron Hubbard, the founder of Scientology. Tune in to learn more about the rocket scientist and real-life wizard Jack Parsons.They don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/See omnystudio.com/listener for privacy information.",
      "release": "2024-01-09T16:00:00Z",
      "duration": "01:16:04.2180000",
      "explicit": false,
      "spotifyId": "23BEODOiuKrCSwlvUO0jXn",
      "appleId": 1000641051242,
      "youTubeId": "-3qnMsavQRc",
      "subjects": [
        "Scientology",
        "Ordo Templi Orientis"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23BEODOiuKrCSwlvUO0jXn",
        "apple": "https://podcasts.apple.com/podcast/classic-sex-cults-and-rocket-science-the-jack-parsons-story/id732915228?i=1000641051242",
        "youtube": "https://www.youtube.com/watch?v=-3qnMsavQRc"
      }
    },
    {
      "id": "5b42498e-1958-4615-82a3-9878836df516",
      "title": "Companies Started By Cults, Part II",
      "description": "From fast food to mass media, it can be tough to know who really runs a company. In tonight\u0027s episode, the guys return to more true stories of companies that are either founded by or run by groups the average person would consider... cults.They don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/See omnystudio.com/listener for privacy information.",
      "release": "2023-10-13T00:00:00",
      "duration": "01:04:52.4270000",
      "explicit": false,
      "spotifyId": "5uhnD4VbNBntpxKxv8na7M",
      "appleId": 1000631227087,
      "youTubeId": "zQQc7TJkA2s",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5uhnD4VbNBntpxKxv8na7M",
        "apple": "https://podcasts.apple.com/podcast/companies-started-by-cults-part-ii/id732915228?i=1000631227087",
        "youtube": "https://www.youtube.com/watch?v=zQQc7TJkA2s"
      }
    },
    {
      "id": "b9d79489-9cd1-4900-b0d9-4f85f5ed6e8d",
      "title": "Strange News: The Kenyan Death Cult. A Mormon Whistleblower and a Staged Plane Crash",
      "description": "A whistleblower alleges the Church of Jesus Christ of Latter-day Saints hides billions of dollars. A horrifying, continuing investigation in Kenya reveals hundred of people have died at the orders of a now-arrested cult leader; and no one\u0027s sure what other crimes may be uncovered. A man attempts to purposely wreck a plane for clout. All this and more in this week\u0027s strange news segment.They don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/See omnystudio.com/listener for privacy information.",
      "release": "2023-05-22T00:00:00",
      "duration": "01:03:01.9030000",
      "explicit": false,
      "spotifyId": "0ixVXRLfvkFFrYKBy9BEp9",
      "appleId": 1000614011294,
      "youTubeId": "hGxHv861B3M",
      "subjects": [
        "Good News International Ministries",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ixVXRLfvkFFrYKBy9BEp9",
        "apple": "https://podcasts.apple.com/podcast/strange-news-the-kenyan-death-cult-a/id732915228?i=1000614011294",
        "youtube": "https://www.youtube.com/watch?v=hGxHv861B3M"
      }
    },
    {
      "id": "651fb7b7-2c15-4375-837f-eef02b0050b3",
      "title": "Modern Cults, Part II: The Creativity Movement and Kashi Ashram | STUFF THEY DON\u0027T WANT YOU TO KNOW",
      "description": "🛎  If You\u0027re New Subscribe ► https://bit.ly/STDWYTKSubscribe\n\nModern Cults, Part II: The Creativity Movement and Kashi Ashram | STUFF THEY DON\u0027T WANT YOU TO KNOW\n\nWhat makes one belief system a religion, and another a cult? How can non-religious organization themselves be cults? In part two of this two-part series, Ben, Matt and Noel explore modern cultic organizations. Warning: this episode not be appropriate for all listeners. \n\nOriginal Air Date: September 14, 2022 \n\n❤️ iHeartRadio » https://ihr.fm/3sDPAty\n📢APPLE PODCASTS » ‎https://apple.co/3U5E4mH\n📢AMAZON MUSIC » https://amzn.to/3fkUCZ7\n🟢SPOTIFY » https://spoti.fi/3zwAKZH\n🎥PREVIOUS VIDEO » https://youtu.be/L-iDVNu_SQQ\n📕GRAB YOUR COPY of Stuff They Don\u0027t Want You To Know » https://bit.ly/3N9DuSm\n👕GRAB YOUR MERCH » https://bit.ly/3f9YQm8\n\n✨ KEEP IN TOUCH WITH:\nFACEBOOK » https://bit.ly/3gDqRTs\nTWITTER » https://bit.ly/3TK3GFE\nINSTAGRAM » https://bit.ly/3FoWFpA\n\nFrom UFOs to psychic powers and government conspiracies, history is riddled with unexplained events. You can turn back now or learn the Stuff They Don\u0027t Want You To Know ... an audio podcast from iHeartRadio.\n\nNew episodes daily on iHeartRadio.\n\n#StuffTheyDontWantYouToKnow #StuffTheyDontWantYouToKnowHosts #StuffTheyDontWantYouToKnowPodcast #iHeartRadioStuffTheyDontWantYouToKnow #StuffTheyDontWantYouToKnowiHeartRadio #StuffTheyDontWantYouToKnowPodcastHosts #podcast #stdwytk #conspiracy #stufftheydontwantyoutoknow",
      "release": "2022-12-08T21:15:00Z",
      "duration": "00:56:39",
      "explicit": false,
      "youTubeId": "CV1_SJc2Qgw",
      "subjects": [
        "Ma Jaya",
        "The World Church of the Creator"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CV1_SJc2Qgw"
      }
    },
    {
      "id": "3170740a-a985-4db0-bbc8-2c039130a66e",
      "title": "Modern Cults, Part I: Black Hammers and More",
      "description": "What makes one belief system a religion, and another a cult? How can non-religious organization themselves be cults? In part one of this two-part series, Ben, Matt and Noel explore modern cultic organizations. They don’t want you to read our book. They don’t want you to see us on tour.They don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/See omnystudio.com/listener for privacy information.",
      "release": "2022-09-09T00:00:00",
      "duration": "01:06:01.1290000",
      "explicit": false,
      "spotifyId": "2itfDMOMlWi5qWJRfpY0AN",
      "appleId": 1000578961876,
      "youTubeId": "ICWPwdyYsgo",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2itfDMOMlWi5qWJRfpY0AN",
        "apple": "https://podcasts.apple.com/podcast/modern-cults-part-i-black-hammers-and-more/id732915228?i=1000578961876",
        "youtube": "https://www.youtube.com/watch?v=ICWPwdyYsgo"
      }
    },
    {
      "id": "947cb750-55f0-48ac-b1e9-8090140ed1a3",
      "title": "A Cult Called \u0022The Body\u0022",
      "description": "Matt and Ben explore the hard realities of a cult called \u0022The Body.\u0022\n\nThis is an excerpt from \u0022Listener Mail: Cartels and Animals, Blood Donation Bans, A Cult Called the Body.\u0022 On Instagram, Jessica explores the strange stories of cartels and exotic animals. Travis and Sam in Japan describe their own experiences with blood donation bans. Ben and Matt explore all this and more in this week\u0027s listener mail.\n\nListen to the full episode at https://apple.co/327uoQq\n\nCHAPTERS\n00:00 - Intro\n00:24 - An Email from Alexandra\n01:43 - The Rabbit Hole that is \u0022The Body\u0022\n06:28 - The Body Focuses on the Body?\n10:17 - First-hand Account\n\nPODCAST  |  https://apple.co/327uoQq\nWEBSITE  |  https://www.iheart.com/podcast/182-st...\nINSTAGRAM | http://www.instagram.com/conspiracyst...\nTWITTER  |  http://twitter.com/ConspiracyStuff\nFACEBOOK  |  http://www.facebook.com/ConspiracyStuff\n\nAbout the Show:\nFrom UFOs to psychic powers, ghosts and government cover-ups, history is riddled with unexplained events. But how can we get tell the truth from the fiction, and separate the fact from the rumor? Since 2008, Stuff They Don\u0027t Want You To Know has delved into the murky world of everything from cults to lost cosmonauts and allegations of the paranormal, applying critical thinking to the world\u0027s most prevalent conspiracy theories and, more often than not, discovering the disturbing grains of truth hidden in the heart of paranoia. Join Ben, Matt and Noel as they embark on their continuing quest to fit the puzzle pieces together, to connect the dots and follow the breadcrumbs into the truth behind the curtain, from the furthest reaches of the universe to the innermost depths of the human mind. You can turn back now or learn the Stuff They Don’t Want You To Know.\n\nAbout the Hosts:\nBen Bowlin is a writer, actor, and producer born to Melungeons from the hinterlands of TN. He has lived in Nashville, Quetzaltenango and, currently, Atlanta. He spent much of his youth traveling, conducting bizarre experiments, watching the Twilight Zone and hunting reports of paranormal activity. He is the recipient of numerous awards for writing and onstage performance. The legends surrounding his family\u0027s past instilled within him a fascination with the fringes of what\u0027s known to be true -- an obsession, of sorts, with the blank spaces on the edges of the map -- and, most importantly, a certainty the world is both understandable and worth understanding. He coined the term “conspiracy realism” and believes a good idea can change the world.\n\nMatt Frederick spent his earliest years almost exclusively outside, but this time was cut short by Nintendo’s dark designs. Thankfully Matt retained his desire to ‘hit things with sticks’ - a skill that would lead him to play drums in the Super Bowl XXXIV Halftime Show. In 2002 Matt portrayed an aging, one-armed man named Candy in “Of Mice and Men” at the International Thespian Conference in Lincoln, Nebraska (where he hugged his future wife for the first time). In his college years, while working as a servant of sorts at a prestigious private club in Atlanta, Matt became highly aware of the sharp divisions in our society.\n\nNoel Brown is a podcaster, musician, and filmmaker living in Atlanta, Georgia. Born to two opera singers in Wurzburg Germany, Brown spent his early childhood traveling abroad with his parents, making his home in the dressing rooms of great opera houses the world over. As he wandered through these clandestine corners of high society, Brown developed an unshakable sense that something hidden was operating beneath the surface of it all. Something sinister and unseen pulling the strings. Brown took his first dive into the world of conspiracy realism with a documentary on the Georgia Guidestones, a mysterious granite monument bearing a list of commandments for establishing a new world order. The film went on to win the award for best documentary short at the Atlanta Film Festival. Now, as a member of the Stuff They Don\u0027t Want You to Know hive-mind, Brown has made a full-time job of chasing the truth around unseen forces that shape our world.\n\n#stdwytk #stufftheydontwantyoutoknow #conspiracy #podcast",
      "release": "2022-07-11T17:38:18Z",
      "duration": "00:13:43",
      "explicit": false,
      "youTubeId": "Yd7AEpIIHJk",
      "subjects": [
        "Marc Bisset"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Yd7AEpIIHJk"
      }
    },
    {
      "id": "5da33b8e-1089-421c-a6c2-da84d23709df",
      "title": "Cults: Indoctrination and Escape",
      "description": "When most people hear the word \u0022cult,\u0022 they immediately think of people like Charles Manson, or any number of controversial organizations strewn across the planet -- but what exactly makes something a cult? How do cultic groups acquire new members, and what can we do to help a loved one steer clear of this manipulation? In today\u0027s interview the guys join Liz Iacuzzi and Tyler Measom, the creators and hosts of the new Was I In A Cult?, to learn more about how cults work, how people find themselves involved, and -- most importantly -- how they get out.  Learn more about your ad-choices at https://www.iheartpodcastnetwork.comThey don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/See omnystudio.com/listener for privacy information.",
      "release": "2021-11-05T00:00:00",
      "duration": "01:01:04.3520000",
      "explicit": false,
      "spotifyId": "2suSHlOYKJ0gGtkgFCVstx",
      "appleId": 1000540892607,
      "youTubeId": "iBP16nZgqGM",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2suSHlOYKJ0gGtkgFCVstx",
        "apple": "https://podcasts.apple.com/podcast/cults-indoctrination-and-escape/id732915228?i=1000540892607",
        "youtube": "https://www.youtube.com/watch?v=iBP16nZgqGM"
      }
    },
    {
      "id": "de9c1882-6fe9-4332-b1ed-2dee751c055f",
      "title": "Did a cult try to run South Korea?",
      "description": "In 2017 South Korean President Park Guen-hye was impeached and ousted from power as a result of a wide-reaching corruption scandal touching everything from big business to religion. In the aftermath, the world’s been left asking: What exactly happened? Was this another tragic case of nepotism and bribery, or … something more? Was South Korea’s President the victim of a cult?  Learn more about your ad-choices at https://www.iheartpodcastnetwork.comThey don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/See omnystudio.com/listener for privacy information.",
      "release": "2017-10-20T00:00:00",
      "duration": "00:56:09.8740000",
      "explicit": false,
      "spotifyId": "6Zgv0CgVP7Wa48WP7OD6m5",
      "appleId": 1000393787721,
      "youTubeId": "eAcT6h6ZfLg",
      "subjects": [
        "Choi Tae-min"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Zgv0CgVP7Wa48WP7OD6m5",
        "apple": "https://podcasts.apple.com/podcast/did-a-cult-try-to-run-south-korea/id732915228?i=1000393787721",
        "youtube": "https://www.youtube.com/watch?v=eAcT6h6ZfLg"
      }
    },
    {
      "id": "df990246-0abf-4a20-8561-74dec807a3e7",
      "title": "Cults (You\u0027ve Never Heard Of)",
      "description": "What\u0027s the difference between a cult and a religion? What are some of history\u0027s strangest cults? Are there any secret cults in the modern day? Tune in to learn more.  Learn more about your ad-choices at https://www.iheartpodcastnetwork.comThey don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/See omnystudio.com/listener for privacy information.",
      "release": "2014-03-21T00:00:00",
      "duration": "00:48:44.8780000",
      "explicit": false,
      "spotifyId": "6a2mw22LXS3FLNPUiZLDST",
      "appleId": 1000281819830,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6a2mw22LXS3FLNPUiZLDST",
        "apple": "https://podcasts.apple.com/podcast/cults-youve-never-heard-of/id732915228?i=1000281819830"
      }
    },
    {
      "id": "5af55731-7320-4c06-a156-6e799876ab39",
      "title": "Serial Killer Cults",
      "description": "Serial killers are insane, prone to exaggeration and delusion, and often inveterate liars. Amid some of their wilder claims, several notable serial killers, such as David Berkowitz and Henry Lee Lucas, have stated that they were killing on the orders of a cult. Is there any way it could be true? Tune in to learn more about the Hand of Death, Four Pi and other alleged serial killer cults.  Learn more about your ad-choices at https://www.iheartpodcastnetwork.comThey don\u0027t want you to read our book.: https://static.macmillan.com/static/fib/stuff-you-should-read/See omnystudio.com/listener for privacy information.",
      "release": "2014-01-17T00:00:00",
      "duration": "00:30:22.0140000",
      "explicit": false,
      "spotifyId": "5tduVE95ip4CdlCrR1LrZt",
      "appleId": 1000232273865,
      "subjects": [
        "David Berkowitz"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tduVE95ip4CdlCrR1LrZt",
        "apple": "https://podcasts.apple.com/podcast/serial-killer-cults/id732915228?i=1000232273865"
      }
    }
  ]
}