{
  "_ts": 0,
  "id": "c7918c17-f845-49ef-a938-0cc6fcee167e",
  "name": "Stuttering in Silence",
  "spotifyId": "1lmWFx3WrvhPXZ2XBunvST",
  "appleId": 1590450677,
  "episodes": [
    {
      "id": "301d525d-fb98-4418-ae84-c435aad186e6",
      "title": "Blood Oaths, Mummified Prophets, and Anthill Nightmares: Three Cults That Shocked the World",
      "description": "In this gripping episode, we uncover the chilling stories behind three infamous cults that pushed the boundaries of belief and control, from Roch Thériault\u0027s Anthill Kids, where followers endured unthinkable torture in the name of salvation, to Amy Carlson’s Love Has Won, a modern-day New Age cult with a disturbing end. We also dive deep into the Church of the Lamb of God, led by the murderous prophet Ervil LeBaron, who turned religious doctrine into a deadly hit list. Discover the twisted timelines, conspiracies, and the lasting impact of these groups on society—both then and now. Prepare for a shocking exploration into the minds of cult leaders and their followers, as well as the public’s reaction to these disturbing chapters of history.",
      "release": "2025-01-23T22:00:13Z",
      "duration": "01:00:45.5960000",
      "explicit": false,
      "spotifyId": "2h5j8Y47v8qkDMHDaS1ni1",
      "appleId": 1000685222657,
      "subjects": [
        "Church of the First Born of the Lamb of God",
        "Love Has Won",
        "Ant Hill Kids"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2h5j8Y47v8qkDMHDaS1ni1",
        "apple": "https://podcasts.apple.com/podcast/blood-oaths-mummified-prophets-and-anthill-nightmares/id1590450677?i=1000685222657"
      }
    },
    {
      "id": "27b4ee6e-4df0-4413-8585-070e38957c78",
      "title": "Cult Chronicles: Rajneesh, Solar Temple, and Aum Shinrikyo",
      "description": "In this chilling episode of Stuttering in Silence, Matt and Gavin delve into the twisted histories of three infamous cults that left their mark on the world. Explore the bizarre rise and fall of the Rajneesh Movement, the horrifying murder-suicides orchestrated by the Order of the Solar Temple, and the devastating Tokyo subway attack carried out by Aum Shinrikyo. Discover the conspiracies that still surround these groups, how they manipulated their followers, and how society responded both then and now. Buckle up — this episode will make you question how far belief can go when it falls into the wrong hands.",
      "release": "2025-01-09T23:05:00Z",
      "duration": "01:11:19.9570000",
      "explicit": false,
      "spotifyId": "5MLDNTNthqIfmYJPjwi6zJ",
      "appleId": 1000683385896,
      "subjects": [
        "Aum Shinrikyo",
        "Bhagwan Shree Rajneesh",
        "Order of the Solar Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5MLDNTNthqIfmYJPjwi6zJ",
        "apple": "https://podcasts.apple.com/podcast/cult-chronicles-rajneesh-solar-temple-and-aum-shinrikyo/id1590450677?i=1000683385896"
      }
    },
    {
      "id": "e7fc9edb-372b-4949-93f3-731947883b99",
      "title": "Cult Minds: Tragedy and Power – The Branch Davidians, Children of God, and NXIVM",
      "description": "Dive deep into the chilling tales of three infamous cults that shocked the world. In this episode, we unravel the apocalyptic fervor of the Branch Davidians and the fiery siege that ended in tragedy. We confront the disturbing practices of the Children of God, a group that weaponized faith and manipulated innocence. Finally, we explore the rise and fall of NXIVM, a self-help organization that became a nightmare of coercion and exploitation. Join us as we examine the psychological grip of these groups, the conspiracies and scandals surrounding them, and their enduring impact on society. How do such movements thrive, and what can we learn to guard against them today?",
      "release": "2025-01-02T22:00:09Z",
      "duration": "00:52:00.8220000",
      "explicit": true,
      "spotifyId": "4EGK87FDJqm85B3VPdSCRZ",
      "appleId": 1000682459021,
      "subjects": [
        "Branch Davidians",
        "Children Of God",
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EGK87FDJqm85B3VPdSCRZ",
        "apple": "https://podcasts.apple.com/podcast/cult-minds-tragedy-and-power-the-branch/id1590450677?i=1000682459021"
      }
    }
  ]
}