{
  "_ts": 0,
  "id": "657d1165-ffbe-4641-929d-9790b14246fe",
  "name": "Success Unscripted",
  "spotifyId": "2pw0pA3KDdq0mbA15SWEeA",
  "appleId": 1716066429,
  "youTubeChannelId": "UCtGaj7XF2Lm7F6mJ24KhXjw",
  "episodes": [
    {
      "id": "64e6bf08-9f94-475d-af32-50c6a68d0b58",
      "title": "S1 E10: Tell me I’m Pretty",
      "description": "In this episode of Success Unscripted, my guest Jon Johnson, Principal Strategic Customer Success Manager at UserTesting discusses his background and journey from a challenging childhood to his current role. \n\nHe shares insights into strategies he employs to drive success and his desire to expand his impact within the company. \n\nThe conversation flows into the direction of topics like personal growth, self-love and acceptance. \n\nKey Highlights:\n\n- Advice to CS Leaders: Jon talks about the key factors required for success in a  customer success role.\n- Importance of Self-love and acceptance: We go deep into talking about personal growth, self-reflection and feedback from past experiences and relationship and how it shaped us into who we are.\n- Ambition vs Contentment: Jon highlights the importance of embracing one\u0027s inner child and finding contentment in the present moment.\n\nThis episode highlight the importance of past experience in workplace and how to build a balance between ambition and contentment. Also, mentioning the importance of self-love and personal growth, making this episode a must-listen for professionals at any stage of their careers.\n\nTo connect with Jon:\nhttps://www.linkedin.com/in/jonwilliamjohnson/\n\nTo share feedback or get in touch with Sara, visit [www.unscriptedpod.com](http://www.unscriptedpod.com/) \n\nTo connect with Sara: \nhttps://www.linkedin.com/in/saralynneroberts/",
      "release": "2024-03-15T18:19:00Z",
      "duration": "00:46:24",
      "explicit": false,
      "spotifyId": "4FjDF53gYDLMcHLKGryEvB",
      "appleId": 1000649357320,
      "youTubeId": "jeeMiLWzNdU",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4FjDF53gYDLMcHLKGryEvB",
        "apple": "https://podcasts.apple.com/podcast/s1-e10-tell-me-im-pretty/id1716066429?i=1000649357320",
        "youtube": "https://www.youtube.com/watch?v=jeeMiLWzNdU"
      }
    }
  ]
}