{
  "id": "8f86bad5-fb89-4235-b9ff-085407a679a7",
  "name": "Sunday Papers Live",
  "youTubeChannelId": "UCZzvSsMn69pfv2hXDgUN9Dg",
  "episodes": [
    {
      "id": "afaa1fc7-5cc6-44a8-b843-7ea4618e52c3",
      "title": "My dad joined a sex cult - Lily Dunn - Lifestyle Section - #20 Edition",
      "description": "A daughter and the outcome of a man who lived a life led by his own desires. In conversation Lily discusses her book which explores the experience, trauma and her attempt to reconcile the legacy of her father who left the family home to follow his guru to India and the promise of enlightenment with the cult of Bhagwan Shree Rajneesh.  A pursuit of transcendence that journeyed through sex addiction via the Rajneesh cult, to a relentless chase of money, and ended in ruin, alcohol and drug addiction.\n\nEVERYONE IS INTERESTED IN EVERYTHING\n\nSunday Papers Live. The broadsheets brought to life - Covering sections like Politics, World News, Food, Music, Culture, and Lifestyle. From in-depth discussions on current affairs to light-hearted silliness, the event showcases a rich tapestry of people and opinions.\n\nThe idea of relaxing in a massive living room, sipping a Bloody Mary while being regaled with stories and insights from a diverse and inspiring array of writers, professors, activists and journalists seems to us like the perfect way to spend a Sunday.\n\nSetting out to provide nothing less than the ultimate Sunday. To reimagine its vital elements as communal experiences: papers, roasts and Bloody Marys.\n\nThe editorial policy of Sunday Papers Live is proudly open minded working upon the assumption that everyone is interested in everything.\n\nLive is better\nHail Sundays\nPassion is contagious\nLove thy neighbour\nThe world is worthy of improvement\nHail Brunch. Hail Roasts. Hail Bloody Marys",
      "release": "2025-04-06T06:12:27Z",
      "duration": "00:15:09",
      "explicit": false,
      "youTubeId": "lKC_NlNMlOI",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lKC_NlNMlOI"
      }
    }
  ]
}