{
  "id": "13499d54-e311-4684-9087-3d5c2d050c69",
  "name": "Sunday School Dropouts",
  "spotifyId": "19H6d4ew569gEVNT5w7PxI",
  "appleId": 1689312239,
  "episodes": [
    {
      "id": "89d9c86a-b4f7-4cb1-9ca8-f23761c3d6c7",
      "title": "Wrapping up Season 2!",
      "description": "In the season two finale of the Sunday School Dropouts podcast, Andrew and Laura recap their experiences and favorite episodes from the past season. They share personal anecdotes about the impact of high control religion on finances, trauma-informed therapy, and purity culture.\nLaura and Andrew highlight significant episodes such as their conversation with Jo Luehmann about financial trauma and Angela Denker on American boyhood and radicalization. The hosts also discuss their summer plans, which include writing projects and potential future topics for the next season. The episode ends with a nod to future explorations of purity culture in the upcoming season.\nThis podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery \nThe views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions.\nThe Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. \nFollow Andrew on Instagram and TikTok @deconstruct_everything \nFollow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com \nHosts: \nLaura Anderson and Andrew Kerbs\nMusic by Benjamin Faye Music @heytherebenji \nEditing and Production by Kevin Crowe and can be found at  kevincrowe.co",
      "release": "2025-05-27T10:00:00Z",
      "duration": "01:00:09",
      "explicit": false,
      "spotifyId": "3iXgsh1gVo32DsxQktQOaX",
      "appleId": 1000710085424,
      "subjects": [
        "Purity Culture",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3iXgsh1gVo32DsxQktQOaX",
        "apple": "https://podcasts.apple.com/podcast/wrapping-up-season-2/id1689312239?i=1000710085424"
      }
    },
    {
      "id": "ce95ae85-3852-48e0-a188-836b68501e4e",
      "title": "(Re-Release) Purity Culture Poster Child to Pastor to Black Sheep w/ Josh Harris",
      "description": "This week we will be talking to a notorious former pastor about their experience growing up inside high control religion, becoming a poster child for purity culture, being set up to take over for a large church and ultimately giving it all up, deconstructing his faith and leaving the church. If you grew up in evangelicalism, and likely even if you didn’t, you’re sure to be familiar with Joshua Harris, author of the wildly popular Christian dating, ahem, courting, book, I Kissed Dating Goodbye. He’s here to share with us about his time inside of high control religion, what opened his eyes to the unhealthy dynamics inside the church and his process of healing after leaving. It’s an episode that all of our younger selves never saw coming and definitely one you won’t want to miss! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-05-20T13:00:00Z",
      "duration": "01:18:47.9020000",
      "explicit": false,
      "spotifyId": "5fD4ccKmenDptX3hRfTBER",
      "appleId": 1000709139296,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5fD4ccKmenDptX3hRfTBER",
        "apple": "https://podcasts.apple.com/podcast/re-release-purity-culture-poster-child-to-pastor-to/id1689312239?i=1000709139296"
      }
    },
    {
      "id": "779dec5a-227d-469e-a00a-e1b5b3e44fbc",
      "title": "Spiritual Abuse \u002B Adverse Religious Experiences",
      "description": "What are Adverse Religious Experiences (AREs) and spiritual abuse? Aren’t they the same thing as religious trauma? Join Andrew and Laura on this week’s episode to discuss AREs, spiritual abuse, dynamics of power and control, how this relates to fundamentalism and how all of this…isn’t religious trauma? You heard us correctly!  Andrew and Laura discuss all of this AND how these things can result in religious trauma on this episode of Sunday School Dropouts!\nThis podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery \nThe views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions.\nThe Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. \nFollow Andrew on Instagram and TikTok @deconstruct_everything \nFollow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com \n\n\nHosts: \nLaura Anderson and Andrew Kerbs\nMusic by Benjamin Faye Music @heytherebenji \nEditing and Production by Kevin Crowe",
      "release": "2025-05-13T10:00:00Z",
      "duration": "01:08:53",
      "explicit": false,
      "spotifyId": "3xg0P7Zcj6nTmmMHQyd8Ns",
      "appleId": 1000708306443,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3xg0P7Zcj6nTmmMHQyd8Ns",
        "apple": "https://podcasts.apple.com/podcast/spiritual-abuse-adverse-religious-experiences/id1689312239?i=1000708306443"
      }
    },
    {
      "id": "9349d710-b8b1-42a5-8221-4d0fc389d00b",
      "title": "Spiritual Meritocracy",
      "description": "In this episode, Laura and Andrew engage in a lively discussion with Janice Lagata about her experiences growing up in evangelicalism, her time at Hillsong College, and the importance of literature and financial therapy. They explore themes of banned books, free speech, and the influence of worship music on personal faith. The conversation is rich with insights and personal anecdotes, making it a compelling listen for anyone interested in the intersections of faith, culture, and personal growth.\nIn this conversation, Janice Lagata shares her journey from moving to New York and joining Hillsong to her struggles with church culture, identity, and the impact of purity culture. She reflects on her experiences within a male-dominated evangelical space, the expectations placed on women, and the burden of not having a personal testimony. Janice discusses her eventual departure from Hillsong, seeking healthier communities, and the complexities of serving in church environments that demand much while often perpetuating shame. In this conversation, the speakers delve into the complexities of faith, race, and the intersections of capitalism and evangelicalism.\nThey explore the trials of personal transformation, the cultural discrepancies faced by people of color in faith communities, and the problematic nature of church planting. The discussion also highlights the spiritual capitalism inherent in evangelicalism and the stagnation observed in deconstruction spaces, ultimately questioning the authenticity of new leadership dynamics. In this conversation, Laura Anderson and Janice Lagata explore the complexities of leaving evangelicalism, addressing themes such as embodied fundamentalism, the impact of capitalism, the challenges of grifting, and the role of privilege in ex-vangelical spaces. They emphasize the importance of personal responsibility, community, and self-trust in the deconstruction journey, while also recognizing the need for diverse voices and perspectives in these discussions.\nTo connect with Janice, check out her website: https://janicelagata.com/ –from there you can join her Patreon, Substack, and hear about the other cool projects and offerings she has!\nThis podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery \nThe views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions.\nThe Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. \nFollow Andrew on Instagram and TikTok @deconstruct_everything \nFollow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com \nHosts: \nLaura Anderson and Andrew Kerbs\nMusic by Benjamin Faye Music @heytherebenji \nEditing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2025-05-06T10:00:00Z",
      "duration": "01:37:22",
      "explicit": false,
      "spotifyId": "0739e8jWRBS1A1EwXsLDiO",
      "appleId": 1000706505656,
      "subjects": [
        "Evangelicalism",
        "Hillsong",
        "Psychology",
        "Purity Culture",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0739e8jWRBS1A1EwXsLDiO",
        "apple": "https://podcasts.apple.com/podcast/spiritual-meritocracy/id1689312239?i=1000706505656"
      }
    },
    {
      "id": "517084be-b2e1-4a12-b670-ba9766dd6ea7",
      "title": "If You\u0027re Poor, You Deserve It w/ Jo Luehmann",
      "description": "Jo Luehmann shares her journey from being a pastor to deconstructing her faith, focusing on the financial challenges and mindsets that shaped her path. The episode also explores strategies for overcoming financial anxiety and reclaiming autonomy after leaving high-control religious settings. Resources Mentioned: Psychology of Money by Morgan Housel Your First Million by Arlan Hamilton Your Journey to Financial Freedom by Jamila Souffrant Keeping Finance Personal by Ellyse Fulmore We should all be millionaires Rachel Rodgers The Art of Thinking Clearly by Rolf Debelli Thinking Fast and Slow by Daniel Kahnemen To follow Jo’s work: @joleuhmann across all platforms! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-04-29T10:00:00Z",
      "duration": "01:40:02",
      "explicit": false,
      "spotifyId": "45yZ6HoOOgR3m4L2n4v3Lo",
      "appleId": 1000705388916,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/45yZ6HoOOgR3m4L2n4v3Lo",
        "apple": "https://podcasts.apple.com/podcast/if-youre-poor-you-deserve-it-w-jo-luehmann/id1689312239?i=1000705388916"
      }
    },
    {
      "id": "fecf2f3d-d57c-4c33-856b-9a8e0c987e0f",
      "title": "The Radicalization of American Boyhood with Rev. Angela Denker",
      "description": "In this episode of the Sunday School Dropouts podcast, Angela Denker joins Andrew to discuss her new book, \u0027Disciples of White Jesus: The Radicalization of American Boyhood\u0027. Reverend Denker explores themes of masculinity, gender narratives, and the influence of culture and church on boys and men. Highlighting the shifting political landscape, she emphasizes the impact of figures like Elon Musk and the ways social media algorithms contribute to radicalization. They touch upon the role of community in countering harmful narratives and supporting healthy identities in boys. They also reflect on the need to balance holding harmful figures accountable while providing compassion and support on a grassroots level. Angela’s Substack: https://angeladenker.substack.com This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-04-22T10:00:00Z",
      "duration": "00:44:55",
      "explicit": false,
      "spotifyId": "3lV5ww977bkgyyGUlrmwzL",
      "appleId": 1000704435304,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3lV5ww977bkgyyGUlrmwzL",
        "apple": "https://podcasts.apple.com/podcast/the-radicalization-of-american-boyhood-with/id1689312239?i=1000704435304"
      }
    },
    {
      "id": "395e8d44-72a7-4a3a-9a5d-2e270cb8c540",
      "title": "Giving Up God with Sarah Henn Hayward",
      "description": "This week on Sunday School Dropouts, we\u0027re joined by author Sarah Henn Hayward for an honest, insightful conversation about her journey from devout Christianity to agnostic atheism. Sarah, author of Giving Up God, opens up about her upbringing in the Evangelical Free Church and the slow, freeing path of deconstruction that followed. She reflects on purity culture, youth group experiences, and the internal conflicts that led her to start questioning her faith. We also talk about what it’s like to navigate relationships—especially marriage—when belief systems diverge. Sarah shares how she’s held onto values like love, humility, and generosity, even as her theology shifted. She offers a refreshing take on parenting, spirituality, and staying connected to a sense of wonder outside of religion. Learn more about Sarah and her work at sarahhennhayward.com On Instagram she is: @shaywardwrites Buy Sarah’s book, “ Giving Up God ” anywhere where books are available! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-04-15T10:00:00Z",
      "duration": "00:59:31",
      "explicit": false,
      "spotifyId": "5Wzs5LwYe2qRUXq5QW39GR",
      "appleId": 1000703579442,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Wzs5LwYe2qRUXq5QW39GR",
        "apple": "https://podcasts.apple.com/podcast/giving-up-god-with-sarah-henn-hayward/id1689312239?i=1000703579442"
      }
    },
    {
      "id": "69a2bd42-e6b3-4a3f-9d25-384c352db3e9",
      "title": "It’s Time to Talk about Men Healing from Purity Culture (re-release)",
      "description": "The holidays are over and we are back into our purity culture mini-series! This month we are talking about purity culture and it’s impact on individuals who grew up male in this system. We are thrilled to have Dr. Bradley Onishi on the podcast today as our professional who has done research and client-facing work in this area as well as being a purity culture poster boy himself. Join Brad and Laura as they discuss the unique impacts of purity culture on men, shame, the expectations of being a “Godly man” and what happens when you don’t measure up to that, as well as the importance of men learning how to step out of of the prescribed roles and mentality that both purity culture and patriarchy prop up. Resources Mentioned: Fair Play (book and game) by Eve Rodsky Mild at Heart podcast series (can be found on the website below and using “Mild” in the search bar) Guest: Brad Onishi Website: https://www.straightwhiteamericanjesus.com Instagram/TT: @straightwhitejc This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-04-08T10:00:00Z",
      "duration": "01:11:38",
      "explicit": false,
      "spotifyId": "0dVVPAo5dkyBKMKzJRXE2I",
      "appleId": 1000702682726,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dVVPAo5dkyBKMKzJRXE2I",
        "apple": "https://podcasts.apple.com/podcast/its-time-to-talk-about-men-healing-from-purity-culture/id1689312239?i=1000702682726"
      }
    },
    {
      "id": "465a89c3-6521-4a59-b8d6-ae9e86ec8501",
      "title": "The Impact of Purity Culture on Women (re-release)",
      "description": "We are thrilled to have with us today Dr. Tina Schermer Seller who is an author, researcher, professor, and psychotherapist specializing in the impacts of purity culture, shame resilience, gender, and sexuality. In this episode, Dr. Tina shares her research and how she came to realize the psychological and physiological impact of purity culture and how that shaped the direction of her work with clients, students, and her writing. In the episode, Dr. Tina shares an incredible definition of sexual shame (see below) that can help us understand the felt sense experience of purity culture! But before we talk to Dr. Tina, we have a vocabulary lesson on what are porn and sex addictions really and why religion is so quick to diagnoses people with them, and we’ll also be taking some prayer requests! This is an episode you won’t want to miss! Dr. Tina’s definition of sexual shame (taken from the dissertation of Noel Clarke): Sexual shame is a visceral feeling of humiliation and disgust toward one’s own body and identity as a sexual being and a belief of being abnormal, inferior and unworthy. this feeling can be internalized but also manifests in interpersonal relationships having a negative impact on trust, communication, and physical and emotional intimacy. Sexual shame develops across the lifespan in interactions with interpersonal relationships, one’s culture and society, and subsequent critical self-appraisal (a continuous feedback loop). There is also a fear and uncertainty related to one’s power or right to make decisions, including safety decisions, related to sexual encounters, along with an internalized judgement toward one’s own sexual desire. You can find Dr. Tina at: Instagram: @drtinashameless Facebook: @TinaSSellers Twitter: @TinaSSellers Website: https://www.tinaschermersellers.com Psychedelic assisted psychotherapy: www.Inannarising.org Dr. Tina’s Books: Sex, God, and the Conservative Church Shameless Parenting – Everything You Need to Raise Shame-free, Confident, Kids and Heal Your Shame Too This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-04-01T10:00:00Z",
      "duration": "01:28:50",
      "explicit": false,
      "spotifyId": "0OmwuHfe6uetuJtWIQdrtd",
      "appleId": 1000701712851,
      "subjects": [
        "Purity Culture",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0OmwuHfe6uetuJtWIQdrtd",
        "apple": "https://podcasts.apple.com/podcast/the-impact-of-purity-culture-on-women-re-release/id1689312239?i=1000701712851"
      }
    },
    {
      "id": "104255ee-0e8b-4417-8256-1c1c8106600f",
      "title": "Fundamentalism…it just really f**ks you up with Andrew Pledger",
      "description": "In this episode of Sunday School Dropouts, Andrew Pledger opens up about his journey growing up in the Independent Fundamental Baptist (IFB) movement and the lasting effects of religious trauma on his mental health, sexuality, and sense of identity. He shares his experiences navigating legalism, spiritual abuse, and the pressure to conform, including his time at Bob Jones University and the emotional toll of leaving such a high-control environment. Andrew discusses the coping mechanisms he developed, such as dissociation, and how creativity, storytelling, and community have played a vital role in his healing. Through vulnerability and reflection, he offers encouragement to others seeking freedom, self-acceptance, and authentic love beyond oppressive systems. This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-03-25T10:00:00Z",
      "duration": "01:34:03",
      "explicit": false,
      "spotifyId": "7ekmgqHwsRnTTpvimMtmbH",
      "appleId": 1000700737284,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7ekmgqHwsRnTTpvimMtmbH",
        "apple": "https://podcasts.apple.com/podcast/fundamentalism-it-just-really-f-ks-you-up-with-andrew/id1689312239?i=1000700737284"
      }
    },
    {
      "id": "0133de79-7a09-4972-b6bc-cf4a048b57f6",
      "title": "Going Broke for God",
      "description": "Today we are joined by Andrew Pledger to talk about the financial burden that going to a religious college/university can cause. We get into not only the cost of these institutions but the extended control they have over all aspects of someone’s life, even when it’s the time in life where you’re developmentally ready to have more freedom. Andrew shares his story with us about how he chose to go to Bob Jones University, what was required when he got there, the rules he had to follow and the financial consequences he had when he didn’t follow the rules. To follow Andrew or learn more about his work, go to: @andrewpledgerwrites on Instagram Check out his podcast series “Surviving Bob Jones University” wherever you listen to podcasts! All of Andrew’s links and projects can be found here To learn more about the support groups offered at the Center for Trauma Resolution and Recovery or to sign up, click here This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2025-03-18T10:00:00Z",
      "duration": "01:22:05",
      "explicit": false,
      "spotifyId": "3Uv87HkbtYVPH3Zqd5Ycr4",
      "appleId": 1000699628026,
      "subjects": [
        "Bob Jones University",
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Uv87HkbtYVPH3Zqd5Ycr4",
        "apple": "https://podcasts.apple.com/podcast/going-broke-for-god/id1689312239?i=1000699628026"
      }
    },
    {
      "id": "15a05a6b-c598-4516-b8ab-ca49611735a2",
      "title": "The Perfect Body for God with Zach Anderson",
      "description": "In this conversation, Zach Anderson shares his journey of growing up in the Mormon Church, navigating his identity as a gay man, and the impact of high control religions on mental health and body image. He discusses his process of resigning from the church, the challenges of coming out, and how these experiences shaped his approach to nutrition coaching. The conversation also explores the intersections of purity culture, diet culture, and the nuances of intuitive eating, emphasizing the importance of self-acceptance and healing from trauma. In this conversation, Zach Anderson discusses the importance of nutrition, the impact of metabolic adaptation, and the psychological barriers many face regarding food. He emphasizes the need to break free from scarcity mindsets and perfectionism, particularly in the context of fundamentalist beliefs. The discussion also touches on the long-term effects of food restrictions and the importance of self-compassion in the journey of healing and growth. Zach shares insights on how to navigate rigidity in beliefs about food and body image, ultimately aiming to foster a healthier relationship with nutrition and oneself. Connect with Zach: IG: @motionsustained Website: motionsustained.com Find out more about working with Zach on his Kate Lyman webpage To learn more about the support groups offered at the Center for Trauma Resolution and Recovery or to sign up, click here This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2025-03-11T10:00:00Z",
      "duration": "01:35:07",
      "explicit": false,
      "spotifyId": "0KZ8N1I6X86AhkgXNmzZBs",
      "appleId": 1000698718875,
      "subjects": [
        "Purity Culture",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0KZ8N1I6X86AhkgXNmzZBs",
        "apple": "https://podcasts.apple.com/podcast/the-perfect-body-for-god-with-zach-anderson/id1689312239?i=1000698718875"
      }
    },
    {
      "id": "ee716639-d902-4f23-956f-6b98f858770e",
      "title": "Choosing Relationship over Doctrine RE-RELEASE",
      "description": "Now more than ever, many of us are having to navigate relationships with family members and friends who are grappling with choosing relationships with people over their belief/doctrines. Perhaps you are wrestling through that too? We are revisiting one of our favorite episodes with guests Beecher and April who share with us their own story of choosing relationship with each other over rigid theology and doctrine. Also, the Center for Trauma Resolution and Recovery is offering their spring support groups! Whether it’s learning boundaries, how to navigate family members, deconstructing common issues post-religion, healing from toxic religion, embodying pleasure and safety after high control religion, or getting in touch with your inner child, we have support for you! To learn more about the support groups offered at the Center for Trauma Resolution and Recovery or to sign up, click here This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-03-04T12:00:00Z",
      "duration": "01:16:07",
      "explicit": false,
      "spotifyId": "3uVDbpWUoatHJOWQSWnMfH",
      "appleId": 1000697628805,
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uVDbpWUoatHJOWQSWnMfH",
        "apple": "https://podcasts.apple.com/podcast/choosing-relationship-over-doctrine-re-release/id1689312239?i=1000697628805"
      }
    },
    {
      "id": "213cecb6-221d-4bd9-8c3d-9a049c0587b3",
      "title": "Sex Education After Sunday School",
      "description": "Today we are excited to have Dr. Celeste Holbrook on the podcast! Celeste is a sex educator, author, speaker, and sexologist with her own story of healing after purity culture. She uses her personal experiences to inspire her professional work and helps folks untangle the long-lasting, embodied impacts of the messages they were taught about their bodies, sex, and pleasure. Today we are talking about all the sex education your Sunday school teachers never taught you! Connect with Celeste! Website: www.drcelesteholbrook.com Instagram: @drcelesteholbrook This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-02-25T12:00:00Z",
      "duration": "01:25:36",
      "explicit": false,
      "spotifyId": "1fwl3j4KMge9VH3dVBMd9s",
      "appleId": 1000695847537,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1fwl3j4KMge9VH3dVBMd9s",
        "apple": "https://podcasts.apple.com/podcast/sex-education-after-sunday-school/id1689312239?i=1000695847537"
      }
    },
    {
      "id": "a6be4540-1013-40a7-be45-8671843ec478",
      "title": "Leaving the Orthodox Community w/ Rikki Herbst",
      "description": "In this episode of Sunday School Dropouts, Rikki Herbst shares her journey of leaving the Orthodox Jewish community in New York. She reflects on growing up in a tightly knit, insular environment and the emotional challenges of stepping away. Drawing parallels to other religious exits—like evangelicalism—she explores the complexities of reclaiming autonomy and finding support. As a therapist, Rikki offers insights on religious trauma from both personal and professional perspectives. You’re listening to Sunday School Dropouts Both of us grew up in high control religion and spent years trying to live up to the rules and standards until one day, we couldn’t do it anymore. We spent our lives aspiring to be true followers of God and all we got from it was religious trauma. So now, we’re taking our lived experiences along with our education, training, and work with clients to create this podcast–a podcast that goes beyond deconstruction and focuses on the unique aspects healing and recovery for folks coming out of high control religions, cults, fundamentalism, purity culture and those with religious trauma. Each episode we’ll be talking with other experts, mental health practitioners, coaches, advocates, therapists and folks who have survived fundamentalist systems, to learn from their experiences and offer resources and support for healing. This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com And before we get started, it’s important for you to know that: The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and REcovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. We are not anti-religion but we are anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. We are two individuals using our academic backgrounds and training and personal experiences to provide a safe and supportive space for those recovering from fundamentalist groups and systems. If you’re interested in finding a trauma-informed practitioner, go to https://www.traumaresolutionandrecovery.com to schedule your free inquiry call with a practitioner of your choice. Follow us on Instagram: https://www.instagram.com/traumaresolutionandrecovery https://www.instagram.com/deconstruct_everything https://www.instagram.com/drlauraeanderson You can also find Laura at https://www.drlauraeanderson.com .",
      "release": "2025-02-18T11:00:00Z",
      "duration": "00:44:53.0150000",
      "explicit": false,
      "spotifyId": "5wUMSYlD72drH8h9l9jljV",
      "appleId": 1000693438717,
      "subjects": [
        "Psychology",
        "Cult Recovery",
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wUMSYlD72drH8h9l9jljV",
        "apple": "https://podcasts.apple.com/podcast/leaving-the-orthodox-community-w-rikki-herbst/id1689312239?i=1000693438717"
      }
    },
    {
      "id": "6411485b-f01c-4b0c-a615-bb611b3da365",
      "title": "God’s Plan for your Genitals w/ Dr. Eric Sprankle",
      "description": "This week we are excited to be joined by Dr. Eric Sprankle (@drsprankle on Instagram). Dr. Sprankle is a clinical psychologist and professor of human sexuality and author of the recently released: “DIY: The Wonderfully Weird History and Science of Masturbation”. He’s joining us today to talk about what a porn addiction *actually* is (hint, it’s not what religion teaches us!), our innate sexuality, and how it’s the messages around sexuality, porn, and masturbation that creates the guilt, shame, and other negative responses…not the acts themselves. It’s a great episode for all of those post-purity culture folks who weren’t taught about healthy sexuality and sexual development! Connect with Dr. Eric Sprankle Website: https://www.drsprankle.com/ Social Media: @drsprankle Buy his new book! DIY: The Wonderfully Weird History and Science of Masturbation This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2025-02-11T11:00:00Z",
      "duration": "01:24:24.9600000",
      "explicit": true,
      "spotifyId": "1LJBeZndUDcmLfrL6dvAVm",
      "appleId": 1000691077277,
      "subjects": [
        "Psychology",
        "Purity Culture",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1LJBeZndUDcmLfrL6dvAVm",
        "apple": "https://podcasts.apple.com/podcast/gods-plan-for-your-g-s-w-dr-eric-sprankle/id1689312239?i=1000691077277"
      }
    },
    {
      "id": "6a7a951d-3031-446c-bee9-65e3ff79aa99",
      "title": "The Glory Whole with Melissa Duge Spiers",
      "description": "In this episode, Melissa Duge Spiers shares her journey of growing up in a Seventh-day Adventist family, her experiences of rebellion, and the challenges she faced when leaving the church. She discusses the unique aspects of Adventism, the impact it had on her identity, and the process of deconstructing her beliefs. Melissa emphasizes the importance of finding joy and freedom after leaving a high-control environment and the need for support systems for those transitioning out of similar backgrounds. In this conversation, Melissa Duge Spiers and Andrew Kerbs explore the complexities of deconstructing from the Adventist faith, discussing themes of social isolation, the impact of self-supporting schools, and the church\u0027s missionary zeal. They delve into the ethical implications of Adventist outreach, connections to controversial groups like the Branch Davidians, and the painful yet necessary process of deconstruction. The conversation also touches on the importance of therapy and support in recovery, culminating in Melissa\u0027s journey of writing a memoir about her experiences. Follow Melissa https://www.instagram.com/the.glory.whole This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-02-04T11:00:00Z",
      "duration": "00:57:49.9490000",
      "explicit": true,
      "spotifyId": "0bAXZdOxexB8BKUNfAZAim",
      "appleId": 1000688865934,
      "subjects": [
        "Seventh-day Adventist Church",
        "Cult Recovery",
        "Branch Davidians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0bAXZdOxexB8BKUNfAZAim",
        "apple": "https://podcasts.apple.com/podcast/the-glory-whole-with-melissa-duge-spiers/id1689312239?i=1000688865934"
      }
    },
    {
      "id": "1867b8ea-07a8-4785-bea1-18a6b6793c6c",
      "title": "Children obey your parents unto the Lord",
      "description": "Who else had the verse “children, obey your parents unto the Lord” said to them? Maybe as a way to justify behavior? Or assert control? Or maybe you still feel the need to obey your parents even if you are an adult (and with your own children!) On today’s episode of Sunday School Dropouts we’ll be talking about the parent-child dynamic within high control religion–the way it impacts a child and how that impact lingers on into adulthood. Whether it’s the way you navigate relationships today or your sense of confidence in the world, how you interacted with your parents as a child impacts you today. And when you add high control religion on top of it, there is an even bigger impact! We’re excited that Megan Von Fricken, who is, herself, a Sunday School Dropout, will be joining us today to talk about this from a clinical perspective and will share some ways that people can begin healing from this dynamic. And also, if you’re a practitioner who works with clients coming out of high control groups, fundamentalism, and cults and want to get more training so you can more meaningfully support your clients, check out Laura’s Religious Trauma Practitioner Cohort . Applications are now being accepted; limited spots available! To get in touch with Megan: IG: @religious.harm.recovery www.religiousharmrecovery.com This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2025-01-28T11:00:00Z",
      "duration": "01:28:57.3120000",
      "explicit": false,
      "spotifyId": "7KzCxo2XWFkKBvgtP6iHRY",
      "appleId": 1000686196971,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KzCxo2XWFkKBvgtP6iHRY",
        "apple": "https://podcasts.apple.com/podcast/children-obey-your-parents-unto-the-lord/id1689312239?i=1000686196971"
      }
    },
    {
      "id": "994fddf7-54d5-4e3f-9c37-10c619dd6c27",
      "title": "Hurt and Healed by the Church",
      "description": "We are excited to be joined by author and adventurer, Ryan George! Ryan recently wrote and published the book “Hurt and Healed by the Church” which details his life as a pastor’s kid whose father was a pastor in the Independent Fundamental Baptist (IFB) church. Ryan’s story is unique in that his father engaged of multiple acts of clergy sexual abuse with children. But instead of keeping that story ‘in the dark’, Ryan has supported his father’s victims, brought the truth into the light, and has created a life for himself opposite of his father’s path. To follow Ryan’s work or purchase his book, check out the links: Ryan’s books: www.booksbyryan.com Find Ryan on Instagram: @ryplane Ryan’s blog: www.Explorience.org This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2025-01-21T11:00:00Z",
      "duration": "00:54:15.5100000",
      "explicit": false,
      "spotifyId": "2yLfiHqjAAPc9I4DVGFth8",
      "appleId": 1000684833744,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2yLfiHqjAAPc9I4DVGFth8",
        "apple": "https://podcasts.apple.com/podcast/hurt-and-healed-by-the-church/id1689312239?i=1000684833744"
      }
    },
    {
      "id": "30f1be5d-1e50-4c08-b301-0c999f2b114a",
      "title": "Understanding Spiritual Trauma w/Hillary McBride",
      "description": "The Sunday School Dropouts are joined today by Dr. Hillary McBride! Hillary is here to help us wrap up our touchstone topics episodes with an amazing conversation about spiritual abuse and trauma. Is it the same as religious abuse? Better or worse? What are the impacts and how do you heal? We talk about all that and more with Hillary. Also, you won’t want to miss Laura and Andrew’s “ins” and “outs” for the year and their reflections on new year’s resolutions when they were both religious! Connect with Hillary Website: www.hillarylmcbride.com Instagram/Threads: @hillaryliannamcbride Buy Holy Hurt This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co.",
      "release": "2025-01-14T11:00:00Z",
      "duration": "01:17:15.8460000",
      "explicit": true,
      "spotifyId": "0Zq4dETzCHV9q2Fo8685Ld",
      "appleId": 1000683919897,
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Zq4dETzCHV9q2Fo8685Ld",
        "apple": "https://podcasts.apple.com/podcast/understanding-spiritual-trauma-w-hillary-mcbride/id1689312239?i=1000683919897"
      }
    },
    {
      "id": "0d4261a3-08c1-400a-af70-3a32103bc86a",
      "title": "The Frozen Chosen: Growing up Church of Christ with Jessica Hyne",
      "description": "Jessica Hyne is joining us today to share her story of growing up in the Church of Christ denomination. We talk about everything from the structure of the Church of Christ, to the strive for certainty, rigid thinking, and being a part of the frozen chosen…if you don’t get what that is, you’ll just have to listen! We also talk about the important pieces of her own healing journey and the piece of advice she would offer folks coming from a Church of Christ background. Jessica is also a Licensed Professional Counselor in the State of Tennessee and a practitioner at the Center for Trauma Resolution and Recovery. Her work with CTRR focuses on individuals coming out of high control religions, rigid thinking, and fundamentalisms and learning how to find their inherent goodness and live in a more connected way in the world. If you’re interested in learning more about Jessica or working with her as a coach at the Center for Trauma Resolution and Recovery, click this link ! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co.",
      "release": "2025-01-07T11:00:00Z",
      "duration": "00:54:05",
      "explicit": false,
      "spotifyId": "1UtMNCHoO6R9alGcypxgR3",
      "appleId": 1000683006937,
      "subjects": [
        "Churches of Christ (non-institutional)",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1UtMNCHoO6R9alGcypxgR3",
        "apple": "https://podcasts.apple.com/podcast/the-frozen-chosen-growing-up-church-of-christ/id1689312239?i=1000683006937"
      }
    },
    {
      "id": "8126d75b-3c27-4377-8363-083f9550b9d9",
      "title": "How do you Celebrate Christmas if you Don’t Believe in Santa (or Jesus)?",
      "description": "The Sunday School Dropouts are back with another episode of answering your questions about religious trauma and the holidays. Many of the questions today centered around finding new traditions post-religion, dealing with family members who don’t understand why you won’t go to church, and how to navigate co-parenting around this time of year when one person has left the church and the other hasn’t. Plus, Andrew and Laura are at it again with another holiday quiz game and sharing some of their own stories of how they celebrated the holidays as they deconstructed. This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co.",
      "release": "2024-12-17T11:00:00Z",
      "duration": "00:59:35.2480000",
      "explicit": false,
      "spotifyId": "3LZsx27k9BYSw09KJ5l9WI",
      "appleId": 1000680682532,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3LZsx27k9BYSw09KJ5l9WI",
        "apple": "https://podcasts.apple.com/podcast/how-do-you-celebrate-christmas-if-you-dont-believe/id1689312239?i=1000680682532"
      }
    },
    {
      "id": "3a641f6c-5b05-4b87-bc72-23c7facdefa7",
      "title": "Your Family, Religious Trauma, and the Holidays",
      "description": "It’s the most wonderful time of the year…or is it? The Sunday School Dropouts are taking on your questions today about all things having to do with religious trauma and the holidays! How do you set boundaries with your family that is still in church? Can you tell your emotionally immature family members that they are emotionally immature? Is it ok to tell your kids that you don’t trust churches and religious doctrine anymore? All these questions (and more!) will be answered today. And, you’ll also get to see who wins at holiday jeopardy between Andrew and Laura! Do YOU know what laughing-red-monster toy was the “it” toy of 1996? Tune in to find out! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-12-10T11:00:00Z",
      "duration": "01:03:48.7410000",
      "explicit": false,
      "spotifyId": "0uG7spD03MyvuUfQcY5Gkp",
      "appleId": 1000679873169,
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0uG7spD03MyvuUfQcY5Gkp",
        "apple": "https://podcasts.apple.com/podcast/your-family-religious-trauma-and-the-holidays/id1689312239?i=1000679873169"
      }
    },
    {
      "id": "f8d26cf2-1338-4db8-94dc-9ec3f289ae2d",
      "title": "Leaving the Fold with RC Curtwright",
      "description": "We are joined today by RC Curtright, or, you might know him from social media as @deconstructing_exjw. RC was on the podcast in season one talking about the impact of purity culture for individuals who grew up male inside that system. But today he is here to talk about his own experiences of growing up in the Jehovah’s Witness organization, his deconstruction and his journey of healing. Books that RC mentioned: Healing CPTSD by Pete Walker When Religion Hurts You by Dr. Laura Anderson Radical Acceptance by Tara Brach Connect with RC on Instagram: @ deconstructing_exjw This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2024-12-03T11:00:00Z",
      "duration": "00:54:53.9620000",
      "explicit": false,
      "spotifyId": "621S25vr1OkPjreH8MPCJJ",
      "appleId": 1000679065686,
      "subjects": [
        "Psychology",
        "Jehovah\u0027s Witnesses",
        "Purity Culture",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/621S25vr1OkPjreH8MPCJJ",
        "apple": "https://podcasts.apple.com/podcast/leaving-the-fold-with-rc-curtwright/id1689312239?i=1000679065686"
      }
    },
    {
      "id": "b9610b43-70c7-4e0e-ac3b-6ff5e3a99bd1",
      "title": "God Made Me Gay (an interview with Mike Maeshiro)",
      "description": "We’re excited to be joined today by Mike Maeshiro! On today’s “Story Episode” Mike shares with us about his time at Bethel Church and their school, the Bethel School of Supernatural Ministry. Did Mike get slain in the spirit or was he a peaceful observer? You’ll have to listen to find out! To connect with Mike: Substack: https://mikemaeshiro.substack.com/ TikTok: @mikemaeshiro Instagram:@mikemaeshiro Website: mikemaeshiro.com This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2024-11-26T11:00:00Z",
      "duration": "01:02:50",
      "explicit": false,
      "spotifyId": "48BPoPPJ3GffLUP14XCbG5",
      "appleId": 1000678275758,
      "subjects": [
        "Kings Chapel Group"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/48BPoPPJ3GffLUP14XCbG5",
        "apple": "https://podcasts.apple.com/podcast/god-made-me-gay-an-interview-with-mike-maeshiro/id1689312239?i=1000678275758"
      }
    },
    {
      "id": "87a4cc3c-dcbb-47ab-b2f4-215585d22436",
      "title": "Deconstruction vs. Deconversion vs. Dechurched with Phil Drysdale",
      "description": "We have one of the “founding fathers” of religious deconstruction on social media with us today…Phil Drysdale! Phil is joining us today to talk about all of the ins and outs of deconstruction, including the differences between deconstructing, deconverting, and being de-churched. Phil has partnered with researchers that have been able to obtain data on the tenants of deconstruction, how many people are deconstructing, and more! We loved this conversation with Phil and we know you’ll love it too! This is our first episode back after the elections in the United States, so Andrew and Laura also share their thoughts on how they are doing and the theme that has been coming up over and over in their client sessions: feeling betrayed. We know that this time–because of the added stress of the elections and the holidays–can be particularly stressful for those of you with a background in high control religion, fundamentalism, and cults. So we wanted to remind you that if you need extra support or help navigating this, the Center for Trauma Resolution and Recovery is here to help! All practitioners offer a free inquiry call in order to make sure that they are a good fit for you, so schedule yours today ! (Sliding scale spots are available!) Connect with Phil Drysdale Instagram: @phildrysdale Youtube: youtube.com/phildrysdale Websites: www.phildrysdale.com / www.thedeconstructionnetwork.com This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-11-19T11:00:00Z",
      "duration": "01:39:39",
      "explicit": false,
      "spotifyId": "2TeJOTRssoJnelhXGPN460",
      "appleId": 1000677460690,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2TeJOTRssoJnelhXGPN460",
        "apple": "https://podcasts.apple.com/podcast/deconstruction-vs-deconversion-vs-dechurched-with-phil/id1689312239?i=1000677460690"
      }
    },
    {
      "id": "be504b03-f39e-4b8b-9782-af01071f6303",
      "title": "Rift: A Conversation with Cait West",
      "description": "We are joined today by Cait West–an author, podcaster, and educator. Cait recently published a book, “Rift: A Memoir Breaking Away from Christian Patriarchy” and is stopping by today to share with us about her book and her journey. Cait grew up in the Christian Patriarchy movement and was a stay at home daughter until age 25. Through courage and trusting herself, Cait was able to leave the system and family she grew up in and create a thriving life outside of it. Website: www.caitwest.com Substack: https://caitwest.substack.com Podcast: Survivors Discuss For Our Daughters Film Find Cait on Instagram Cait’s book: Rift: A Memoir Breaking Away from Christian Patriarchy This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2024-11-12T11:00:00Z",
      "duration": "00:59:45.2270000",
      "explicit": false,
      "spotifyId": "2BvkFhCm1jbnR3Yon4Xk5p",
      "appleId": 1000676633648,
      "subjects": [
        "Christian Fundamentalist",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2BvkFhCm1jbnR3Yon4Xk5p",
        "apple": "https://podcasts.apple.com/podcast/rift-a-conversation-with-cait-west/id1689312239?i=1000676633648"
      }
    },
    {
      "id": "6d8c2758-888a-48ab-b852-891b6afb3be2",
      "title": "Taking Care of Yourself on Election Day",
      "description": "It’s Election Day in the United States…which can feel relieving, nerve wracking, and everything in between! It made sense that we use this episode to wrap up our Religious Trauma and Politics mini-series by talking about how to take care of yourself today, the next few days, and beyond. Andrew and Laura are talking about finding stability, how fear can cause us to do and think things that are not aligned with our core values, identifying what we can control, and how to take care of ourselves. And you’ll also get to hear who wins at the game of Presidential and Elections Jeopardy! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co.",
      "release": "2024-11-05T11:00:00Z",
      "duration": "01:06:00",
      "explicit": false,
      "spotifyId": "4MGqMJahZs1jkG14thk942",
      "appleId": 1000675756214,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4MGqMJahZs1jkG14thk942",
        "apple": "https://podcasts.apple.com/podcast/taking-care-of-yourself-on-election-day/id1689312239?i=1000675756214"
      }
    },
    {
      "id": "f83aa4c7-3378-4eee-bfe8-32147de06c33",
      "title": "Project 2025 gets an “F”",
      "description": "We are thrilled to have Julia and Jeremiah (aka the Sexvangelicals) back on the podcast today to wrap up our Religious Trauma and the Elections mini-series. Today’s topic: Project 2025. If you haven’t heard about it or don’t know what, consider this your catch up course to all things related to Project 2025. And in our opinion, this project gets an “F”. Jeremiah and Julia explain various policies, the language used, the history behind why we got here and how it connects to Christian Nationalism. To Connect with the Sexvangelicals: www.sexvangelicals.com Substack (Relationship 101): https://sexvangelicals.substack.com/ IG: @sexvangelicals Resources mentioned in the pod: Andra Watkins’ article: https://project2025istheocracy.substack.com/p/why-anti-abortion-laws-christian Sexvangelicals’ first Project 2025 article: https://sexvangelicals.substack.com/p/what-does-the-republican-party-actually Sexvangelicals’ second Project 2025 article: https://sexvangelicals.substack.com/p/what-is-a-family-according-to-the Link to Project 2025 (the entire 900-pages!) This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co.",
      "release": "2024-10-29T10:00:00Z",
      "duration": "01:37:22",
      "explicit": false,
      "spotifyId": "0LJSjced6c624e6WcVVHZt",
      "appleId": 1000674847746,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0LJSjced6c624e6WcVVHZt",
        "apple": "https://podcasts.apple.com/podcast/project-2025-gets-an-f/id1689312239?i=1000674847746"
      }
    },
    {
      "id": "59179c3a-cadf-437e-8afe-25bc2826929f",
      "title": "Disciples of White Jesus",
      "description": "The Sunday School Dropouts are proving their dropout status today! We are talking about all things White Christian Nationalism, including the origins, impacts, and how to heal with Rev. Angela Denker. Angela is the author of “Red State Christians” and the forthcoming book “Disciples of White Jesus” where she writes about the growing phenomenon of White Christian Nationalism and its impact on a specific group of people: White men and boys. Throughout this conversation we begin to see how this extremist approach began, why it thrives and even how to navigate relationships with people in our lives who live according to those values. Andrew and Laura also discuss the term ‘gaslighting’ and explain what it truly means–instead of how it’s talked about on social media and in pop culture–as a way to help people better organize and name what happened to them. Join the Religious Trauma and the Elections Support Groups! Find out more and/or sign up here! Books discussed today: Angry White Men by Michael Kimmel Connect with our Guest: Rev. Angela Denker @denkerangela This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe",
      "release": "2024-10-22T10:00:00Z",
      "duration": "01:21:17",
      "explicit": false,
      "spotifyId": "3zF1XW67Drm0fyptZ0tTFO",
      "appleId": 1000673981577,
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zF1XW67Drm0fyptZ0tTFO",
        "apple": "https://podcasts.apple.com/podcast/disciples-of-white-jesus/id1689312239?i=1000673981577"
      }
    },
    {
      "id": "c303293a-cae1-4280-bd8a-47c24256c07b",
      "title": "Using Fear and Trauma for Political Gain",
      "description": "Dan Miller is back on the podcast today with an excellent discussion regarding the way that extremist political groups use fear and trauma as a way to move their message forward, gain control, and get followers. It’s an episode you won’t want to miss as Dan, Andrew, and Laura dive into why groups target specific age ranges, the neuroscience of extreme thinking and propaganda, and how this can result in trauma. Today we are lifting Russell Brand up in prayer. To find out more about the Religious Trauma and the Elections self-led course, click here . Use code SUNDAYSCHOOLDROPOUTS for $50 off! Registration for the Religious Trauma and the Elections support group opens next week! Find out more about it here ! Connect with Dan Miller: dan@traumaresolutionandrecovery.com danielmillerswaj@gmail.com https://www.straightwhiteamericanjesus.com/ This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2024-10-15T10:00:00Z",
      "duration": "01:32:53",
      "explicit": false,
      "spotifyId": "4Lo9qBcZIjkNp2MLYSh2xy",
      "appleId": 1000673150703,
      "subjects": [
        "Spiritual Narcissist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Lo9qBcZIjkNp2MLYSh2xy",
        "apple": "https://podcasts.apple.com/podcast/using-fear-and-trauma-for-political-gain/id1689312239?i=1000673150703"
      }
    },
    {
      "id": "919c90d3-fb38-4a8c-ad9a-647f1eaf4de7",
      "title": "The Marriage of Religion and Politics w/ Brad Onishi",
      "description": "We’re excited to have Brad Onishi back on the Sunday School Dropouts today! When we were thinking of what was important for folks to know as it related to religious trauma and the elections, we knew that we needed Brad on the podcast to talk about the history of religion and politics! This episode takes a deep dive, exploring the past 70 years of religious and political movements that joined together to get us to the point we are at now. Brad also shares about the practicalities of what this looks like in the current election cycle and politics as a whole. To find out more about the Religious Trauma and the Elections self-led course, click here . Use code SUNDAYSCHOOLDROPOUTS for $50 off! Registration for the Religious Trauma and the Elections support group opens next week! Find out more about it here! Here’s the link to listen to Brad’s episode regarding the impact of purity culture on men. Connect with Brad and support his work: Straight White American Jesus website Straight White American Jesus Podcast is available wherever you listen to podcasts! “ Preparing for War: The Extremist History of White Christian Nationalism and What Comes Next ” by Brad Onishi Follow on IG @ straightwhitejc This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co.",
      "release": "2024-10-08T10:00:00Z",
      "duration": "01:35:13",
      "explicit": false,
      "spotifyId": "0b4SvGUYZGHrLFvKZxPvG9",
      "appleId": 1000672203148,
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0b4SvGUYZGHrLFvKZxPvG9",
        "apple": "https://podcasts.apple.com/us/podcast/the-marriage-of-religion-and-politics-w-brad-onishi/id1689312239?i=1000672203148"
      }
    },
    {
      "id": "8e1cea1d-f231-48e6-8d67-7486f8ad6d09",
      "title": "Star-Spangled Jesus",
      "description": "We are thrilled today to have back on our show April Ajoy! This is the third time April’s been on our podcast but the first time without her partner Beecher…and as much as we love Beecher, we are so glad to have April here today as she’ll be talking to us about her book that is coming out TODAY called “Star Spangled Jesus” which is available wherever you buy books and is also on Audible. The links for the book are in the show notes! April is a content creator who uses humor to shine light on the harmful, toxic and sometimes just weird traits of American Christianity. She is the Co-host of The Non-Binary Marriage Podcast and Co-Host of Evangelicalish and also co-hosts a weekly episode on The New Evangelicals podcast feed focusing on what’s been happening in the culture and its connection to religion that week. April is passionate about helping others overcome indoctrination and recognizes on a personal level just how difficult that can be. She knows that if she can do it, anyone can! To find out more about the Religious Trauma and the Elections self-led course, click here . Use code SUNDAYSCHOOLDROPOUTS for $50 off! Resources: Jamarcus Tisby books April’s book, “Star Spangled Jesus” can be purchased here Follow April on Instagram and TikTok: @aprilajoy This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe",
      "release": "2024-10-01T11:00:00Z",
      "duration": "01:20:24.8940000",
      "explicit": false,
      "spotifyId": "63J7LEUUPYAelfRsG6XjWx",
      "appleId": 1000671415095,
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/63J7LEUUPYAelfRsG6XjWx",
        "apple": "https://podcasts.apple.com/podcast/star-spangled-jesus/id1689312239?i=1000671415095"
      }
    },
    {
      "id": "eee9be11-d060-4e67-95c2-f6939c755844",
      "title": "Healing Religious Trauma through the Nervous System",
      "description": "Want to heal from religious trauma? Then you’re listening to the right podcast! Today we are talking with licensed therapist, coach, and Somatic Experiencing practitioner, Jeremy Lehmann. Jeremy talks to us about what the nervous system is, it’s roll in trauma, and why it’s essential to the process of healing from trauma. We also get into a fascinating discussion regarding how the absence of safe and stable connection can also result in trauma through the topic of lack of sex education in high control religion. We’ll also be bringing to you our first vocabulary lesson of the season, discussing the term ‘trauma response’. Do Andrew and Laura think that it’s a term worth using or has social media co-opted yet another term to make it mean something entirely different? Tune in to hear their thoughts! Sign ups are still happening for a couple of the Fall Support Groups at the Center for Trauma Resolution and Recovery! Check them out here ! Resources discussed today: To be Loved by Frank Anderson, MD Guest Info: Jeremy Lehmann, LMFT, SEP www.thrivery.com This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-09-24T11:00:00Z",
      "duration": "01:14:57.8930000",
      "explicit": false,
      "spotifyId": "2yiABFKHjuxMMPU8pqZqPR",
      "appleId": 1000670520715,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2yiABFKHjuxMMPU8pqZqPR",
        "apple": "https://podcasts.apple.com/podcast/healing-religious-trauma-through-the-nervous-system/id1689312239?i=1000670520715"
      }
    },
    {
      "id": "54cacfc2-6e2d-433a-98f7-d9063d392226",
      "title": "We’re Back Baby! Welcome to Season 2 of Sunday School Dropouts!",
      "description": "We’re back! After a summer filled with Vacation Bible School and all of the adventures that go along with it, we are back for another season of Sunday School Dropouts! In this episode Andrew and Laura talk about some of the amazing guests and topics that will be coming on season 2 and are excited about bringing back our “touchstone topics”, a mini-series on religious trauma and the elections, sharing survivor stories of leaving and healing from religious trauma, and focusing on various aspects of medical and financial trauma and how they intersect with religious trauma. This week we’ll begin our touchstone topic series with a discussion about what religious trauma is! Our touchstone topic series is one where we talk about some of the foundations of religious trauma, the nervous system, the difference between deconstruction and deconversion, and adverse religious experiences. And we’re also bringing back some of your favorite segments! In this episode we have Flannelgraph Storytime where we have a fascinating discussion on the impact of James Dobson and the Strong Willed Child propaganda. And, we can’t forget prayer requests! This week we’re lifting up …the Secret Lives of Mormon Wives on Hulu and the bizarre case out of Aurora, CO where a faith based therapist is accused of abuse of her clients as she tried to reunify them with their criminally charged father. Resources that are discussed during this episode: When Religion Hurts You by Laura Anderson In an Unspoken Voice by Peter Levine Healing Trauma by Peter Levine No Bad Parts by Richard Schwartz Sign up for Fall Support Groups at the Center for Trauma Resolution and Recovery! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-09-17T12:00:00Z",
      "duration": "01:41:54.6900000",
      "explicit": false,
      "spotifyId": "2A2CWodAhGUGYpbw4JzIdp",
      "appleId": 1000669815273,
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2A2CWodAhGUGYpbw4JzIdp",
        "apple": "https://podcasts.apple.com/podcast/were-back-baby-welcome-to-season-2-of-sunday-school-dropouts/id1689312239?i=1000669815273"
      }
    },
    {
      "id": "4c9596b9-d36b-4d0d-b77f-285591d2e951",
      "title": "The Ark Encounter w/ April Ajoy and Beecher Reuning",
      "description": "This month the Sunday School Dropouts did some field-reporting…that is, we went on a field trip to the Ark Encounter and we took our friends April and Beecher with us. In today’s episode we share more about our experience at the Ark, what it was like to venture back into fundamentalist Christianity, listening to a live-lecture by Ken Hamm, and go through the story of Noah in Genesis as we look at it from a different perspective than when we were in VBS the first time around! To lighten the mood you’ll also be able to listen in on our sanctified gossip session as we talk about all things Christian persecution at the Olympics and the weirdness of JD Vance. And we have a few other segments too, to round out another great episode of Vacation Bible School–Sunday School Dropouts edition! We are thrilled to be joined again on this episode by the incredible April Ajoy and Beecher Reuning. April and Beecher are the co-hosts of the Non-Binary Marriage podcast which you can find wherever you listen to podcasts. April can be found across all social media platforms at @aprilajoy and Beecher can be found across all social media platforms at @hellobeecher. And, if you’re looking for a place to spend that extra tithe money, make sure to grab a copy of April’s forthcoming book, “ Star Spangled Jesus ” which is available for pre-order wherever you buy books! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at kevincrowe.co",
      "release": "2024-08-29T11:00:00Z",
      "duration": "02:05:02.7060000",
      "explicit": false,
      "spotifyId": "5037ovfZXhZxdo5Xleg0Tp",
      "appleId": 1000667077111,
      "subjects": [
        "Christian Fundamentalist",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5037ovfZXhZxdo5Xleg0Tp",
        "apple": "https://podcasts.apple.com/podcast/the-ark-encounter-w-april-ajoy-and-beecher-reuning/id1689312239?i=1000667077111"
      }
    },
    {
      "id": "e594ea72-7733-4c75-aa20-012df3e23c1e",
      "title": "The Abuser’s Playbook (aka the Story of Job)",
      "description": "We’re excited to bring you another episode of Vacation Bible School–Sunday School Dropouts edition! This month we are joined by our favorite podcast editor, Kevin Crowe (@jesusunfollower on social media) to talk about the story of Job. And let us tell ya, this is *not* the story you heard in VBS! We’ll also be talking about some of the latest things going on in the world during our “Sanctified Gossip” segment and you won’t want to miss our Silly Songs and Arts \u0026 Crafts time either! If you’re looking for support to help with the increased stress and anxiety of the election cycle, we are offering a self-led course that is filled with resources, lectures, skills and practices to help you navigate this chaotic time. Find out more information here and use the code ELECTIONS to get $15 off! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-07-30T11:00:00Z",
      "duration": "01:40:29.5570000",
      "explicit": false,
      "spotifyId": "4uQljnsOJZVBRv4OB2v3hj",
      "appleId": 1000663790434,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4uQljnsOJZVBRv4OB2v3hj",
        "apple": "https://podcasts.apple.com/podcast/the-abusers-playbook-aka-the-story-of-job/id1689312239?i=1000663790434"
      }
    },
    {
      "id": "a7de42c8-0ea9-4ecd-9ad6-e1478f922d38",
      "title": "Vacation Bible School featuring the Apostle Paul, the OG Grifter",
      "description": "It’s summer and that means it’s time for Vacation Bible School–Sunday School Dropouts Edition! This month we’re letting you in on all the church-sanctified gossip that all the moms are talking about as their kiddos are doing arts and crafts like Carl Lenz’s new podcast, Robert Morris’ “affair, and more. And during our Bible story time we’ll be talking about the Apostle Paul–the OG Grifter. It’s definitely not the stories you heard when you were at VBS, but you’ll surely learn something! And this month we are joined by the fabulous Janice Lagata, otherwise known as @godhasnotgiven on Instagram. Janice brings to us her knowledge, humor, and passion for all things deconstruction, and reminding others that they can believe better things–that your thoughts about God are just as valid as anyone from the Bible. Make sure to give Janice a follow on socials and check out her podcast, God Has Not Given , wherever you stream podcasts! To find out more about Janice’s work, to support her, read her substack, or sign up for her workshop, head to her website: janicelagata.com If you’re interested in the Religious Trauma and the Elections Course you can sign up here and use the code ELECTIONS for $15 off! Resources discussed in this episode: Zealot by Reza Aslan The Politics of Jesus by Obrey Hendricks Jesus and the Disinherited by Howard Thurman and Rev. Dr. Kelly Douglas This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-06-28T11:00:00Z",
      "duration": "01:58:03.7810000",
      "explicit": false,
      "spotifyId": "0aaGh9VlOoNabBMP2fy6L0",
      "appleId": 1000660542379,
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "Robert Morris"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0aaGh9VlOoNabBMP2fy6L0",
        "apple": "https://podcasts.apple.com/podcast/vacation-bible-school-featuring-the-apostle-paul-the/id1689312239?i=1000660542379"
      }
    },
    {
      "id": "71f424f6-7ad5-4983-8b4b-7c834d4e5df3",
      "title": "Wrapping Up Season One!",
      "description": "This is our final episode of season one and Andrew and Laura are back to talk about men and bears, lift up John MacArthur in prayer, to quite literally celebrate the United Methodist church’s repeal of their declaration that did not allow LGBTQ\u0026#43; clergy members and more. We’ll also be reflecting on some of our favorite moments from the season and sharing about our summer episodes because you can’t have Sunday School Dropouts without Vacation Bible School! We’re dropping some hints about what’s to come in those episodes and talking a little bit about Season 2 which will start in the fall! More than anything, we just want to say a big thank you to all of our fellow dropouts for supporting us! We have loved doing this podcast and are so excited for Vacation Bible School this summer and Season 2! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-05-14T11:00:00Z",
      "duration": "01:07:39.8460000",
      "explicit": false,
      "spotifyId": "4boPKwbOvrrKNucShioX1Q",
      "appleId": 1000655540494,
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "John MacArthur"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4boPKwbOvrrKNucShioX1Q",
        "apple": "https://podcasts.apple.com/podcast/wrapping-up-season-one/id1689312239?i=1000655540494"
      }
    },
    {
      "id": "9876ff75-ec97-4b6d-a93e-9cdfbea11f56",
      "title": "Purity Culture Poster Child to Pastor to Black Sheep w/ Josh Harris",
      "description": "For those of you who don’t know Josh Harris, he is a former pastor and poster-child of the purity culture movement with his (formerly) best selling book, I Kissed Dating Goodbye, which was published when he was 21–which meant he was even younger when he wrote it–like 19 years old!. The book and the pastors around him gave Josh a national platform where he was looked to as an authority and subsequently, someone whose teachings were incredibly harmful. In 2015, Josh left formal ministry and the United States and just a few years after that Josh and his then wife announced they were dissolving their marriage and Josh began publicly speaking about his faith deconstruction process. Josh has received both welcome and warning from people in post-religious spaces and though he does not consider himself a leader in faith deconstruction spaces, he desires to hold space and hear stories from people who are coming out of these environments–many of whom were deeply harmed by the teachings he was taught, lived, and promoted. In Josh’s words… “I spent the first 40 years of my life promoting what I now see as narrow, controlling, fear-based religion. Today I’m an advocate for the freedom to change, grow, and walk away from systems and beliefs that no longer fit. I want to see religious and non-religious communities healthier. Stepping outside of rigid religion, I’ve found there’s a lot of room for discovery. For hearing and telling new stories. For creating new things in business. And spotlighting people whose ideas can reshape the world.” This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-04-23T11:00:00Z",
      "duration": "01:45:14.9190000",
      "explicit": false,
      "spotifyId": "1PzNCu74UwliLGs91ARqsC",
      "appleId": 1000653321539,
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1PzNCu74UwliLGs91ARqsC",
        "apple": "https://podcasts.apple.com/podcast/purity-culture-poster-child-to-pastor-to-black-sheep/id1689312239?i=1000653321539"
      }
    },
    {
      "id": "608045fb-bd41-4818-9d3c-ca285ffb1b8a",
      "title": "How to Heal when You’re the Victim and Perpetrator",
      "description": "How do you heal from religious trauma when you were both the victim and perpetrator of high control religion? Dan Miller joins us today to discuss his work with clients who are healing from religious trauma and adverse religious experiences that were in positions of ministry leadership, including the unpaid labor of volunteers (which many of us called: servants). In this episode we talk about some of the unique aspects of healing that former ministry leaders face, steps to re-build your life after leaving ministry positions, feeling burned out after volunteering, and building self-compassion. Guest: Dan Miller Website: www.straightwhiteamericanjesus.com Work with Dan: dan@traumaresolutionandrecovery.com This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-04-09T11:00:00Z",
      "duration": "01:22:14.1380000",
      "explicit": false,
      "spotifyId": "6VBBkpkZlNb3GP06wRa3NL",
      "appleId": 1000651889859,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6VBBkpkZlNb3GP06wRa3NL",
        "apple": "https://podcasts.apple.com/podcast/how-to-heal-when-youre-the-victim-and-perpetrator/id1689312239?i=1000651889859"
      }
    },
    {
      "id": "beba141b-b5e9-4285-a23c-daa8fe7b372d",
      "title": "Choosing Relationship over Doctrine",
      "description": "We are excited to be talking today with April Ajoy and Beecher Reuning! They are sharing with the Sunday School Dropouts crew their story of growing up in fundamentalism and purity culture, meeting and getting married under those systems and then navigating their way through discarding those doctrines and theology to find their way into the relationship they have today. It’s an episode you won’t want to miss! Religious Trauma \u0026#43; the Elections Course - use code ELECTIONS for $15 off Guests: April Ajoy can be found on Instagram, TikTok, and Facebook @aprilajoy and on X at @aprilajoyr Beecher Reuning can be found Instagram, TikTok and X @hellobeecher and on Facebook @beecher Buzzfeed article about April can be found here This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-03-26T11:00:00Z",
      "duration": "01:30:11.9700000",
      "explicit": false,
      "spotifyId": "0eQZyoEjg35Wn7Wd0WmEbb",
      "appleId": 1000650479617,
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0eQZyoEjg35Wn7Wd0WmEbb",
        "apple": "https://podcasts.apple.com/podcast/choosing-relationship-over-doctrine/id1689312239?i=1000650479617"
      }
    },
    {
      "id": "1e83f628-7033-41f4-9a86-6ee5886004b1",
      "title": "…when you don’t get what you’re promised from purity culture…",
      "description": "Today we are excited to have the Sexvangelicals, that is Julia Postema and Jeremiah Gibson, on our podcast! Julia and Jeremiah are licensed and AASECT certified psychotherapists who use their personal and professional lives and experience to work with relationships where at least one partner has been a part of high control religion, fundamentalism or purity culture. Resources Developmental Model - Ellen Bater AASECT.org - finding a sex therapist Six Steps for a structured question Decide on specific topic - key word SPECIFIC! (Ex: what are my favorite places to be touched, to be kissed, preferences around initiation) Agenda - (not rigid) what is the purpose of this conversation? Eg. understanding each other better, resolving conflict Choose a time and location that will set you up for success (beginning and end) - try to make it outside the house Set a timer based on the topic, level of vulnerability and your level of experience in these conversations Stay on topic! Once you’ve decided what the topic is, write it on a sticky note or card what the topic is so you can refer to it later to help you stay on topic! Aftercare - sometimes these conversations can be going or vulnerable so how can you come back together with your partner *(e.g. a game, going out to eat, cuddling) This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-03-12T11:00:00Z",
      "duration": "01:28:53.3430000",
      "explicit": false,
      "spotifyId": "4xGed0fGwKNPkEVylO6iwM",
      "appleId": 1000648894504,
      "subjects": [
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xGed0fGwKNPkEVylO6iwM",
        "apple": "https://podcasts.apple.com/podcast/when-you-dont-get-what-youre-promised-from-purity-culture/id1689312239?i=1000648894504"
      }
    },
    {
      "id": "66efc901-2c56-4c30-a8c6-61e4189890f4",
      "title": "Growing Up as a Woman in Purity Culture",
      "description": "We are thrilled today to be talking with Rachel Overvoll! Rachel herself grew up in purity culture and high control religion. We discuss her experiences inside purity culture, the impact of it and her healing journey. We then get into how Rachel has used her personal story to inspire her professional life as a Somatic Sex Coach who works with clients focusing on finding sexual freedom after purity culture. We’ll also be answering a listener question and a special prayer partner guest will be joining us for this episode’s segment of prayer requests! The Religious Trauma \u0026#43; Elections course is now available for sign up! Find out more information and register for the course here ! Resources from today The Purity Myth by Jessica Valenti Better Sex Through Mindfulness by Lori Brotto Pleasure Activism by Adrian Maree Brown She Comes First by Ian Kerner Rachel Overvoll Somatic Sex Coach @rachelovervoll on IG and TikTok Find out more about the work Rachel does or book a session with her at: www.modernintimacy.com This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-02-27T12:00:00Z",
      "duration": "01:22:55.4120000",
      "explicit": false,
      "spotifyId": "5eNE2bZ4MVLSw6QWkEreDz",
      "appleId": 1000647221698,
      "subjects": [
        "Psychology",
        "Self-Help",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5eNE2bZ4MVLSw6QWkEreDz",
        "apple": "https://podcasts.apple.com/podcast/growing-up-as-a-woman-in-purity-culture/id1689312239?i=1000647221698"
      }
    },
    {
      "id": "456bbca7-c085-48a8-9ef1-74b9752e63ad",
      "title": "The Impact of Purity Culture on Women",
      "description": "We are thrilled to have with us today Dr. Tina Schermer Seller who is an author, researcher, professor, and psychotherapist specializing in the impacts of purity culture, shame resilience, gender, and sexuality. In this episode, Dr. Tina shares her research and how she came to realize the psychological and physiological impact of purity culture and how that shaped the direction of her work with clients, students, and her writing. In the episode, Dr. Tina shares an incredible definition of sexual shame (see below) that can help us understand the felt sense experience of purity culture! But before we talk to Dr. Tina, we have a vocabulary lesson on what are porn and sex addictions really and why religion is so quick to diagnoses people with them, and we’ll also be taking some prayer requests! This is an episode you won’t want to miss! Dr. Tina’s definition of sexual shame (taken from the dissertation of Noel Clarke): Sexual shame is a visceral feeling of humiliation and disgust toward one’s own body and identity as a sexual being and a belief of being abnormal, inferior and unworthy. this feeling can be internalized but also manifests in interpersonal relationships having a negative impact on trust, communication, and physical and emotional intimacy. Sexual shame develops across the lifespan in interactions with interpersonal relationships, one’s culture and society, and subsequent critical self-appraisal (a continuous feedback loop). There is also a fear and uncertainty related to one’s power or right to make decisions, including safety decisions, related to sexual encounters, along with an internalized judgement toward one’s own sexual desire. You can find Dr. Tina at: Instagram: @drtinashameless Facebook: @TinaSSellers Twitter: @TinaSSellers Website: https://www.tinaschermersellers.com Psychedelic assisted psychotherapy: www.Inannarising.org Dr. Tina’s Books: Sex, God, and the Conservative Church Shameless Parenting – Everything You Need to Raise Shame-free, Confident, Kids and Heal Your Shame Too This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups. Follow Andrew on Instagram and TikTok @deconstruct_everything Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com Hosts: Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji Editing and Production by Kevin Crowe and can be found at www.kevincrowe.co",
      "release": "2024-02-13T12:00:00Z",
      "duration": "01:29:54.2850000",
      "explicit": false,
      "spotifyId": "4OGBdTszyEGYKrKtmeW0En",
      "appleId": 1000645164839,
      "subjects": [
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4OGBdTszyEGYKrKtmeW0En",
        "apple": "https://podcasts.apple.com/podcast/the-impact-of-purity-culture-on-women/id1689312239?i=1000645164839"
      }
    },
    {
      "id": "f76d535e-48b7-482a-8727-9c29feed89e3",
      "title": "Growing Up Male in Purity Culture",
      "description": "We’re back with another episode from our purity culture mini-series! This week’s guest is RC Curtwright (@deconstructing_exjw on Instagram) who grew up in the Jehovah’s Witness organization and was a poster child of purity culture. In our conversation RC shares some of the long term impacts, mental health issues and shame that he and  many other men experienced as a result of purity culture. Before we get into our conversation, Laura answers a listener question and shares a little bit about being a church leader and teaching adolescents about purity culture, thereby having a front row seat to the lived experiences of men and boys. This is an episode you won’t want to miss!  Resources mentioned by RC Healing CPTSD by Pete Walker Mating in Captivity by Esther Perel This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery  The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups.  Follow Andrew on Instagram and TikTok @deconstruct_everything  Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com  Hosts:  Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji  Editing and Production by Kevin Crowe and can be found at  www.kevincrowe.co",
      "release": "2024-01-23T12:00:00Z",
      "duration": "01:36:58.3310000",
      "explicit": false,
      "spotifyId": "5jL6179vgjBRokcgakqXBC",
      "appleId": 1000642627692,
      "subjects": [
        "Psychology",
        "Jehovah\u0027s Witnesses",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jL6179vgjBRokcgakqXBC",
        "apple": "https://podcasts.apple.com/podcast/growing-up-male-in-purity-culture/id1689312239?i=1000642627692"
      }
    },
    {
      "id": "1d1a396e-7033-438c-9a97-825018803ab9",
      "title": "It’s Time to Talk about Men Healing from Purity Culture",
      "description": "The holidays are over and we are back into our purity culture mini-series! This month we are talking about purity culture and it’s impact on individuals who grew up male in this system. We are thrilled to have Dr. Bradley Onishi on the podcast today as our professional who has done research and client-facing work in this area as well as being a purity culture poster boy himself. Join Brad and Laura as they discuss the unique impacts of purity culture on men, shame, the expectations of being a “Godly man” and what happens when you don’t measure up to that, as well as the importance of men learning how to step out of of the prescribed roles and mentality that both purity culture and patriarchy prop up.  Resources Mentioned:  Fair Play (book and game) by Eve Rodsky  Mild at Heart podcast series (can be found on the website below and using “Mild” in the search bar) Guest: Brad Onishi Website: https://www.straightwhiteamericanjesus.com Instagram/TT: @straightwhitejc  This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery  The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups.  Follow Andrew on Instagram and TikTok @deconstruct_everything  Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com  Hosts:  Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji  Editing and Production by Kevin Crowe and can be found at  www.kevincrowe.co",
      "release": "2024-01-09T12:00:00Z",
      "duration": "01:29:20.2480000",
      "explicit": false,
      "spotifyId": "2ROyyTE0mqkdd2AmGDoAwK",
      "appleId": 1000641024841,
      "subjects": [
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ROyyTE0mqkdd2AmGDoAwK",
        "apple": "https://podcasts.apple.com/podcast/its-time-to-talk-about-men-healing-from-purity-culture/id1689312239?i=1000641024841"
      }
    },
    {
      "id": "5c3198b1-5cc3-4f9d-aca8-cca38f779af7",
      "title": "Transitioning out of Purity Culture",
      "description": "On today’s episode of Sunday School Dropouts we will be talking to Cody Harman, a certified fitness coach and nutritionist! Cody shares his story of growing up within evangelicalism and purity culture being socialized female, coming out and transitioning. Cody’s lets us in on his process of healing from the shame and harm that was caused by high control religion and offers encouragement and hope on the journey of healing. You can find Cody at the following places: • Instagram: @mrcoachcody_scoobyprep • TikTok: @mrcoachcody • Facebook: Cody Harman • Twitter: @mrcoachcody YouTube Channel: https://www.youtube.com/@Codytalks11/featured • Website: www.codyharman.com This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery  The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups.  Follow Andrew on Instagram and TikTok @deconstruct_everything  Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com  Music by Benjamin Faye Music @heytherebenji  Editing and Production by Kevin Crowe  ",
      "release": "2023-09-26T11:00:00Z",
      "duration": "01:24:14.3780000",
      "explicit": false,
      "spotifyId": "1cEGYv4cuORG2F2rJraBHh",
      "appleId": 1000629189307,
      "subjects": [
        "Evangelicalism",
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cEGYv4cuORG2F2rJraBHh",
        "apple": "https://podcasts.apple.com/podcast/transitioning-out-of-purity-culture/id1689312239?i=1000629189307"
      }
    },
    {
      "id": "02c85cc6-65da-4722-bae5-f32dc7b4b796",
      "title": "Religious Trauma for Queer Folks",
      "description": "Today we are excited to be joined by Jeremy Lehmann–Licensed Marriage and Family Therapist, Somatic Experiencing Practitioner, Trauma Coach and Assistant Director for the Center for Trauma Resolution and Recovery. Jeremy joins us today to talk about some of the aspects of working with queer folks coming out of high control religion, fundamentalism, and cults–sharing the unique pieces of religious trauma recovery including shame, embodiment, internalized hatred, and more.  To find out  more about Jeremy, you can go to his website: www.thrivery.com. Jeremy is taking therapy clients in the state of Tennessee through is website. If you would like to work with him but do not live in Tennessee, he is taking clients at the Center for Trauma Resolution and Recovery.  Books that Jeremy Recommends: Radical Self-Acceptance by Tara Brach Beyond Shame by Matthias Roberts This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery  The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups.  Follow Andrew on Instagram and TikTok @deconstruct_everything  Follow Laura on Instagram, Threads, and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com  Hosts:  Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji  Editing and Production by Kevin Crowe and can be found at  www.tubeatoz.com",
      "release": "2023-09-12T12:00:00Z",
      "duration": "01:52:01.6130000",
      "explicit": false,
      "spotifyId": "4OLGqqQj7gt4ulZbD3ZrUj",
      "appleId": 1000627602173,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4OLGqqQj7gt4ulZbD3ZrUj",
        "apple": "https://podcasts.apple.com/podcast/religious-trauma-for-queer-folks/id1689312239?i=1000627602173"
      }
    },
    {
      "id": "39b98423-0954-490c-a797-b27111458ab9",
      "title": "Trauma Bonding, Bypassing, Narcissism, and Gaslighting–what do they actually mean?",
      "description": "It’s time to go to school! Pull out your paper and pencil because today we’re going to have a vocabulary lesson! Join Laura and Andrew on today’s episode where they discuss some of the most commonly misunderstood and mis-defined words that people throw around conversationally and in social media spaces! Trauma bonding is when you bond over shared traumatic experiences…right? Doesn’t persistent selfishness equal narcissism? And surely you’re being gaslit if you feel confused by someone else’s memory or experience of something, right? In this episode Laura and Andrew define what these terms and concepts mean and why it’s important to the healing process to know what various terms mean–even if large social media accounts say otherwise! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery  The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups.  Follow Andrew on Instagram and TikTok @deconstruct_everything  Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com   Hosts:  Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji  Editing and Production by Kevin Crowe and can be found at  www.tubeatoz.com",
      "release": "2023-08-22T12:00:00Z",
      "duration": "01:28:23.2950000",
      "explicit": false,
      "spotifyId": "4KCKvV7TGunRyr4tAAO18B",
      "appleId": 1000625257044,
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4KCKvV7TGunRyr4tAAO18B",
        "apple": "https://podcasts.apple.com/podcast/trauma-bonding-bypassing-narcissism-and-gaslighting/id1689312239?i=1000625257044"
      }
    },
    {
      "id": "88f8245e-249d-4d1a-903b-beddef4604fc",
      "title": "Therapy vs. Coaching vs. Psychiatry",
      "description": "Nowadays there are more resources available than ever before if you’re looking for support on your healing journey–but which type of person is the best fit for you? A therapist? Coach? Psychiatrist? Join Andrew and Laura to discuss the differences and similarities between these professionals, why they practice as coaches (even though they have academic backgrounds as therapists), and help you figure out which type of person would be the most meaningful to you. Additionally, they discuss religion’s view of medicine, therapy, and why it can feel so difficult to engage in support services after leaving high control religion, cults, and fundamentalist systems.  This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery  The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups.  Follow Andrew on Instagram and TikTok @deconstruct_everything  Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com   Hosts:  Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji  Editing and Production by Kevin Crowe and can be found at  www.tubeatoz.com",
      "release": "2023-08-08T12:00:00Z",
      "duration": "01:32:05.1760000",
      "explicit": false,
      "spotifyId": "2fLOyxbWfwU2KWa5h1wI9s",
      "appleId": 1000623795442,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2fLOyxbWfwU2KWa5h1wI9s",
        "apple": "https://podcasts.apple.com/podcast/therapy-vs-coaching-vs-psychiatry/id1689312239?i=1000623795442"
      }
    },
    {
      "id": "d3bd1a7d-9fbb-40c8-bbe9-5276027b0e59",
      "title": "Deconstruction vs. Deconversion vs. Dechurched",
      "description": "Many people in deconstruction and post-religious communities use the term ‘deconstruction’ to describe their experience coming out of high control religion as well as the religious trauma that may have resulted. But are deconstruction and religious trauma the same? On today’s episode of Sunday School Dropouts we will be talking about deconstruction vs. deconversion vs. dechurched–how they are different and where they overlap. Laura and Andrew will also discuss the difference between these three experiences and religious trauma as well as offering up prayer requests and having some flannelgraph storytime! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery  The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups.  Follow Andrew on Instagram and TikTok @deconstruct_everything  Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com  Hosts:  Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji  Editing and Production by Kevin Crowe and can be found at  www.tubeatoz.com",
      "release": "2023-07-25T12:00:00Z",
      "duration": "01:49:40.2260000",
      "explicit": false,
      "spotifyId": "5dCx8Kd80OTz0M1S6HDEtk",
      "appleId": 1000622268388,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5dCx8Kd80OTz0M1S6HDEtk",
        "apple": "https://podcasts.apple.com/podcast/deconstruction-vs-deconversion-vs-dechurched/id1689312239?i=1000622268388"
      }
    },
    {
      "id": "e1049e34-9c0f-4e5b-8191-2074bde086f9",
      "title": "Spiritual Abuse \u002B Adverse Religious Experiences",
      "description": "What are Adverse Religious Experiences (AREs) and spiritual abuse? Aren’t they the same thing as religious trauma? Join Andrew and Laura on this week’s episode to discuss AREs, spiritual abuse, dynamics of power and control, how this relates to fundamentalism and how all of this…isn’t religious trauma? You heard us correctly!  Andrew and Laura discuss all of this AND how these things can result in religious trauma on this episode of Sunday School Dropouts! This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery  The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups.  Follow Andrew on Instagram and TikTok @deconstruct_everything  Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com   Hosts:  Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji  Editing and Production by Kevin Crowe",
      "release": "2023-07-11T12:00:00Z",
      "duration": "01:30:24.7910000",
      "explicit": false,
      "spotifyId": "5WaVrnCZ4qEj3z7IRHqMgQ",
      "appleId": 1000620767631,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WaVrnCZ4qEj3z7IRHqMgQ",
        "apple": "https://podcasts.apple.com/podcast/spiritual-abuse-adverse-religious-experiences/id1689312239?i=1000620767631"
      }
    },
    {
      "id": "c38dd83e-bd3d-46fc-ab29-f3e90fc7a0d5",
      "title": "What is the Nervous System (and how does it impact religious trauma)?",
      "description": "On this episode of Sunday School Dropouts, Laura and Andrew discuss the nervous system–what is it and how it is essential in healing trauma, including religious trauma. They discuss why you can’t think trauma away as well as how high control religions, cults, and fundamentalist systems encourage us to bypass the nervous system as a way of gaining additional control over people. This podcast is brought to you by the Center for Trauma Resolution and Recovery: an online trauma coaching company whose practitioners are trauma informed and trauma trained to work with individuals, couples and families who have experienced high control religion, cults, and religious trauma. For more information on the support that CTRR provides, for resources–including courses, workshops, and more–head to traumaresolutionandrecovery.com or follow us on Instagram: @traumaresolutionandrecovery  The views and opinions expressed by Sunday School Dropouts are those of the hosts and not necessarily reflect the official policy or position of the Center for Trauma Resolution and Recovery. Any of the content provided by our guests, sponsors, authors, or bloggers are their own ideas and opinions. The Sunday School Dropouts podcast is not anti-religion but it is anti -harm, -power and control, -oppression and, -abuse and will speak to the harmful practices and messaging of fundamentalist groups.  Follow Andrew on Instagram and TikTok @deconstruct_everything  Follow Laura on Instagram and TikTok @drlauraeanderson or on her website: www.drlauraeanderson.com   Hosts:  Laura Anderson and Andrew Kerbs Music by Benjamin Faye Music @heytherebenji  Editing and Production by Kevin Crowe and can be found at  www.tubeatoz.com",
      "release": "2023-06-27T12:00:00Z",
      "duration": "01:28:26.6620000",
      "explicit": false,
      "spotifyId": "0yYVrJD2Zeee8QPgTSh194",
      "appleId": 1000618485575,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0yYVrJD2Zeee8QPgTSh194",
        "apple": "https://podcasts.apple.com/podcast/what-is-the-nervous-system-and-how-does-it/id1689312239?i=1000618485575"
      }
    },
    {
      "id": "060b237b-3758-4211-b1de-198a18f8d088",
      "title": "What is Religious Trauma?",
      "description": "For our first episode we will be discussing one of the questions we get asked the most: what is religious trauma? But before that, we’ll be taking “prayer requests”, have flannelgraph storytime and Andrew and Laura will share a bit of their own story!  Sunday School Dropouts is brought to you by the Center for Trauma Resolution and Recovery.  Music is by Benjamin Faye and you can find him on Instagram at @heytherebenji  Editing and production by Kevin Crowe If you like what you’ve heard today we would love for you to rate, review, and subscribe wherever you listen to podcasts You can find us on Instagram @sundayschooldropoutspod or subscribe to our email list at www.sundayschooldropoutspod.com  If you’re interested in finding a trauma-informed practitioner, go to www.traumaresolutionandrecovery.com to schedule your free inquiry call with a practitioner of your choice or follow us on Instagram at @traumaresolutionandrecovery    You can find Andrew @deconstruct_everything on Instagram and TikTok And you can find me Laura @drlauraeanderson across all platforms or on my website: www.drlauraeanderson.com",
      "release": "2023-06-13T12:00:00Z",
      "duration": "02:22:15.7220000",
      "explicit": false,
      "spotifyId": "2zjrfM4TvbMZ9rmGjMUS6G",
      "appleId": 1000616834151,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zjrfM4TvbMZ9rmGjMUS6G",
        "apple": "https://podcasts.apple.com/podcast/what-is-religious-trauma/id1689312239?i=1000616834151"
      }
    }
  ]
}