{
  "id": "3068b5d6-668f-443a-97be-7bc69a6d9bd5",
  "name": "SuperPsyched Podcast with Dr. Adam Dorsay",
  "spotifyId": "1pxa5N0prbsBVnS85kD4L3",
  "appleId": 1512883587,
  "youTubeChannelId": "UCSh5nmITBuW84ztjc5dWlhQ",
  "episodes": [
    {
      "id": "d7986a01-7d75-4dde-b763-d6442f047587",
      "title": "#39 Cults: What You Need to Know | Daniel Shaw, LCSW",
      "description": "Cults…they’re scary, predatory, and life-sucking. Perhaps you know someone who was in a cult. These days, with loneliness at an all-time high, our basic human desire to feel connected and belong can make us vulnerable. Pair that with the nefarious and novel ways cults can reach out through the Internet, we are more threatened than ever by their presence. Truly, anyone can be a victim of a charismatic, malignantly narcissistic, and delusional leader. HBO’s documentary series, The Vow, is one of many shows that go into great depth showing us that smart, well-intentioned people can be manipulated badly. Knowledge is power and my expert guest on this episode, Daniel Shaw (www.danielshawlcsw.com), is the perfect person to teach us about cults. For many years, he was a member of a cult and, fortunately, he found his way out. Today, Dan is a highly-regarded author, psychoanalyst, clinical supervisor, and teacher. His brilliant book, Traumatic Narcissism, has been described by a colleague at Harvard Medical School as a “must-read for any of us who have worked with victims of traumatizing narcissists or been their victims ourselves.” So, listen in as Dan and I have a lively and informative discussion about cults and what you need to know. https://www.icsahome.com Book Link: https://amzn.to/465fCII This is an affiliate link. It will provide me with a small commission on purchases made through it and help the podcast (but it won’t affect the price you pay).",
      "release": "2020-10-09T00:00:00",
      "duration": "00:52:03.0950000",
      "explicit": false,
      "spotifyId": "4mYGxaY4VHqUPYiUH3YZ3E",
      "appleId": 1000494143184,
      "youTubeId": "6afmcWtnDwk",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mYGxaY4VHqUPYiUH3YZ3E",
        "apple": "https://podcasts.apple.com/podcast/39-cults-what-you-need-to-know-daniel-shaw-lcsw/id1512883587?i=1000494143184",
        "youtube": "https://www.youtube.com/watch?v=6afmcWtnDwk"
      }
    }
  ]
}