{
  "id": "2f7a5d7b-34b1-4149-a8d9-d8d15eeaf3fd",
  "name": "Surviving Reality",
  "spotifyId": "7EjYmjqpb5TGI3b69q8Mf0",
  "appleId": 1757539273,
  "youTubeChannelId": "UCSEQ8WJWJxeve4vNYhTDE9A",
  "episodes": [
    {
      "id": "c0e9d235-7cfc-4f63-b661-7335a0dc5d32",
      "title": "Ep 117:  The Cult of the Real Housewife (2025)",
      "description": "This week we attempt to untangle the turmoil surrounding The Real Housewives of Salt Lake City star Mary Cosby, and her Faith Temple Pentecostal Church. The investigative series raises big questions about power, control, and exploitation, but never fully commits - leaving us to wrestle with whether Mary is a victim, an opportunist, or something else entirely. Find All Our Links in One Place: beacons.ai/survivingpod Love the Show? Be sure to subscribe, leave a review, and share the laughs with your fellow reality TV junkies! It helps more listeners find our show. Support Us on Patreon: Looking for bonus content, ad-free and early episodes, exclusive merch discounts, and a place to spill the tea with us on our private Discord server? Join us on Patreon! Shop Our Merch: Snag official Surviving Sister Wives and Surviving Reality merch to twin with us! Follow Us on TikTok: Join the fun for memes, updates, and more reality TV drama. Get in Touch: Got a hot take or a question for us? Email us at survivingpod@gmail.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2026-01-06T11:00:00Z",
      "duration": "01:04:42.3180000",
      "explicit": true,
      "spotifyId": "2qlOgBnRKjykfV0uypb56M",
      "appleId": 1000743956062,
      "youTubeId": "FSCWwr--kmM",
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qlOgBnRKjykfV0uypb56M",
        "apple": "https://podcasts.apple.com/podcast/ep-117-the-cult-of-the-real-housewife-2025/id1757539273?i=1000743956062",
        "youtube": "https://www.youtube.com/watch?v=FSCWwr--kmM"
      }
    }
  ]
}