{
  "id": "4b9e1233-36fa-4390-8eb1-4197f3bdf47a",
  "name": "Survival Mode Disrupted with Leticia R Francis",
  "spotifyId": "2iKqw9ElRpuVqS34k2RZuv",
  "appleId": 1820821004,
  "episodes": [
    {
      "id": "d83bd8de-5917-4f51-9ef0-10f623634c74",
      "title": "Escaping the Cult, Reclaiming the Self",
      "description": "This powerful episode is a full-body exhale for every woman who\u0027s been told to \u0022just move on\u0022 while silently unraveling inside. Martha shares her harrowing journey from growing up in a religious cult to confronting the trauma stored in her body — and what it really takes to heal.\n✨ We talk nervous system regulation, inner child work, vulnerability as a superpower, and the raw truth about choosing healing even when it\u0027s hard.\nEscaping a religious cult at 26The myth of “I’m finally free”How trauma shows up in your physical bodyWhy healing is a forever journeyDoing it scared — and doing it anywayTools that helped Martha disrupt survival modeWhat it means to be a battle angel in the world of trauma recovery\n🎙️ What We Talk About:What most people don’t understand about traumaSomatic symptoms of unresolved painThe trauma response we mistake for personalityWhy generational trauma doesn’t stop unless you stop itThe healing power of faith, energy, and intuitionMoving from “I survived” to “I reclaimed my life”\n🔑 Key Takeaways:“You are not your trauma, but healing is a choice only you can make.”“There’s no pill for what trauma does to the soul.”“Your nervous system doesn’t know the difference between big-T or little-T trauma.”“We cannot thrive while dragging our pain behind us.”🙌 Why This Episode Matters:This is not just another healing story—it’s a mirror for every woman who buried her pain under performance, religion, silence, or shame. Martha doesn’t just talk about survival. She embodies what it means to disrupt it.\n\nIf you’ve ever questioned whether your trauma was “bad enough” to warrant healing, this episode will shake you.\n\n💬 Connect with Martha:🌐 www.trauma-x.org\n📱 Instagram, Facebook, TikTok: @marthagloriacari\n\n🔗 Resources \u0026 Links:💣 Download the Survival Mode Exit Blueprint 👉🏾 Join the Survival Mode Exodus Membership🎧 Subscribe to Survival Mode Disrupted: The Podcast on YouTube ✍🏾 Subscribe to Survival Mode Disrupted: The Newsletter on LinkedIn💬 Book a 1:1 Session with Leticia 📖 Order Survival Mode Exit Plan Book",
      "release": "2025-09-07T16:30:00Z",
      "duration": "00:32:03",
      "explicit": false,
      "spotifyId": "0LM9zzGzfmTJlQlZtueW0f",
      "appleId": 1000725392347,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0LM9zzGzfmTJlQlZtueW0f",
        "apple": "https://podcasts.apple.com/podcast/escaping-the-cult-reclaiming-the-self/id1820821004?i=1000725392347"
      }
    }
  ]
}