{
  "_ts": 0,
  "id": "3d235ec5-a39b-493d-a8d8-9a82350db286",
  "name": "Surviving Podcast",
  "spotifyId": "0kCN6uh73b15zv2mOhr2az",
  "appleId": 1572182113,
  "episodes": [
    {
      "id": "57bd19a2-0713-4631-9e3e-9221751bc3e9",
      "title": "The Process of Healing: Ashley Easter 30 Days of Courage",
      "description": "Can laughter be a lifeline after enduring trauma? Join us as we sit down with Ashley Easter to uncover the power of humor in reclaiming joy and control. Ashley\u0027s story is both heartbreaking and uplifting, as she navigates the absurdity of her past life in a fundamentalist religious cult. Her small acts of rebellion and the discovery of humor as a coping mechanism provide a fresh perspective on finding light amid darkness. This conversation is a testament to the resilience of the human spirit ...",
      "release": "2024-09-19T04:00:00Z",
      "duration": "01:00:32",
      "explicit": false,
      "spotifyId": "7zLMoLRIi5aqUzamvoBEFb",
      "appleId": 1000670006924,
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7zLMoLRIi5aqUzamvoBEFb",
        "apple": "https://podcasts.apple.com/podcast/the-process-of-healing-ashley-easter-30-days-of-courage/id1572182113?i=1000670006924"
      }
    },
    {
      "id": "a5d26c87-5ae8-445d-b634-b066f27ce9a5",
      "title": "Tamara Buchanan: Ill Always be a \u0022Jezebel\u0022",
      "description": "Tamara’s story is nothing short of extraordinary—a tale of survival, resilience, and the ultimate quest for joy beyond the shadows of a dark past. This week, we have the privilege of hearing from Tamara, a brave woman who escaped a cult over 25 years ago, along with her three children. Her journey from the grip of religious indoctrination and domestic violence to a life filled with self-expression and empowerment is a powerful testimony to human strength and the transformative power of therapy, especially EMDR. Tamara’s vibrant spirit and love for bright makeup and colors shine through as she reclaims her identity and finds beauty in everyday moments. The harsh realities of domestic abuse and religious control underscore Tamara’s harrowing escape from a marriage filled with extreme violence. Her ex-husband’s threats and the church\u0027s perpetuation of a culture of silence and victim-blaming created a suffocating environment. It was her young son\u0027s heartbreaking declaration of his inability to protect her that catalyzed her decision to leave. This chapter of her life brings to light the critical role of therapy in healing trauma and the broader societal issues of isolation and shunning within cult-like communities. Our conversation dives deep into the impact of these experiences and the steps taken to break free and seek a new beginning. Empowerment and community are central themes as we explore Tamara’s journey beyond her escape. She shares the triumphs of earning an associate degree and becoming the first female graduate in her religious community, symbolizing her breaking of generational cycles of abuse. Tamara’s reclamation of the stigmatized term \u0022Jezebel\u0022 embodies her fight against imposed shame and the power of finding one\u0027s voice. Her story is a call to unity and allyship in the battle against patriarchy and marginalization. Join us as we celebrate Tamara\u0027s unyielding spirit and the transformative power of speaking authentically. Support the Show.",
      "release": "2024-07-18T04:00:00Z",
      "duration": "00:47:12.0390000",
      "explicit": false,
      "spotifyId": "6WzWMdBQTmc9pGjfyjKciw",
      "appleId": 1000662594243,
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6WzWMdBQTmc9pGjfyjKciw",
        "apple": "https://podcasts.apple.com/podcast/tamara-buchanan-ill-always-be-a-jezebel/id1572182113?i=1000662594243"
      }
    },
    {
      "id": "63c7055b-e78f-4d6e-bf13-2bfa7f5d2c15",
      "title": "Danny Masterson \u0026 The Church of Scientology",
      "description": "As we navigate the turbulent waters of trauma and seek the shores of justice, this episode stands as a beacon, illuminating the struggles and triumphs within the human spirit. We pay homage to our late friend and tireless advocate, Doug Scott Kramer, whose absence is profoundly felt, and whose legacy continues to resonate. Joining us as we discuss Scientology and the Masterson trial articulates not just the personal cost of such ordeals but also the profound courage required to confront them. Within the confinements of the Church of Scientology, shadows loom large over the souls seeking solace. The Jane Does\u0027 battle against systemic victim-blaming and gaslighting unravels before us, casting a stark light on the harrowing paths they\u0027ve tread in the pursuit of justice. The intersection of celebrity, internal power dynamics, and personal belief systems creates a labyrinth where accountability is elusive, and personal tragedies are often met with cold indifference. Our episode is an odyssey of resilience, an exploration into the heart of advocacy, and a testament to the power of solidarity. We traverse the complex landscapes of disclosing trauma, the intricacies of the legal system, and the societal barriers that often muzzle the voices of survivors. As we close, we are reminded of the irreplaceable value of allies like Doug Scott Kramer, whose compassion and commitment to the survivor community burn as a guiding light for all who seek to emerge from the darkness of abuse into the dawn of healing and hope. https://www.youtube.com/@dbnc Support the show",
      "release": "2024-03-21T04:00:00Z",
      "duration": "00:53:33.7340000",
      "explicit": false,
      "spotifyId": "6prQjy1T88qFGI3YK0a9iw",
      "appleId": 1000649951516,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6prQjy1T88qFGI3YK0a9iw",
        "apple": "https://podcasts.apple.com/podcast/danny-masterson-the-church-of-scientology/id1572182113?i=1000649951516"
      }
    },
    {
      "id": "1325a230-2e91-4849-839b-8085adf7b019",
      "title": "Kristin Watson: Surviving a Religious Cult",
      "description": "Have you ever felt trapped by the invisible chains of your past, wondering if there\u0027s a path to freedom? Kristin Watson joins us in a raw and impactful narrative of breaking free from a life once dictated by a strict religious upbringing and the loss that came with it. Her voice reverberates with the courage of a mother, a wife, and a survivor, shining a light on the dark corners of religious manipulation and the power of reclaiming one\u0027s narrative. This episode is a mosaic of struggle and triumph, as Kristin unfolds the contrasting worlds of a nurturing present and an oppressive past. Her story is not just hers but echoes the tales of many who have grappled with the loss of personal passions to dogmatic demands. With each chapter, we traverse her emotional journey from the relinquishment of her figure skating dreams to the healing embrace of self-affirmation, examining the intricate relationship between faith, personal choice, and the cathartic power of speaking one\u0027s truth. Kristin\u0027s healing journey is a beacon of hope and inspiration for all. She bravely steps into the light, sharing the pivotal moments of her life—from challenging the damaging messages of her religious upbringing to finding love that defies constraints. Her intention to pen a memoir is a promise of transparency and solidarity with others on similar paths. Join us as we bear witness to a tale that affirms love triumphs, voices matter, and there is immense power in rewriting our own stories. Support the show",
      "release": "2024-02-29T05:00:00Z",
      "duration": "01:21:17.6980000",
      "explicit": false,
      "spotifyId": "7bh06aYZVg180o7odrY6V3",
      "appleId": 1000647489795,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7bh06aYZVg180o7odrY6V3",
        "apple": "https://podcasts.apple.com/podcast/kristin-watson-surviving-a-religious-cult/id1572182113?i=1000647489795"
      }
    }
  ]
}