{
  "_ts": 0,
  "id": "91f1f4ed-a202-400f-afec-3d525eea8815",
  "name": "Surviving Narcissism",
  "youTubeChannelId": "UCIELB1mz8wMKIhB6DCmTBlw",
  "episodes": [
    {
      "id": "494344cc-fa09-4771-88b4-d34898f93630",
      "title": "Narcissistic Families That Resemble Cults, featuring Meredith Miller",
      "description": "Dr. C interviews Meredith Miller who helps individuals traumatized by highly authoritarian family systems.  Her psychological thrust goes beyond just surviving, but in helping survivors shed the victim\u0027s mindset so they can move fully into a rewarding adult identity.\n\nIf you are interested in online therapy, Dr. Carter has a sponsor who can assist.  Go to our sponsor https://betterhelp.com/drcarter for 10% off your first month of therapy with BetterHelp and get matched with a therapist who will listen and help.\n\nSign up for Dr. Carter\u0027s course: Ready, Set, Connect\nhttps://courses.survivingnarcissism.tv/courses/ready-set-connect \nGet 20% off when you use the coupon code: rsc20youtube \n\nDr. Les Carter is a best selling author and therapist who has semi-retired to Waco, TX. For 40\u002B years he maintained a counseling practice in Dallas, conducting more than 65,000 therapy sessions and many workshops and seminars.  He specializes in anger management and narcissistic personality disorder.  Since creating his YouTube channel, his videos have received more than 110 million views.\n\nJoin the Team Healthy community HERE: https://survivingnarcissism.tv/subscribe/ \nCheck out videos, articles, quizzes, and more at our website:  https://survivingnarcissism.tv\n\nYou can follow Surviving Narcissism on:\nTwitter:  @SNarcissism101\nInstagram:  @survivingnarcissism101\nFacebook: @survivingnarcissism101\n\nDr. Carter has two other courses that you may find to be useful:\nFree to Be: Reclaim \u0026 rediscover your uniqueness https://survivingnarcissism.tv/free-to-be-course/\nThis Is Me: Setting boundaries with the controllers in your life   https://survivingnarcissism.tv/this-is-me \n\nDr. Carter\u0027s personal website: http://drlescarter.com/\nDr. Carter\u0027s other YouTube channel:  https://www.youtube.com/c/drlescarter\nBookstore: https://survivingnarcissism.tv/books-on-narcissism-surviving-narcissism/",
      "release": "2024-04-09T15:00:07Z",
      "duration": "00:34:31",
      "explicit": false,
      "youTubeId": "qKMCj0j7Xck",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qKMCj0j7Xck"
      }
    }
  ]
}