{
  "_ts": 0,
  "id": "66aa9f4b-9f3c-4f75-a6e4-0ef35269095b",
  "name": "Surviving the Survivor: #BestGuests in True Crime",
  "spotifyId": "7Ksy7m9DccUfTuzYa0x0HE",
  "appleId": 1561371265,
  "episodes": [
    {
      "id": "1ac3db90-85bb-4ac3-b32a-509cf80d9a44",
      "title": "Lori Vallow’s Cousin Megan Conner Discusses Growing Up With the Infamous Killer",
      "description": "IT\u0027S HERE: Pre-Order Joel\u0027s Book: Https://amzn.to/48GwbLx STS Patreon \u0026#x1f449; Https://patreon.com/SurvivingTheSurvivor STS Website: https://survivingthesurvivor.com/ STS Merch Store: https://www.bonfire.com/store/sts-store/ #STSNation , Welcome to another episode of Surviving The Survivor, the podcast that brings you the #BestGuests in all of True Crime… Lori Vallow was sentenced to life in prison without parole on 31 July. But she is still awaiting trial in another case. She is separately charged in Arizona with conspiring to murder her fourth husband Charles Vallow, with the help of her now-deceased brother Alex Cox – who mysteriously also died three months after the children’s disappearance. She is also charged with conspiracy to murder her niece’s estranged husband Brandon Boudreaux after he narrowly escaped a drive-by shooting. Today, we speak with Lori’s cousin Megan Conner who has known the infamous killer since childhood. #BestGuest : Megan Conner is the mother of six spectacular human beings and a breaker of generational trauma cycles. She survived sex trafficking as a child and spent almost 40 years in other abusive systems before finally learning how to break free. Megan is now an author and coach and teaches others how to identify and exit coercive and abusive relationships and systems. She is passionate about discussing how toxic family patterns and cult mentalities led her cousin, Lori Vallow Daybell, to become a convicted murderer, and how everyone can help prevent future tragedies. Megan’s favorite topics to teach about are healthy parenting, family systems, high-demand religion and healing from trauma. Her books, \u0022I Walked Through Fire to Get Here\u0022 and \u0022100 Ways to Practice Self Care\u0022 are available on Amazon. #LoriVallowDaybell #LoriVallow #DoomsdayMom #DoomsdayMother #Boise #TJ #Tylee #TrueCrime #TrueCrimeCommunity #LoriVallowTrial #LoriVallowDaybellTrial",
      "release": "2024-03-14T10:00:00Z",
      "duration": "01:33:04.0390000",
      "explicit": false,
      "spotifyId": "0vmZGzBKf485duo1Em3ZlQ",
      "appleId": 1000649177484,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0vmZGzBKf485duo1Em3ZlQ",
        "apple": "https://podcasts.apple.com/podcast/lori-vallows-cousin-megan-conner-discusses-growing/id1561371265?i=1000649177484"
      }
    }
  ]
}