{
  "id": "2699d3f0-03d6-49e9-8c92-ca4d1506d600",
  "name": "Survivors Discuss",
  "spotifyId": "3qTwCpqu8PBiXvGtJVS8SF",
  "episodes": [
    {
      "id": "81172ba5-4307-471e-b6ce-bd47fb937a04",
      "title": "DL and Krispin Mayfield - Strongwilled and not mourning James Dobson",
      "description": "We’re talking with Krispin and D.L. Mayfield about their project over on Substack called Strongwilled. James Dobson and Focus on the Family have impacted millions of people with their teachings about corporal punishment and breaking the will of children. Many of these children have grown up to speak out about how traumatic their upbringing was. What does the legacy of James Dobson mean for us as we live in a time of growing authoritarianism globally? We get into the nitty-gritty of authoritarian parenting, how we heal our nervous systems, and why we were so drawn to books about orphans when we were kids. Be sure to subscribe to Survivors Discuss for more episodes on life after toxic religion. Krispin and D.L. Mayfield are both products of the modern religious authoritarian parenting movement that has shaped millions and millions of evangelical Christians. Krispin is a therapist who specializes in working in religious trauma recovery and supporting neurodivergent clients. He wrote a book on attachment theory and Christianity in 2022 (and has since left the faith). He loves photography, music, and most anything creative. D.L. is the author of three books and a former freelance writer. They are a late-diagnosed autistic who currently has a special interest in exposing Christian authoritarianism and healing from high-control religion Strongwilled on Substack: https://strongwilled.substack.com/ Cohosts: Clare Heath-McIvor: kitkennedy.com Shari A. Smith: shariasmith.com Cait West: caitwest.com Website: https://survivorsdiscuss.com/ Instagram: https://www.instagram.com/survivorsdiscuss/ Facebook: https://www.facebook.com/SurvivorsDiscuss",
      "release": "2025-08-24T00:00:00",
      "duration": "01:30:35.3520000",
      "explicit": true,
      "spotifyId": "4uqEvSC2lVfKu0WORE1MKF",
      "subjects": [
        "Cult Recovery",
        "Christian Fundamentalist",
        "Evangelicalism",
        "Psychology",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4uqEvSC2lVfKu0WORE1MKF"
      }
    },
    {
      "id": "bf22d01a-4730-4895-b0f0-78f257006105",
      "title": "International House of Prayer Kansas City - a Pseudo-church in scandal",
      "description": "In this episode, Shari, Cait and Clare sit down with the wonderful Nikki G (from @nikki_g_speaks) and Jo (from @_bytheirfruit). Both courageous women were involved in the International House of Prayer in Kansas, which has recently been embroiled in scandal as Mike Bickle, the head of the movement, faces allegations of egregious wrongdoing. CW: this episode includes discussion of sexual abuse. If this raises something for you, please contact Lifeline if you are in Australia (13 11 14) or 1-800-273-TALK (8255) if you are in America. We stand with survivors. We believe them.",
      "release": "2024-07-24T00:00:00",
      "duration": "01:28:06.4310000",
      "explicit": true,
      "spotifyId": "02X8Z8QPpPzDSyQziXkqFG",
      "subjects": [
        "International House of Prayer Kansas City"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/02X8Z8QPpPzDSyQziXkqFG"
      }
    },
    {
      "id": "d112beeb-d4ee-49ef-82ac-9d5afcf68c10",
      "title": "Cults - Their leaders, their methods, their damage",
      "description": "Today on the podcast, we’re talking all things cults and cult recovery! Experts Janja Lalich and Nikki G join us to share their experience with political and religious cults and how they now work with others who are processing the aftermath of leaving high-control groups. We cover why people join cults (hint: it’s not because they’re unintelligent), how you lose your sense of self in a cult, shunning and excommunication, cult hopping, and the newest version of cults on the internet, such as Twin Flames and QAnon. Be sure to subscribe to Survivors Discuss for more episodes on life after toxic religion. Janja Lalich, Ph.D., Professor Emerita of Sociology, is an international authority on cults, extremism, and coercion. She specializes in closed systems (cults, narcissistic relationships, human trafficking, ideological extremism) and has been an avid contributor to the field for more than 30 years through her research, publications, presentations, and social media. Dr. Lalich is Founder and CEO of the Lalich Center on Cults and Coercion, a 501c3 organization. The mission of the Lalich Center is to provide psychoeducational resources to survivors of cults, the Troubled Teen Industry, and narcissistic families/relationships. She is author of six books, including the now classic, Take Back Your Life: Recovering from Cults and Abusive Relationships; her theoretical work, Bounded Choice: True Believers and Charismatic Cults; and Escaping Utopia: Growing Up in a Cult, Getting Out and Starting Over. She also coauthored two books with Dr. Margaret Thaler Singer: Cults in Our Midst and “Crazy” Therapies: What Are They? Do They Work? In addition to working with survivors and their families, she conducts workshops for governments and international intelligence agencies, private companies, and educational institutions. She conducts courses for trauma survivors and mental-health professionals and has served as consultant/expert witness in civil and criminal legal cases. Dr. Lalich may be reached at janja.l@lalichcenter.org or through her websites: www.janjalalich.com or www.lalichcenter.org. Nikki G. is a Life Coach and Advanced Certified Trauma Recovery Coach (in training) who helps survivors recover and thrive after Narcissistic Abuse, Religious Trauma/Spiritual Abuse \u0026 Cult involvement/High Demand Groups. She is also a survivor of multiple narcissistic relationships, religious trauma as well as a former member of multiple cultic communities. Nikki is the CEO of Nikki G Speaks LLC, which exists to support survivors with individual coaching services, online courses, and other various forms of psychoeducation related to religious trauma, narcissistic abuse, and cult involvement. She educates and empowers survivors to reclaim their lives and embrace the journey to “come back home” to self. Nikki is a co-host of the podcast “Surviving the Black Church” where she and co-hosts delve into conversations regarding religious trauma within the Black Church. She also sits on the board of directors for a non-profit organization called Tears of Eden (which supports survivors who have experienced abuse in the evangelical community). Nikki is a member of the IAOTRC (International Association of Trauma Recovery Coaching), where she co-facilitated a Religious Trauma Cohort Group for coaches. She is also a member of the ICSA (International Cultic Studies Association), where she keeps abreast of the latest information regarding spiritual abuse, cults, and how trauma and abuse affects survivors. To connect with Nikki for individual coaching, online collective community, or future speaking engagements, you can find her at www.nikkigspeaks.com. Nikki G. Links Website: www.nikkigspeaks.com Instagram - Nikki G (@nikki_g_speaks) • Instagram photos and videos Facebook - Nikkig Speaks | Facebook Cohosts: Clare Heath-McIvor: www.clareheathmcivor.com Shari A. Smith: shariasmith.com Cait West: caitwest.com Website: https://survivorsdiscuss.com/ Instagram: https://www.instagram.com/survivorsdiscuss/ Facebook: https://www.facebook.com/SurvivorsDiscuss",
      "release": "2024-05-14T00:00:00",
      "duration": "01:20:17.8560000",
      "explicit": true,
      "spotifyId": "1jNzBw2umCDt03qDYgR8Ll",
      "subjects": [
        "Psychology",
        "Cult Recovery",
        "Cult-Expert",
        "Human Trafficking",
        "Troubled Teen Industry",
        "Christian Fundamentalist",
        "Evangelicalism",
        "Qanon",
        "Quiverfull",
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1jNzBw2umCDt03qDYgR8Ll"
      }
    },
    {
      "id": "2da8d6f2-aad8-4ac8-97f1-857d0d486cb3",
      "title": "CTPSD -The Great Parting Gift From Toxic Religion",
      "description": "Therapist Dr. Laura Anderson and faith deconstruction coach Angela Herrington join Shari and Cait to discuss Complex Post-Traumatic Stress Disorder (CPTSD). So many survivors experience CPTSD, particularly when we’ve grown up in high-demand religions and/or abusive homes. Healing isn’t easy, but it is possible! We talk about different ways to get support through trauma-informed therapy and coaching, as well as grounding practices to help with dissociation and the importance of self-compassion. Be sure to subscribe to Survivors Discuss for more episodes on life after toxic religion. Dr. Laura Anderson (PhD, Saybrook University; LMFT) is a therapist, trauma resolution and recovery coach, writer, educator, and creator who specializes in complex trauma with a focus on domestic violence, sexualized violence and religious trauma. Laura has a private practice in Nashville, TN and is the founder and director of the Center for Trauma Resolution and Recovery , an online coaching company where she and the other practitioners work with clients who have experienced high demand/high control religions, adverse religious experiences, cults, and religious trauma. In 2019, Laura co-founded the Religious Trauma Institute with the goal of providing trauma-informed resources, consultation, and training to clinicians and other helping professionals who work with religious trauma survivors. Laura’s first book, When Religion Hurts You: Healing From Religious Trauma and the Impact of High Control Religion, was released by Brazos press in October 2023. She lives with her dog, Phoebe, in Nashville, Tennessee. Find Laura on Instagram , TikTok , Facebook , and her website . Angela Herrington is a faith deconstruction coach and host of The Deconstructing Faith Summit, who helps people break free from toxic religious culture \u0026 empowers them to recover from #churchhurt. She has led online ministries for a decade, enjoys working with clients 1:1, in groups, and is a dynamic conference speaker. She’s a Lark’s Song Certified Life Coach who reaches thousands of people in 40\u0026#43; countries each month on Facebook, IG, Twitter, Pinterest, and her blog. She’s a firstborn, Enneagram 8, Gen Xer who loves to question everything. She holds a BA from Indiana Wesleyan and a Master in Leadership from Wesley Seminary. Her graduate research project focused on leadership development and opportunities for Gen X women in the US church. Angela and her unique online ministry are featured in Lyz Lenz’s 2019 book God Land: Story of Faith, Loss, and Renewal in Middle America. She has published articles in Hope for Women and HOPE is Now magazines. She has been featured in The New Republic, Publisher’s Today, and Religion News Service. Her first book, Deconstruct Your Faith Without Losing Yourself ( Eerdmans, February 2024 ), shares her decade of experience as a faith deconstruction coach, personal stories, a hefty dose of compassion, and her trademark Gen X humor. Angela is also a wife, a mom to 5, and a proud resident of Marion, Indiana, with her family when they’re not traveling the US in their RV. Find Angela on Instagram , Facebook , X , YouTube , and her website . Cohosts: Clare Heath-McIvor: kitkennedy.com Shari A. Smith: shariasmith.com Cait West: caitwest.com Website: https://survivorsdiscuss.com/ Instagram: https://www.instagram.com/survivorsdiscuss/ Facebook: https://www.facebook.com/SurvivorsDiscuss",
      "release": "2024-02-23T00:00:00",
      "duration": "01:03:26.2310000",
      "explicit": true,
      "spotifyId": "3fOBgisxzBuAyyqj57eKcm",
      "subjects": [
        "Psychology",
        "Cult Recovery",
        "Christian Fundamentalist",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3fOBgisxzBuAyyqj57eKcm"
      }
    },
    {
      "id": "e88ce4aa-6090-4c57-beef-c9e2ce8f2837",
      "title": "Christianity, Race and White Supremacy - The lived experience and the road to anti-racism",
      "description": "We have the honor of interviewing LaToya Thompson, Naiomi Gonzalez, and R. Scott Okamoto as our guests for this episode to talk about racism in evangelicalism, decolonizing faith, intersectionality, and what it means to be an anti-racist as we move forward. White supremacy has deep roots in evangelicalism, and all too often, racist ideas and attitudes can follow us into the exvangelical community. Decolonizing our way of thinking is essential as we deconstruct our faith and find a new path away from toxic religion. Be sure to subscribe to Survivors Discuss for more episodes on life after toxic religion. LaToya Thompson (she/her) is a professional editor and writer who has guided coaches, entrepreneurs, veterans, moms, corporate professionals, and ministers toward self-publishing their books. Find LaToya on Instagram and her website Naiomi Gonzalez (she/they) is a professional nerd. They are Puerto Rican, queer, and nonbinarish. They have a passion for helping other Christians, especially those questioning fundamentalist Christian theology, expand their understanding of God. Their writing can be found at https://faithfullyradicalchristian.substack.com . Find Naiomi on Instagram , Facebook , Substack , and YouTube Scott Okamoto (he/him) was raised evangelical and was a golden child of church and Inter-Varsity Christian Fellowship in college. But he asked too many questions, disagreed with the answers, and slowly deconstructed through his early adulthood until he gave it all up while teaching English at an evangelical university. He is currently the creator and host of the Chapel Probation podcast , the author of Asian American Apostate: Losing Religion and Finding Myself at an Evangelical University (Lake Drive Books), and an editor and music supervisor for the newly launched Axis Mundi Media, an academic podcast company that is part of the Straight White American Jesus universe. Find Scott on Instagram , his website , and X Content Warning Event : February 17-18, 2024 Cohosts: Clare Heath-McIvor: kitkennedy.com Shari A. Smith: shariasmith.com Cait West: caitwest.com Website: https://survivorsdiscuss.com/ Instagram: https://www.instagram.com/survivorsdiscuss/ Facebook: https://www.facebook.com/SurvivorsDiscuss",
      "release": "2023-11-22T00:00:00",
      "duration": "01:16:19.1510000",
      "explicit": true,
      "spotifyId": "5SyadYupeRVOLyWRPKQ5gM",
      "subjects": [
        "Evangelicalism",
        "Christian Fundamentalist",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5SyadYupeRVOLyWRPKQ5gM"
      }
    },
    {
      "id": "69a2b607-79fa-4f3a-acd8-f467c6ced7a7",
      "title": "Purity Culture - What Data and Embodiment PracticeTeach Us About Recovery",
      "description": "Clare, Shari, and Cait interview Tara Teng and Rebecca Gregoire-Lindenbach on their groundbreaking work in terms of sexuality. Rebecca is part of the mother daughter dynamic duo behind The Great Sex Rescue - where large scale surveys capture life-changing and insightful data into female sexuality, relationships and abuse within church contexts. Tara Teng works with people as an embodiment coach, helping reconnect ourselves with our bodies after purity culture drives the great schism. Both women are authors - Tara\u0027s book \u0022Your Body is a Revolution\u0022 and Rebecca\u0027s titles which include \u0022She Deserves Better\u0022 and \u0022The Great Sex Rescue\u0022 are, well, revolutionary. We laughed in this episode. Maybe cried a bit. Had to sit with big realisations. Had to deal with a hungry cat. We hope you enjoy this conversation as much as we did. Be sure to subscribe to Survivors Discuss for more episodes on spiritual abuse and healing from religious trauma. Find our Guests: Rebecca Lindenbach: baremarriage.com Tara Teng: tarateng.com (and ơn socials as @MissTaraTeng) Cohosts: Clare Heath-McIvor: kitkennedy.com Shari A. Smith: shariasmith.com Cait West: caitwest.com Website: https://survivorsdiscuss.com/ Instagram: https://www.instagram.com/survivorsdiscuss/ Facebook: https://www.facebook.com/SurvivorsDiscuss",
      "release": "2023-10-12T00:00:00",
      "duration": "01:30:42.1910000",
      "explicit": true,
      "spotifyId": "5GUN9JpbCDn6U7nkOabzwO",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GUN9JpbCDn6U7nkOabzwO"
      }
    },
    {
      "id": "a0a6eb94-30ab-449b-8e44-4ced32e7cf78",
      "title": "The Way We Were - Our Lives Before Deconstruction",
      "description": "Clare, Shari, and Cait share their own journeys to healing after growing up in toxic fundamentalist Christianity. From mental health struggles and PTSD, to losing family and friends, leaving can mean the upheaval of our lives, but it can also be a way to connect back with our intuition, learn to trust ourselves again, and find the confidence to make good decisions for our futures. Be sure to subscribe to Survivors Discuss for more episodes on spiritual abuse and healing from religious trauma. Cohosts: Clare Heath-McIvor: www.clareheathmcivor.com Shari A. Smith: shariasmith.com Cait West: caitwest.com Website: https://survivorsdiscuss.com/ Instagram: https://www.instagram.com/survivorsdiscuss/ Facebook: https://www.facebook.com/SurvivorsDiscuss",
      "release": "2023-08-25T00:00:00",
      "duration": "00:54:59.4710000",
      "explicit": true,
      "spotifyId": "0MZWgeXhhaGYgBybbc4Dlt",
      "subjects": [
        "Psychology",
        "Christian Fundamentalist",
        "Quiverfull",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0MZWgeXhhaGYgBybbc4Dlt"
      }
    },
    {
      "id": "c8e50342-47f7-4645-ba7c-b896fe75c869",
      "title": "Shiny Happy IBLP Life - The reach, the impact and the life after",
      "description": "Join us - Clare, Shari and Cait - as we chat with the wonderful Tia Levings and compare our lives and the varying levels of impact that Gothard, IBLP and Vision Forum had on all of us - even those of us who thought we were too far removed to be in the target zone for proselytising. From homophobia, transphobia and \u0022subtle\u0022 racism to homeschooling female submission, politics, and quiverful - it\u0027s got it all. Its a heavy episode, but it was a heavy documentary. And its time we start paying attention to the voices that influence us without us even thinking about it.",
      "release": "2023-06-30T00:00:00",
      "duration": "01:26:17.6610000",
      "explicit": false,
      "spotifyId": "2ZLpE4VpAROqj3PjqR3ucv",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZLpE4VpAROqj3PjqR3ucv"
      }
    }
  ]
}