{
  "id": "1bb531ef-5f39-4706-86cf-8efbfed5a2ea",
  "name": "Surviving Scientology Radio",
  "spotifyId": "1W2XGIs3HW2D6kqbmAOSsJ",
  "appleId": 864571814,
  "episodes": [
    {
      "id": "67c42d1f-fb66-4a4f-9c81-274fef3cbb93",
      "title": "Surviving Scientology podcast: Dirty private eyes discuss killing Leah Remini?",
      "description": "Tony Ortega\u0027s Daily Beast story revealed that texts seized from a private investigator showed him not only stalking Leah Remini, but suggesting that Scientology wanted her dead. Tony joins California licensed Private Investigator Jeffrey Augustine to discuss this amazing revelation.\n \n  Tony Ortega\u0027s Daily Beast Story \n Jeffrey Augustine\u0027s Blog: The Scientology Money Project \n  ",
      "release": "2021-07-11T21:31:40Z",
      "duration": "00:57:35",
      "explicit": false,
      "appleId": 1000528543474,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-podcast-dirty-private-eyes-discuss/id864571814?i=1000528543474"
      }
    },
    {
      "id": "2a47e305-30d5-4bad-bc67-19ffc095ec3f",
      "title": "Aaron Smith-Levin: Life in the Scientology Matrix. Why Clears Are in Danger \u0026 Other Inside Secrets",
      "description": "This podcast is about the often arbitrary ways in which the Church of Scientology works in real life as opposed to its PR. For example, after spending $50,000, or more, to reach the State of Clear, the new Clear is given a secret letter from L. Ron Hubbard telling them that they are in danger and get onto the OT levels as fast as possible or else! But how can this be if a Clear no longer has his or her Reactive Mind? A Clear is supposed to be at \u0022Cause Over Life\u0022 and able to handle anything. However, they are told they in some kind of danger and won\u0027t discover why until they do OT III Jeffrey Augustine asks Aaron why it can take up to 20 years to move from Clear to OT in Scientology. This is a great question. Aaron explains why this happens to former Sea Org members who are treated like pariahs and lepers. Aaron discusses how David Miscavige used the Golden Age of Tech I and II in an ideological manner to purge older Scientologists who were loyal to Hubbard and not Miscavige. Aaron also offers fascinating insights into young 2nd generation Scientologists who attested that they were past life clears as early as 12 years of age. Aaron\u0027s insights into this and the consequences it caused inside of Scientology are extremely fascinating.",
      "release": "2020-06-03T22:32:33Z",
      "duration": "00:58:51",
      "explicit": false,
      "appleId": 1000476735532,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/aaron-smith-levin-life-in-the-scientology-matrix-why/id864571814?i=1000476735532"
      }
    },
    {
      "id": "21d7ace8-82c0-4538-b443-3a3da800d187",
      "title": "Former Scientology RTC Executive Claire Headley - Part 2",
      "description": "Claire Headley tells more anecdotes about life as a Sea Org Member in the notorious place of violence and confinement, INT Base, (or Gold Base), the Religious Technology Center, David Miscavige\u0027s luxury six figure BMW and how David Miscavige ordered her to divorce her husband Marc, author of \u0022Blown for Good\u0022. Claire covers how violent David Miscavige is, beating top execs and how his colleagues make him an OSCAR for his performance on Nightline ! We have already interviewed Marc Headley for this channel...stay tuned!",
      "release": "2020-05-07T18:59:33Z",
      "duration": "00:38:15",
      "explicit": false,
      "appleId": 1000473905967,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/former-scientology-rtc-executive-claire-headley-part-2/id864571814?i=1000473905967"
      }
    },
    {
      "id": "381f121a-8c2b-41db-9aa4-044f10f62938",
      "title": "Former Scientology RTC Executive Claire Headley - Part 1",
      "description": "Claire Headley takes us through her Sea Org years at Religious Technology Center. She talks about the messing Shelley Miscavige, the escalating punishments and sadism at INT base, including the humiliating punishment of having the clean feces with one\u0027s hands. She describes what happened at INT Base after Marty Rathbun fled, and how she finally understands what Miscavige meant by stating that INT Base staff were \u0022security risks.\u0022",
      "release": "2020-04-29T05:14:12Z",
      "duration": "00:38:10",
      "explicit": false,
      "appleId": 1000473019930,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/former-scientology-rtc-executive-claire-headley-part-1/id864571814?i=1000473019930"
      }
    },
    {
      "id": "aa15ee71-77a9-4b29-87f9-809e7310f6b4",
      "title": "Guy White -- Part 2",
      "description": "Guy White opens by discussing how he and his wife Suzette spent Christmas days, birthdays, and other holidays at Mary Sue Hubbard\u0027s home with their three children. Guy White next describes how Suzette Hubbard fled the Sea Org and took their infant son with her. The Church of Scientology tried to convince Guy to divorce Suzette and remain in the Sea Org. Guy wanted his son to be with him. However, the Church feared that any custody battle could become a public legal matter and involve Mary Sue Hubbard as Suzette was living with her mother. Guy soon left the Sea Org and he and Suzette worked to reestablish their lives outside of the Sea Org. Guy disabuses the notion that L. Ron and Mary Sue\u0027s children had plenty of money due to their father\u0027s wealth. Indeed, L. Ron Hubbard left very little to his children by Mary Sue. Guy reveals the exact amount. Guy talks about his going to work for the Scientologist-owned Dohring Company as his first job after he left the Sea Org.",
      "release": "2020-03-01T01:49:48Z",
      "duration": "01:02:53",
      "explicit": false,
      "appleId": 1000467095243,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/guy-white-part-2/id864571814?i=1000467095243"
      }
    },
    {
      "id": "11de349c-1722-4836-b278-db0d2fc06c7e",
      "title": "Scientology Founder\u0027s son-in-law ~~ Guy White\u0027s first podcast. He fled after 20 years IN",
      "description": "Guy White was a Scientology executive who married Suzette Hubbard, the daughter of L. Ron and Mary Sue Hubbard. In this podcast, Guy discusses how he met and married Suzette. Marriage in Scientology\u0027s Sea Org, and his close relationship to Mary Sue Hubbard. No Honeymoon in Sea Org they married at the Courthouse and the next hour were back in the job ! Guy White drew the wrath of Miscavige for reasons unknown and his wife Suzette was made Miscavige\u0027s laundress to wash his underwear and smelly socks.",
      "release": "2020-03-01T01:19:39Z",
      "duration": "00:54:00",
      "explicit": false,
      "appleId": 1000467095244,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/scientology-founders-son-in-law-guy-whites-first-podcast/id864571814?i=1000467095244"
      }
    },
    {
      "id": "d693a9b3-1f51-46cd-b66c-ba523c1e62b2",
      "title": "Scientology 2019 -- Year in Review by Mike Rinder and Jeffrey Augustine \u002B Predictions for 2020",
      "description": "Mike Rinder and Jeffrey Augustine discuss the Church of Scientology in 2019. Topics discussed:\n \n 1. The powerful and effective work of attorney Graham Berry in exposing and getting justice for the elderly victims of Scientology credit card and bank loan frauds. Graham stood out as a true hero in 2019.\n \n 2. Rizza Islam et. al. to stand trial in 2020 for ripping off $3.8 million in a Medicare fraud based on running high school students through the Scientology-Narconon Purification Rundown. Jeffrey comments on his observations of the preliminary criminal trial at which the Islam family defendants used a bizarre sovereign citizen argument.\n \n 3. Mike Rinder explains why he sees an inevitable divorce between the Nation of Islam and the Church of Scientology occurring very soon. Alfreddie Johnson, Tony Muhammad, and Louis Farrakhan are discussed.\n \n 4. Mike and Jeff discuss Scientologists and crime: The Spina Brothers $80 million Medicare fraud for which the brothers will be sentenced in February 2020; the $1.8 billion Ponzi scheme known as GPB Capital Holdings that is owned and operated by Scientologist David Gentile.\n \n 5. Jeffrey asks why the Church of Scientology is defending alleged serial rapist Danny Masterson even as Sea Org member Taryn Teutsch cynically used the #MeToo movement and the rape survivors in Denim Day in an attempt to get her father Mike Rinder fired from Scientology and the Aftermath. 6. Jeffrey mentions that Curacao, the homeport of the Freewinds, is an island engaged in sex trafficking of women from Venezuela and other countries. Curacao is home to the largest open air brothel in the world, the notorious Campo Alegre. Scientology has never once protested sex trafficking or the other human rights abuses on Curacao despite the Church\u0027s claimed commitment the UN Human Rights charter. See Jeffrey\u0027s story on this at his blog: https://scientologymoneyproject.com/2...\n  \n 7. Mike offers an update on Scientology and the Aftermath. 8. Mike makes a prediction about what the Church of Scientology faces in 2020.",
      "release": "2020-01-04T04:33:20Z",
      "duration": "01:00:07",
      "explicit": false,
      "appleId": 1000461536179,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/scientology-2019-year-in-review-by-mike-rinder-and/id864571814?i=1000461536179"
      }
    },
    {
      "id": "dec17018-142a-4e3d-b85c-c3d833f516e9",
      "title": "Scientology 3rd Gen Nathan Rich Tells His Horror Story of Surviving Scientology",
      "description": "Nathan Rich was born into Scientology. He endured hell as a teenager at Scientology\u0027s infamous Mace-Kingsley Ranch. Operated by the abusive Wally Hanks, a man whom Scientology protected after he admitted to sexually molesting two teenage girls.\n Nathan\u0027s life spiraled out of control and soon he was living on the streets as a drug addict. Nathan tells a riveting tale of how he survived seven years of homelessness and self-medicating with street drugs and turned his life around. Nathan\u0027s new book Scythe Tleppo is now available on Amazon.",
      "release": "2018-09-28T21:54:52Z",
      "duration": "01:29:11",
      "explicit": false,
      "appleId": 1000420676297,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/scientology-3rd-gen-nathan-rich-tells-his-horror-story/id864571814?i=1000420676297"
      }
    },
    {
      "id": "07b50ea5-2ce6-49e9-bb6b-a0c5a5bac245",
      "title": "Former Scientology Colombian and Los Angeles Org Staff Member Adrian Vanegas",
      "description": "Adrian Vanegas was 17 years old and had just graduated high school in his hometown of Bogota. He had been attracted to Scientology by its study technology. He quickly signed a 2.5 year staff contract and was appointed as the Director of Communications for the Bogota Org. Located in a private home in an upscale neighborhood, it would be twenty-five years before David Miscavige would pull a rope to open the big new 8-story Scientology Org in downtown Bogota. Adrian recounts many interesting stories of his time on staff in Colombia and gives us a look into Scientology in Latin America. Adrian left Scientology in 2005 and did a slow fade out from the organization.",
      "release": "2018-08-20T04:08:49Z",
      "duration": "01:22:00",
      "explicit": false,
      "appleId": 1000418149220,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/former-scientology-colombian-and-los-angeles-org/id864571814?i=1000418149220"
      }
    },
    {
      "id": "0c181075-3330-4f26-a6b4-6d84d8f58a20",
      "title": "Scientology Meddling into Shastina Sandman\u0027s US Congressional Campaign",
      "description": "Shastina Sandman is running in the GOP primary to nominate the Republican candidate for Congress in the 48th District of California. As part of her platform, Shastina opposes the widespread psychiatric drugging of children. Upon learning of her position on psychiatric medications, Scientology sent in an operative from its notorious front group Citizens Commission on Human Rights (CCHR). The CCHR agent met Shastina at a political meeting and gave her a CCHR package of materials.\n \n The agent never told CCHR was a part of the Church of Scientology. Rather, the CCHR agent played upon Shastina\u0027s opposition to drugging children and got her to support CCHR on her podcast. In the podcast, Shastina and Jeffrey also discuss Scientologist Joy Villa and her foray into politics. Of note is Joy Villa\u0027s insistence that she is a Christian and a Scientologist when, in fact, Scientology does not allow its members to engage in other practices and considers all other religions to be implants.\n \n Article on Shastina on the Scientology Money Project: https://scientologymoneyproject.com/2018/04/14/scientology-meddling-into-shastina-sandmans-us-congressional-campaign/",
      "release": "2018-04-14T22:29:21Z",
      "duration": "01:04:36",
      "explicit": false,
      "appleId": 1000408902613,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/scientology-meddling-into-shastina-sandmans-us-congressional/id864571814?i=1000408902613"
      }
    },
    {
      "id": "55238140-33ed-4fc2-940e-c354e61f29e9",
      "title": "The Wasel-Augustine Scientology Refund-Repayment Fraud Survey",
      "description": "On this podcast Dr. Jeff Wasel and Jeffrey Augustine discuss the Scientology Refund-Repayment Fraud Survey. To view and/or complete the survey please go here: Wasel-Augustine Scientology Refund-Repayment Fraud Survey\n \n The Wasel-Augustine Scientology Refunds-Repayment Survey represents the first ever formal attempt to quantify a specific institutional behavior of Scientology. In this instance, the legitimacy of Scientology’s claims of having a transparent refund/repayments policy, as well as the human cost of Scientology’s problematic financial behavior in this regard.\n The survey will extrapolate data from a variety of key indicators, such as the amount a member has/had on account, their time in Scientology, their level of success in attempting to obtain a refund or repayment from Scientology, as well as if they experienced undue levels of aggressive “regging”. It also asks if they were coerced into exceeding their credit limit or pressured into opening new accounts to fund Scientology services, and lastly, the extent of any negative lifestyle outcomes that may have arisen from their financial relationship with Scientology.",
      "release": "2018-04-14T05:07:09Z",
      "duration": "00:23:06",
      "explicit": false,
      "appleId": 1000408871789,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/the-wasel-augustine-scientology-refund-repayment/id864571814?i=1000408871789"
      }
    },
    {
      "id": "0ae726fe-b60f-4d48-861e-5a54e7189e9d",
      "title": "Mike Rinder, Church of Scientology\u0027s Former Spokesman On Fair Game \u0026 Season 3 of Aftermath",
      "description": "Mike talks about Scientology and the Aftermath‘s upcoming third season, which appears to be the reason for a new wave of Fair Game harassment from Scientology’s hired goons. Leah has observed Private investigators stalking her and following her. — At the same time that the church is trying to project a very different image with its new television network.  Mike describes how David Miscavige orders his Office of Special Affairs minions to do something about Leah’s show, and how this results in actions that are irrational and actually harm Scientology by exposing its sleazy Fair Game tactics, Rinder also recounts the series of events that led him to escape from the Church of Scientology in 2007. “This leads to Mike describing the internal justice system of Scientology and why the church covers up sexual molestation and the other crimes and misdeeds committed by Scientologists.",
      "release": "2018-04-05T00:14:51Z",
      "duration": "01:01:40.0890000",
      "explicit": false,
      "spotifyId": "7jYvi9jqeS1fQcoPqOFjQm",
      "appleId": 1000408188478,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jYvi9jqeS1fQcoPqOFjQm",
        "apple": "https://podcasts.apple.com/podcast/mike-rinder-church-of-scientologys-former-spokesman/id864571814?i=1000408188478"
      }
    },
    {
      "id": "c1bdefe8-7efb-46f1-8fb2-9a3dc238ef05",
      "title": "Leah Remini on Scientology and the Aftermath, Fair Game, and the Aftermath Foundation",
      "description": "Leah Remini discusses her A\u0026E show Scientology and the Aftermath, Scientology\u0027s Fair Game, the Aftermath Foundation, and other topics.",
      "release": "2018-04-05T00:03:46Z",
      "duration": "00:53:15.0900000",
      "explicit": false,
      "spotifyId": "7iLYca7Y1h0Bi6Kdm806Wp",
      "appleId": 1000408188480,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7iLYca7Y1h0Bi6Kdm806Wp",
        "apple": "https://podcasts.apple.com/podcast/leah-remini-on-scientology-and-the-aftermath-fair/id864571814?i=1000408188480"
      }
    },
    {
      "id": "8c72a037-ff5f-4650-bc4e-b49d59e20f0c",
      "title": "Katrina Reyes\u0027 Horror Story Part 3: Escape from the Church of Scientology",
      "description": "Katrina Reyes was eleven years old and living in poverty in Siberia, Russia when her mother joined the Church of Scientology. The Cult quickly exploited the mother and daughter and recruited them into it\u0027s notorious Sea Org. Katrina and her mother were shipped to Clearwater, Florida. Scientology used Katrina as child labor and she received no formal education. In Part 3 we hear how Katrina escaped from Scientology and started her new life.",
      "release": "2018-04-04T23:42:55Z",
      "duration": "00:49:30.0710000",
      "explicit": false,
      "spotifyId": "7FMbrhys0N6MCfUxkf1VQU",
      "appleId": 1000408188477,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7FMbrhys0N6MCfUxkf1VQU",
        "apple": "https://podcasts.apple.com/podcast/katrina-reyes-horror-story-part-3-escape-from-the/id864571814?i=1000408188477"
      }
    },
    {
      "id": "94007ce6-7a80-4763-9d88-c4a9eb58126a",
      "title": "Keeping Up with Ron Miscavige (Father of Scientology Leader David Miscavige)",
      "description": "Ron Miscavige is a dynamo of energy and a busy man. A New York Times bestselling author for his book \u0022Ruthless: Scientology, My Son David Miscavige, and Me\u0022 Ron has just re-released his 1974 album he did with Polydor Records. Called \u0022Timeless\u0022 the album shows the range of Ron\u0027s talent on the trumpet. Ron talks about St. Hill in the early 1970\u0027s, Herbie Parkhouse, and reminisces about his session work and live performances with Chick Corea and Isaac Hayes.",
      "release": "2018-04-04T23:31:38Z",
      "duration": "00:47:15.0700000",
      "explicit": false,
      "spotifyId": "0fqupl7SKpblFzzoncXDiL",
      "appleId": 1000408188481,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0fqupl7SKpblFzzoncXDiL",
        "apple": "https://podcasts.apple.com/podcast/keeping-up-with-ron-miscavige-father-of/id864571814?i=1000408188481"
      }
    },
    {
      "id": "c3591ecf-bd74-464f-b4a9-6ab7ccc02921",
      "title": "Church of Scientology - Katrina Reyes\u0027 Horror Story: Forced Into the Sea Org at Age 11 -- Part 2",
      "description": "Katerina was eleven years old and living in poverty in Siberia, Russia when her mother joined the Church of Scientology. The Cult quickly exploited the mother and daughter and recruited them into it\u0027s notorious Sea Org. Katrina and her mother were shipped to Clearwater, Florida. Scientology used Katrina as child labor and she received no formal education.",
      "release": "2018-04-04T23:09:41Z",
      "duration": "00:58:41.6470000",
      "explicit": false,
      "spotifyId": "6BKirAgYG7STpPxJYttvft",
      "appleId": 1000408188479,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6BKirAgYG7STpPxJYttvft",
        "apple": "https://podcasts.apple.com/podcast/church-of-scientology-katrina-reyes-horror-story/id864571814?i=1000408188479"
      }
    },
    {
      "id": "6f84565b-6828-4e91-bb59-defbf1ea375a",
      "title": "Conversation with GOP Political Consultant Robbie Olson on Joy Villa \u0026 Scientology",
      "description": "GOP Political Consultant Robbie Olson and Jeffrey Augustine discuss Joy Villa\u0027s exploratory run for the US Congress. Robbie describes the way in which Joy represented herself as a Christian and how the Church of Scientology meddled in things.",
      "release": "2018-04-04T22:25:28Z",
      "duration": "00:51:53.9010000",
      "explicit": false,
      "spotifyId": "6w9lOhwdFuMPmsrzmfyUoH",
      "appleId": 1000408185253,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6w9lOhwdFuMPmsrzmfyUoH",
        "apple": "https://podcasts.apple.com/podcast/conversation-with-gop-political-consultant-robbie/id864571814?i=1000408185253"
      }
    },
    {
      "id": "32f93b63-fdf3-4bda-9dc5-8b8b60130d98",
      "title": "Church of Scientology - Katrina Reyes\u0027 Horror Story: Forced Into the Sea Org at Age 11 -- Part 1",
      "description": "Katrina was eleven years old and living in poverty in Siberia, Russia when her mother joined the Church of Scientology. The Cult quickly exploited the mother and daughter and recruited them into it\u0027s notorious Sea Org. Katrina and her mother were shipped to Clearwater, Florida. Scientology used Katrina as child labor and she received no formal education.",
      "release": "2018-04-04T22:03:54Z",
      "duration": "00:57:00.0830000",
      "explicit": false,
      "spotifyId": "7uoDKkmRgTAwfpw0Kr9seh",
      "appleId": 1000408185252,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7uoDKkmRgTAwfpw0Kr9seh",
        "apple": "https://podcasts.apple.com/podcast/church-of-scientology-katrina-reyes-horror-story/id864571814?i=1000408185252"
      }
    },
    {
      "id": "2faeb298-0b2f-471d-9cf7-fae573c4c574",
      "title": "Scientology Sea Org Member Valeska Paris Reveals Sexual Abuse Covered Up by Church",
      "description": "Valeska Paris \u0022joined\u0022 the Cadet Org of Scientology at six years of age. Her younger sister and brother were also dumped at the Cadet Org when their father joined Scientology\u0027s Sea Org. The Cadet Org was at Stonesland, a hellish old building in England where the children of Sea Org were warehoused. Malnourished in filthy conditions, the children had to steal food, had no toilet paper or soap, and lived in abject poverty. This deprivation was created purposely by the wealthy Church of Scientology and its leader L. Ron Hubbard who at T-Bone steak on his private ship while children starved, had no medical or dental care, and wore rags. Valeska survived starvation, sexual molestation, and mental and physical cruelty inside of Scientology. She left the Sea Org, left Scientology, and is now a wife and a mother of beautiful children. Valeska\u0027s courage and perseverance are an inspiration and show the strength and resilience of the human spirit.",
      "release": "2018-04-04T02:30:44Z",
      "duration": "00:52:39.5370000",
      "explicit": false,
      "spotifyId": "67MoI7USHzF5CHS1l9G01d",
      "appleId": 1000408136517,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/67MoI7USHzF5CHS1l9G01d",
        "apple": "https://podcasts.apple.com/podcast/scientology-sea-org-member-valeska-paris-reveals-sexual/id864571814?i=1000408136517"
      }
    },
    {
      "id": "38cd3f41-72a7-4ba7-bfd2-c6dd67e581c2",
      "title": "Valeska Paris: Scientology Freewinds Ship ~~ Prisoner for 12 Years",
      "description": "Valeska Paris joined the Scientology Cadet Org at six years of age. She then joined the Sea Org when she was 14 years old. As a teenager she was sent to Scientology\u0027s ship the Freewinds. In this gripping podcast Valeska discusses the surprise raid on the Freewinds by the French police in 1999 when it was anchored at St. Barts. Valeska then describes the suicide of her stepfather Scientologist Albert Jaquier; the suicide of a member of a Sea Org member on the Freewinds; and the punishments she suffered on the ship. Valeska talks about her relationship to Shelly Miscavige who has not been seen in public for over a decade. Other people discussed include Mike Napier, the Captain of the Freewinds, Guillaume Leserve, Heber Jentzsch, and Tom Cruise and his $400,000 birthday party on the Freewinds. Albert Jacquier kept a diary as he was dying. After his death his wife, Valeska\u0027s mother, published it online. \u0022The Diary of a Dying Scientologist\u0022 is posted here: http://www.xenu.net/archive/photoalbum/jaquier.html  ",
      "release": "2018-04-04T01:47:49Z",
      "duration": "01:02:34.1890000",
      "explicit": false,
      "spotifyId": "1SxfGTYo8UhFucu350Ij3O",
      "appleId": 1000408136518,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1SxfGTYo8UhFucu350Ij3O",
        "apple": "https://podcasts.apple.com/podcast/valeska-paris-scientology-freewinds-ship-prisoner-for/id864571814?i=1000408136518"
      }
    },
    {
      "id": "fade1839-ec71-4224-9b3f-4513752e80ad",
      "title": "Surviving Scientology Episode 52 with Karen Schless Pressley",
      "description": "Karen Schless Pressley is the former Commanding Officer of the Scientology Celebrity Centre. In this interview she discusses how she and her then husband -- the composers Peter Schless -- became Scientologists and later joined the Sea Org. Karen fascinatingly discusses the lure of Scientology for celebrities in terms of co-dependency. In my view, this is a remarkably insightful description. Karen\u0027s new book \u0022Escaping Scientology: An Insider\u0027s True Story: My Journey With the Cult of Celebrity Spirituality, Greed and Power \u0022 is available on Amazon:  https://www.amazon.com/Escaping-Scien...",
      "release": "2017-09-22T23:26:29Z",
      "duration": "01:00:07.7460000",
      "explicit": false,
      "spotifyId": "5sH8FiYnhZYyurcUqP3pzY",
      "appleId": 1000392612685,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5sH8FiYnhZYyurcUqP3pzY",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-52-with-karen-schless/id864571814?i=1000392612685"
      }
    },
    {
      "id": "d9dbec38-8578-4051-a3c2-cf81586b5daf",
      "title": "Surviving Scientology Episode 51 with Janis Grady",
      "description": "Janis Grady was born into the Church of Scientology. She joined the Sea Org at age 11 and was one of the first four original messengers in L. Ron Hubbard\u0027s Commodore\u0027s Messenger\u0027s Organization (CMO). Janis\u0027 mother was Yvonne Gillham Jentzsch who founded the Scientology Celebrity Centre.",
      "release": "2017-08-11T23:20:54Z",
      "duration": "00:51:28.0920000",
      "explicit": false,
      "spotifyId": "6Bzdn2PTc6RyCLacgr7c8s",
      "appleId": 1000390950800,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Bzdn2PTc6RyCLacgr7c8s",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-51-with-janis-grady/id864571814?i=1000390950800"
      }
    },
    {
      "id": "d333f2a1-e794-4f54-b105-eb4b41512f6a",
      "title": "Surviving Scientology Episode 50 with Janis Grady",
      "description": "Janis Grady was born into the Church of Scientology. She joined the Sea Org at age 11 and was one of the first four original messengers in L. Ron Hubbard\u0027s Commodore\u0027s Messenger\u0027s Organization (CMO). Janis\u0027 mother was Yvonne Gillham Jentzsch who founded the Scientology Celebrity Centre. Janis\u0027 book is available in print or on Kindle at: https://www.amazon.com/Commodores-Mes...",
      "release": "2017-08-11T23:10:27Z",
      "duration": "00:43:59.3870000",
      "explicit": false,
      "spotifyId": "159i63rSL4WIaTzF3X98GF",
      "appleId": 1000390950802,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/159i63rSL4WIaTzF3X98GF",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-50-with-janis-grady/id864571814?i=1000390950802"
      }
    },
    {
      "id": "c80183d0-cfd5-469f-8ca7-0e48e4510ff4",
      "title": "Surviving Scientology Episode 49 with Janis Grady",
      "description": "Janis Grady was born into the Church of Scientology. She joined the Sea Org at age 11 and was one of the first four original messengers in L. Ron Hubbard\u0027s Commodore\u0027s Messenger\u0027s Organization (CMO). Janis\u0027 mother was Yvonne Gillham Jentzsch who founded the Scientology Celebrity Centre. Janis\u0027 book is available in print or on Kindle at: https://www.amazon.com/Commodores-Mes...",
      "release": "2017-08-11T22:54:12Z",
      "duration": "00:53:27.2370000",
      "explicit": false,
      "spotifyId": "5KVR73litLiHUwUFpDGiTy",
      "appleId": 1000390950801,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KVR73litLiHUwUFpDGiTy",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-49-with-janis-grady/id864571814?i=1000390950801"
      }
    },
    {
      "id": "52a0d5f3-8a1f-4ea5-9859-86f45d7d8f61",
      "title": "Surviving Scientology Episode 48 with Jon Atack",
      "description": "Jon Atack \u0026 Jeffrey Augustine Discuss L. Ron Hubbard Jr., Captain Bill, and Scientology. L. Ron Hubbard Jr., or \u0022Nibs\u0022 as he was called, was the #2 figure in Scientology from 1952-1959. Among his other duties, Nibs served as an Enforcer for his father. Nibs left the Church. He later spoke out against his father and even sued to gain control of his father\u0027s estate. Nibs famously granted Penthouse Magazine an interview in which he said that Scientology was Black Magick spread out over time and that his father thought of himself as the Antichrist. Nibs was eventually \u0022recovered\u0022 by the Church of Scientology for an undisclosed sum of money. In exchange, Nibs recanted everything he had said about his father and thereby destroyed his own credibility forever. Jeffrey asks Jon, \u0022Is Marty Rathbun the new L. Ron Hubbard Jr.?\u0022",
      "release": "2017-08-08T15:01:43Z",
      "duration": "01:02:47.6940000",
      "explicit": false,
      "spotifyId": "5KFeRrnaWNowLqpfw1oVnR",
      "appleId": 1000390800464,
      "subjects": [
        "Scientology",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KFeRrnaWNowLqpfw1oVnR",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-48-with-jon-atack/id864571814?i=1000390800464"
      }
    },
    {
      "id": "e6a65e4c-7c4b-42cb-bd79-145a27421bf4",
      "title": "Surviving Scientology Episode 46 with John Atack",
      "description": "Jon Atack, author Let\u0027s Sell These People a Piece of Blue Sky, one of the definitive books on Scientology, discusses L. Ron Hubbard and Scientology. Jon Atack is also the author of \u0022opening minds: the secret world of manipulation, undue influence and brainwashing.\u0022",
      "release": "2017-07-03T04:11:52Z",
      "duration": "01:13:02.0940000",
      "explicit": false,
      "spotifyId": "5bHMtsYVDiNfi9YXJEzGx6",
      "appleId": 1000389462345,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5bHMtsYVDiNfi9YXJEzGx6",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-46-with-john-atack/id864571814?i=1000389462345"
      }
    },
    {
      "id": "59c01210-46be-4183-8978-92214835456e",
      "title": "Surviving Scientology Episode 45 with Brandon Reisdorf",
      "description": "Brandon Reisdorf, a third generation, Scientologist talks about his experiences growing up in a Scientology family and his time on Staff at the San Diego Org. He also discusses the Church\u0027s ludicrous claims about the wild success Scientology Media Productions will achieve by bringing millions of people into Scientology. The interview ends with a great description of what Brandon can now do in life now that he is free of the 24/7/365 slavery of Scientology.",
      "release": "2017-07-03T04:08:02Z",
      "duration": "01:12:48.0920000",
      "explicit": false,
      "spotifyId": "3jndqpEmeH97TyS6Or0BKB",
      "appleId": 1000389462344,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3jndqpEmeH97TyS6Or0BKB",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-45-with-brandon-reisdorf/id864571814?i=1000389462344"
      }
    },
    {
      "id": "c5178f88-0946-4337-9316-5eebe80ffad3",
      "title": "Surviving Scientology Episode 44 with Steven Hassan",
      "description": "Author Steven Hassan and Jeffrey Augustine discuss the Church of Scientology and leaving Scientology. Steven Hassan\u0027s website: https://freedomofmind.com/",
      "release": "2017-07-03T04:04:19Z",
      "duration": "00:58:08.0790000",
      "explicit": false,
      "spotifyId": "21dTaLRgo8U6rsyFD823CO",
      "appleId": 1000389462342,
      "subjects": [
        "Scientology",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21dTaLRgo8U6rsyFD823CO",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-44-with-steven-hassan/id864571814?i=1000389462342"
      }
    },
    {
      "id": "14eb6bdf-a12f-4195-ade8-f83817f563f6",
      "title": "Surviving Scientology Episode 43 with Ron Miscavige Sr.",
      "description": "Ron Miscavige Sr. discusses parts of his 26 years spent as a Sea Org member at Scientology\u0027s Gold Base in Riverside County, California.",
      "release": "2017-02-09T20:15:50Z",
      "duration": "00:57:08.1020000",
      "explicit": false,
      "spotifyId": "3RgD9CSJxrMvFLkZ3ZqoKE",
      "appleId": 1000381027795,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3RgD9CSJxrMvFLkZ3ZqoKE",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-43-with-ron-miscavige-sr/id864571814?i=1000381027795"
      }
    },
    {
      "id": "1307dcea-b8c7-49ce-80d8-bd39e5862e53",
      "title": "Surviving Scientology Episode 42 with Ron Miscavige Sr.",
      "description": "Ron Miscavige, father of Scientology leader David Miscavige, discusses his New York Times #1 bestselling book Ruthless, his escape from Scientology, Disconnection, and Fair Game. Be sure to watch Ron Miscavige\u0027s appearance on the A\u0026E show \u0022Leah Remini: Scientology and the Aftermath.\u0022 Episode 4, \u0022A Leader Emerges.\u0022",
      "release": "2016-12-22T02:21:48Z",
      "duration": "00:50:22.7600000",
      "explicit": false,
      "spotifyId": "3X1kqKL2VRZV1XHyoJBgoG",
      "appleId": 1000379296300,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3X1kqKL2VRZV1XHyoJBgoG",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-42-with-ron-miscavige-sr/id864571814?i=1000379296300"
      }
    },
    {
      "id": "0918a847-0804-4511-8be3-df32baf75570",
      "title": "Surviving Scientology Episode 41 with Dan Koon",
      "description": "Dan Koon ghost wrote Ron Miscavige Sr.\u0027s book Ruthless. In this interview Dan discusses the writing and vetting process of the book and addresses criticisms. Dan also shares highlights of his 27 years in the Sea Org.",
      "release": "2016-09-13T19:18:03Z",
      "duration": "00:48:04.9380000",
      "explicit": false,
      "spotifyId": "6PrglCDG3h0AgZeZ47ZyAc",
      "appleId": 1000375286798,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6PrglCDG3h0AgZeZ47ZyAc",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-41-with-dan-koon/id864571814?i=1000375286798"
      }
    },
    {
      "id": "666f980b-cbf6-445e-be77-2b57c7511931",
      "title": "Surviving Scientology Episode 40 with Dan Koon",
      "description": "Former Sea Org member Dan Koon worked in the compilations unit of Scientology (RTRC) where Hubbard\u0027s writings were turned into official Scientology books, lectures, and publications. Many of these products were sold to Scientologists and the public and thus represented a significant income stream for the Church. Accordingly, David Miscavige micromanaged compilations and Dan worked closely with Miscavige. After leaving the Sea Org, Dan Koon later helped Ron Miscavige Sr. to write his New York Times bestselling book -- Ruthless: Scientology, My Son David Miscavige, and Me.",
      "release": "2016-09-04T01:28:43Z",
      "duration": "00:54:00.7520000",
      "explicit": false,
      "spotifyId": "2gfD73KsWd4T9AF7lrklui",
      "appleId": 1000374894290,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2gfD73KsWd4T9AF7lrklui",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-40-with-dan-koon/id864571814?i=1000374894290"
      }
    },
    {
      "id": "66c9ad00-9163-4e3c-ad38-95535e718939",
      "title": "Surviving Scientology Episode 39 with Mark Fisher",
      "description": "In this podcast Mark Fisher -- David Miscavige\u0027s former assistant for many years at the Corporate Liaison Office and later RTC -- discusses how L. Ron Hubbard never appointed David Miscavige as his Successor. Instead, Author Services Inc. was the privately-owned for-profit company David Miscavige used to stage a palace coup to take over RTC after the death of L. Ron Hubbard.",
      "release": "2016-07-06T17:59:41Z",
      "duration": "01:07:20.0730000",
      "explicit": false,
      "spotifyId": "4HC7v42czefmaOLMktNAEd",
      "appleId": 1000372027884,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4HC7v42czefmaOLMktNAEd",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-39-with-mark-fisher/id864571814?i=1000372027884"
      }
    },
    {
      "id": "9a76de78-b9a3-4521-9496-b9b6e681545e",
      "title": "Surviving Scientology Episode 38 with Mike Rinder",
      "description": "Mike Rinder voices new anecdotes and looks ahead to 2016.It was interesting to digest the concept in law of \u0022Libel proof.\u0022 Their reputation is so bad, that they can\u0027t be libelled.It would be like ISIS complaining that we were disparaging them.Mike Rinder rarely talks about the assault and battery. In this video he shares with us body assault while on the phone with Tom Tobin and Joe Childs of the Tampa bay Times.",
      "release": "2016-01-05T19:09:22Z",
      "duration": "01:03:34.1140000",
      "explicit": false,
      "spotifyId": "5TRw2YCovgAmQrffIPuxrM",
      "appleId": 1000360135598,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TRw2YCovgAmQrffIPuxrM",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-38-with-mike-rinder/id864571814?i=1000360135598"
      }
    },
    {
      "id": "07965e8f-f43e-453d-a33f-3c99adc962e0",
      "title": "BBC Radio interviews Karen de la Carriere",
      "description": "Church of Scientology Public Relations lies again.Lies to the BBC that Hubbard never implemented punishments that were \u0022too Gruesome\u0022HCO Policy Letter of 5 January 1968, “Overfilled In-Basket, Bad News.” Hubbard said “MAKE THE PENALTIES FOR NON COMPLIANCE AND FALSE REPORTS TOO GRUESOME TO BE FACED AND ENFORCE THEM.”In the same issue, Hubbard also said, “It takes far more ethics and far steeper, enforced penalties to make an organization work than Scientologists have been using.”Please listen to the last few minutes as the Church spouts their lies about un-precedented expansion ! Laughter !",
      "release": "2015-12-08T17:53:26Z",
      "duration": "00:21:11.4330000",
      "explicit": false,
      "spotifyId": "5R19qdXGJ8mJjxPrihaiP7",
      "appleId": 1000358597671,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5R19qdXGJ8mJjxPrihaiP7",
        "apple": "https://podcasts.apple.com/podcast/bbc-radio-interviews-karen-de-la-carriere/id864571814?i=1000358597671"
      }
    },
    {
      "id": "f143d639-7edf-47e2-b54e-01a135db7738",
      "title": "Surviving Scientology Episode 37 with Jesse Prince",
      "description": "L Ron Hubbard never involved David Miscavige in anything technical or to do with counselling, Jesse discusses, yet Miscavige would up supervising \u0022Tech delivery\u0022 to Lisa who then died in Church Custody, Jesse tells of how Scientology killed her in 17 days whereas not even Aids and Cancer patients don\u0027t die in 17 days.Jesse\u0027s purpose for speaking out for the last 15 years is to prevent another Lisa Mcpherson gruesome death.Tony Ortega, world class journalist tells the story in daily segments.",
      "release": "2015-12-07T18:23:15Z",
      "duration": "00:53:51.1390000",
      "explicit": false,
      "spotifyId": "78lK8x9g3sZmnlRhZRpbmP",
      "appleId": 1000358537416,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/78lK8x9g3sZmnlRhZRpbmP",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-37-with-jesse-prince/id864571814?i=1000358537416"
      }
    },
    {
      "id": "7f8c096c-c730-425a-af9b-b6259028378b",
      "title": "Surviving Scientology Episode 36 with Bill Franks",
      "description": "Bill Franks shares a remarkable incident when L Ron Hubbard tells David Mayo and himself that people depart Scientology Inc because of upsets *NOT* because of transgressions or harmful acts \u0022overts\u0022 which is absolutely backbone theory of all of Scientology.There are more stories, more important history.",
      "release": "2015-11-07T22:43:21Z",
      "duration": "01:15:20.6210000",
      "explicit": false,
      "spotifyId": "5wjsY4jWuyxAUrjAAmR5QP",
      "appleId": 1000356659533,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wjsY4jWuyxAUrjAAmR5QP",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-36-with-bill-franks/id864571814?i=1000356659533"
      }
    },
    {
      "id": "e2c07327-a3e1-4b85-a46c-6da629ed493d",
      "title": "Surviving Scientology Episode 34 with Bill Franks",
      "description": "Church of Scientology former Executive Director International Bill Franks discusses L. Ron Hubbard, David Miscavige.This is a knock out video with a lot of data never previously released.",
      "release": "2015-09-24T20:26:54Z",
      "duration": "00:49:06.8750000",
      "explicit": false,
      "spotifyId": "6lO6CbOaGUyV7KxdlulE5P",
      "appleId": 1000353166789,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6lO6CbOaGUyV7KxdlulE5P",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-34-with-bill-franks/id864571814?i=1000353166789"
      }
    },
    {
      "id": "9b94877a-1f4a-4028-bfb3-32295b87fef4",
      "title": "Surviving Scientology Episode 33 with Jesse Prince",
      "description": "Jesse Prince was in the Church of Scientology from 1976 to 1992. After extensive training at Scientology’s “Flag” spiritual headquarters in Cleawater, Florida, Jesse became a “Class IX” auditor. Jesse was then ordered by L. Ron Hubbard to report to Scientology’s secretive international management headquarters near Hemet, California, Gold Base, to serve as the Cramming Officer in the Inspector General network In this capacity Jesse became auditor to the man who would take over for Hubbard, David Miscavige.",
      "release": "2015-08-03T04:03:32Z",
      "duration": "00:56:18.0520000",
      "explicit": false,
      "spotifyId": "1YQUbJV4RFT8rZ5rlG9nd6",
      "appleId": 1000348646708,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YQUbJV4RFT8rZ5rlG9nd6",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-33-with-jesse-prince/id864571814?i=1000348646708"
      }
    },
    {
      "id": "20ecf070-9d39-4ca1-bfa9-5ed583e8a799",
      "title": "Surviving Scientology Episode 30 with Jefferson Hawkins",
      "description": "Scientology Inc believes they are masters of \u0022Ethics\u0022 and that they are highly moral.Former Church of Scientology Int\u0027l executive Jefferson Hawkins discusses Scientology Ethics and his new book: Closing Minds: How Scientology\u0027s \u0022Ethics Technology\u0022 is Used to Control Their Members.",
      "release": "2015-06-26T23:00:27Z",
      "duration": "00:48:49.0590000",
      "explicit": false,
      "spotifyId": "2NELwic62EHsGFMUhcIFyq",
      "appleId": 1000345785741,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NELwic62EHsGFMUhcIFyq",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-30-with-jefferson-hawkins/id864571814?i=1000345785741"
      }
    },
    {
      "id": "790c8c9b-7c9f-47cc-a13a-f942b5f07343",
      "title": "Surviving Scientology Episode 29 with Marc Headley",
      "description": "Marc Headley discusses Scientology, the internet, and technology with your host Jeffrey Augustine. Marc Headley is the author of Blown For Good: Behind the Iron Curtain of Scientology.",
      "release": "2015-04-21T16:20:39Z",
      "duration": "01:14:42.0910000",
      "explicit": false,
      "spotifyId": "3hV0j4iNKJ5w8rdAIVrFAe",
      "appleId": 1000340459654,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hV0j4iNKJ5w8rdAIVrFAe",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-29-with-marc-headley/id864571814?i=1000340459654"
      }
    },
    {
      "id": "9c58d318-1fbe-4a46-83fb-14e4c5e5064d",
      "title": "Surviving Scientology Episode 28 with Mareka Brousseau",
      "description": "Third-generation Scientologist Mareka Brousseau discusses how she learned of her grandmother\u0027s suicide years after the event.",
      "release": "2015-03-19T00:16:46Z",
      "duration": "01:04:27.9250000",
      "explicit": false,
      "spotifyId": "2vGeRDyntd1TGI1giBR3WA",
      "appleId": 1000337940518,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2vGeRDyntd1TGI1giBR3WA",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-28-with-mareka-brousseau/id864571814?i=1000337940518"
      }
    },
    {
      "id": "8967e478-6cc5-4b53-a805-f318c60105e7",
      "title": "Surviving Scientology Episode 27 with Mike Rinder",
      "description": "Mike Rinder looks back on the Church of Scientology in 2014 and looks ahead to 2015. Topics includes the Church\u0027s serious legal problems in France and with Narconon. For example using Super Bowl for a PR image but in Reality, using freebies on Craig\u0027s list for solicitation into the Cult.In this interview, Jeffrey Augustine mentions that Narconon brings in about $100,0000,000 per year for the Church of Scientology.",
      "release": "2015-01-06T22:22:45Z",
      "duration": "00:42:24.0660000",
      "explicit": false,
      "spotifyId": "0gsjNn4M6i4CxeS5SzQqsK",
      "appleId": 1000330104613,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0gsjNn4M6i4CxeS5SzQqsK",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-27-with-mike-rinder/id864571814?i=1000330104613"
      }
    },
    {
      "id": "484fa795-601e-4a81-bb15-97742b086e2d",
      "title": "Surviving Scientology Episode 26 with Marc Headley",
      "description": "Former Sea Org member Marc Headley describes how he and a Danish film crew were ambushed at Int Base by Scientologists. This story was picked up by the International Business Times after Marc filmed the event with his phone and Tony Ortega published the account of the ambush. Marc Headley, author of the book Blown For Good: Behind the Iron Curtain of Scientology. Available on Amazon.",
      "release": "2014-12-15T22:17:58Z",
      "duration": "01:02:00.0470000",
      "explicit": false,
      "spotifyId": "4CEf6uA3yzkVCyAWEoVT2I",
      "appleId": 1000327500608,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4CEf6uA3yzkVCyAWEoVT2I",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-26-with-marc-headley/id864571814?i=1000327500608"
      }
    },
    {
      "id": "03cca8c6-d19b-479f-8627-06e7d9e10ffd",
      "title": "Surviving Scientology Episode 25 with Mike Rinder",
      "description": "Mike Rinder discusses current affairs, including the incident in which Marty Rathbun was accosted by senior Church of Scientology officials at LAX. Also discussed: The consolidation of LA Org, the decline of activity at Flag, and the Ideal Orgs. Taken altogether, the indicators show a Church in crisis under the management of David Miscavige.",
      "release": "2014-10-31T20:44:06Z",
      "duration": "00:46:20.0570000",
      "explicit": false,
      "spotifyId": "2x6cPU6tMNWzrQ72eGft0g",
      "appleId": 1000321482043,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2x6cPU6tMNWzrQ72eGft0g",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-25-with-mike-rinder/id864571814?i=1000321482043"
      }
    },
    {
      "id": "447396cf-45cc-49a3-9204-90379c970658",
      "title": "Surviving Scientology Episode 24 with Claire Headley",
      "description": "Escape from a Cult is never easy.In the Cult of Scientology, it has been a practice of tracking down the escapee like a hounded animal and bringing them back to the campus. This is founded on fear of what the escapee will reveal of what goes in behind the guard gates and their intense \u0022Security\u0022 .",
      "release": "2014-10-28T18:34:25Z",
      "duration": "00:34:23.9360000",
      "explicit": false,
      "spotifyId": "1AeCSRMAtecM4tuUHaxP9j",
      "appleId": 1000321112392,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1AeCSRMAtecM4tuUHaxP9j",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-24-with-claire-headley/id864571814?i=1000321112392"
      }
    },
    {
      "id": "9800adc3-8580-425e-b0d5-41109b485744",
      "title": "Karen de la Carriere on Talk Radio Europe",
      "release": "2014-10-01T20:58:59Z",
      "duration": "00:27:52.3070000",
      "explicit": false,
      "spotifyId": "3fI41EOHOTkP57cjAPwgOZ",
      "appleId": 1000319624362,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3fI41EOHOTkP57cjAPwgOZ",
        "apple": "https://podcasts.apple.com/podcast/karen-de-la-carriere-on-talk-radio-europe/id864571814?i=1000319624362"
      }
    },
    {
      "id": "b3054fe1-5a8d-4e9a-86bf-2958f4f89d4e",
      "title": "Surviving Scientology Episode 23 with Maureen Bolstad",
      "description": "Former Sea Org member Maureen Bolstad describes her experienced the Church of Scientology\u0027s controversial Purification Rundown. A Medical Doctor signs off that the person can do the Purif, but then, Sea Org members or staff supervise it. .Purification Rundown requires a person to be in a dry sauna five hours per day. A person must also take increasingly high daily doses of niacin until they reach a 5,000mg maximum. I have heard from some credible sources that there is an insistence on continuing the Purif at 5000 Niacin for some time before a person can attest they are done. This is a Miscavige Order. Often OT VIIIs who have done all the levels are re-cyled to re-do their Purifs.",
      "release": "2014-10-01T20:51:05Z",
      "duration": "00:46:04.5920000",
      "explicit": false,
      "spotifyId": "2HQQ3bjkO9nVrkRcalC807",
      "appleId": 1000319624361,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2HQQ3bjkO9nVrkRcalC807",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-23-with-maureen-bolstad/id864571814?i=1000319624361"
      }
    },
    {
      "id": "62487962-7102-4584-8baf-67f3d55aa76c",
      "title": "Surviving Scientology Episode 22 with Claire Headley",
      "description": "Claire Headley recounts events from her life as a senior Sea Org executive working in the Religious Technology Center (RTC). These events were stressful, abusive, and worsened by extreme sleep deprivation. This caused Claire to lose so much weight that she believed she had cancer. These events led Claire to secretly plan her very dramatic escape from the Sea Org. Commanded by Captain David Miscavige, RTC can be correctly described as the \u0022Internal Affairs\u0022 branch of the of the Church of Scientology. Miscavige his complete dictatorial control over the Church of Scientology through his invented office of \u0022Chairman of the Board, Religious Technology Center.\u0022",
      "release": "2014-09-15T22:49:37Z",
      "duration": "00:43:52.6210000",
      "explicit": false,
      "spotifyId": "3bBKjds5UpmPGmPjFmq6Fv",
      "appleId": 1000319036414,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3bBKjds5UpmPGmPjFmq6Fv",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-22-with-claire-headley/id864571814?i=1000319036414"
      }
    },
    {
      "id": "a62b2bf2-be62-464b-8dd2-67b60e43c9dc",
      "title": "Surviving Scientology Episode 21 with Mark Fisher",
      "description": "Public money is used for espionage and blackmail.Tax exempt money used for *Religious infilatration*Ecclesiastical !Mark Fisher was a very high-ranking Sea Org member who served as David Miscavige\u0027s personal assistant. Mark had significant insider details. When Mark left the Church in 1990 he went into business in Las Vegas with other former high-ranking Sea Org members including former CMO and even a CST Trustee. As a result, David Miscavige had the \u0022Las Vegas Group\u0022 spied on for years by Scientology PI David Lebow and later by Ferris Khan. Mark relates details in this video.Note the language of David Miscavige.",
      "release": "2014-09-10T23:12:56Z",
      "duration": "01:03:13.1640000",
      "explicit": false,
      "spotifyId": "0hPi5S6XN1sDR7h3DVTWa1",
      "appleId": 1000318778281,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hPi5S6XN1sDR7h3DVTWa1",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-21-with-mark-fisher/id864571814?i=1000318778281"
      }
    },
    {
      "id": "c7f87041-0c56-49d0-86e7-2842dc4291e5",
      "title": "Surviving Scientology Episode 20 with Mark Fisher",
      "description": "Lots of previously undisclosed stories, Tom Cruise Stories.Hierarchy insider stories and always...continuing purges.Just another coup.Just another Purge.Just another bloodbath in the mentality of power and paranoid cosmicpsycho-politics in the \u0022Church\u0022 of ScientologyGood history from Mark Fisher.",
      "release": "2014-08-31T22:42:14Z",
      "duration": "01:04:23.6160000",
      "explicit": false,
      "spotifyId": "5nzo3o5SWn5d4uCrnAGatw",
      "appleId": 1000318367414,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5nzo3o5SWn5d4uCrnAGatw",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-20-with-mark-fisher/id864571814?i=1000318367414"
      }
    },
    {
      "id": "7f9d24e2-1372-4dfb-b04b-a847e70ee342",
      "title": "Surviving Scientology Episode 19 with Mark Fisher",
      "description": "Former Sea Org member Mark Fisher served as \u0022Corporate Liason\u0022 a fictitious post or job to pretend separation of the the for-profit Author Services and the management of the Church.In Part one of this series, Mark talks about day to day operationsgiving up college for what he then thought was a \u0022noble cause\u0022Didn\u0027t we all !Mark was spied on with Private Investigators for some 25 years after he left. ..",
      "release": "2014-08-19T22:52:57Z",
      "duration": "00:55:19.1720000",
      "explicit": false,
      "spotifyId": "32yJiYJRBemvPVR75i8pDt",
      "appleId": 1000317909953,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/32yJiYJRBemvPVR75i8pDt",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-19-with-mark-fisher/id864571814?i=1000317909953"
      }
    },
    {
      "id": "d4a2f564-e5a7-4d36-9f9c-b638fd4e67af",
      "title": "Surviving Scientology Episode 18 with Mike Rinder",
      "description": "Mike Rinder discusses the Scientology PR flack Sylvia Stanard\u0027s recent speech about Scientology at the Chataqua religious conclave. Stanard lied about Xenu, Disconnection, and other matters of substance. Stanard was evasive and refused to honestly answer questions. Mike Rinder makes the point that no Church of Scientology spokesperson can tell the truth -- and Rinder knows as he was the International Spokesman for the Church of Scientology for over twenty years.Mike Rinder makes the point that all the Church of Scientology can do is to evade, duck, and deflect the hard questions and does so by focusing on its real estate portfolio as proof of its expansion. \u0022If Scientology were really that bad would we be purchasing and opening all of these new Ideal Orgs?\u0022 ",
      "release": "2014-08-11T18:50:36Z",
      "duration": "00:34:48.1250000",
      "explicit": false,
      "spotifyId": "1PhA4x5ACH4oiBFmpL0FRT",
      "appleId": 1000317549333,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1PhA4x5ACH4oiBFmpL0FRT",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-18-with-mike-rinder/id864571814?i=1000317549333"
      }
    },
    {
      "id": "c4cbe28e-e0b7-4110-8a11-6cc7ce9e2856",
      "title": "Surviving Scientology Episode 17 with Mareka Brousseau",
      "description": "Mareka Brousseau was born a third generation Scientologist. She discusses her childhood and the harsh conditions in Sea Org nurseries. Mareka signed a Sea Org contract when she was nine years old. Mareka\u0027s mother and stepfather are Haydn and Lucy James.Her husband John Brousseau did a couple of amazingly revealing interviews with Tony Ortega.http://blogs.villagevoice.com/runninscared/2012/07/scientology_john_brousseau_mareka_james.php",
      "release": "2014-08-05T18:27:38Z",
      "duration": "01:12:00.0790000",
      "explicit": false,
      "spotifyId": "02algdXr3q0cnfnSTrGFOC",
      "appleId": 1000317288570,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/02algdXr3q0cnfnSTrGFOC",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-17-with-mareka-brousseau/id864571814?i=1000317288570"
      }
    },
    {
      "id": "86dba6c3-acf6-4e8d-b642-6d8c70bf7ad3",
      "title": "Surviving Scientology Episode 16 with Mat Pesch",
      "description": "Mat Pesch, 30 year veteran discusses working conditions at Scientology\u0027s Flag Land Base in Clearwater, Florida. Topics include hard sales tactics used by the sales people to Scientology public, Listen to the Intelligence gathering done on a target to extort maximum money. What are his buttons ? How much is his net worth ? Does he have a boat ? What investments ? The \u0022FSMs\u0022 are the feeders that make 10% of money they extorts.The Church with frenzied shark feeding at the smell of blood.It\u0027s so Ecclesiastical !Also, the utter miserable life of Outer Org trainees to the Flag Service Org, foot fungus at Flag; and the Freewinds as a money loser.",
      "release": "2014-07-25T11:32:38Z",
      "duration": "00:57:16.6700000",
      "explicit": false,
      "spotifyId": "6Asat8it9ngEKNb319im9D",
      "appleId": 1000316850848,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Asat8it9ngEKNb319im9D",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-16-with-mat-pesch/id864571814?i=1000316850848"
      }
    },
    {
      "id": "540aa833-c694-4378-8eca-2f969ce7433c",
      "title": "Surviving Scientology Episode 15 with Mat Pesch",
      "description": "Mat Pesch describes his time in the Scientology Sea Org.",
      "release": "2014-07-21T08:05:54Z",
      "duration": "01:01:27.0540000",
      "explicit": false,
      "spotifyId": "1Uti2i3SxV6BGuSth3l0SV",
      "appleId": 1000316611733,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Uti2i3SxV6BGuSth3l0SV",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-15-with-mat-pesch/id864571814?i=1000316611733"
      }
    },
    {
      "id": "e6a13fa6-2210-4ab9-94c6-38c01896518b",
      "title": "Surviving Scientology Episode 14 with Chuck Beatty",
      "description": "Published on Jul 11, 2014  Former Sea Org member Chuck Beatty and Jeffrey Augustine discuss a perennial debate: Did L. Ron Hubbard appoint David Miscavige his successor, or, did David Miscavige seize power? Chuck also discusses his experiences in Author Services Incorporated and the way Miscavige used ASI to assume power over the Church prior to becoming COB RTC. Chuck describes how ASI was created as a legal way to funnel money to L. Ron Hubbard. Jeff mentions a little known fact: David Miscavige had a life-threatening asthma attack in 1980. Emerging from this crisis in a hospital emergency room, David Miscavige told Paul Grady that he had a revelation that \u0022Power is Assumed\u0022 and thereafter began to assume power in the Church by whatever means it required.This is part 2 of an on going Series exposing \u0022Author Services\u0022. ",
      "release": "2014-07-12T05:57:50Z",
      "duration": "00:42:21.8200000",
      "explicit": false,
      "spotifyId": "42ndqMhfMz7YzXjrOSwRy0",
      "appleId": 1000316164406,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/42ndqMhfMz7YzXjrOSwRy0",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-14-with-chuck-beatty/id864571814?i=1000316164406"
      }
    },
    {
      "id": "8e52ff1e-237a-43e6-806a-ce637a1cb01d",
      "title": "Surviving Scientology Episode 13 with Marc Headley",
      "description": "Marc Headley describes more details of life at Scientology\u0027s Gold Base. Even though the wealth is obvious and there are multi-millions available to purchase those slick \u0022Ideal Orgs\u0022 the food company Sysco was not paid for weeks so no food was available at INT Base, the Church Headquarters. Whereupon rancid Tacos dipped in Oil were fed to the crew mixed in with old old meat. Listen to what happens...Marc also discusses his trip to Scientology\u0027s secret CST base in Trementina, New Mexico and more.",
      "release": "2014-07-06T05:10:22Z",
      "duration": "01:02:15.1190000",
      "explicit": false,
      "spotifyId": "5QvkNdTVytRxC2yITvQziH",
      "appleId": 1000315907430,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5QvkNdTVytRxC2yITvQziH",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-13-with-marc-headley/id864571814?i=1000315907430"
      }
    },
    {
      "id": "3a9db3de-8296-4dfc-8ddf-a56846b953cc",
      "title": "Surviving Scientology Episode 12 with Pete Griffiths",
      "description": "Pete Griffiths talks about his life in and out of Scientology Inc. How he was left with a 2000 British pound bill for an event and the subsequent events.Pete has been the target of obscene actions by office of special affairs, the intelligence division of the Church. These include associating him with Gay porn sites, pedophilia and other made up venom.Pete has united folk in different camps Critics, Exes, Indies, old Guard, Anons, and brought them together. He fights the abuses and atrocities.",
      "release": "2014-06-30T05:25:34Z",
      "duration": "01:00:55.6810000",
      "explicit": false,
      "spotifyId": "2E21BVpf7swFNMFUPZWe1G",
      "appleId": 1000315587530,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2E21BVpf7swFNMFUPZWe1G",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-12-with-pete-griffiths/id864571814?i=1000315587530"
      }
    },
    {
      "id": "b83f07a7-a7ab-4d7e-b0ad-9bc1b686ec7c",
      "title": "Surviving Scientology Episode 11 with Steve Hall",
      "description": "The first and earliest site on the Web which was most ex-Religious Technology Center and ex Sea org vets that exposed the internal conduct and behavior of the Scientology Cult hierarchy (Gold Base/Int base) was the site created by Steve Hall.http://www.scientology-cult.com/Steve spent 22 years in the Sea Org (mostly at INT Base) and he shares his thoughts and stories in his first interview.",
      "release": "2014-06-30T05:20:05Z",
      "duration": "01:10:17.8620000",
      "explicit": false,
      "spotifyId": "6cqzFzpo8HOkDhsBi3yjlL",
      "appleId": 1000315587529,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cqzFzpo8HOkDhsBi3yjlL",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-11-with-steve-hall/id864571814?i=1000315587529"
      }
    },
    {
      "id": "a7f0c7cb-5ad3-4d4a-9c93-3ccf7e75fa5c",
      "title": "Surviving Scientology Episode 10 with Jackson Morehead",
      "description": "Gary \u0022Jackson\u0022 Morehead is the former Security Chief of the Church of Scientology\u0027s secretive headquarters called Int Base (International Base). In Part 2, Jackson describes Life in a Cult ~~ Int Base. How Jackson almost killed a Private investigator by accident.  How a trailer load of secret documents, the history of Church management, cabinet after cabinet left the base for Long Beach and how David Miscavige handled it.",
      "release": "2014-06-19T06:20:14Z",
      "duration": "01:03:02.1140000",
      "explicit": false,
      "spotifyId": "23isUlQOlZ373nf9iFehno",
      "appleId": 1000315105983,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23isUlQOlZ373nf9iFehno",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-10-with-jackson-morehead/id864571814?i=1000315105983"
      }
    },
    {
      "id": "42ad1712-eb45-4158-b438-0368f3506d86",
      "title": "Surviving Scientology Episode 9 with Jackson Morehead",
      "description": "Gary \u0022Jackson\u0022 Morehead is the former Security Chief of the Church of Scientology\u0027s secretive headquarters called Int Base (International Base). In this interview, Jackson clarifies certain misconceptions related to Int Base having to do with guns, a big wildfire, the razor fences, and even the urban legend that a Sea Org member once had David Miscavige locked in the cross-hairs of the scope of a high-powered sniper rifle. Located in San Jacinto, California, the Int Base is notorious for being the site of the beatings committed by Scientology leader David Miscavige.",
      "release": "2014-06-14T23:05:58Z",
      "duration": "00:34:08.0790000",
      "explicit": false,
      "spotifyId": "4BYJnwUx35OcCZU8s11ZLE",
      "appleId": 1000314853910,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BYJnwUx35OcCZU8s11ZLE",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-9-with-jackson-morehead/id864571814?i=1000314853910"
      }
    },
    {
      "id": "18c1fd91-5d17-478f-8fb5-a4c55673f200",
      "title": "Surviving Scientology Radio Breaking News Report",
      "release": "2014-06-10T07:10:32Z",
      "duration": "00:02:53.2730000",
      "explicit": false,
      "spotifyId": "3ddrCaRG0ApJIamoi7j5cJ",
      "appleId": 1000314488773,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ddrCaRG0ApJIamoi7j5cJ",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-radio-breaking-news-report/id864571814?i=1000314488773"
      }
    },
    {
      "id": "c90347aa-7462-4069-8ec8-84de281a2ebe",
      "title": "Surviving Scientology Radio Episode 8 with Marc Headley",
      "description": "While Tom Cruise was being coached and trained to be a Scientology counselor, Marc Headley was selected to be his *guinea pig* as Marc calls it.In this episode Marc discusses his time with Tom and what the headquarters of Scientology did to pamper the big movie star.INT Base or GOLD Base as it is named, is the residence of the hierarchy of Scientology, the executives and Miscavige.Radio Podcasts",
      "release": "2014-06-08T21:53:00Z",
      "duration": "00:35:37.4440000",
      "explicit": false,
      "spotifyId": "1vSj3PpFvH4qpZ34eGpU0T",
      "appleId": 1000314373419,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1vSj3PpFvH4qpZ34eGpU0T",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-radio-episode-8-with-marc-headley/id864571814?i=1000314373419"
      }
    },
    {
      "id": "8355adbc-81ec-465f-a133-d82de6b7ac3a",
      "title": "Surviving Scientology Episode 6 with Jefferson Hawkins",
      "description": "Jefferson Hawkins was THE Top Marketing Exec of the Church. He authored a completely engrossing and compelling book \u0022Counterfeit Dreams\u0022 describes life at the hierarchy of Scientology Inc. 5x Assault and Battery from a \u0022Global\u0022 ecclesiastical Leader. He covers the cruelty of escalating punishments and why they do not Fair Game him.",
      "release": "2014-05-24T22:55:32Z",
      "duration": "00:44:10.2100000",
      "explicit": false,
      "spotifyId": "6cpWoogOBPKMZFumitSdrw",
      "appleId": 1000313415816,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cpWoogOBPKMZFumitSdrw",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-6-with-jefferson-hawkins/id864571814?i=1000313415816"
      }
    },
    {
      "id": "48197d49-f6f0-4a87-b819-858025e4140e",
      "title": "Marc Headley and Jeff Augustine Part 2 (Int Base Musical Chairs and more)",
      "description": "Mark Headley continues his discussion of Life at INT Base, the pinnacle of Scientology Inc. He describes the actual incident of \u0022Int Base Musical Chairs\u0022 the most read thread of all time on Xenu.net capturing the *Scientology* world\u0027s attention. At least 350,000 read the story, counting the cross posts. Marc covers the darker more diabolical aspects of Office of Special Affairs which is emotional blackmail.   OSA actually called Child Protective Services to take away Marc and Claire\u0027s children on trumped up charges. This, folks is the vengeful hideous side of the *Church* of Scientology.",
      "release": "2014-05-24T22:51:07Z",
      "duration": "01:02:55.3220000",
      "explicit": false,
      "spotifyId": "6dlymhBBG3zOsllb4QuycP",
      "appleId": 1000313415817,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6dlymhBBG3zOsllb4QuycP",
        "apple": "https://podcasts.apple.com/podcast/marc-headley-and-jeff-augustine-part-2-int-base/id864571814?i=1000313415817"
      }
    },
    {
      "id": "66036860-80c4-48a7-bc68-0dab94008fd6",
      "title": "Surviving Scientology Episode 5 with Marc Headley",
      "description": "Marc Headley grew up in the Church of Scientology. He joined the Sea Org when he was a young teenager. Marc became an executive in Golden Era Productions at Scientology International Base in San Jacinto, California. In his executive position, Marc routinely worked directly with Scientology leader David Miscavige. Marc describes the actual incident in which David Miscavige flew into a rage and violently assaulted him. Marc describes other events and the general working conditions at Int Base. Listeners will find the “bad tacos” story to be especially illustrative of the conditions inside the Sea Org.",
      "release": "2014-05-13T22:24:20Z",
      "duration": "01:01:26.9410000",
      "explicit": false,
      "spotifyId": "0lHJ3HY3p6kOa6VQFImYSf",
      "appleId": 1000312844731,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0lHJ3HY3p6kOa6VQFImYSf",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-episode-5-with-marc-headley/id864571814?i=1000312844731"
      }
    },
    {
      "id": "b5227498-165e-4fff-9cfb-d6f494c63d50",
      "title": "April 28: Claire Headley Interview part 2 with your host Jeffrey Augustine",
      "description": "Program Summary: April 28: Claire Headley interview part 2 with your host Jeffrey Augustine     Claire Headley grew up in the Church of Scientology.   Claire rose to great prominence in the Church and became a senior executive in the Religious Technology Center (RTC) where she reported directly to Shelly Miscavige.   In this two-part interview, Claire discusses in fascinating detail Shelly Miscavige, David Miscavige, life on Int Base, and her husband Marc Headley and how he blew from Int Base.",
      "release": "2014-05-08T12:00:00Z",
      "duration": "00:38:13.9750000",
      "explicit": false,
      "spotifyId": "31EBJkdxkxkKoi26lqO9Te",
      "appleId": 1000311409129,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/31EBJkdxkxkKoi26lqO9Te",
        "apple": "https://podcasts.apple.com/podcast/april-28-claire-headley-interview-part-2-with-your/id864571814?i=1000311409129"
      }
    },
    {
      "id": "a3e801f9-e048-4196-a0ee-6f2f83afcab2",
      "title": "April 28: Claire Headley Interview with your host Jeffrey Augustine",
      "description": "Program Summary: April 28: Claire Headley interview with your host Jeffrey Augustine     Claire Headley grew up in the Church of Scientology.   Claire rose to great prominence in the Church and became a senior executive in the Religious Technology Center (RTC) where she reported directly to Shelly Miscavige.   In this two-part interview, Claire discusses in fascinating detail Shelly Miscavige, David Miscavige, life on Int Base, and her husband Marc Headley and how he blew from Int Base.",
      "release": "2014-05-03T20:57:56Z",
      "duration": "00:38:09.1500000",
      "explicit": false,
      "spotifyId": "6kAwUNxbu7FZfwdiX9ZgW9",
      "appleId": 1000310111711,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6kAwUNxbu7FZfwdiX9ZgW9",
        "apple": "https://podcasts.apple.com/podcast/april-28-claire-headley-interview-with-your-host/id864571814?i=1000310111711"
      }
    },
    {
      "id": "517eff55-85fe-481f-83ad-4218e823cb37",
      "title": "Surviving Scientology Radio Episode 1 with Mike Rinder",
      "description": "Mike Rinder and Jeffrey Augustine discuss Jillian Schlesinger, the recently leaked Church of Scientology 990-T tax filings with the IRS, and the disaster created by the Church of Scientology in South Africa. Jillian Schlesinger recently escaped from the notorious Church of Scientology slave labor force known as the Sea Org. Within three weeks of her escape, Jillian made of series of YouTube videos with Karen de la Carriere. These videos and Jillian’s story went viral. The Church’s Office of Special Affairs engaged in Fair Game against Karen de la Carriere and Jeffrey Augustine following the release of these videos. Mike Rinder comments on why he thinks the Jillian Schlesinger videos represent such a threat to Church of Scientology. Jeffrey Augustine recently located and released Church of Scientology IRS 990-T filings wherein the Church declared a book value of $1.5 billion for just three of its entities: Church of Scientology International, Church of Spiritual Technology, and Flag Service Organization. Mike Rinder describes the dramatic meltdown of the Church of Scientology in South Africa.",
      "release": "2014-04-17T00:12:31Z",
      "duration": "00:30:08.9760000",
      "explicit": false,
      "spotifyId": "0sY6imgECcaARoFzfXsU4M",
      "appleId": 1000302784711,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0sY6imgECcaARoFzfXsU4M",
        "apple": "https://podcasts.apple.com/podcast/surviving-scientology-radio-episode-1-with-mike-rinder/id864571814?i=1000302784711"
      }
    }
  ]
}