{
  "id": "8a82a859-9e47-4792-8d07-9bdce442a5b6",
  "name": "Surviving Together",
  "youTubeChannelId": "UCLpP37wUXD8t8If6RPFNFRQ",
  "episodes": [
    {
      "id": "3fda32ee-2358-4902-8f3f-cff8f8256b94",
      "title": "Raised in a Cult: Tammy Rene\u0027s Journey through Childhood Trauma to Wholeness",
      "description": "Join me for an incredible conversation with Tammy René!! As a survivor of childhood sexual and physical abuse in a cult, Tammy René brings her personal experience of overcoming trauma to audiences to inspire hope and understanding. Her messages offer victims of childhood trauma keys to healing and offer insights for helping lift those who struggle on their healing journey. She currently volunteers with her local Suicide Prevention Network as a PTSD support group facilitator and has worked as a CASA (Court Appointed Special Advocate) on behalf of abused and neglected children. \n\nTammy hosts two podcast series: Survivor Shift: Moving from Surviving to Thriving where she interviews others about critical shifts in thought and behavior that allowed them to move forward after trauma; Building on the Light\u0027s guests share pieces of light they\u0027ve discovered that help them continue to build a life they can thrive in. You can find both podcasts on YouTube at https://www.youtube.com/@TammyRene915\n\nShe is the author of her bestselling and award-winning memoir, Miracles in the Dark: How a Childhood Cult and Abuse Victim Reclaimed the Light. You can order her book here: https://a.co/d/dkl7qSs\n\n***************************************************************************************\nSUPPORT the channel through:\nPayPal - username @SurvivingTogether \nCashApp - cash.app/$SurvivingTogether \n\nChannel link -    / @survivingtogethersass  \n\nTo contact Mak directly, email her at survivingtogethersass@gmail.com\n\nAll are welcome as long as you abide by the rules:\n1. Be respectful of others in the comments \u0026 Live chat. It\u0027s critical that people feel this is a safe, supportive \u0026 caring environment to discuss their feelings/share their stories about an emotionally difficult topic. So no mean people allowed!!\n2. If it\u0027s not your story to tell, don\u0027t repeat it. What is shared here is highly personal \u0026 not meant for general consumption. \n3. No religion or politics talk. There are other channels for that.\n \nDISCLAIMER: Surviving Together is an online peer support group for sexual assault survivors \u0026 their supporters, as well as a platform to provide education about sexual assault \u0026 related topics. The information provided here is not intended or implied to be a substitute for professional mental health diagnosis or treatment. All content including text, graphics, images and information contained on or available through this channel is for general \u0026/or educational purposes only. This channel makes no representation and assumes no responsibility for the accuracy of information on or available through this channel. You are encouraged to confirm any information obtained from or through this channel with other sources and review all information with a mental healthcare professional.\n\n🎙️ New to streaming or looking to level up? Check out StreamYard and get $10 discount! 😍 https://streamyard.com/pal/d/6271554293465088",
      "release": "2026-01-09T15:03:57Z",
      "duration": "01:49:27",
      "explicit": false,
      "youTubeId": "ZzdSG-ZHjJY",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZzdSG-ZHjJY"
      }
    }
  ]
}