{
  "_ts": 0,
  "id": "b380d0c0-d939-4941-a216-1a2bd6116fb8",
  "name": "Swayology",
  "spotifyId": "1GsMp63tifpoeQ1wkHZQ85",
  "appleId": 1645177321,
  "episodes": [
    {
      "id": "9021b81a-c762-44b9-af5c-cfa5e89d9b8b",
      "title": "41. No Matter Your Past, God Wants to Use Your Story With Anne LeBaron",
      "description": "Anna LeBaron knows what it is like to be a survivor in an impossible situation. Escaping her father’s violent polygamist cult at age thirteen, Anna has spent her life sharing her story to help others overcome their traumatic experiences. Author of “The Polygamists Daughter: A Memoir” and now featured in the 5-episode docuseries streaming now on Hulu and Disney\u0026#43; called “Daughters of the Cult,” Anna’s story will fascinate and inspire you. Now a mother to five adult children and one precious grandchild, Anna continues her journey and will graduate in 2024 with a master’s degree in Christian Spiritual Formation and Leadership. You can find more from Anna on her website at https://annalebaron.com . WHAT WE CHAT ABOUT: What it means to be in a cult Victim mentality Deconstructing the Christian faith after trauma When you don’t get family support The redemption arc Perspective shifts CONNECT WITH ANNA: Website (Book Launching, Author Coaching, Social Media Coaching available.) Instagram Facebook The Polygamist’s Daughter Book (4.4 Stars on Goodreads) Daring Greatly book by Brene Brown Daughters of The Cult can be seen on Hulu or Disney\u0026#43; Follow her brother, Hyrum Follow her sister, Celia WHAT TO DO NEXT: LEAVE a review! SHARE this episode. SUBSCRIBE to stay in the know! FOLLOW Anne on Instagram *Some affiliate links may apply.",
      "release": "2024-02-20T06:14:00Z",
      "duration": "00:35:41.0780000",
      "explicit": false,
      "spotifyId": "2gz1POwU3VzfZchJI4z4Ql",
      "appleId": 1000645959744,
      "subjects": [
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2gz1POwU3VzfZchJI4z4Ql",
        "apple": "https://podcasts.apple.com/podcast/41-no-matter-your-past-god-wants-to-use-your-story/id1645177321?i=1000645959744"
      }
    }
  ]
}