{
  "_ts": 0,
  "id": "a772eeaa-d9a2-4ef0-a0eb-7bd13a9d3179",
  "name": "Takes One to Write One",
  "spotifyId": "0BNFJbWYVYw1n7WhGYTnuq",
  "appleId": 1774739270,
  "youTubeChannelId": "UCdPgLXBGyl0Hk3IjPdTM0Wg",
  "episodes": [
    {
      "id": "6923c09f-96c9-46c6-9910-dc4201c9e8e4",
      "title": "Cults - Part Three",
      "description": "In the final part of this candid and emotionally resonant series, Katherine sits down with our anonymous guest for a wide-ranging conversation on reclaiming life, identity, and freedom after leaving a cult. Through reflection, analysis, and moments of both levity and gravity, they explore what comes after escape: the long process of unlearning, healing, and re-entering the world.\n\n\nThis episode dives into pop culture, spirituality, horror as catharsis, and what documentaries get right—and wrong—about cult life. You’ll hear powerful reflections on trust, autonomy, and the ongoing journey of writing a new story after surviving a system of control.\n\n\n\n\nTIMESTAMPS\n00:01:32 What other gossip was happening amongst the church?\n00:02:38 You said a hundred people. Was there like a flow of there was a minimum, there was a maximum?\n00:03:15 Was it ever discouraged going to the doctor?\n00:04:05 Tell me more about healing hands.\n00:04:47 Were there some church members that were a little louder than others?\n00:05:35 Was that truly believed to a level of, like, yes, women are healers, but God is ultimate?\n00:06:52 Is Aunt Bessie a reference to something?\n00:08:40 Was it just God or was there like the Trinity of God, Jesus, and the Holy Spirit?\n00:09:40 What were you able to watch as a kid?\n00:10:40 Once you were out, and you could watch relatively anything, how did that feel?\n00:12:15 Are there any [bible] verses that you might still hold close to you because you like them?\n00:14:38 What was it like regaining your freedom of choice?\n00:16:11 Did you have to learn how to trust yourself?\n00:17:43 What\u0027s the difference between a cult and a military?\n00:19:29 Did you find comfort being in the military after your experience in the cult?\n00:21:18 When you say that you\u0027re learning this dark humor, how does that come about?\n00:23:27 What tactics have you utilized to get the pop culture refresh into your brain?\n00:24:32 What is it about horror that you\u0027re able to enjoy?\n00:27:32 Were there ever doomsday prophecies with the cult?\n00:29:03 You and I have watched a few documentaries on Cults, the Twin Flames documentary, the Keep Sweet and Obey documentary. What about these documentaries do you feel get it right?\n00:34:07 “As to what the documentaries got wrong, I can\u0027t speak to too much because every cult is different.”\n00:35:05 Would you like to see something being made about the cult that you were a part of?\n00:36:38 ”Anybody could fall victim to a cult.”\n00:37:44 What traits would that leader have to have?\n00:38:28 What resources would you suggest writers utilize to better write about Cults, either fictional or realistic, in their own writing?\n00:39:34 If I were to only watch one documentary to get that cultness through, what would it be?\n00:41:15 What is the best way to heal from a cult experience?\n00:44:54 What might you want to say to somebody listening who is questioning the organization that they are currently in, that it may also be of a cult persuasion?\n\n\n\nWEBSITE\nhttps://takesonetowriteone.com/\n\n\n\nSOCIALS\nInstagram: https://tinyurl.com/T1tW1-Instagram\nThreads: https://tinyurl.com/T1tW1-Threads\nBluesky: https://tinyurl.com/T1tW1-Bluesky\nYouTube: https://tinyurl.com/T1tW1-YouTube\nPinterest: https://tinyurl.com/T1tW1-Pinterest\nSpotify: https://tinyurl.com/T1tW1-Spotify\nYouTube Music: https://tinyurl.com/T1tW1-YouTubeMusic",
      "release": "2025-05-20T01:43:37Z",
      "duration": "00:48:55",
      "explicit": false,
      "spotifyId": "1m92AOtAZtzjSXsiHbuQKK",
      "appleId": 1000704321422,
      "youTubeId": "OXxdfd7UUYc",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1m92AOtAZtzjSXsiHbuQKK",
        "apple": "https://podcasts.apple.com/podcast/cults-part-three/id1774739270?i=1000704321422",
        "youtube": "https://www.youtube.com/watch?v=OXxdfd7UUYc"
      }
    },
    {
      "id": "40ea2944-230a-4ea2-8804-2f5e24804efa",
      "title": "Cults - Part Two",
      "description": "In Part Two of Takes One to Write One: Cults, Katherine sits down again with her anonymous guest as they dig deeper into life inside a high-control religious group. This episode explores the long-term impact of spiritual abuse, how loyalty was weaponized, and what happens when someone begins to question everything they’ve ever been taught.\n\n\nTogether, they unpack relationships, identity, and the emotional unraveling that often follows the first steps toward freedom. It’s an honest, intense, and insightful look into the psychological grip these groups can have—even long after someone leaves.\n\n\nTrigger warnings include trauma, spiritual and emotional abuse, psychological manipulation, and suicidal ideation. Please listen with care.\n\n\n\n\n\n\nTIMESTAMPS\n00:01:26 What differences did you notice in these “biblified” holidays? \n00:03:41 What were birthdays like?\n00:04:13 Speaking of siblings and their names from the bible…\n00:05:50 And y\u0027all could have pets like typical household families?\n00:08:44 To have siblings that weren\u0027t around for the cult, that are growing up in a different way. How do you feel about that?\n00:10:24 You touched on the sex education or rather lack of. Is that the only way —abstinence?\n00:11:53 Was there any talk about the health of like, hey, you\u0027re, this is what happens with puberty?\n00:13:18 What is in the Bible regarding menstruation?\n00:15:51 Did you experience other women in the church being pregnant?\n00:18:21 You mentioned at five years old, you knew who you were, quote unquote, destined to marry. Did you have a friendship with the person, or relationship?\n00:20:02 What sex education do you suppose the guys got?\n00:21:56 “I know one of the guys that assaulted me, assaulted one of my sisters.”\n00:22:33 Is that out of shame that you didn\u0027t share with each other?\n00:24:09 So now that you\u0027re not involved, and you exited, what was the removal process like for you?\n00:26:45 You mentioned earlier how overwhelming it was to be in the greater world of things. How did you cope with that?\n00:29:16 “I never even saw the r*pes as r*pe until I was in college.”\n00:33:14 So when you were trying one of every [drug], did you find answers out of those experiences?\n00:35:23 What was ultimately something that really helped you start the healing?\n00:36:39 This may have been weeks ago, perhaps an off comment, where you were figuring out like, there\u0027s not a hell, there\u0027s not this, there\u0027s not, and it was like, your whole belief system was crashing around you. How long did that take to get over?\n00:38:13 “Since the day I was born, I was told these shoulders are going to send me to hell.”\n00:39:35 Tell me more about you looking into Greek mythologies.\n00:44:32 “I have struggled with s*icid*l ideation adhesion since leaving the cult because suicide is a sin, according to the Bible and according to the cult.”\n00:46:13 Is an identity crisis the right term to use for that?\n00:46:49 Do you find more solace from talking to folk that were also involved in cults, or do you find more solace from folk that have never been in cults?\n00:50:08 So these claims, it seems very your word against everybody else\u0027s.Does stuff like this get caught in that rumor mill and all of the gossip?\n\n\nWEBSITE\nhttps://takesonetowriteone.com/\n\n\nSOCIALS\nInstagram: https://tinyurl.com/T1tW1-Instagram\nThreads: https://tinyurl.com/T1tW1-Threads\nBluesky: https://tinyurl.com/T1tW1-Bluesky\nYouTube: https://tinyurl.com/T1tW1-YouTube\nPinterest: https://tinyurl.com/T1tW1-Pinterest\nSpotify: https://tinyurl.com/T1tW1-Spotify\nYouTube Music: https://tinyurl.com/T1tW1-YouTubeMusic\nRead less",
      "release": "2025-05-20T01:43:34Z",
      "duration": "00:52:06",
      "explicit": false,
      "spotifyId": "0FFkalfQr5fDWOo6lttfji",
      "appleId": 1000702627386,
      "youTubeId": "mTfKDh0LL6o",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0FFkalfQr5fDWOo6lttfji",
        "apple": "https://podcasts.apple.com/podcast/cults-part-two/id1774739270?i=1000702627386",
        "youtube": "https://www.youtube.com/watch?v=mTfKDh0LL6o"
      }
    },
    {
      "id": "29a2d2a5-366e-4da8-9b0a-64ee63b044e2",
      "title": "Cults - Part One",
      "description": "In this first episode of Takes One to Write One: Cults, Katherine sits down with a guest who bravely shares their experience growing up in a high-control group and their journey to breaking free. Through their anonymous account, we explore what it means to be raised in a cult, the tactics used to maintain control, and the emotional toll of leaving. This conversation is raw, honest, and at times heavy—so please listen with care. Trigger warnings include coercion, trauma, psychological manipulation, spiritual and emotional abuse, and physical assault. Your well-being comes first.\n\nTIMESTAMPS\n00:00:27 Trigger Warnings: coercion, trauma, physical assault, psychological manipulation, spiritual abuse, emotional abuse, sexual abuse, self-harm, suicide, and gaslighting.\n00:02:05 Did the cult have a name, or was it a cult?\n00:04:26 What are your first memories or experiences with being in the organization?\n00:06:20 Who was doing the homeschooling?\n00:08:40 I imagine in an unfortunate circumstance, you got really good at knowing the Bible verses.\n00:09:20 Bible verses for discipline\n00:10:51 With these church services, were they the same no matter what day of the week or were they like, it\u0027s Monday, so this day is about this?\n00:11:55 What\u0027s the difference between the kids\u0027 service and the adult service?\n00:13:40 Could you elaborate more on these responsibilities?\n00:16:14 How did your parents get involved?\n00:17:37 Matchmaking\n00:19:14 The bible taught the Rule of Thumb \n00:20:40 What would you experience in these church services?\n00:23:31 Would anybody who\u0027s been at a church service be able to find similarities with the church services that you attended?\n00:25:09 What was the view with working— having an unrelated job?\n00:25:25 Members of the church, what sort of jobs did they have?\n00:26:42 Tithing with 10 percent but definitely more \n00:29:44 With these clothes, was it retail stores that you went to? Were they made sewn?\n00:30:20 Was there like a uniform, like were there specific things that you needed to wear?\n00:31:02 If I were to put a dollar at the top of my knee, the shorts had to be longer than where the dollar ended going up my knee.\n00:32:07 Carrying religious traumas \n00:32:56 What was youth group like?\n00:35:28 What does one do to become a leader?\n00:37:29 So overall, in the grand scheme of things, rather recently, a couple of years ago and I was like, hey, this is a cult, right?\n00:39:35 Because one does not simply leave a cult, they just replace it.\n00:39:53 What was the difference between the original and now the new or second?\n00:40:39 Are these cults still operating?\n00:41:06 You mentioned at the church services that people questioned commitment. What was that verbiage like?\n00:42:57 Was the pastor who was getting all the money, who was clearly not doing what he was saying he was going to do with the money, was he living a flashier life than the rest of the members?\n00:44:58 So, you were with this group, always doing stuff, always keeping busy, studying, doing X, Y, Z. And then you mentioned how isolating it was at the same time. I imagine there wasn\u0027t mental health support of, hey, you\u0027re feeling this way.\n00:46:08 Was there a big presence of Satan?\n00:46:57 Let\u0027s take a break\n\n﻿WEBSITE\nhttps://takesonetowriteone.com/\nSOCIALS\nInstagram: https://tinyurl.com/T1tW1-Instagram\nThreads: https://tinyurl.com/T1tW1-Threads\nBluesky: https://tinyurl.com/T1tW1-Bluesky\nYouTube: https://tinyurl.com/T1tW1-YouTube\nPinterest: https://tinyurl.com/T1tW1-Pinterest\nSpotify: https://tinyurl.com/T1tW1-Spotify\nYouTube Music: https://tinyurl.com/T1tW1-YouTubeMusic",
      "release": "2025-03-24T16:00:00Z",
      "duration": "00:49:00",
      "explicit": false,
      "spotifyId": "53JxL0X8yhmlBrF7a4hxZd",
      "appleId": 1000700683903,
      "youTubeId": "Sikuz1F6HIA",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/53JxL0X8yhmlBrF7a4hxZd",
        "apple": "https://podcasts.apple.com/podcast/cults-part-one/id1774739270?i=1000700683903",
        "youtube": "https://www.youtube.com/watch?v=Sikuz1F6HIA"
      }
    }
  ]
}