{
  "id": "f3186f70-7408-4664-8ed6-a8fbcce1a189",
  "name": "Tales From A Cult Insider",
  "spotifyId": "2a3QmfxfeBHHSXgHjbFQuT",
  "appleId": 1376764078,
  "episodes": [
    {
      "id": "82deda5c-57df-409a-9c37-85a93130e167",
      "title": "Forgiveness v Freedom",
      "description": "As I\u0027m working out guests for the podcast and getting the schedules to line up, I\u0027ve also been reflecting on this idea of healing through truth-telling. I want more of that healing. I\u0027m greedy. I want to be free. I yearn for freedom from the tendrils and chains of what those cultists did to me - WHILE at the same time, I\u0027m grateful for the hardship that led me to become a deeply happy and blessed person. So I reflect on all that in this episode. Stay with me! And if you\u0027re enjoying this, please review or rate and share.",
      "release": "2024-08-30T23:11:47Z",
      "duration": "00:36:45.4170000",
      "explicit": false,
      "spotifyId": "4z05IYz0AFXvyYbx1IWExb",
      "appleId": 1000667556352,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4z05IYz0AFXvyYbx1IWExb",
        "apple": "https://podcasts.apple.com/podcast/forgiveness-v-freedom/id1376764078?i=1000667556352"
      }
    },
    {
      "id": "d5f5f48f-d0f6-43c2-a6d3-a92df1ccaf22",
      "title": "Next Guest: My Dad - Part Two",
      "description": "This is the second half of the session with just me and my father. He adds more detail and we have a good opportunity to keep proving the truth that there\u0027s always more to the story. Also, he\u0027s a great dude and I love him. Thank you as always! Don\u0027t forget to rate and share!",
      "release": "2024-08-23T00:00:00",
      "duration": "00:34:55.7600000",
      "explicit": false,
      "spotifyId": "0m3rLMYBQr72TEQYjD7wSq",
      "appleId": 1000666370679,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0m3rLMYBQr72TEQYjD7wSq",
        "apple": "https://podcasts.apple.com/us/podcast/next-guest-my-dad-part-two/id1376764078?i=1000666370679"
      }
    },
    {
      "id": "bdb46177-aa59-44ec-a8d9-62285f00cc31",
      "title": "Next Guest: My Dad - Part One",
      "description": "My dad stuck around to share more interesting details and more from his perspective about how his life was in the Process, then the Foundation Faith of God. Thank you all for returning to the podcast, and thank everyone who is just finding it! I hope you enjoy this new approach of healing through truth-telling. There\u0027s more to come! Please remember to share and rate!",
      "release": "2024-08-16T14:00:00Z",
      "duration": "00:39:32.1810000",
      "explicit": false,
      "spotifyId": "2bFU2MlYTWCnvgupzjJQWr",
      "appleId": 1000665637635,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bFU2MlYTWCnvgupzjJQWr",
        "apple": "https://podcasts.apple.com/podcast/next-guest-my-dad-part-one/id1376764078?i=1000665637635"
      }
    },
    {
      "id": "2ea12618-f989-4e33-8599-79655d5466ca",
      "title": "First Guests: Dad and Sister - Part Two",
      "description": "My father continues telling his story. Lots of neat details. We do a lot of good for ourselves and others when we not only listen to there stories but also try to help them tell that story. Often, when we have a story to tell, even a true one that is from our experience, we need help and space to figure out how to tell that story truthfully and in a way that satisfies us. I hope this episode is the beginning of that for my father and might inspire you to do the same.",
      "release": "2024-08-13T14:00:00Z",
      "duration": "00:37:57.5070000",
      "explicit": false,
      "spotifyId": "5ozzLr75BHCR9pqzZmvnFt",
      "appleId": 1000665154100,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ozzLr75BHCR9pqzZmvnFt",
        "apple": "https://podcasts.apple.com/podcast/first-guests-dad-and-sister-part-two/id1376764078?i=1000665154100"
      }
    },
    {
      "id": "343cd8cd-3b55-4a6a-b3ff-2b4d240139e1",
      "title": "First Guests: Dad and Sister - Part One",
      "description": "As I mentioned, my father was a big driver of getting this started back up. This is the episode where he starts telling his story, with my sister and I adding color commentary, questions, and our own memories here and there. He shares stuff I didn\u0027t know at all. It\u0027s interesting to realize that there really is always more to the story, and there\u0027s so much power in telling the truth and knowing what you\u0027re saying is being listened to.",
      "release": "2024-08-09T14:00:00Z",
      "duration": "00:34:59.5120000",
      "explicit": false,
      "spotifyId": "56UUj0fjYMzPWVSlctKPgQ",
      "appleId": 1000664827918,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/56UUj0fjYMzPWVSlctKPgQ",
        "apple": "https://podcasts.apple.com/podcast/first-guests-dad-and-sister-part-one/id1376764078?i=1000664827918"
      }
    },
    {
      "id": "71984b48-bb47-4b24-a1e2-f03fbce70545",
      "title": "Introduction to Season Two",
      "description": "We\u0027re back! In this episode, I share what has happened over the last couple of years that made it necessary to start a sequel season. New information, new photos, strengthened relationships, renewed friendships, and healing opportunities got me thinking, \u0022What if I went back and shared all of this with those amazing listeners?\u0022 So I did. And that includes guests! Here\u0027s the intro to tell you what to expect and to also tell you all about what happened when - all of a sudden - I heard from someone I hadn\u0027t talked to in 33 years! Please share with friends and family!",
      "release": "2024-08-02T23:18:48Z",
      "duration": "00:25:14.0690000",
      "explicit": false,
      "spotifyId": "5OZRaOsoE5K13TYAeuE6hL",
      "appleId": 1000664185734,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5OZRaOsoE5K13TYAeuE6hL",
        "apple": "https://podcasts.apple.com/podcast/introduction-to-season-two/id1376764078?i=1000664185734"
      }
    },
    {
      "id": "ebc609c4-6cab-411f-9764-c07e16aa879b",
      "title": "Surprise! Season Two Intro and Trailer",
      "description": "Surprise, there\u0027s more! Lots has happened since \u0022I\u0027m Out\u0022 dropped. I\u0027ve loved the freedom I\u0027ve felt from the cult as I feel I\u0027ve truly moved on and healed, so I\u0027m very grateful. But there\u0027s more. Like, more guests with unique insight. And more reconnections. And loads more information. So welcome to season two of this podcast. Actual Season Two. I think I called some episodes a second season, but this is now the official Season Two. Thanks for coming along for the ride. More to come soon!",
      "release": "2024-07-25T20:39:03Z",
      "duration": "00:08:35.6560000",
      "explicit": false,
      "spotifyId": "5Fr8CFAVLlgeatL5vjEshL",
      "appleId": 1000663368335,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Fr8CFAVLlgeatL5vjEshL",
        "apple": "https://podcasts.apple.com/podcast/surprise-season-two-intro-and-trailer/id1376764078?i=1000663368335"
      }
    },
    {
      "id": "75adbe96-c56f-4345-8633-6f5e6deff338",
      "title": "Tales from a Cult Insider - I\u0027m Out",
      "description": "I needed to record some truly final thoughts while actually on Best Friends property. So I recorded on my phone near a highway and you\u0027ll hear cars going by and me being reflective as I take the final step of the journey this podcast has taken me on. I can\u0027t overstate how much it means to me that you have taken this journey with me. I hope you\u0027ve gained hope and optimism for the future and have gotten a glimpse at the amount of power you have in your life to change and improve and make yourself what you want. Love, blessings, and peace. Life is short. Love unabashedly. Find beauty. Your support is also beautiful! Please review, share, spread the word. You can support by sharing or even Venmo at @Jared-Garrett-writes.",
      "release": "2022-02-09T16:41:20Z",
      "duration": "00:10:39.0330000",
      "explicit": false,
      "spotifyId": "61G7JPu8w5NOjGBl3NtEDi",
      "appleId": 1000550580719,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61G7JPu8w5NOjGBl3NtEDi",
        "apple": "https://podcasts.apple.com/podcast/tales-from-a-cult-insider-im-out/id1376764078?i=1000550580719"
      }
    },
    {
      "id": "8db1a3e7-6b1c-4c20-8718-3addc50e9b71",
      "title": "Episode 44: Grand Finale Recorded with a Live Audience",
      "description": "This is the grand finale episode, recorded in Kanab, only seven miles from Best Friends. Poetic by design! And with a live, not exactly studio, audience! This is a wrap-up episode aimed to provide some closure to myself and all of you wonderful listeners. I think it worked. I share my deepest feelings about all of this and I have hope and optimism and am blessed with all I could ever need. -- also yes, there\u0027s a bit of a bonus \u0027outro\u0027 episode after this... Please review, share, spread the word. You can support by clicking the link or even Venmo at @Jared-Garrett-writes.",
      "release": "2022-02-09T04:19:18Z",
      "duration": "00:56:51.6080000",
      "explicit": false,
      "spotifyId": "0ZktljdTU3s7ABAlajm85K",
      "appleId": 1000550512678,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ZktljdTU3s7ABAlajm85K",
        "apple": "https://podcasts.apple.com/podcast/episode-44-grand-finale-recorded-with-a-live-audience/id1376764078?i=1000550512678"
      }
    },
    {
      "id": "472428fa-f0e7-4f46-a89e-bedddc1343d1",
      "title": "Episode 43: Punches Sort of Thrown and Final Thoughts",
      "description": "This is the final of three long, deep episodes with my wonderful sister, Emma. You can find more of her perspective and also her excellent talents on TikTok at spicyemmapanada. We make sure we say what needs to be said, not out of malice but because we will tell the story and we are responsible for telling all of it, both for ourselves and for the world to have truth. So join us for the ride. And stay tuned for the final episode in a few short days, recorded in a super cool location!",
      "release": "2022-02-04T04:43:17Z",
      "duration": "00:57:40.5850000",
      "explicit": false,
      "spotifyId": "18iyVlNH5cNB4OLqzdp6yf",
      "appleId": 1000550028440,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18iyVlNH5cNB4OLqzdp6yf",
        "apple": "https://podcasts.apple.com/podcast/episode-43-punches-sort-of-thrown-and-final-thoughts/id1376764078?i=1000550028440"
      }
    },
    {
      "id": "0b49c980-4f20-45eb-b654-84cc2c4132e9",
      "title": "Episode 42: Kids and Siblings and Parents Healing Together... and TikTok",
      "description": "My sister Emma joins me for another wide-ranging, mildly cathartic episode in which we dive into the trauma of constant instability and how that looks today. We also talk about how the cult did our parents dirty and really was a wrecking ball of crap. Start for the silly inside jokes, stay for the sweet chat about The Little Mermaid. Which is obviously more than a chat about a movie with a series of questionable messages.",
      "release": "2022-01-29T07:00:45Z",
      "duration": "01:03:23.9620000",
      "explicit": false,
      "spotifyId": "5KgD9MfTGj8AHdP3W6yes1",
      "appleId": 1000549354802,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KgD9MfTGj8AHdP3W6yes1",
        "apple": "https://podcasts.apple.com/podcast/episode-42-kids-and-siblings-and-parents-healing/id1376764078?i=1000549354802"
      }
    },
    {
      "id": "d5a049cc-01ab-44bc-bd20-f541f29af308",
      "title": "Episode 41: Another Cult Insider - My Sister",
      "description": "The podcast is back. Not epilogues, not bonus episodes. Back with stories and more truth that needs telling. Back with my sister, Emma, for at least the next several episodes. I\u0027m still not trying to bring down the whole thing that used to be the cult that we grew up in. But I\u0027m not happy about keeping some of the story untold out of a desire to \u0027be nice\u0027 or whatever. So when I heard my sister telling some of what she experienced, stuff I didn\u0027t know about, I knew it was time to, well, throw a punch or two. So here we are. My wonderful sister Emma and I talking about her experience and me being somewhat surprised at some of the significant commonalities between us. As ever, please review this podcast and share it all over the place.",
      "release": "2021-05-04T04:45:25Z",
      "duration": "00:54:52.7520000",
      "explicit": false,
      "spotifyId": "66BO2BD5IAdrh3TpQUh5sw",
      "appleId": 1000520019409,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/66BO2BD5IAdrh3TpQUh5sw",
        "apple": "https://podcasts.apple.com/podcast/episode-41-another-cult-insider-my-sister/id1376764078?i=1000520019409"
      }
    },
    {
      "id": "f2f0f8a5-9708-4db3-a8ad-16b12184996e",
      "title": "Epilogue 6: Reactions from Me and Others to the Religion News Service Article",
      "description": "Back in January of 2020, before all the crazy, I was contacted by Bob Smietana, who was then the Editor-in-Chief of Religion News Service, a rather impressive and wonderful news outlet that reports on the religious angle of all the newsworthy stuff going down. Bob had found this podcast and was interested in discussing my childhood and experiences and we ended up doing an interview some weeks later. He also talked to my dad and sister. The article ultimately came out on October 14 and you can find it here: https://religionnews.com/2020/10/14/process-church-final-judgment-best-friends-animal-rescue-foundation-faith-jared-garett-latter-day-saint-cult-scientology-satanist-pet-rescue/ I shared it around and had some fascinating reactions. First off, it sounds like my dad and a few other former members aren\u0027t happy with how \u0027Satanist\u0027 the cult sounds. Additionally, there\u0027s at least one factual error. More importantly, one of the guys I grew up with got Facebook-angry and I wound up doing an informal poll of others that I grew up with regarding how we grew up. Turns out we have very different takes on our experience. I\u0027ll address all of these things in this episode, as well as share my own thoughts as I read my own words and experience as filtered through a very good journalist\u0027s brain and writing. As ever, please consider supporting this podcast in any of several ways: clicking on the support link, reviewing, telling your friends, and sharing with your family at your holiday gatherings! And on your snapchat. And Tik Tok. And all the things.",
      "release": "2020-10-31T04:29:23Z",
      "duration": "00:40:48.5900000",
      "explicit": false,
      "spotifyId": "35DXIMv0A53f9IptfVcwrT",
      "appleId": 1000496728256,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/35DXIMv0A53f9IptfVcwrT",
        "apple": "https://podcasts.apple.com/podcast/epilogue-6-reactions-from-me-and-others-to-the/id1376764078?i=1000496728256"
      }
    },
    {
      "id": "5aa84536-daef-4f95-9f3c-26d6a88c4cca",
      "title": "Epilogue 5: What It\u0027s Like to Visit Best Friends Now",
      "description": "You can probably imagine that visiting Best Friends now is odd. In this epilogue episode, I share stories to illustrate some of the strange and disconnected feelings I have visiting there. Spoiler: it\u0027s odd. But cool and chill. Remember to review and share this podcast with your chums and bums!",
      "release": "2020-09-19T01:02:51Z",
      "duration": "00:38:39.0690000",
      "explicit": false,
      "spotifyId": "2PKYKwoYhtFuLJuAI0Ndpv",
      "appleId": 1000491793202,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2PKYKwoYhtFuLJuAI0Ndpv",
        "apple": "https://podcasts.apple.com/podcast/epilogue-5-what-its-like-to-visit-best-friends-now/id1376764078?i=1000491793202"
      }
    },
    {
      "id": "5f40f21a-8bb4-4822-b2f0-3d4aa0ea838c",
      "title": "Epilogue 4: My Reaction to the Documentary",
      "description": "I learned a lot from watching the documentary that Neil Edwards at TwoFour Entertainment put together. It\u0027s a very good documentary with an impressive amount of primary sources, interviews, and footage and audio. Very cool stuff. I had several visceral reactions to this thing. I considered writing them all down, but didn\u0027t want to go to the effort. So I recorded an episode. This one is me being a little less guarded than usual. Not out of vindictiveness, but truth has to be spoken. Not \u0027my truth\u0027 either - just actual truth. And keep talking about this thing. Studies show that podcasts gain new listeners primarily and almost solely through word of mouth. Studies also show that cake is a great breakfast. The first statement is true, but the cake one is not. Enjoy!",
      "release": "2020-08-14T06:18:06Z",
      "duration": "00:51:45.7610000",
      "explicit": false,
      "spotifyId": "7sR9IeY2lq5TP9ikEri9vl",
      "appleId": 1000488114163,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7sR9IeY2lq5TP9ikEri9vl",
        "apple": "https://podcasts.apple.com/podcast/epilogue-4-my-reaction-to-the-documentary/id1376764078?i=1000488114163"
      }
    },
    {
      "id": "61f5f819-4373-417a-84dc-75c7d49879e6",
      "title": "Epilogue 3: Nearly Thirty Years Later - I Know What the Cult Believed",
      "description": "Remember that episode I did on what the cult actually believed? Well, my knowledge was far more incomplete than it is now. I received a bunch of material from the director of a documentary about the Process. His name is Neil Edwards and the documentary is called Sympathy for the Devil: The True Story of the Process Church of the Final Judgment. He sent me some interesting stuff in the same package as a DVD copy of the documentary that I ordered. If you\u0027re interested, Google that title and you\u0027ll see it. Anyway, I had to do an episode on all the stuff. What they believed. The popular pseudo occult science they preached which was extremely hip at the time and... Gah. Just listen to me ramble and read if you\u0027re interested. I get a bit.. warm and probably hypocritical. Oh well, what\u0027re you gonna do? It was a cult, and that\u0027s no good. In the episode, I promise to give you a link to where you can see the images I talk about. I put them on my Facebook page: Jared Nathan Garrett . Please remember to review and support the podcast!",
      "release": "2020-08-08T07:10:41Z",
      "duration": "00:41:55.1150000",
      "explicit": false,
      "spotifyId": "5cBkU4F50wJeHK9oR5FcEF",
      "appleId": 1000487492903,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5cBkU4F50wJeHK9oR5FcEF",
        "apple": "https://podcasts.apple.com/podcast/epilogue-3-nearly-thirty-years-later-i-know-what-the/id1376764078?i=1000487492903"
      }
    },
    {
      "id": "5be27107-5925-46bc-ae47-9db4583163be",
      "title": "Epilogue 2: Finding Parts of Myself - Even Today",
      "description": "Did I ever tell you I was a firefighter? Well, I was. My first call was to rescue young bulls from a truck accident. My first fire was a dumpster fire. No, literally. Also, I talked a lot about how important books were to me, but I don\u0027t think I emphasized the power and importance of music in my formative years. It provided unfettered exhilaration and pretend and I will always be thankful to it. I recently rediscovered an artist and album and it took me to a place I was delighted to revisit. Anyway, I\u0027m finding parts of myself even today - things that have been and will be a part of me forever. And I\u0027m coming to terms with that. So tune in and hear me rave and tell more stories. Thanks for listening. As always, I\u0027d love it if you would tell friends about this crazy podcast. And review and rate it! Maybe tell three friends, and if those three friends told three friends, and so on and so on - well, that\u0027s what an MLM is, my friends.",
      "release": "2020-07-11T06:32:09Z",
      "duration": "00:39:35.7260000",
      "explicit": false,
      "spotifyId": "7jjJIO3ipHYntv1oFSJuoO",
      "appleId": 1000484288349,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jjJIO3ipHYntv1oFSJuoO",
        "apple": "https://podcasts.apple.com/podcast/epilogue-2-finding-parts-of-myself-even-today/id1376764078?i=1000484288349"
      }
    },
    {
      "id": "72208c3e-4471-44d3-beab-8b03cb19e428",
      "title": "Epilogue 1: My Mission to Brazil",
      "description": "This is the first of at least three epilogues. The way I grew up led me to a mission in Brazil and I found a home in the warmth, goodness, and welcome of those people. And I learned and was changed fundamentally. This episode shares some of the more impactful stories from my mission and you will be able to see how this experience provided everything I had wanted my whole life. Sincerity, genuine faith, and things that in my old cynical mind I considered cheesy and dumb. Now I believe they\u0027re those cheesy things- those sincere things, are the treasure of this world and life. That is entirely because of my mission. Enjoy.",
      "release": "2020-03-25T05:12:39Z",
      "duration": "00:44:55.3020000",
      "explicit": false,
      "spotifyId": "1ngAorLrl1GpaXP8G81D8U",
      "appleId": 1000469427464,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ngAorLrl1GpaXP8G81D8U",
        "apple": "https://podcasts.apple.com/podcast/epilogue-1-my-mission-to-brazil/id1376764078?i=1000469427464"
      }
    },
    {
      "id": "c6bea70a-9bbd-4dee-b587-f1c5fa5b4b20",
      "title": "Episode 40: Post Cult Story 3 - How I Met Their Mother",
      "description": "Spoiler: I have never seen that show. Not even a single episode - and I\u0027m a big fan of Alyson Hannigan. This episode brings the podcast full-circle from where I started: I wanted a family, to where I am now: I have a family. It\u0027s longer because there\u0027s a lot of juicy details and intermittently mortifying memories. I tell how I met my dear wife and how we got to know each other and got engaged. So buckle up, this is the last episode until I have a few epilogues done in a few months or two. Also, I speak Portuguese in a couple parts because of you lovely listeners in Brazil. Amo voces! As always, thank you for listening. Tell your friends. Share on social media. Rate and review!",
      "release": "2020-02-08T07:29:55Z",
      "duration": "00:51:16.8290000",
      "explicit": false,
      "spotifyId": "1I2ThkPiqV5dsnm5i0Z20P",
      "appleId": 1000464980069,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1I2ThkPiqV5dsnm5i0Z20P",
        "apple": "https://podcasts.apple.com/podcast/episode-40-post-cult-story-3-how-i-met-their-mother/id1376764078?i=1000464980069"
      }
    },
    {
      "id": "551e5cf2-6c80-4f46-842f-34dfa2f0936a",
      "title": "Episode 39: Bonfires, Poetry, Metallica, Girls, and not LSD",
      "description": "This episode starts with me singing, moves on into me reading a very small part of a poem by Walt Whitman, and then just keeps to that epically high standard. I mean, might as well go out with a bang. But really though, this episode is all about the things that helped me find my identity, my voice, my love, and my passion. Things that helped me see and recognize beauty. Also, it\u0027s about Dead Poets Society, that amazing movie. So check it out and remember to review, share, and rate!",
      "release": "2020-01-31T06:18:13Z",
      "duration": "00:32:45.6620000",
      "explicit": false,
      "spotifyId": "2FLuITDJ0c1LHLqvLdQ8N6",
      "appleId": 1000464200700,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2FLuITDJ0c1LHLqvLdQ8N6",
        "apple": "https://podcasts.apple.com/podcast/episode-39-bonfires-poetry-metallica-girls-and-not-lsd/id1376764078?i=1000464200700"
      }
    },
    {
      "id": "47fc64df-91b7-43b5-8194-f736f47391f0",
      "title": "Episode 38: Life Immediately After",
      "description": "So it\u0027s not like the story of my life in the cult and then out of the cult is ever really going to end. I am who I am due to my circumstances and my choices and I wouldn\u0027t go back for anything. That said, we\u0027re winding up this big arc and the podcast is going to come to an end soon - with some epilogues here and there over the next few months or so. This episode is where I share anecdotes and situations and funny and even important experiences in my immediately post-cult life. In fact, I share the story of my very first actual girlfriend. And frankly, I\u0027ll never not be grateful to the people of Kanab, Utah, for being warm, welcoming, and just exactly weird enough for me as I fought to find my feet. Remember you can support this podcast via: listening, sharing, word of mouth, reviewing, and rating. And everything you do, I appreciate. Reach me at jared@jaredgarrett.com or on Twitter @jaredgarrett. #CultInsider",
      "release": "2020-01-25T06:17:24Z",
      "duration": "00:33:37.5810000",
      "explicit": false,
      "spotifyId": "2NfuNaQpNrkMRxssOgPbqM",
      "appleId": 1000463622720,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NfuNaQpNrkMRxssOgPbqM",
        "apple": "https://podcasts.apple.com/podcast/episode-38-life-immediately-after/id1376764078?i=1000463622720"
      }
    },
    {
      "id": "ec268061-35d4-485e-8dca-132aa391990e",
      "title": "Episode 37: The Great Escape",
      "description": "It\u0027s the episode you might have been waiting for! I talk about how I finally actually got out of the cult. For a guy whose bread and butter is telling stories, I recognize that this story might be somewhat anti-climactic, but it\u0027s not. It\u0027s true in all the right ways. I made my choices all the way along and those choices helped me get out of the negative, abusive situation and start healing. So give it a listen and find out how I found the physical freedom I\u0027d sought for so long - although I\u0027d found emotional freedom sometime before. As always, tell your friends, family, and enemies. And hug your loved ones.",
      "release": "2020-01-18T05:44:18Z",
      "duration": "00:34:01.0570000",
      "explicit": false,
      "spotifyId": "6J9vrbKUaoQOQ5Tft9N5kc",
      "appleId": 1000462971524,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6J9vrbKUaoQOQ5Tft9N5kc",
        "apple": "https://podcasts.apple.com/podcast/episode-37-the-great-escape/id1376764078?i=1000462971524"
      }
    },
    {
      "id": "56659e50-23dc-4d4d-ba31-0b934bbdb086",
      "title": "Episode 36: The Promenade and Easing In and Out",
      "description": "Okay friends, we\u0027re closing in on the story of my escape. But before that, some things changed for us kids. This episode focuses on all of us kids in the Dallas Branch-- also called the Children\u0027s Center. I mention a few things I\u0027ve talked about in the past and put it all together, doing my best to share what it felt like to be an older teenager in this cult. There was a normalcy, even though it was still bizarre. The conversations I had with new friends were a bit of a taste of what I would experience for the rest of my life when making new friends-- the cult was the focus. Enjoy the anecdotes and such. Fans of Peter Gabriel will appreciate the final story. As always, thank you for listening. Don\u0027t forget: sharing is caring.",
      "release": "2020-01-07T05:31:48Z",
      "duration": "00:31:56.0640000",
      "explicit": false,
      "spotifyId": "2wTZtmMM9kekP2RjSmoyWd",
      "appleId": 1000461773392,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2wTZtmMM9kekP2RjSmoyWd",
        "apple": "https://podcasts.apple.com/podcast/episode-36-the-promenade-and-easing-in-and-out/id1376764078?i=1000461773392"
      }
    },
    {
      "id": "54e85102-2a4e-4bf2-97df-4909c51b9fe9",
      "title": "Episode 35: Memoir Chapter 6: Are You My Father?",
      "description": "I share another chapter of my memoir, in which I tell some stories about learning who my real father is, how my biological family sort of evolved, being a ring-bearer at a cult wedding, and more. I also pose some questions to you, dear listener. I await your response. Merry Christmas!",
      "release": "2019-12-20T05:58:40Z",
      "duration": "00:29:59.9180000",
      "explicit": false,
      "spotifyId": "7EOvu1ohEZ7E3UXTU3jTNC",
      "appleId": 1000460274057,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7EOvu1ohEZ7E3UXTU3jTNC",
        "apple": "https://podcasts.apple.com/podcast/episode-35-memoir-chapter-6-are-you-my-father/id1376764078?i=1000460274057"
      }
    },
    {
      "id": "07048718-3597-4fa1-b2a1-ee617405cfdc",
      "title": "Episode 34: The Children\u0027s Ministry",
      "description": "If I were a clickbait headline writer, this episode\u0027s title would be: Hypocrisy Made Him This. Click To Be Shocked! The truth is that the name The Children\u0027s Ministry might not mean what you think it means. And in this episode, I finally reveal a deep, dark secret that perhaps two people outside of the Dallas Branch kids know. Or really, those two people might not even remember me telling them. So you get to find it out. Also, this episode covers one of the most bizarre disconnects that I experienced growing up. But through that disconnect, I found I had a talent for performing, so that\u0027s okay. And I tie balloons very well. And I teach you how to use a helium tank. Just listen already. And support this podcast and review it and share with your crew. Posse? Tribe? What do the kids say these days?",
      "release": "2019-12-11T06:29:53Z",
      "duration": "00:33:40.8320000",
      "explicit": false,
      "spotifyId": "6RinNY7ovaHEgWZlLQ2KrO",
      "appleId": 1000459276524,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RinNY7ovaHEgWZlLQ2KrO",
        "apple": "https://podcasts.apple.com/podcast/episode-34-the-childrens-ministry/id1376764078?i=1000459276524"
      }
    },
    {
      "id": "fb759305-98b0-4dfa-be04-482291cb0b9e",
      "title": "Episode 33: History and Life of Brian\u0027s Bright Side",
      "description": "Given how sort of all over the place the history of the cult is being told in this podcast, I thought it might be useful to really hone the thing\u0027s evolution down into a simple explanation of facts, with my own perspective on some of the popular myths about the cult. For example, was it a Satanist cult? Answer in the podcast (spoiler: no). Also, even in major trauma or very harsh conditions, the human spirit is strong and will find joy. Luckily, this cult was not good but was nowhere near as bad as millions in this world have it. And there were sometimes some really fun things that we got to do. I talk about those here. As always, thanks for your support, your reviews, and your word of mouth!",
      "release": "2019-12-03T06:44:48Z",
      "duration": "00:38:52.9550000",
      "explicit": false,
      "spotifyId": "55KRvFxa6WHW0mB5QtZKWY",
      "appleId": 1000458514996,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/55KRvFxa6WHW0mB5QtZKWY",
        "apple": "https://podcasts.apple.com/podcast/episode-33-history-and-life-of-brians-bright-side/id1376764078?i=1000458514996"
      }
    },
    {
      "id": "777fcd66-3dfc-435b-ae22-bfeb407e8652",
      "title": "Tales From A Cult Insider (Trailer)",
      "release": "2019-11-30T02:09:33Z",
      "duration": "00:00:59.5590000",
      "explicit": false,
      "spotifyId": "34wHj5bc2oHI04bRzoN5rc",
      "appleId": 1000458250380,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34wHj5bc2oHI04bRzoN5rc",
        "apple": "https://podcasts.apple.com/podcast/tales-from-a-cult-insider-trailer/id1376764078?i=1000458250380"
      }
    },
    {
      "id": "8f2f5462-0c8e-4a1c-9b5d-8c92fb4d6492",
      "title": "Episode 32: Memoir Chapter 22: The Cult\u0027s Life and Death, But Not Really",
      "description": "If you\u0027re a long time listener (first time caller :-) ), you know I\u0027ve written my memoir. I\u0027m revising it now preparatory to sending it to agents. I wanted to share chapter 22 with you, in which I sum up the cult\u0027s evolution, and mine as well. It\u0027s also a chapter in which I give the cult\u0027s founders a much needed message. This chapter was incredibly healing for me to write. I hope you enjoy it. Remember you can email me, support this podcast, review it, and share it with your crew!",
      "release": "2019-11-26T04:52:47Z",
      "duration": "00:25:26.5490000",
      "explicit": false,
      "spotifyId": "6mSDzffBe8xpvwz1xLXhCF",
      "appleId": 1000457876688,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6mSDzffBe8xpvwz1xLXhCF",
        "apple": "https://podcasts.apple.com/podcast/episode-32-memoir-chapter-22-the-cults-life-and-death/id1376764078?i=1000457876688"
      }
    },
    {
      "id": "0a513fa0-8903-4f2b-a6dd-571529de3713",
      "title": "Episode 31: We Were Robbed",
      "description": "It\u0027s episode 31 and I\u0027m talking all about being robbed. I also share some interesting experiences I had with old cult cronies over the last weekend and I answer a listener\u0027s excellent question about holidays. The being robbed thing was ongoing, really. But this episode is also about the actual thing when our home was burgled. Crazy, right? As always, thanks for tuning in. Remember to review and share!",
      "release": "2019-11-13T06:49:18Z",
      "duration": "00:31:02.8200000",
      "explicit": false,
      "spotifyId": "5LdkiP9zVBYUt6h6gkahnq",
      "appleId": 1000456658899,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5LdkiP9zVBYUt6h6gkahnq",
        "apple": "https://podcasts.apple.com/podcast/episode-31-we-were-robbed/id1376764078?i=1000456658899"
      }
    },
    {
      "id": "b7816781-ab1c-4a70-9095-64b7d1898060",
      "title": "Episode 30: Post-Cult Story 2 - Don\u0027t Cut Off My Hand, Bro!",
      "description": "This title will become self-explanatory, but spoiler: this episode will especially please theater geeks. Stage acting and everything associated with it blessed my life and changed it fundamentally. My baby face might have gotten me roles, but my roles helped me find a voice. I tell the stories of my very first ever part in a play, along with my very first solo act, and sort of getting paid to act professionally for a time. Also, theater helped me meet and marry a great lady. Not kidding. Enjoy. Thanks for stopping by. May I suggest you review this podcast and talk about it with your pals?",
      "release": "2019-10-26T08:32:54Z",
      "duration": "00:34:12.1560000",
      "explicit": false,
      "spotifyId": "2YNWKZSQ5uTkT2fJbGZvd5",
      "appleId": 1000454986185,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2YNWKZSQ5uTkT2fJbGZvd5",
        "apple": "https://podcasts.apple.com/podcast/episode-30-post-cult-story-2-dont-cut-off-my-hand-bro/id1376764078?i=1000454986185"
      }
    },
    {
      "id": "84315a90-3229-4ed9-b4ed-5347616f56ea",
      "title": "Episode 29: Night Time Anxiety and Other Ailments (Like Allergies)",
      "description": "Being sick in the Foundation Faith of God was not fun. Especially when it was an ongoing anxiety about sleeping. I mean, think about it. Who do you tell when you haven\u0027t slept well? Your spouse? Your parent? Your coworker or siblings? I didn\u0027t have any of that. We were all just trying to make it through, man. So enjoy the stories about ailments in the Foundation. Cringe at your leisure. I\u0027m fine now, so don\u0027t worry about it. And don\u0027t forget to review, share, and support this podcast!",
      "release": "2019-10-11T06:03:53Z",
      "duration": "00:31:41.9690000",
      "explicit": false,
      "spotifyId": "3cJe09l6CHo2IIfLi9LK45",
      "appleId": 1000453100524,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3cJe09l6CHo2IIfLi9LK45",
        "apple": "https://podcasts.apple.com/podcast/episode-29-night-time-anxiety-and-other-ailments-like/id1376764078?i=1000453100524"
      }
    },
    {
      "id": "d53a2a7d-7bd4-4eec-8a0f-9ebb42d3f878",
      "title": "Episode 28: What Was Our Religion, Anyway?",
      "description": "You\u0027d think that a cult would have a single, controlling doctrine that informed every moment and every action in the lives of its adherents, wouldn\u0027t you? Something like this world is an illusion, so everything we do is an attempt to break the illusion. Or our existence is a simulation. Or animals are the actual gods. Or something else. But the Foundation Faith of God didn\u0027t really, in my experience, have a single uniting doctrine. I explore more about this, why it was the case, and more about the evolution of the cult/commune from Scientology offshoot to, ultimately, the very productive and wonderful Best Friends Animal Society. Remember to review, share with your friends, and support this podcast!",
      "release": "2019-10-02T05:06:35Z",
      "duration": "00:37:37.2810000",
      "explicit": false,
      "spotifyId": "0bdzBjM6zD6dKCEPXyRUL6",
      "appleId": 1000451999681,
      "subjects": [
        "Process Church of the Final Judgement",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0bdzBjM6zD6dKCEPXyRUL6",
        "apple": "https://podcasts.apple.com/podcast/episode-28-what-was-our-religion-anyway/id1376764078?i=1000451999681"
      }
    },
    {
      "id": "c9ce25f2-3245-4314-a7e5-7ac5e526efad",
      "title": "Episode 27: Post Cult Story 1 - Painfully Shy",
      "description": "Part of my growing up in a cult has actually been the growing up I\u0027ve done outside of the cult. This is a story about good, friendly, generous people helping me find my feet, find my voice a little, and also start finding myself. Because when I got out of that cult, I was in a thick, shy shell. But that wasn\u0027t my end form, friends. That was me in embryo, and this story is the story of me breaking free. At least a little. So join me at high school dances full of bangs and perms. And remember to review this podcast and tell your friends about it.",
      "release": "2019-09-21T05:43:35Z",
      "duration": "00:33:49.5400000",
      "explicit": false,
      "spotifyId": "5RgIaDC6J7GVWY3RFRdiut",
      "appleId": 1000450580189,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5RgIaDC6J7GVWY3RFRdiut",
        "apple": "https://podcasts.apple.com/podcast/episode-27-post-cult-story-1-painfully-shy/id1376764078?i=1000450580189"
      }
    },
    {
      "id": "a2a42339-5f2a-4439-82e1-ab3a5714f7db",
      "title": "Episode 26: Random Double Standards",
      "description": "Let\u0027s get into some of the intricacies of the day-to-day of cult/commune living. In this episode, I share some of the bizarre, sometimes alienating double standards propagated by the Foundation and its members. Things to do with sex, the terrible outside world, and more. Tune in and remember to leave a review!",
      "release": "2019-09-11T05:47:54Z",
      "duration": "00:32:05.5610000",
      "explicit": false,
      "spotifyId": "3vgwxrSzXkiGyinaHIWw3T",
      "appleId": 1000449348910,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vgwxrSzXkiGyinaHIWw3T",
        "apple": "https://podcasts.apple.com/podcast/episode-26-random-double-standards/id1376764078?i=1000449348910"
      }
    },
    {
      "id": "3e039120-eb13-4106-8035-82395a19bc6e",
      "title": "Episode 25: I Will Not Be Erased",
      "description": "I\u0027m usually down with just telling my stories and being as chill as possible. But several things combined to make this episode necessary. And talking about being essentially erased over and over again by the people who \u0027raised\u0027 me was necessary- because voices will be heard. I will be heard. There appears to be a little anger left in the basement, which I\u0027d like to excise, so this episode was even therapeutic. Please understand, my intent is not to tear down or deliver a scathing indictment or even to write an exposé of the organization the cult has become. I admire their work. But I can admire their work and want it to continue and still speak the truth. We were there. They had us, abandoned us, used us to do hard labor, and neglected and even abused many of us. All that mixed in with plenty of good times. Truth needs to be spoken. I have committed to not live a life of fear. So I spoke the truth- with no animosity for anyone.",
      "release": "2019-09-04T04:34:31Z",
      "duration": "00:30:49.4230000",
      "explicit": false,
      "spotifyId": "03FRJeJOmvKe7PfhZna3Ja",
      "appleId": 1000448530520,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/03FRJeJOmvKe7PfhZna3Ja",
        "apple": "https://podcasts.apple.com/podcast/episode-25-i-will-not-be-erased/id1376764078?i=1000448530520"
      }
    },
    {
      "id": "c3c97788-2f59-4a2f-a5ba-96cf8cda9bc7",
      "title": "Episode 24: Okay, I Had A Crush",
      "description": "For the final episode of Season 1, a lengthy story about a major crush I had. Yes, a crush. On a Scottish girl. The years that I carried this torch became incredibly formative for me and I\u0027m grateful for all I learned and all I did to improve myself. The last little bit of the episode is a reflection on a moment I had tonight with one of my kids and the juxtaposition of that moment with my life growing up. I get a little... energetic about that. As always, thank you for tuning in. Thank you for sharing. Remember to click on the support link below. And on Instagram and Twitter and other social media, you can use #TalesFromACultInsider and #CultInsider to find a community of listeners.",
      "release": "2019-03-28T06:46:14Z",
      "duration": "00:39:02.8700000",
      "explicit": false,
      "spotifyId": "0Boh0lpLzn6N91sbPBcYPq",
      "appleId": 1000433637643,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Boh0lpLzn6N91sbPBcYPq",
        "apple": "https://podcasts.apple.com/podcast/episode-24-okay-i-had-a-crush/id1376764078?i=1000433637643"
      }
    },
    {
      "id": "bd3644d7-ec22-42ab-8cac-ce32ad0dbe13",
      "title": "Episode 23: A Hippie With A Temper Part 2",
      "description": "It\u0027s part two of the short series about my mother. Our relationship, as I tried to describe in the last episode, was odd at best. We ate Chinese food sometimes. We both read horror novels. We spoke sometimes. But when I shared my honest feelings, it made her angry, so I learned to not do that. She had a life full of what was important to her and surprised me by a late-in-life emergence as a businesswoman. Listen and you will soon discover I have mommy issues. As always, I\u0027d love your support. Rate, review, share. You can share on Twitter and Instagram, and if you use #CultInsider as a hashtag, I\u0027ll see it. See you next week for the next episode!",
      "release": "2019-03-21T05:37:35Z",
      "duration": "00:38:10.5090000",
      "explicit": false,
      "spotifyId": "3EKmZ1sNbzMaN2EaKtXzJX",
      "appleId": 1000432661950,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3EKmZ1sNbzMaN2EaKtXzJX",
        "apple": "https://podcasts.apple.com/podcast/episode-23-a-hippie-with-a-temper-part-2/id1376764078?i=1000432661950"
      }
    },
    {
      "id": "5497a647-04c1-4f5f-9353-1a661fc939c7",
      "title": "Episode 22: A Hippie With a Temper Part 1",
      "description": "Now for two episodes about my mother. There\u0027s a lot of me doing my level best to get across the experience/relationship I had with my mother- which wasn\u0027t all bad, but was not what most people would understand. So listen and you\u0027ll probably get a new appreciation for your own parents ( I really hope so at least) and you will also find out that this world is full of so many variations and relationships. Maybe this will help us all gain more empathy for those we inhabit this world with. Don\u0027t forget to share, review, rate, and support this podcast. Thank you for being a #cultinsider.",
      "release": "2019-03-07T05:40:10Z",
      "duration": "00:31:50.4440000",
      "explicit": false,
      "spotifyId": "4ysBgJQKUK4UlSXAz8KI2W",
      "appleId": 1000431268374,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ysBgJQKUK4UlSXAz8KI2W",
        "apple": "https://podcasts.apple.com/podcast/episode-22-a-hippie-with-a-temper-part-1/id1376764078?i=1000431268374"
      }
    },
    {
      "id": "1fc598e3-c6e2-4b2c-85a4-17bccd13dc70",
      "title": "Episode 21: Water Activities",
      "description": "I love water today. I was scared of it when I was younger. Here\u0027s where I tell you why and take the opportunity to share some specific stories about how we commune kids spent our days. The YWCA in Dallas features prominently, as does weird, ritualistic baptism. Remember to review!",
      "release": "2019-02-28T05:16:47Z",
      "duration": "00:29:48.5170000",
      "explicit": false,
      "spotifyId": "4Js0T3OOFMJ2enGBN2xCkP",
      "appleId": 1000430775933,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Js0T3OOFMJ2enGBN2xCkP",
        "apple": "https://podcasts.apple.com/podcast/episode-21-water-activities/id1376764078?i=1000430775933"
      }
    },
    {
      "id": "f212fe2c-27e8-4dfd-8298-18ca9075e21f",
      "title": "Episode 20: Faith School",
      "description": "\u0022I\u0027m an equal-opportunity weirdo.\u0022 Ah, the joys of an unscripted podcast. In this milestone 20th episode, I share lots of details about the school I spent seven years attending. The one created by the cult because of... reasons I can only really speculate about. In many ways, it was awesome. In a few ways, it was meh. It was basically home school, but with less home. Don\u0027t forget to review, tell your friends about, and maybe even support this podcast!",
      "release": "2019-02-21T06:37:23Z",
      "duration": "00:32:47.4030000",
      "explicit": false,
      "spotifyId": "1RKId8SXr1K5ADP3PiBL2q",
      "appleId": 1000430307692,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1RKId8SXr1K5ADP3PiBL2q",
        "apple": "https://podcasts.apple.com/podcast/episode-20-faith-school/id1376764078?i=1000430307692"
      }
    },
    {
      "id": "9aff916e-b877-4911-9a53-d54c609492c6",
      "title": "Episode 19: No Idea How To Mourn",
      "description": "This is a slightly longer episode, as the subject matter merits a bit more time. Plus, I had a question submitted that deserved a good answer. This episode is where I share one of the most important events of my childhood and, frankly, how I screwed it up. It\u0027s related to my oldest brother\u0027s death and how I really made a mess of my own reaction at the time in a way that actually caused trauma to myself. Yep, I scarred myself. I\u0027m talented like that. Please remember to review and share!",
      "release": "2019-02-14T05:21:44Z",
      "duration": "00:34:21.9300000",
      "explicit": false,
      "spotifyId": "7DOyBixup1ohoOfnjXqvzH",
      "appleId": 1000429836394,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7DOyBixup1ohoOfnjXqvzH",
        "apple": "https://podcasts.apple.com/podcast/episode-19-no-idea-how-to-mourn/id1376764078?i=1000429836394"
      }
    },
    {
      "id": "f9a9f1ed-e453-4abf-a078-c029814de2ca",
      "title": "Episode 18: Dogs and Cats Living Together",
      "description": "Mass hysteria! Okay, it wasn\u0027t exactly mass hysteria, but being raised by people whose primary focus and goal in life were to rescue animals meant that I was surrounded by furry critters all the time. It wasn\u0027t always great. It wasn\u0027t always terrible. Listen to learn who the greatest cat ever was.",
      "release": "2019-02-07T08:20:48Z",
      "duration": "00:32:09.3920000",
      "explicit": false,
      "spotifyId": "0ynzme3P9AwP5SfzQZHGeN",
      "appleId": 1000429367653,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ynzme3P9AwP5SfzQZHGeN",
        "apple": "https://podcasts.apple.com/podcast/episode-18-dogs-and-cats-living-together/id1376764078?i=1000429367653"
      }
    },
    {
      "id": "6fe522cc-2ae9-4837-b3b1-7ee5c2413596",
      "title": "Episode 17: A Corner, 5000 Lines, and All Points in Between",
      "description": "It\u0027s a long, long description for an episode about the colorful, sometimes terrible and cruel, and sometimes just bizarre punishments that we received in the cult. I quote Ursula from The Little Mermaid because that\u0027s always a good idea. Remember to review and share!",
      "release": "2019-01-31T07:53:33Z",
      "duration": "00:30:51.3500000",
      "explicit": false,
      "spotifyId": "4R288tDkrTkN9cySVDpntS",
      "appleId": 1000428846922,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4R288tDkrTkN9cySVDpntS",
        "apple": "https://podcasts.apple.com/podcast/episode-17-a-corner-5000-lines-and-all-points-in-between/id1376764078?i=1000428846922"
      }
    },
    {
      "id": "ce81ae94-6ba3-4ab6-8830-c87c6923a179",
      "title": "Episode 16: I Had A Big Problem - Part 3",
      "description": "The final part of the three-part series on the problem of my temper and the temper of others. I knew my temper was causing problems. I knew I wanted to change that and do better. BE better. Here\u0027s the story of how I found healing, strength, and progress in my goal to overcome my temper. Remember to review and share!",
      "release": "2019-01-24T06:24:09Z",
      "duration": "00:33:29.1990000",
      "explicit": false,
      "spotifyId": "3ZWoy5ODMsNBIhqO9xuMPb",
      "appleId": 1000428358122,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ZWoy5ODMsNBIhqO9xuMPb",
        "apple": "https://podcasts.apple.com/podcast/episode-16-i-had-a-big-problem-part-3/id1376764078?i=1000428358122"
      }
    },
    {
      "id": "acb19912-49f6-4ccd-9b96-d8b89e4ae8d6",
      "title": "Episode 15: I Had A Big Problem - Part 2",
      "description": "Last time we talked about my big problem: a temper. However, we talked a lot more about someone else\u0027s temper than mine and what happened to me when he lost it. In this episode, we talk about how my temper was terrible and one day I lost it badly - and how that was a turning point for me. Remember to review and share! It makes all the difference to a small podcast like mine.",
      "release": "2019-01-17T04:09:15Z",
      "duration": "00:29:55.6680000",
      "explicit": false,
      "spotifyId": "4aTGQQmFavrziSY6b9Zxuv",
      "appleId": 1000427823974,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4aTGQQmFavrziSY6b9Zxuv",
        "apple": "https://podcasts.apple.com/podcast/episode-15-i-had-a-big-problem-part-2/id1376764078?i=1000427823974"
      }
    },
    {
      "id": "0f4020b9-2b09-42dd-9db5-194dfe38e63c",
      "title": "Episode 14: I Had A Big Problem - Part 1",
      "description": "Today we get personal. Actually, today and next week, and possibly the following week. This is a multi-episode story about my temper problem. I\u0027m not just talking about my own temper either. Listen in and remember to tell your friends to check out my podcast. I\u0027d love it if you would support the podcast by clicking on the link!",
      "release": "2019-01-10T06:34:38Z",
      "duration": "00:32:12.5960000",
      "explicit": false,
      "spotifyId": "4Oq6VWusdqVE5nqlO9kQq9",
      "appleId": 1000427366987,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Oq6VWusdqVE5nqlO9kQq9",
        "apple": "https://podcasts.apple.com/podcast/episode-14-i-had-a-big-problem-part-1/id1376764078?i=1000427366987"
      }
    },
    {
      "id": "ea1aa0ad-c02a-4608-97de-63275fdb94f0",
      "title": "Episode 13: The Problem of Parents",
      "description": "So glad you\u0027re back for more! Here I talk about what many of us cult kids talked a lot about: parents. We were raised as if parents were not needed, although that experience varied due to prestige of one\u0027s actual parents. Many of us were lied to about at least one parent. Why? Good question. A few anecdotes and some speculation await you in this episode. Please consider sharing and reviewing. These two things make all the difference for small podcast like mine.",
      "release": "2019-01-05T08:19:00Z",
      "duration": "00:32:52.7440000",
      "explicit": false,
      "spotifyId": "6iqUzg2qO4CUY7m8B1g1Li",
      "appleId": 1000427049095,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6iqUzg2qO4CUY7m8B1g1Li",
        "apple": "https://podcasts.apple.com/podcast/episode-13-the-problem-of-parents/id1376764078?i=1000427049095"
      }
    },
    {
      "id": "f12fc56c-5aa8-44a6-8daf-a2a7db095f4a",
      "title": "Episode 12: I Have Skills",
      "description": "Hey Cult Insider! Was the cult all bad? No, friends, it was not. I gained a lot from growing up the way I did. Let\u0027s talk about bikes, cars, cockroaches, and woodwork. But mostly cockroaches. Remember! Please share and review. You can help me turn my podcasting into a speaking career!",
      "release": "2018-12-27T05:28:30Z",
      "duration": "00:31:26.0400000",
      "explicit": false,
      "spotifyId": "6PlO63mllm5SlkWqSV9cZb",
      "appleId": 1000426551632,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6PlO63mllm5SlkWqSV9cZb",
        "apple": "https://podcasts.apple.com/podcast/episode-12-i-have-skills/id1376764078?i=1000426551632"
      }
    },
    {
      "id": "0eb40e1e-ef8e-4481-a842-49cbc27ee39c",
      "title": "Episode 11: Dogs, Their Poo, and Me",
      "description": "I promise this episode isn\u0027t gross. You\u0027ll laugh, not cringe. I answer some questions about smells and other cults, then I tell the story of scooping large amounts of dog poop and how that was actually a good thing. You\u0027ll have to listen if you want to find out how much dog crap I scooped in my lifetime. Please remember to share and review so more people can hear about dog poo!",
      "release": "2018-12-20T05:33:08Z",
      "duration": "00:28:11.4800000",
      "explicit": false,
      "spotifyId": "0xL5kMXvhNBVWTHi0aABYQ",
      "appleId": 1000426180548,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0xL5kMXvhNBVWTHi0aABYQ",
        "apple": "https://podcasts.apple.com/podcast/episode-11-dogs-their-poo-and-me/id1376764078?i=1000426180548"
      }
    },
    {
      "id": "c7cdcc96-7313-453a-a23f-3b4bd0164d57",
      "title": "Episode 10: Miles of Trenches",
      "description": "The Process/Foundation/Best Friends bought a giant ranch just north of Kanab, Utah. There was much work to be done and who better to do a large part of it than a bunch of young, sort of fit youths who couldn\u0027t say no? Here\u0027s where I tell some of those stories, answer some questions, and get a bit emotional.",
      "release": "2018-12-13T05:56:04Z",
      "duration": "00:29:35.1000000",
      "explicit": false,
      "spotifyId": "1QLCGR4pB7wFVKAmri7Xr5",
      "appleId": 1000425704162,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1QLCGR4pB7wFVKAmri7Xr5",
        "apple": "https://podcasts.apple.com/podcast/episode-10-miles-of-trenches/id1376764078?i=1000425704162"
      }
    },
    {
      "id": "4beb931b-f22e-4eb1-bd70-17fc315bc589",
      "title": "Episode 9: Why I Hate Hatchbacks",
      "description": "This week\u0027s episode is not exactly about hatchbacks. It\u0027s more about an unexpected goodbye, a hallucination I had at age seven, and somewhat self-imposed loneliness. Please consider reviewing and sharing.",
      "release": "2018-12-06T06:50:47Z",
      "duration": "00:28:44.4870000",
      "explicit": false,
      "spotifyId": "3MPEjLWhNRIZROVQr6CYLH",
      "appleId": 1000425259277,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3MPEjLWhNRIZROVQr6CYLH",
        "apple": "https://podcasts.apple.com/podcast/episode-9-why-i-hate-hatchbacks/id1376764078?i=1000425259277"
      }
    },
    {
      "id": "ac93c0d4-fe43-4263-bd96-b07e774e0cf5",
      "title": "Episode 8: Did We Not Have Rent Money?",
      "description": "One of the key early features of growing up in the Foundation/Process was that we were nomads. The cult would set up shop, send out its money beggars (as my grandmother called them), and within a couple years move. I was in at least two different pre-schools. Maybe three. I tell stories about this and speculate as to the cause of these moves.",
      "release": "2018-11-29T07:00:24Z",
      "duration": "00:30:05.3110000",
      "explicit": false,
      "spotifyId": "5sDbDIb0CxOJiqhzfVK6TO",
      "appleId": 1000424787393,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5sDbDIb0CxOJiqhzfVK6TO",
        "apple": "https://podcasts.apple.com/podcast/episode-8-did-we-not-have-rent-money/id1376764078?i=1000424787393"
      }
    },
    {
      "id": "ee785e63-2c43-44a1-9c0e-2951ec31c1af",
      "title": "Episode 7: Dallas Angry Beans",
      "description": "What do congealed baked beans, anger, sociopathy, and falling socks have to do with each other? Listen and you\u0027ll find out.",
      "release": "2018-11-25T01:22:50Z",
      "duration": "00:29:27.6790000",
      "explicit": false,
      "spotifyId": "0wtoiWE0OOxx4svsuXdc3K",
      "appleId": 1000424495480,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0wtoiWE0OOxx4svsuXdc3K",
        "apple": "https://podcasts.apple.com/podcast/episode-7-dallas-angry-beans/id1376764078?i=1000424495480"
      }
    },
    {
      "id": "ede31ea3-22a7-40d6-860d-9e7efabe6a25",
      "title": "Episode 6: Excelsior - Farewell Stan Lee",
      "description": "I had another episode planned, but then Stan Lee died. Stan was my man. He embodied so much of who and what I want to be and do. I had to devote an episode to him and to the beautiful stories that meant everything to me growing up. And still mean so very much to me now. I mention Teen Titans in this podcast- please know that I am fully aware that they are DC. And Stan was Marvel. I know. Enjoy.",
      "release": "2018-11-13T04:51:33Z",
      "duration": "00:28:22.5610000",
      "explicit": false,
      "spotifyId": "5j917mQfr1w1jvbY0zbSu1",
      "appleId": 1000423747604,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5j917mQfr1w1jvbY0zbSu1",
        "apple": "https://podcasts.apple.com/podcast/episode-6-excelsior-farewell-stan-lee/id1376764078?i=1000423747604"
      }
    },
    {
      "id": "0926c7ee-c839-4690-9ee9-d6c696d91eb7",
      "title": "Episode 5: Focus Class",
      "description": "We\u0027ve established that this was a cult. Here\u0027s where you get a look at one of the ways the cult worked on us kids. Turns out it was useful, albeit strange.",
      "release": "2018-10-30T04:39:04Z",
      "duration": "00:25:31.3060000",
      "explicit": false,
      "spotifyId": "3mVNSaRpmIwG1SFezC8pHf",
      "appleId": 1000422840486,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mVNSaRpmIwG1SFezC8pHf",
        "apple": "https://podcasts.apple.com/podcast/episode-5-focus-class/id1376764078?i=1000422840486"
      }
    },
    {
      "id": "4bbf12d9-7ca2-4d50-9693-a00dde2a1c69",
      "title": "Episode 4: Liar Liar Pants on Fire",
      "description": "This is a slightly different set of stories, a bit more personal. I used lying as a coping strategy for my situation. I share my goofiest and best ones here.",
      "release": "2018-10-19T05:29:34Z",
      "duration": "00:27:37.2400000",
      "explicit": false,
      "spotifyId": "6fwwemmgpUaqDgQEAohTqi",
      "appleId": 1000422165242,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6fwwemmgpUaqDgQEAohTqi",
        "apple": "https://podcasts.apple.com/podcast/episode-4-liar-liar-pants-on-fire/id1376764078?i=1000422165242"
      }
    },
    {
      "id": "22ffb416-a6c8-4234-a4e5-fb4ce53a8a42",
      "title": "Episode 3: A Cult Kid and Libraries Saved Me",
      "description": "Here\u0027s your long-awaited episode three. I talk about what being a kid in this cult was like-- our living arrangements, who took care of us, moving a lot, and how that turned me into a breathing ball of fury. Also, libraries very likely saved my life.",
      "release": "2018-08-30T05:41:08Z",
      "duration": "00:36:17.5200000",
      "explicit": false,
      "spotifyId": "6b7PHAAMjcClsGCGO6RnRl",
      "appleId": 1000418815180,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6b7PHAAMjcClsGCGO6RnRl",
        "apple": "https://podcasts.apple.com/podcast/episode-3-a-cult-kid-and-libraries-saved-me/id1376764078?i=1000418815180"
      }
    },
    {
      "id": "3a1bb453-1ea0-4a9b-b1f5-982e0130526f",
      "title": "Episode 2: Rituals and Friends and Poetry",
      "description": "In which there is admittedly some rambling- all of it interesting, but I talk about Sundays, meeting my lifelong best friend and worst enemy (the same guy), and how we were taught to lie.",
      "release": "2018-04-26T16:49:21Z",
      "duration": "00:31:03.1920000",
      "explicit": false,
      "spotifyId": "3TBuEbyU8bf8YQdiui7xt0",
      "appleId": 1000409975654,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3TBuEbyU8bf8YQdiui7xt0",
        "apple": "https://podcasts.apple.com/podcast/episode-2-rituals-and-friends-and-poetry/id1376764078?i=1000409975654"
      }
    },
    {
      "id": "fe616b12-aa10-4a6b-91e2-88e72fff103b",
      "title": "Episode 1: Context and Boxing",
      "description": "The very first episode where I talk through the history of the Process/Foundation/Best Friends- through my perspective. A few story tidbits, including some brother worship on my part. More on cult practices and rituals in the next episode. Please review, share, spread the word. You can support by clicking the link or even Venmo at @Jared-Garrett-writes.",
      "release": "2018-04-25T07:59:55Z",
      "duration": "00:30:16.5920000",
      "explicit": false,
      "spotifyId": "69xHsSnLltgOPWmdiIXUxF",
      "appleId": 1000409837409,
      "subjects": [
        "Process Church of the Final Judgement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/69xHsSnLltgOPWmdiIXUxF",
        "apple": "https://podcasts.apple.com/podcast/episode-1-context-and-boxing/id1376764078?i=1000409837409"
      }
    }
  ]
}