{
  "id": "bbd5216c-00b8-4c68-932e-ae964498f95d",
  "name": "TalkTV",
  "youTubeChannelId": "UCm0yTweyAa0PwEIp0l3N_gA",
  "episodes": [
    {
      "id": "7ad27b5e-8f7c-4dde-8e1f-f85123a3a6e3",
      "title": "\u0022A Very Harrowing Story...\u0022 | Jeffrey Epstein Victim Shares Her Story On Meeting Andrew On Island",
      "description": "Andrew Mountbatten-Windsor’s move from his Windsor mansion to the King’s Sandringham Estate has received a cold reception from some of the locals.\n\nPress photographers and TV crews gathered near the entrance to a driveway to Wood Farm Cottage, where Andrew is reported to be staying temporarily, on Wednesday.\n\nA usually quiet lane in the village of Wolferton, by St Peter church, was parked up with cars and a helicopter hovered overhead.\n\nIt is understood the former duke’s new home of nearby Marsh Farm is not yet fully ready but he is expected to move in by the start of April.\n\nTalk\u0027s Kevin O\u0027Sullivan is joined by Jeffrey Epstein victim Lisa Phillips.\n\nHave you got a story? Email tips@talk.tv\n\nClick here for more from Talk https://talk.tv\n\nIf you need any help visit: https://talk.tv/helplines\n\n#jeffreyepstein #epsteinfiles #epsteinisland",
      "release": "2026-02-06T17:45:02Z",
      "duration": "00:11:18",
      "explicit": false,
      "youTubeId": "WUrdp73rodI",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WUrdp73rodI"
      }
    },
    {
      "id": "9dd6f93c-5f4d-40a2-93cc-209af603d9ec",
      "title": "“My Parents Forced Me To Marry The Cult Leader Age 3” Traumatic Account Of How To Survive A Cult",
      "description": "Serena Kelley was born into the Children of God in the Philippines in 1983. At three years old, Serena was given to the Supreme Leader David Berg as a child bride by her mother. \n\nIt was in his household that she alleges facing constant mental, physical and sexual abuse and being forced to appear in child pornography videos. \n\nThe group, which was founded in 1968 by Berg, began as a new religious movement focused on spreading the Christian message. \n\nBut, as the decades progressed and the group evolved, it began to attract the attention of the international media with regards to its practices involving children. \n\nAnd even after she escaped to the US aged 18 in 2001, it took her years to come to terms with the bottled up trauma from her childhood. \n\nBut in 2017, she began her training to become a Trauma Recovery Specialist, becoming the person she wished she had had when she was looking for help. \n\nThis is her story. \n\nClick here for more from TalkTV https://talk.tv\n\nIf you need any help visit: https://talk.tv/helplines\n\n#cult #cults #survival #survivor",
      "release": "2023-08-30T17:00:10Z",
      "duration": "00:15:46",
      "explicit": false,
      "youTubeId": "EGfd0YvPYco",
      "subjects": [
        "Children Of God",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EGfd0YvPYco",
        "internetArchive": "https://archive.org/details/youtube-EGfd0YvPYco"
      }
    }
  ]
}