{
  "id": "7aa08dec-d3b3-4ec6-9e18-611620495205",
  "name": "Talking Royals",
  "spotifyId": "4HFwds9BJLjIQHrIZEpPBl",
  "appleId": 1433740386,
  "youTubeChannelId": "UC1JGJjW2QOXb_iZNcZaPCGA",
  "episodes": [
    {
      "id": "9932f927-7950-4451-9ff7-fe27b0afc387",
      "title": "How was this iconic image of Andrew Mountbatten-Windsor leaving a police station captured?",
      "description": "It’s the photo that will define a moment in history for the royal family. \n\nA press photographer captured the split second that the former Prince Andrew was driven away from a Norfolk police station after being arrested.\n\nSo how was the iconic photo of Andrew Mountbatten-Windsor captured? \n\nOur royal experts, Chris and Lizzie, tell Charlene everything they have learned about that moment, the historic arrest and release of a former Prince.\n\nThis week, Andrew became the first member of the royal family to be arrested in more than 350 years.\n\nSo is this a constitutional crisis for King Charles? Or can he weather the storm?\n\n1:02 An historic week for the royal family\n2\u002700 The story behind the iconic press photograph of Andrew Mountbatten-Windsor, in the back of a car, leaving a Norfolk police station\n4\u002750 Are the royal family in crisis mode?\n5:15 Analysis of the King\u0027s unprecedented statement on the arrest of his brother, the former Prince Andrew\n10:24 How Andrew, the Falklands war hero, fell from grace?\n18:35 Did President Trump inadvertently confirm the King\u0027s visit to the USA?",
      "release": "2026-02-20T18:11:23Z",
      "duration": "00:21:58",
      "explicit": false,
      "spotifyId": "2zjfROLNvROhWDdhyjC5SR",
      "appleId": 1000750699603,
      "youTubeId": "LnFpSgjFIuc",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zjfROLNvROhWDdhyjC5SR",
        "apple": "https://podcasts.apple.com/podcast/how-was-this-iconic-image-of-andrew-mountbatten/id1433740386?i=1000750699603",
        "youtube": "https://www.youtube.com/watch?v=LnFpSgjFIuc"
      }
    },
    {
      "id": "4f5e0722-c1bb-479b-926c-660ce459057d",
      "title": "Did the Palace response to the Andrew-Epstein allegations go far enough?",
      "description": "What happened when Prince William decided to speak out on Andrew Mountbatten-Windsor’s connection to Jeffrey Epstein? And did the statement go far enough? Listen as Chris and Lizzie describe how it all unfolded, while they were in Saudi Arabia with Prince William. They talk us through how they found out that Kensington Palace, and Buckingham Palace, decided to end the royal wall of silence, addressing the allegations against the former-Prince Andrew. So what did Buckingham Palace’s statement on Andrew say? How does Prince William really feel about his uncle, Andrew Mountbatten-Windsor? And what are the police now looking into? A reminder, that ITV News have put the latest allegations to Andrew Mountbatten-Windsor who did not respond, and when he was previously approached for a response he strenuously denied all wrongdoing.",
      "release": "2026-02-13T20:15:00Z",
      "duration": "00:31:27.4510000",
      "explicit": false,
      "spotifyId": "4Aws3GWW8Uzay3LepS9Vxk",
      "appleId": 1000749657362,
      "youTubeId": "lCexlRgX2gE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Aws3GWW8Uzay3LepS9Vxk",
        "apple": "https://podcasts.apple.com/podcast/did-the-palace-response-to-the-andrew-epstein/id1433740386?i=1000749657362",
        "youtube": "https://www.youtube.com/watch?v=lCexlRgX2gE"
      }
    },
    {
      "id": "8f2a9031-a8aa-4274-b04b-f8054c2d5a29",
      "title": "Andrew Mountbatten-Windsor and the Epstein files: Everything you need to know",
      "description": "In this special Q\u0026A episode, our #royal experts answer some of the most asked questions on Andrew Mountbatten-Windsor.\n\nIs Andrew Mountbatten-Windsor still in the line of succession to the throne?\n\nHow does Andrew Mountbatten-Windsor fund his lifestyle?\n\nHave British police ever looked into Andrew Mountbatten-Windsor?\n\nDo we know what the royal family think about what\u0027s happening with the former Prince Andrew?\n\nWill the man formally known as Prince Andrew ever have to testify?\n\nOver the past two weeks, the royal family has been rocked by the inclusion of the man formally known as Prince Andrew in the Epstein files.\n\n References to Andrew appear in some of the three million documents released by the US Department of Justice.\n\nThis episode was recorded before a statement was released from the Prince and Princess of Wales on the subject of the Epstein files.\n\nA reminder, that Andrew Mountbatten-Windsor strenuously denies all wrongdoing, and that appearing in the Epstein files is not an indication of any guilt or wrongdoing.",
      "release": "2026-02-09T13:09:51Z",
      "duration": "00:13:02",
      "explicit": false,
      "youTubeId": "CM71b_nI-H0",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CM71b_nI-H0"
      }
    },
    {
      "id": "b2650a0b-6b70-48b2-a216-901631d2b839",
      "title": "Is this the biggest royal scandal in living memory?",
      "description": "As the latest Epstein files uncover more claims about Andrew Mountbatten-Windsor, the former Prince moves out of his royal mansion in the dead of the night. But who told him it was time to go?\n\nOur royal experts delve into the latest drop, and question whether the late Queen Elizabeth II could have done more to intervene after allegations against her son?\n\nAndrew Mountbatten-Windsor strenuously denies all allegations of wrongdoing.\n\nSubscribe to ITV News on YouTube: http://bit.ly/2lOHmNj\nGet breaking news and more stories at http://www.itv.com/news\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram:  / itvnews \nFollow ITV News on Facebook:  / itvnews \nFollow ITV News on X:  / itvnews",
      "release": "2026-02-06T19:48:32Z",
      "duration": "00:39:21",
      "explicit": false,
      "spotifyId": "3Un1qKiomG5BTZNKpATlP1",
      "appleId": 1000748580451,
      "youTubeId": "TFEYEdUg5fg",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Un1qKiomG5BTZNKpATlP1",
        "apple": "https://podcasts.apple.com/podcast/is-this-the-biggest-royal-scandal-in-living-memory/id1433740386?i=1000748580451",
        "youtube": "https://www.youtube.com/watch?v=TFEYEdUg5fg"
      }
    },
    {
      "id": "70664af6-4de8-4da6-b37e-f63435c9ee6f",
      "title": "Andrew and Fergie face intense scrutiny after latest Epstein files",
      "description": "Andrew Mountbatten-Windsor is facing intense scrutiny after the latest release of three million Jeffrey Epstein files.\n\nCharlene, Chris and Lizzie have recorded this special episode on what the latest #Epstein revelations mean for the former Prince, and how it will impact the wider #royal family.\n\nPreviously unseen photos appear to show Andrew crouched over an unidentified woman. The undated images have no caption but appear to show the former duke touching the woman’s stomach.\n\nVarious emails also reveal the extent of the friendship between the former royal couple and Jeffrey Epstein. Screenshots and scans appear to show Andrew exchanged emails with Jeffrey Epstein about a “beautiful” Russian woman and invited him to Buckingham Palace in 2010. This raises questions about Andrew’s earlier claims he had cut contact with the convicted paedophile after Epstein’s conviction.",
      "release": "2026-02-02T20:12:07Z",
      "duration": "00:19:17",
      "explicit": false,
      "spotifyId": "1KTUOxseBeyV9ms3DtlsOq",
      "appleId": 1000747757386,
      "youTubeId": "4qJXDS7ggXo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1KTUOxseBeyV9ms3DtlsOq",
        "apple": "https://podcasts.apple.com/podcast/andrew-and-fergie-face-intense-scrutiny-after-latest/id1433740386?i=1000747757386",
        "youtube": "https://www.youtube.com/watch?v=4qJXDS7ggXo"
      }
    }
  ]
}