{
  "id": "3c6fb81c-0612-4b4e-bf93-ff1dda3850c3",
  "name": "Tara Voss",
  "youTubeChannelId": "UC7QoSn1inpR9lC1QNQnVEUA",
  "episodes": [
    {
      "id": "5190e3a6-4012-4918-8ccf-6cce770b0ab9",
      "title": "How Are People Still Falling for This?? | The Cult Psychology and Emotional Addiction of Modern MLMs",
      "description": "Why do smart, self-aware people still fall for MLMs?\nThis video unpacks how they use cult-like tactics, emotional manipulation, and behavioral psychology to hook people — and why it’s so hard to walk away. We’ll also explore the psychology of high-ranking leaders, the dark triad traits behind the manipulation, and the real cost of chasing someone else’s version of freedom.\n\nNote: Public examples are used to illustrate broader patterns — not to judge individuals. \n***********\nCreator Intent Disclaimer:\nThis is an opinion-based video created for entertainment, cultural commentary, and reflective exploration. It is not intended to incite hate, harassment, or bullying toward any individual. Public examples are used to explore how certain behaviors or dynamics are perceived — and what those perceptions reveal about culture, media, and human behavior more broadly.\nThe goal is not to educate in an academic sense or offer expert conclusions, but to invite curiosity, critique, and thoughtful reflection on the systems we participate in.\n\nFair Use Disclaimer:\nThis video contains copyrighted material used under the guidelines of fair use for the purposes of commentary, education, and cultural critique. No copyright infringement is intended. If you are the copyright holder or represent one and have concerns about the use of any material, please reach out via the contact email listed on my channel.\n\n************\n\nIntro - 00:00\nPart 1: The Bait - 02:27\nPart 2: The Trap  - 08:43\nPart 3: The Predator - 22:34\nPart 4: The Cost - 30:08",
      "release": "2025-07-06T21:35:31Z",
      "duration": "00:34:35",
      "explicit": false,
      "youTubeId": "956N_-voS-8",
      "subjects": [
        "Multi-Level Marketing",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=956N_-voS-8"
      }
    }
  ]
}