{
  "id": "2e41963c-b6d4-402e-a35e-c118d2ad9aa7",
  "name": "Tara Palmeri",
  "spotifyId": "3kgamV3lbZIGIHW2H0XUTR",
  "appleId": 1811176978,
  "youTubeChannelId": "UCev9TXKm5GiaebXHjp-xJnA",
  "episodes": [
    {
      "id": "d863bc9b-09c8-4215-b767-ab39f682764f",
      "title": "Ghislaine Maxwell Testified Before Congress — and Lawmakers Reviewed Unredacted Epstein Files",
      "description": "What would happen if Ghislaine Maxwell testified before Congress and the unredacted Epstein files exposed the full network of powerful figures who escaped scrutiny?\n\nOn this explosive episode of the Tara Palmeri Show, Katy Tur breaks down Ghislaine Maxwell\u0027s appearance before lawmakers where she invoked the Fifth Amendment on nearly every question, her lawyer hinting at potential clemency from President Trump as the only way she might cooperate. The discussion explores why Maxwell spoke freely for hours with Deputy Attorney General Todd Blanch yet stonewalled Congress, her transfer to the lenient \u0022Club Fed\u0022 prison despite her sex trafficking conviction, and survivor accounts portraying her as the more insidious figure in the grooming and abuse of underage girls. Joined by experts including Sam Stein, Tom Dupree, and Sarah Fitzpatrick, the conversation delves into bipartisan elite connections shielding the conspiracy, conflicting explanations around her DOJ meeting, the lack of prosecutions against other high-profile names mentioned in files, survivor frustration with stalled investigations, and the limited fallout in the U.S. compared to international pressure in cases like the UK\u0027s.\n\nWhat inconsistencies in the handling of the Epstein files and Maxwell\u0027s treatment disturb you the most?\n\nFor more of her reporting, subscribe to her weekly newsletter, \u0022The Red Letter.\u0022 https://tarapalmeri.substack.com/\nhttps://www.tarapalmeri.com/subscribe\n\nLatest from the Red Letter:\nhttps://www.tarapalmeri.com/p/meet-floridas-racist-troll-candidate\nhttps://www.tarapalmeri.com/p/live-with-bill-bishop-the-world-order\nhttps://www.tarapalmeri.com/p/the-epstein-files-and-the-prosecutor\n\nTo support her mission of independent journalism, consider donating to her GoFundMe account: https://gofund.me/0c46f9a5\n\nTara Palmeri is one of the most feared and fearless reporters covering power and politics. She has 15 years of experience covering national politics and foreign affairs. She was formerly a White House Correspondent for ABC News where she covered the first Trump administration. She was the chief National Correspondent for POLITICO during the Biden administration. She has been a political analyst for CNBC, CBS and CNN. She started her career as a columnist for the Washington Examiner and then went on to report for the New York Post. She was a foreign correspondent for POLITICO Europe, where she covered international affairs, including Brexit. She hosted the Ringer\u0027s political podcast \u0022Somebody\u0027s Gotta Win\u0022 and wrote a column for Puck. Tara also hosted two acclaimed podcasts on Jeffrey Epstein, \u0022Broken: Jeffrey Epstein\u0022 and \u0022Power: The Maxwells.\u0022 Tara currently hosts the Tara Palmeri Show.\n\nListen to the \u0027Tara Palmeri Show\u0027:\nApple\nhttps://apple.co/4lWeFuo\niHeartRadio\nhttps://iheart.com/podcast/273622585/\nAmazon Music\nhttps://music.amazon.com/podcasts/cdfe747e-54a2-47ae-9ec5-15957642e533/the-tara-palmeri-show\nSpotify\nhttps://open.spotify.com/show/3kgamV3lbZIGIHW2H0XUTR?si=1ffdbb566a964bc1\n\nNew videos from Tara are released 5PM EST on weekdays and Sunday\nhttps://www.youtube.com/@TaraPalmeri\n\nFollow Tara:\nhttps://www.instagram.com/tarapalmeri/\nhttps://x.com/tarapalmeri\nhttps://www.tiktok.com/@tarapalmeri\n\nFor inquiries, email: TaraPalmeriInfo@gmail.com\n\n#Epstein #JeffreyEpstein #GhislaineMaxwell #EpsteinFiles #EpsteinList #Trump #Politics #EpsteinIsland #TaraPalmeriShow #TaraPalmeri\n\nGhislaine Maxwell Testified Before Congress — and Lawmakers Reviewed Unredacted Epstein Files\nChapters:\n00:00 Welcome to the Tara Palmeri Show\n02:05 Survivor describes Maxwell as worse than Epstein\n04:07 Tara joins Katy Tur Reports on MSNow\n05:19 Maxwell\u0027s plea to the Fifth and clemency ploy\n07:21 Trump refuses to rule out Maxwell clemency\n10:36 Bipartisan elite network shielded Epstein conspiracy\n14:14 Survivors push for more Epstein prosecutions\n17:49 Thanks for watching the Tara Palmeri Show",
      "release": "2026-02-09T21:40:07Z",
      "duration": "00:18:25",
      "explicit": false,
      "spotifyId": "20SOos3cMFnvysVMl8EN43",
      "appleId": 1000748978211,
      "youTubeId": "gmxjoctR0AE",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20SOos3cMFnvysVMl8EN43",
        "apple": "https://podcasts.apple.com/podcast/ghislaine-maxwell-testified-before-congress-and/id1811176978?i=1000748978211",
        "youtube": "https://www.youtube.com/watch?v=gmxjoctR0AE"
      }
    }
  ]
}