{
  "id": "89fb995a-3217-4702-89cd-68f6fe53640e",
  "name": "Tash Delek",
  "youTubeChannelId": "UCDauFkmDKtSBZ_FP-7nFUvw",
  "episodes": [
    {
      "id": "c79c388a-6f29-494b-b184-5d366b2a6bbc",
      "title": "Dalai Lama about Sogyal Rinpoche and Rigpa with students from the University of California",
      "description": "Excerpt from a live webcast of His Holiness the 14th Dalai Lama’s interaction with students from the University of California, San Diego at his residence in Dharamshala. | 6 Sep 2017\n\nTranscript:\n\n\u0022In the west when I use the word ‘secular’ some of my friends say secular means a little bit negative towards religion. You see, it’s understandable, during the French Revolution and the Bolshevik Revolution in Russia there is some sort of tendency (of a) negative attitude towards religion. That actually is not religion, but religious institution. Religion, real religion, means love. Even animal(s) appreciate love. So nobody can (be) against religion, or love. But, you see, these institution(s), frankly speaking, I think (in) many cases religious teachers or religious spiritual leaders or institution(s), frankly speaking, in some cases (are) rotten. (HHDL puts his tongue out.)\n\n\u0022So, it’s worthwhile to (HHDL makes a fist) against these things. During French Revolution, before that, the elite, or kings or queens, elite people very much related with religious institution. So, they got benefit from these group(s) so automatically they support them. So, when people really suffer due to exploitation, then people should develop courage in order to topple that institution. They also need courage to (go) against religious institution. Isn’t it? What do you think?\n\n\u0022Now recently in Haryana some problems, now you know (HHDL is pointing towards audience). So the Dharma, use name of Dharma (for) exploitation. They themselves not properly practised these Dharma, including some Tibetan Lama also like that. \n\n\u0022Now recently in America, Rigpa, you may (have) heard Rigpa Dharma Centre, the leader, I know him. Now recently one open letter, or against, full of criticism about that person. So, therefore, religious institution quite often, you see, spoilt, not caring (about) the real sort of message of religion, but rather use the name of religion. Religion used (as an) instrument for exploitation. So French Revolution and Russian Bolshevik Revolution, some tendency against religion because of that.\n\n\u0022So, when I say ‘secular’ some of my friend(s) have a little sort of reservation. But in this country (India) secular means respect (for) all religion and also, I think, one unique thing is according (to the) Indian concept of secularism, secular (is also) respect (for) non believer.\u0022\n\nDetails about the discussion: http://tibet.net/2017/09/there-will-be-a-live-webcast-of-his-holiness-the-dalai-lama-interacting-with-students-from-the-university-of-california-san-diego-at-his-residence-in-dharamsala/\n\nDetails about alleged abuse: Süddeutsche Zeitung International (Dr. Michaela Haas): \u0022The Tibetan Book of Living and Lying\u0022 http://international.sueddeutsche.de/post/164130948510/the-tibetan-book-of-living-and-lying\n\nBuddhism Controversy Blog: \u0022Abuse: Letter to Sogyal Rinpoche From Long Term Rigpa Students\u0022 https://buddhism-controversy-blog.com/2017/07/22/abuse-letter-to-sogyal-rinpoche-from-long-term-rigpa-students/",
      "release": "2017-09-06T15:42:29Z",
      "duration": "00:03:50",
      "explicit": false,
      "youTubeId": "2fWZWwSSkXs",
      "subjects": [
        "Rigpa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2fWZWwSSkXs"
      }
    },
    {
      "id": "420e61f6-34d2-4c3a-b6dc-52783ae96703",
      "title": "\u0022In the Name of Enlightenment - Sex Scandal in Religion\u0022 - About Sogyal Rinpoche",
      "description": "Süddeutsche Zeitung International: The Tibetan Book of Living and Lying http://international.sueddeutsche.de/post/164130948510/the-tibetan-book-of-living-and-lying\nLetter to Sogyal Rinpoche by senior Rigpa members (14 July 2017) \u0026 its consequences so far:\nhttps://buddhism-controversy-blog.com/2017/07/22/abuse-letter-to-sogyal-rinpoche-from-long-term-rigpa-students/\nMary Finnigan: http://www.guardian.co.uk/commentisfree/belief/2011/jul/01/lama-sex-abuse-sogyal-rinpoche-buddhist\nInterview with Mary Finnigan: http://www.mythicistmilwaukee.com/mythicistmilwaukeeblog/2016/11/12/jqxrww2sh7z8pfgowiorn65v3wr5s6\nMarion Dapsance: https://www.academia.edu/8283817/_When_Fraud_is_Part_of_a_Spiritual_Path_A_Tibetan_Lamas_Play_on_Reality_and_Illusion_\nInterview with Olivier Raurich: http://buddhism-controversy-blog.com/2016/03/09/sogyal-rinpoche-rigpa-an-interview-with-the-former-director-of-rigpa-france-olivier-raurich/\nInterview with Mimi: https://buddhism-controversy-blog.com/2016/12/01/lock-the-door-i-was-devoted-to-a-great-buddhist-master-and-then-i-quit-by-mimi-former-dakini/\nInterview with Marion Dapsance: https://buddhism-controversy-blog.com/2016/12/01/submission-devotion-and-sexual-abuse-my-investigation-of-buddhism-in-france/\nInterview with Oane Bijlsma: https://buddhism-controversy-blog.com/2017/06/21/abuse-in-the-buddhist-community-this-victim-tells-her-story-for-the-first-time/",
      "release": "2012-09-21T12:39:51Z",
      "duration": "00:21:07",
      "explicit": false,
      "youTubeId": "yWhIivvmMnk",
      "subjects": [
        "Rigpa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yWhIivvmMnk"
      }
    }
  ]
}