{
  "_ts": 0,
  "id": "87ff530b-4273-48b8-8d98-1375fdd679dc",
  "name": "Taste0ftruth Tuesdays",
  "spotifyId": "7kbrkigAkhL7mTbg3cvyf1",
  "appleId": 1722952794,
  "youTubeChannelId": "UCIAoN4CNht4xyc4g82Ul57w",
  "episodes": [
    {
      "id": "3ece188e-ac1d-42e3-8299-b7f5b1f8fff3",
      "title": "Escaping One Cult, Joining Another? The Trap of Ideological Echo Chambers",
      "description": "Welcome back! In this episode Megan Leigh tackles a personal experience that underscores a troubling trend within the “critical thinking” communities—communities that claim to be open to questioning and dialogue but often shut down dissenting views. Episode blog \u0026#x1f517; In this episode, we’ll cover: The DARVO Tactic: What happens when questioning turns into exile. Megan explores the manipulative tactic of Deny, Attack, Reverse Victim and Offender, commonly used by high-control groups, abusers, and surprisingly, some “critical thinking” communities. How MLMs Use DARVO: A deep dive into how MLMs (Multi-Level Marketing schemes) use this psychological tactic to silence critics and keep people trapped in a system of manipulation. The Hypocrisy of Selective Skepticism: How figures like Brandie, who claim to fight misinformation, inadvertently fall into the same patterns of selective skepticism when it comes to the food industry, dietitians, and processed foods. The Problem with Experts: Megan discusses the dangers of blindly trusting “credentialed experts” without considering potential conflicts of interest, especially when it comes to the health and wellness industry, Big Food, and Big Pharma. Intellectual Humility vs. Ideological Rigidity: The importance of intellectual humility in the face of challenging ideas and how the obsession with data and science has become a new form of dogma, silencing dissent and critical inquiry. Why This Matters: Megan delves into the tension between questioning accepted narratives and being labeled a conspiracy theorist or extremist, pointing out the importance of maintaining intellectual curiosity while avoiding the traps of ideological extremes. What happens when we leave one cult-like belief system only to fall into another? Is this really freedom? Tune in for an episode that challenges both the content and the way we think about the conversations we’re having in these spaces. \u0026#x1f64f; Please help this podcast reach a larger audience in hope to edify \u0026 encourage others! To do so: leave a 5⭐️ review and send it to a friend! Thank you for listening! I’d love to hear from you, find me on Instagram! ⁠⁠⁠ @taste0ftruth⁠⁠⁠ , @megan_mefit , ⁠⁠⁠ Pinterest! ⁠⁠ ⁠ Substack and on X!",
      "release": "2025-03-18T04:00:00Z",
      "duration": "00:27:13.6630000",
      "explicit": true,
      "spotifyId": "4A1yl81sHENlhDd1M6gFxP",
      "appleId": 1000699591248,
      "youTubeId": "GdO0-AwiENA",
      "subjects": [
        "Multi-Level Marketing",
        "Cult Psychology",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4A1yl81sHENlhDd1M6gFxP",
        "apple": "https://podcasts.apple.com/podcast/escaping-one-cult-joining-another-the-trap/id1722952794?i=1000699591248",
        "youtube": "https://www.youtube.com/watch?v=GdO0-AwiENA"
      }
    },
    {
      "id": "a940a890-fcea-48cf-9cd6-603f892165e4",
      "title": "Deconstructing Deception: MLMs, Exploitation \u0026 Online Influencers",
      "description": "Welcome to Taste0ftruth Tuesdays! Today, we dive into the murky waters of high control groups like MLMs, conspiracies and evangelicalism. We discuss about how exploitation is huge in these environments. And I share a bit more about my journey from MLM entanglement to pandemic conspiracies and high-control religion. We\u0027ll explore: Lobbyism \u0026 Amway \u0026#x1f6d1; Enagic\u0027s Kangen Water Scandal - Discover how MLMs like Enagic exploit financial gaps and spread dangerous misinformation. \u0026#x1f64f; Faith and Finance - Why are Christian women particularly vulnerable to MLM schemes ? We delve into the factors and how to spot the red flags. \u0026#x1f469;‍\u0026#x1f3eb; Influencers and Ideologies - How influencers like Girl Defined mask harmful beliefs behind seemingly appealing facades. \u0026#x1f3a7; Podcasting Insights - Hear about the joys and challenges of podcasting, from trusting your instincts to finding joy in the creative process. Join us for an eye-opening episode that tackles the intersections of gender, culture, business, and control. Don’t miss out on these compelling insights! \u0026#x1f680; DISCLAIMER: The views and opinions expressed in this episode are solely those of the host and guest and do not necessarily reflect the official policy or position of any company, organization, or individual mentioned. This episode contains personal opinions and interpretations which are protected under fair use for the purposes of commentary and critique. Any claims made about multi-level marketing (MLM) companies in general are intended to address industry-wide practices and do not necessarily apply to the specific company discussed in this episode. Furthermore, statements made by distributors or former distributors are their personal opinions and experiences and do not represent the official views or positions of the company in question. Listeners are encouraged to conduct their own research and form their own opinions. Thank you for tuning in. \u0026#x1f64f; Please help this podcast reach a larger audience in hope to edify \u0026 encourage others! To do so: leave a 5⭐️ review and send it to a friend! Thank you for listening! I’d love to hear from you, find me on Instagram! ⁠⁠⁠ @taste0ftruth⁠⁠⁠ or ⁠⁠⁠ Pinterest! ⁠⁠ ⁠",
      "release": "2024-07-23T04:00:00Z",
      "duration": "00:41:23.4200000",
      "explicit": true,
      "spotifyId": "4YGRWHFYZfRLQH4cid66ke",
      "appleId": 1000663050388,
      "youTubeId": "4XmK2pXE3gI",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4YGRWHFYZfRLQH4cid66ke",
        "apple": "https://podcasts.apple.com/podcast/deconstructing-deception-mlms-exploitation-online-influencers/id1722952794?i=1000663050388",
        "youtube": "https://www.youtube.com/watch?v=4XmK2pXE3gI"
      }
    },
    {
      "id": "98f701d3-886b-496c-893b-28674d404d74",
      "title": "Mindsets and Movements: Comparing Law of Attraction, High Control Religion, \u0026 Diet Culture",
      "description": "Welcome to Taste0ftruth Tuesdays, where today’s topic is Mindsets and Movements: Comparing Law of Attraction, High Control Religion, and Diet Culture Tune in as we uncover the highs, lows, and everything in between of this cosmic mind game. As always, stay until the end, we\u0027ll share some tips on how to keep your mental mojo balanced. So, let’s walk that fine line between harnessing the power of our minds and falling into the traps of unrealistic expectations and self-blame. Episode blog \u0026#x1f64f; Please help this podcast reach a larger audience in hope to edify \u0026 encourage others! To do so: leave a 5⭐️ review and send it to a friend! Thank you for listening! I’d love to hear from you, find me on Instagram! ⁠⁠⁠ @taste0ftruth⁠⁠⁠ or ⁠⁠⁠ Pinterest! ⁠⁠ ⁠",
      "release": "2024-07-16T04:00:00Z",
      "duration": "00:19:18.7680000",
      "explicit": false,
      "spotifyId": "2IGiVnLbtpe0l6c19ig9NE",
      "appleId": 1000662363985,
      "youTubeId": "1QN7w_FrFTk",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2IGiVnLbtpe0l6c19ig9NE",
        "apple": "https://podcasts.apple.com/podcast/mindsets-and-movements-comparing-law-of-attraction/id1722952794?i=1000662363985",
        "youtube": "https://www.youtube.com/watch?v=1QN7w_FrFTk"
      }
    },
    {
      "id": "1a109336-8c3c-4dc0-9f99-92e3f61937f6",
      "title": "Unveiling the Influence: Social Media\u0027s Role in Recruitment and Brainwashing",
      "description": "Welcome back to Taste0ftruth Tuesdays! Today, we\u0027re hopping back on the wild ride through my personal journey of radicalization into high control religion and some eye-opening trends in today\u0027s world. \u0026#x1f3a2; Have you heard about the \u0022crunchy hippie to alt-right pipeline\u0022? It\u0027s this wild phenomenon where people who start off into alternative wellness and New Age practices slowly get exposed to far-right ideologies. Thanks to social media algorithms and some pretty persuasive influencers who mix wellness content with conspiracy theories and extreme views, this shift happens without you even noticing. \u0026#x1f33f;➡️\u0026#x1f6d1; So, what are the key points of this pipeline? How does social media fit into all this? \u0026#x1f4f1;\u0026#x1f933; We\u0027re breaking it down in today\u0027s episode, and trust me, you don\u0027t want to miss it. Grab your headphones and let\u0027s get into it! \u0026#x1f3a7;\u0026#x1f525; Unveiling the Influence: Social Media’s Role in Recruitment and Brainwashing – Taste0ftruth Tuesdays \u0026#x1f64f; Please help this podcast reach a larger audience in hope to encourage others! To do so: leave a 5⭐️ review and send it to a friend! Thank you for listening! I’d love to hear from you, find me on Instagram! ⁠⁠⁠⁠⁠ @taste0ftruth⁠⁠⁠⁠⁠ or ⁠⁠⁠⁠⁠ Pinterest!",
      "release": "2024-07-09T04:00:00Z",
      "duration": "00:21:54.6440000",
      "explicit": false,
      "spotifyId": "6fLdryL2wP1JgpktTS6Is4",
      "appleId": 1000661610157,
      "youTubeId": "rYUhzhMW86k",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6fLdryL2wP1JgpktTS6Is4",
        "apple": "https://podcasts.apple.com/podcast/unveiling-the-influence-social-medias-role-in/id1722952794?i=1000661610157",
        "youtube": "https://www.youtube.com/watch?v=rYUhzhMW86k"
      }
    },
    {
      "id": "47ba1ffb-f1a0-4f97-b8d7-c8c77795a86a",
      "title": "Unpacking Religious Trauma: Navigating the dynamics of Faith Deconstruction ",
      "description": "Welcome back to Taste0fTruth Tuesdays! This week, we\u0027re diving deep with Dr. Mark Gregory Karris in a profound interview. With a blend of professional expertise and personal life insights, he navigates the complexities of healing and restoration, offering invaluable guidance for anyone on their journey of personal growth. Episode Blog \u0026#x1f4d6; Homepage - Mark Karris (markgregorykarris.com) Dr. Mark Gregory Karris - YouTube \u0026#x1f64f; Please help this podcast reach a larger audience in hope to edify \u0026 encourage others! To do so: leave a 5⭐️ review and send it to a friend! Thank you for listening! I’d love to hear from you, find me on Instagram! ⁠⁠⁠ @taste0ftruth⁠⁠⁠ or ⁠⁠⁠ Pinterest! ⁠⁠",
      "release": "2024-07-02T04:00:00Z",
      "duration": "00:50:50.8930000",
      "explicit": true,
      "spotifyId": "4FO6ExHR2fbLPuePUFoH5S",
      "appleId": 1000660870040,
      "youTubeId": "Y629l9_oyBM",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4FO6ExHR2fbLPuePUFoH5S",
        "apple": "https://podcasts.apple.com/podcast/unpacking-religious-trauma-navigating-the-dynamics/id1722952794?i=1000660870040",
        "youtube": "https://www.youtube.com/watch?v=Y629l9_oyBM"
      }
    },
    {
      "id": "3de0dff2-ce96-48cf-8c7f-afd3f846f192",
      "title": "From Conspiracy to Cult: Unveiling the interplay between Radicalization, Conspiracies, \u0026 Religion",
      "description": "WELCOME BACK! In this episode, we delve into the intriguing intersection of end times obsession, conspiracy theories, and the manipulation techniques employed by high-control religions. Join your host Megan Leigh as we explore the alluring pull of conspiracies intertwined with religious conversion, and the impact of radical ideologies on individuals\u0027 beliefs and behaviors. From the historical roots of premillennial dispensationalism to the modern-day influencers of end times prophecy, we unravel the complexities of these phenomena. Plus, we uncover the 8️⃣ criteria for brainwashing employed by high-control religions. Stay curious, embrace skepticism, and keep tuning in! \u0026#x1f399;️\u0026#x1f512; Episode Blog\u0026#x1f5d2;️ Radicalization, Conspiracies, and Religion: The Complex Interplay Unveiled – Taste0ftruth Tuesdays \u0026#x1f64f; Please help this podcast reach a larger audience in hope to edify \u0026 encourage others! To do so: leave a 5⭐️ review and send it to a friend! Thank you for listening! I’d love to hear from you, find me on Instagram! ⁠⁠⁠ @taste0ftruth⁠⁠⁠ or ⁠⁠⁠ Pinterest!",
      "release": "2024-06-11T04:00:00Z",
      "duration": "00:16:12.4280000",
      "explicit": false,
      "spotifyId": "3rV9jXMADCG9daMCrS1bTb",
      "appleId": 1000658552212,
      "youTubeId": "FDYNRJWVQvo",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3rV9jXMADCG9daMCrS1bTb",
        "apple": "https://podcasts.apple.com/podcast/from-conspiracy-to-cult-unveiling-the-interplay/id1722952794?i=1000658552212",
        "youtube": "https://www.youtube.com/watch?v=FDYNRJWVQvo"
      }
    },
    {
      "id": "658fb38d-9cf4-43b1-9f22-b52e10bee6b9",
      "title": "Faith Unbound: Navigating the Process of Disentanglement",
      "description": "The \u0022deconstruction of Christianity\u0022 is something I’ve heard of since stepping into the world of theology, but I never thought I’d find myself smack dab in the middle of the movement. Tune in as we explore the impacts of purity culture to uncovering abuse tactics and harmful ideologies, we\u0027ll shine a light on the truth together! PLEASE Click here for further reading/resources mentioned! Disentangling or Deconstruction is a phenomenon where individuals, often within the Christian faith, critically reevaluate their beliefs, doctrines, and practices. This process involves questioning and challenging long-held assumptions, teachings, and traditions within Christianity, with the goal of arriving at a more authentic and personally meaningful understanding of faith. \u0026#x1f64f; Please help this podcast reach a larger audience in hope to edify \u0026 encourage others! To do so: leave a 5⭐️ review and send it to a friend! Thank you for listening! I’d love to hear from you, find me on Instagram! ⁠⁠⁠ @taste0ftruth⁠⁠⁠ or ⁠⁠⁠ Pinterest!",
      "release": "2024-04-29T13:06:04Z",
      "duration": "01:02:35.0140000",
      "explicit": false,
      "spotifyId": "4JcXHNsSBQ7laBzSvebYNR",
      "appleId": 1000653928487,
      "youTubeId": "W68TbRSOkcc",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4JcXHNsSBQ7laBzSvebYNR",
        "apple": "https://podcasts.apple.com/podcast/faith-unbound-navigating-the-process-of-disentanglement/id1722952794?i=1000653928487",
        "youtube": "https://www.youtube.com/watch?v=W68TbRSOkcc"
      }
    }
  ]
}