{
  "_ts": 0,
  "id": "39f79962-887a-45bf-b720-e39a4c85a36d",
  "name": "Taylor Mouroufas",
  "youTubeChannelId": "UCDDdHiIWCAjuMAqyJ1_GRsA",
  "episodes": [
    {
      "id": "a362134d-3072-4114-adbc-4f9c3049bb23",
      "title": "How I Escaped an MLM Cult | Oil Painting \u002B Storytime",
      "description": "🎨 Welcome to my painting studio! In today’s video, I take you through a full oil painting timelapse while sharing one of the wildest experiences of my life: how I got involved with (and eventually escaped) a commercial cult (in my opinion) disguised as the best business opportunity that would lead to unimaginable success: Amway, specifically under the Worldwide Dream Builders training group.\n\nI’ll be telling my story and sharing what they don’t want you to know: what the meetings were like, how they kept people trapped, the manipulation tactics they used that are textbook culty, and what eventually made me leave. This is part storytime, part educational dive into MLM culture and cult behavior surrounding Amway all while I create a realism oil painting from start to finish. If you’ve ever been involved in MLMs or are curious about the hidden dangers, I hope this video offers clarity and solidarity. I have offered some resources below if you are interested in continuing your own research:\n\n✨ Don’t forget to like, subscribe, and leave a comment if this resonates with you! I would love to hear your stories as well.\n\nSteven Hassan’s BITE Model:\nhttps://freedomofmind.com/cult-mind-control/bite-model-pdf-download/\n\nAntiMLM Subreddit:\nhttps://www.reddit.com/r/antiMLM/?rdt=40567\n\nFTC Multi-Level Marketing Article:\nhttps://consumer.ftc.gov/articles/multi-level-marketing-businesses-pyramid-schemes\n\n#AntiMLM #Storytime #RealismArt #CultSurvivor #Amway #PaintingTimelapse #EscapeTheCult #MLMHorrorStory",
      "release": "2025-06-11T16:30:07Z",
      "duration": "00:22:21",
      "explicit": false,
      "youTubeId": "HRtnBXLQJeY",
      "subjects": [
        "Multi-Level Marketing",
        "Amway"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HRtnBXLQJeY"
      }
    }
  ]
}