{
  "id": "6576670c-ea69-497e-9e03-06f2603dd74e",
  "name": "Teal Swan Exposed",
  "youTubeChannelId": "UCNsZ32DZTfG4lrdBPGy6pHA",
  "episodes": [
    {
      "id": "7e26dbdb-01ca-434c-a128-ca84de0c7817",
      "title": "Spiritual Teacher Teal Swan\u0027s Ritual Abuse Story Investigated",
      "description": "Spiritual teacher Teal Swan claims that she was a part of a satanic cult, and was ritually tortured, and emotionally abused for thirteen years, starting at age six. She has been heavily questioned by those who have researched her story due to her inconsistent storytelling, timeline discrepancies, and improbable claims. This video takes a close look into the numerous claims Teal has made about her story. For more on Teal\u0027s ritual abuse story, visit: www.tealswanexposed.com/satanic-ritual-abuse",
      "release": "2018-04-25T12:56:06Z",
      "duration": "00:47:06",
      "explicit": false,
      "youTubeId": "hliG6MHSBmE",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hliG6MHSBmE"
      }
    },
    {
      "id": "fbf024db-29d5-49f5-9845-dc98064bb752",
      "title": "\u0022Spiritual Teacher\u0022 Teal Swan\u0027s Lust For Fame",
      "description": "Accompanying Article: https://bit.ly/2IJp7li — Cult Warning Sign: Teal Swan’s Love of Admiration – the evidence. Genuine celebrities working in the entertainment industry, don’t tend to refer to themselves as “celebrities”. But Teal, the self-proclaimed “leader of the new age”, does. She frequently describes herself as one, even using the hashtag #celebrity on her Instagram posts. She loves reminding her followers of her “fame”. Her followers are her “fans”, her community is her “entourage” and her workshops are “performances.”\n\nwww.tealswanexposed.com",
      "release": "2018-04-12T10:21:49Z",
      "duration": "00:05:13",
      "explicit": false,
      "youTubeId": "2vKWJK-xz4k",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2vKWJK-xz4k"
      }
    },
    {
      "id": "bad2dea0-1182-4c8d-ad3d-7aef014f9349",
      "title": "Teal Swan\u0027s Epic Escape From 13 Years of Ritual Abuse",
      "description": "\u0022Spiritual teacher\u0022 Teal Swan recounts three different versions of her escape from 13 years of physical and emotional abuse from being in two cults. One would think she would remember how she escaped right? It\u0027s a pretty big deal.\n\nwww.tealswanexposed.com/ritual-abuse-story",
      "release": "2018-04-09T10:22:16Z",
      "duration": "00:03:57",
      "explicit": false,
      "youTubeId": "Lsjem0o43gI",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Lsjem0o43gI"
      }
    },
    {
      "id": "fb746125-cc15-45ac-8f8b-d766906eb8a1",
      "title": "Teal Swan\u0027s - Mirror Event - Universal Reflector Is Here! But...",
      "description": "Accompanying Article: https://bit.ly/2JlAjWJ — \u0022Spiritual teacher\u0022 Teal Swan claims she is a “Universal Reflector” for her upcoming event called “The Mirror”. This self-proclamation, is in addition to the already exhaustive list of grandiose titles she has bestowed upon herself. Teal has a history of using these titles in lieu of any valid credentials in psychology. She is presumably using this “reflector” label to give credence to her mind-reading guru act.\n\n_____________________\n\nREFERENCES\n\nTeal Swan\u0027s - Mirror Event\nhttps://youtu.be/BUtCRIZzPqk\n\nTeal Swan Answers To The Allegations Made Against Her - https://youtu.be/ZhwcygYOxOc\n\nWorkshop At Philia Retreat Center, 2017-01-07\nVideo Not Published\n\nTeal Swan Instagram Daily Update #287 - bit.ly/2H64jVx\nTeal Swan - Ridiculous Hour Webinar Feb. 2017 - https://youtu.be/Mzn0CDS_XnM\n\nDo You Need Space? If So, You Are Being Inauthentic - Teal Swan - https://youtu.be/ctrylHAC5a4\n\nMiami Synchronization Workshop 2015 - www.tealswan.com\nBelonging and How to Belong - Teal Swan - https://youtu.be/9AIZK0QSk8w\n\nVancouver Synchronization Workshop - Part 4 of 4 - https://youtu.be/Ib9OyTu8OcU",
      "release": "2018-04-06T01:33:32Z",
      "duration": "00:07:23",
      "explicit": false,
      "youTubeId": "NVZSXlEAy-g",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NVZSXlEAy-g"
      }
    },
    {
      "id": "6c626597-a1c8-4d41-99ef-8cfdbad77629",
      "title": "Teal Swan\u0027s Self Proclaimed Titles of Exaltation",
      "description": "Accompanying Article: https://bit.ly/2uMYnP2 | These are not all of Teal Swan\u0027s self-proclaimed titles! She has a penchant for applying many grandiose titles for herself, and by doing so, she exalts herself... just like a cult leader. If Teal applied only a handful of titles, it\u0027s likely no one would raise an eyebrow, however, when this is combined with the many other traits Teal displays, then it becomes problematic. The danger with this lack of humility and exaltation, is that it reinforces the cult leader and follower dynamic. \n\nRead the accompanying article here:\nhttp://www.tealswanexposed.com/2018/03/28/teal-swan-grandiose-titles/",
      "release": "2018-03-28T23:47:18Z",
      "duration": "00:03:23",
      "explicit": false,
      "youTubeId": "yIE3wiYKt5Y",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yIE3wiYKt5Y"
      }
    },
    {
      "id": "5110cc32-d4ea-48df-8d40-875d2765ca04",
      "title": "Teal Swan\u0027s Dream of a Pueblo-Like Compound for her \u0022Tealers\u0022",
      "description": "Accompanying Article: https://bit.ly/2JoUhj1 | Either Teal was being facetious with all the latest negative press, centered around her being a cult leader, or she\u0027s serious. With Teal, it\u0027s typically half-truths.  www.tealswanexposed.com",
      "release": "2018-03-22T03:00:08Z",
      "duration": "00:00:58",
      "explicit": false,
      "youTubeId": "O61XZ51pBL8",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=O61XZ51pBL8"
      }
    },
    {
      "id": "0f04cb29-1bd6-44ea-b9c6-06741402019e",
      "title": "Teal Swan: The Suicide Catalyst - Disturbing Compilation - Fake Fraud Scam",
      "description": "Learn More: https://www.tealswanexposed.com/suicide | Dozens of clips, compiled into one video, covering \u0022spiritual teacher\u0022 Teal Swan\u0027s preoccupation with death and suicide. “Spiritual teacher” Teal Swan has mentioned how death would be relief to her, has a history of self-harm, and suicide attempts. She has suggested to her followers that suicide is an option, while stating, “I’m not going to advocate for suicide.” In response to this statement and more, read the Rebuttal to Teal’s Suicide Segment in “Teal Swan Answers Allegations” video [https://bit.ly/2HdgIat]. She has used inappropriate and suggestive language to convince guests that they are unhappy living, she has glorified death and suicide, projected thoughts, feelings, and beliefs onto guests such as “You are not committed to life”, and once joked about her first client’s suicide that prompted the audience to laugh. As evidenced in Teal’s Facebook group, Teal Tribe, many of her followers are suicidal [https://bit.ly/2EmU0tt], with no qualified training, and support experience - see Suicidal Posts for how Teal handles those who are suicidal in her group [https://bit.ly/2q8p8Zr]. Her teaching methods display her lack of degree, license, specialized training in trauma therapy, nor accountability. None of this behavior is “revolutionary” as she likes to describe herself and her work, it’s irresponsible, if not, dangerous. \n\nVideo Credit: The Suicide Catalyst / A.U.\n\nwww.tealswanexposed.com",
      "release": "2018-03-18T09:17:02Z",
      "duration": "00:40:54",
      "explicit": false,
      "youTubeId": "NNszAPWNWSg",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NNszAPWNWSg"
      }
    },
    {
      "id": "21047e44-e051-4524-81b8-c1a897b4e64a",
      "title": "Teal Swan On Alcoholism - Suicide Contradiction",
      "description": "In the following clips, \u0022spiritual teacher\u0022 Teal Swan misleads her followers by stating that the only source of alcoholism is loneliness, and believes that recovery could be too difficult, and \u0022suicide would be better.\u0022 She made this statement less than a month before she said that she \u0022does not advocate for suicide.\u0022\n\nhttps://www.TealSwanExposed.com/suicide\n\n____\n\nReferences\n\nOnline Workshop Sep 2017 Alcoholism\nwww.tealswan.com / Premium\n\nTeal Swan Answers To The Allegations Made Against Her\n(Exposed, Fraud, Fake, Scam)\nhttps://youtu.be/ZhwcygYOxOc",
      "release": "2018-03-17T23:02:41Z",
      "duration": "00:01:37",
      "explicit": false,
      "youTubeId": "s4NQkuyrNn8",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=s4NQkuyrNn8"
      }
    },
    {
      "id": "19aa8cd2-cf14-46b1-8932-6a775b4e41e8",
      "title": "Teal Swan\u0027s Claim of Being Sewn Into a Corpse",
      "description": "Accompanying Article: https://bit.ly/2Jkybyi | \u0022Spiritual leader\u0022 Teal Swan claims that she was sewn into a human corpse at age 8 for twelve hours. Is this even possible? Cloverdale Funeral Home in Boise, Idaho has this to say about Teal\u0027s claim: \u0022No, no, no. I mean, you can imagine, just, anybody can look at their own body [laughs] to figure that one out.\u0022\n\n____________\n\nReferences\n\nLea, Sienna. “Ep. 18: From the Depths of Hell to Happiness with Teal Swan (FKA Teal Scott)” \nhttps://youtu.be/_DpMjKZiSqE?t=7m10s\n\nSchab, Jessica. “Was Teal Swan Sewn into a Human Corpse?”\nhttp://www.jessicamystic.com/uploads/1/4/8/5/14856272/was_teal_swan_sewn_into_a_human%C2%A0corpse.pdf\n\nStone, Sacha. “Sacha Stone \u0026 Teal Swan: Face-to-Face – Part 1” https://youtu.be/ABL-C8FPoak?t=17m",
      "release": "2018-03-17T11:49:52Z",
      "duration": "00:01:40",
      "explicit": false,
      "youTubeId": "RKBSjK0zOms",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RKBSjK0zOms"
      }
    },
    {
      "id": "054a2204-63ee-41cd-b20a-2fd02122864b",
      "title": "Teal Swan Confuses Followers With Word Salad",
      "description": "Considering Teal Aggrandizes herself as an omnipotent extrasensory, but plagiarizes, could it be that the guest inadvertently was a mirror for Teal, and so Teal exposed her own inauthenticity? It is concerning that Teal projected her beliefs onto the guest that was not uplifting, confused the guest with over-complicating the judgement of her, and Teal perhaps humiliated her in front of a live audience. Plagiarism: www.tealswanexposed.com/plagiarism\n___\n\nMore on Teal Swan\u0027s word salad:\nWhile Google is Teal’s best friend, she has the notable ability for “word salad” as witnessed in her speaking engagements and in her blogs. It is a “combination of intentional manipulative conversational techniques that are designed to frustrate, confuse, and erode the sanity of the victim by getting them to question their perceptions of events, as well as their own judgment in general.” (MacKenzie). Her guests are oftentimes left perplexed and sometimes even embarrassed and humiliated in front of hundreds of attendees. Teal’s followers will confront those who question Teal’s word salad by stating they just do not have a higher level of spiritual knowledge and understanding yet. Talk about divisive elitism. That should debunk the “teachings” right there due to hypocrisy and contradictions. For examples of confused followers, watch her Synchronization Workshops",
      "release": "2018-01-15T23:49:35Z",
      "duration": "00:00:57",
      "explicit": false,
      "youTubeId": "EuJ-ezFysGU",
      "subjects": [
        "Teal Swan",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EuJ-ezFysGU"
      }
    },
    {
      "id": "320edeb2-a342-4f87-b189-aae1ac25a659",
      "title": "Teal Swan Claims She Can\u0027t Plug In Devices",
      "description": "A former member of Teal Swan\u0027s \u0022Intentional Community\u0022 stated, \u0022Teal is promising that her version of \u0027real\u0027 shadow work is going to cure even the most shell shocked and war torn veterans. Yet somehow, after all this expert shadow work on herself, Teal still feigns being unable to cope with plugging in appliances in her documentary trailer? — For what it’s worth, this is just more performance art for the camera. I personally witnessed Teal plugging in her blow dryer, phone charger, and Fallon’s laptop many times, without so much as a pause while I was living\nwith her.\u0022",
      "release": "2018-01-09T01:14:20Z",
      "duration": "00:01:10",
      "explicit": false,
      "youTubeId": "d4RlLq7LN34",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d4RlLq7LN34"
      }
    },
    {
      "id": "3f8a9a62-4815-4cfb-93b3-471a7ee87c10",
      "title": "Teal Swan Believes She\u0027s Revolutionary (Grandiosity) But Plagiarizes (Entitlement)",
      "description": "Grandiosity \u0026 Entitlement: https://www.tealswanexposed.com/cult\nPlagiarism: https://www.tealswanexposed.com/plagiarism | “Spiritual teacher” Teal Swan, who describes herself as a “Self-Help Expert” and “Leader of the New Age”, has verbatim plagiarized from a number of authors and resource websites. It is not ethical for Teal Swan to lift others’ work, and even more concerning, receive royalties for her plagiarized material.\n\nTeal Swan\u0027s behavior is a cult characteristic. She feels she\u0027s entitled to steal others\u0027 work, and is grandiose with her belief that she is revolutionary and a martyr. She places herself on the level of great historical leaders.\n\nhttps://tealswanblog.wordpress.com/2018/01/07/teal-swan-plagiarism\n\nwww.tealswanexposed.com",
      "release": "2018-01-08T07:03:17Z",
      "duration": "00:00:46",
      "explicit": false,
      "youTubeId": "0WZy76qCcWQ",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0WZy76qCcWQ"
      }
    },
    {
      "id": "9f3ac3fc-6c6b-4483-8ad1-388218fee9d4",
      "title": "Teal Swan\u0027s Titles of Exaltation: \u0022Spiritual Guide\u0022 One Of Many Examples",
      "description": "Read: Cult Warning Sign: “Spiritual teacher” Teal Swan’s Titles of Exaltation [https://bit.ly/2uMYnP2] Teal Swan has a grandiose idea of who she is; a cult leader trait. One of the issues that is gleaned from this clip, is her self-proclaimed \u0022Spiritual Guide\u0022. She has many more: Spiritual Catalyst, Extrasensory, Internationally Recognized Spiritual Leader, Spiritual Authority, Oracle, Revolutionary, Guru, Seer, Spiritual Luminary, International Spiritual Luminary, Leader of an Authenticity Movement, and Self-Help Expert. www.tealswanexposed.com",
      "release": "2018-01-07T07:28:13Z",
      "duration": "00:02:14",
      "explicit": false,
      "youTubeId": "cPQZBPw3Bb4",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cPQZBPw3Bb4"
      }
    },
    {
      "id": "e403fe12-b33f-4250-b977-5fd9565fba5a",
      "title": "Cult Warning Sign: Teal Swan\u0027s Grandiosity \u0022Message From The Universe\u0022",
      "description": "Cult Warning Signs: https://www.tealswanexposed.com/cult | Teal states, “Now, I want you to take this in when I say this. Now, take it in. That means sit here and listen to me. Like, Look at me. I’m Teal Swan. K, I just flew across the entire ocean to come to you with a message from the universe.“ This statement is clearly grandiose and indicative of cult leader mentality.\n\nwww.tealswanexposed.com",
      "release": "2018-01-07T07:28:13Z",
      "duration": "00:00:31",
      "explicit": false,
      "youTubeId": "pgBuf4JQIr8",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pgBuf4JQIr8"
      }
    },
    {
      "id": "1580fcd5-8473-44d6-b701-70a74d3983a7",
      "title": "Teal Swan Solicits Gifts From Students [Read Article For Context]",
      "description": "Article: https://bit.ly/2uMsOEV | Teal Swan likes to receive gifts. Specifically, she likes to receive them from her “fans” (quotation marks hers, from her blog post,  “Fear Layered Love”). Teal states, \u0022Speaking of love, I went to my company mailbox yesterday. My box was full of presents and letters sent by “fans”. I feel so weird calling people who follow my material fans. It feels more like they are members of my army or like they are extended family members scattered all over the world.\u0022 Read more: https://bit.ly/2uMsOEV\nwww.tealswanexposed.com",
      "release": "2018-01-07T07:28:13Z",
      "duration": "00:01:04",
      "explicit": false,
      "youTubeId": "uDZQZF4C2MM",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uDZQZF4C2MM"
      }
    }
  ]
}