{
  "_ts": 0,
  "id": "4b7805f4-71b6-4948-b52a-30c7df47f2cf",
  "name": "TED",
  "youTubeChannelId": "UCAuUUnT6oDeKwE6v1NGQxug",
  "episodes": [
    {
      "id": "f14652b6-d66b-44fb-a718-5fb97dd00824",
      "title": "How to Spot a Cult | Sarah Edmondson | TED",
      "description": "Nobody joins a cult on purpose, says Sarah Edmondson, a former member of the infamous Nxivm cult and one of the three whistleblowers that led to its downfall. She explains how she got ensnared in this highly manipulative group — and then escaped it — and shares red flags to help you distinguish between a cult and a safe community.\n\nIf you love watching TED Talks like this one, become a TED Member to support our mission of spreading ideas: https://ted.com/membership\n\nFollow TED! \nX: https://twitter.com/TEDTalks\nInstagram: https://www.instagram.com/ted\nFacebook: https://facebook.com/TED\nLinkedIn: https://www.linkedin.com/company/ted-conferences\nTikTok: https://www.tiktok.com/@tedtoks\n\nThe TED Talks channel features talks, performances and original series from the world\u0027s leading thinkers and doers. Subscribe to our channel for videos on Technology, Entertainment and Design — plus science, business, global issues, the arts and more. Visit https://TED.com to get our entire library of TED Talks, transcripts, translations, personalized talk recommendations and more.\n\nWatch more: https://go.ted.com/sarahedmondson\n\nhttps://youtu.be/fa7uN2vo6rc\n\nTED\u0027s videos may be used for non-commercial purposes under a Creative Commons License, Attribution–Non Commercial–No Derivatives (or the CC BY – NC – ND 4.0 International) and in accordance with our TED Talks Usage Policy: https://www.ted.com/about/our-organization/our-policies-terms/ted-talks-usage-policy. For more information on using TED for commercial purposes (e.g. employee learning, in a film or online course), please submit a Media Request at https://media-requests.ted.com\n\n#TED #TEDTalks",
      "release": "2024-04-05T11:00:38Z",
      "duration": "00:17:42",
      "explicit": false,
      "youTubeId": "fa7uN2vo6rc",
      "subjects": [
        "NXIVM",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fa7uN2vo6rc"
      }
    },
    {
      "id": "8329bc75-e61f-4f69-b853-e52822de228f",
      "title": "I grew up in the Westboro Baptist Church. Here\u0027s why I left | Megan Phelps-Roper",
      "description": "What\u0027s it like to grow up within a group of people who exult in demonizing ... everyone else? Megan Phelps-Roper shares details of life inside America\u0027s most controversial church and describes how conversations on Twitter were key to her decision to leave it. In this extraordinary talk, she shares her personal experience of extreme polarization, along with some sharp ways we can learn to successfully engage across ideological lines.\n\nTEDTalks is a daily video podcast of the best talks and performances from the TED Conference, where the world\u0027s leading thinkers and doers give the talk of their lives in 18 minutes (or less). Look for talks on Technology, Entertainment and Design -- plus science, business, global issues, the arts and much more.\nFind closed captions and translated subtitles in many languages at http://www.ted.com/translate\n\nFollow TED news on Twitter: http://www.twitter.com/tednews\nLike TED on Facebook: https://www.facebook.com/TED\n\nSubscribe to our channel: http://www.youtube.com/user/TEDtalksDirector",
      "release": "2017-03-06T17:10:02Z",
      "duration": "00:15:18",
      "explicit": false,
      "youTubeId": "bVV2Zk88beY",
      "subjects": [
        "Westboro Baptist Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bVV2Zk88beY"
      }
    },
    {
      "id": "978226ae-48f1-48a1-a61f-15240f3d6cff",
      "title": "Homeopathy, quackery and fraud | James Randi | TED",
      "description": "http://www.ted.com Legendary skeptic James Randi takes a fatal dose of homeopathic sleeping pills onstage, kicking off a searing 18-minute indictment of irrational beliefs. He throws out a challenge to the world\u0027s psychics: Prove what you do is real, and I\u0027ll give you a million dollars. (No takers yet.)\r\n\r\nTEDTalks is a daily video podcast of the best talks and performances from the TED Conference, where the world\u0027s leading thinkers and doers give the talk of their lives in 18 minutes. TED stands for Technology, Entertainment, Design, and TEDTalks cover these topics as well as science, business, development and the arts. Closed captions and translated subtitles in a variety of languages are now available on TED.com, at http://www.ted.com/translate. Watch a highlight reel of the Top 10 TEDTalks at http://www.ted.com/index.php/talks/top10\r\n\r\nFollow us on Twitter\r\nhttp://www.twitter.com/tednews\r\n\r\nCheckout our Facebook page for TED exclusives\r\nhttps://www.facebook.com/TED",
      "release": "2010-04-20T16:51:18Z",
      "duration": "00:17:51",
      "explicit": false,
      "youTubeId": "c0Z7KeNCi7g",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c0Z7KeNCi7g"
      }
    },
    {
      "id": "cfc402d9-d4a3-49e2-9618-ee55866c7d7e",
      "title": "Why people believe weird things | Michael Shermer",
      "description": "http://www.ted.com  Why do people see the Virgin Mary on cheese sandwiches or hear demonic lyrics in \u0022Stairway to Heaven\u0022? Using video, images and music, professional skeptic Michael Shermer explores these and other phenomena, including UFOs and alien sightings. He offers cognitive context: In the absence of sound science, incomplete information can combine with the power of suggestion (helping us hear those Satanic lyrics in Led Zeppelin). In fact, he says, humans tend to convince ourselves to believe: We overvalue the \u0022hits\u0022 that support our beliefs, and discount the more numerous \u0022misses.\u0022",
      "release": "2008-04-15T16:21:42Z",
      "duration": "00:14:12",
      "explicit": false,
      "youTubeId": "8T_jwq9ph8k",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8T_jwq9ph8k"
      }
    }
  ]
}