{
  "_ts": 0,
  "id": "6eeafca5-ee52-4190-94f4-5a714cb3c68a",
  "name": "TEDx Talks",
  "youTubeChannelId": "UCsT0YIqwnpJCM-mx7-gSA4Q",
  "episodes": [
    {
      "id": "b66d4567-dcc2-4a29-b252-b90961150c6b",
      "title": "Breaking Barriers: A Journey through Cult and Prison | Benedict Kindle | TEDxSchaan",
      "description": "A story of a young man who grew up in a sect and after he finally got out of it he Fell into drugs and got criminal until he got arrested. In prison he finally started working up his hole life and got sober but he still is struggeling with the consequences of his past. Now he also does speeches in schools to reach as many young people as possiple to provide others. At 25, he ended up in jail because of his addictions. In prison, he decided to break free from addiction. He sought help from inside the prison and from outside sources, committing to turn his life around. Jail became the unexpected trigger for change, giving him a chance to start fresh and build a healthier life. With determination and a new sense of purpose, he left jail committed to staying free from addiction. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2024-05-24T15:43:28Z",
      "duration": "00:14:56",
      "explicit": false,
      "youTubeId": "bidAavEAwJs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bidAavEAwJs"
      }
    },
    {
      "id": "45a28a6c-ce72-4908-94d3-33cac80adfe8",
      "title": "Why You Could Be Vulnerable To A Cult | Ashley Easter | TEDxDanville",
      "description": "Your autonomy, ability to have free thought, and personal differences are your most precious assets. Cults come with the intent to steal those so they can control you and bend you towards their agenda. So, before you join a new group or go back to your old ones, ask yourself this: Am I free to be me here, or am I only allowed to be like them?\n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at http://ted.com/tedx\n Ashley is a cult survivor turned Intuition Coach who helps people escape self-doubt and harness the science and practice of intuition so they can take control of their destiny. \n\nShe is an activist, author and the founder of Courage 365, a non-profit for abuse survivors (especially those abused in high-control faith contexts) and a television producer focused on highlighting stories of meaning and mission. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2024-01-30T17:07:28Z",
      "duration": "00:12:34",
      "explicit": false,
      "youTubeId": "eDvhN7rSLK4",
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Independent Fundamentalist Baptist",
        "Quiverfull"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eDvhN7rSLK4"
      }
    },
    {
      "id": "aa0f5f97-4624-4c54-9568-6dc3e2e6679a",
      "title": "Why we need to understand cults better | Sarah Edmondson | TEDxPortland",
      "description": "Sarah Edmondson is a survivor and a fearless advocate with cult awareness. She courageously shares her idea of how to “seek safely” when deciding to join a group and why cult literacy matters. \n\nSarah Edmondson is an actress who gained notoriety for her role in exposing the NXIVM cult. In 2019, Sarah published Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life, an acclaimed memoir chronicling her harrowing experience. Alongside her husband, she hosts the A Little Bit Culty podcast, which has become a powerful platform for cult survivors and recovery advocates. Sarah also attends conferences and events around the world as a speaker and cult-recovery advocate, as well as continuing her work as an actress and podcaster. \n\n******\nWith special thanks to the University of Oregon for presenting partnership, a world class stage design provided by Meyer Pro Inc, an incredible legacy bound Event Book provided by Premier Press and to the creative digital craft provided by Thesis. All of our Partners and event history can be found at TEDxPortland.com \n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2023-10-19T17:00:09Z",
      "duration": "00:18:32",
      "explicit": false,
      "youTubeId": "9K_CZbu-UAU",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9K_CZbu-UAU"
      }
    },
    {
      "id": "dfc3b424-dfbd-4272-8219-db6eb48db83b",
      "title": "How to tell if you’re brainwashed?” | Steve Hassan | TEDxBoston",
      "description": "Do you know someone who has changed radically in their values and beliefs? Do you think it may have been brainwashing? Steven Hassan offers a 4-step reality testing formula developed over 45 years of research starting after leaving a cult that deceptively recruited him. The bottom line is that brainwashing is not just something that happens in cults—we are all susceptible. A talk to make you think.\n\nEmpowerment, Freedom, Global issues, Law, Psychology, Social Justice, cults Steven Hassan, PhD is a mental health professional and expert in undue influence tactics used by authoritarian leaders and destructive cults. His expertise includes harmful influence in cases of destructive religious and political cults, human trafficking, extremist and terrorist groups, one-on-one relationships, families, parental alienation, mini-cults, therapy and self-improvement groups, professional and institutional abuse, corporate and multi-level marketing programs, and harmful belief systems. He is the author of four books including Combating Cult Mind Control, Freedom of Mind and The Cult of Trump. He is a translated author with books in 10 languages. His foundational online course is Understanding Cults: The Basics. He is the Founding Director of the Freedom of Mind Resource Center, which provides training, consulting and support to individuals who are struggling to leave or recover from a cult and to families and organizations that are concerned about cult behaviors. He also is the founder of Freedom From Undue Influence, a not-for-profit entity with the purpose of conducting and publishing the research on undue influence that is needed to update legal and social policies. He developed the BITE Model of Authoritarian Control to identify control tactics and the Influence Continuum Model to discern ethical from unethical influence. He developed the Strategic Interactive Approach (SIA), as an effective and legal intervention alternative for families to help cult members. Dr. Hassan believes that access to the truth, freedom of thought, and freedom from undue influence are basic human rights. A complex systems approach, based in science and supported by the rule of law, is necessary to protect these rights. He is a member of the Program in Psychiatry and the Law at the Massachusetts Mental Health Center, a teaching hospital of Harvard Medical School. He is an experienced educator having served as an instructor for the Harvard Law School Trial Advocacy Workshop, as an elective teacher and a presenter for the Harvard Longwood Psychiatry Residency Training Program, and in other educational and training capacities for other higher education, professional, law enforcement, governmental, non-governmental and advocacy group audiences. Dr. Hassan began helping people affected by undue influence after he was deprogrammed from the Moon cult in 1976 at age 22. His 45 plus years of experience give him a unique perspective on the damaging effects of undue influence and exploitation by destructive cults. He is a frequently requested speaker and media interviewee. Dr. Hassan holds a Master’s Degree in Counseling Psychology from Cambridge College and a Doctorate in Organizational Development and Change from Fielding Graduate University School of Leadership Studies. Visit freedomofmind.com to access information and services. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2022-04-11T18:43:47Z",
      "duration": "00:13:42",
      "explicit": false,
      "youTubeId": "JzSwZpHDAaU",
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Psychology",
        "Human Trafficking",
        "Qanon",
        "Multi-Level Marketing",
        "One-on-one"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JzSwZpHDAaU"
      }
    },
    {
      "id": "6266cdce-7666-43ae-ae1a-62bd49ceacf5",
      "title": "From Sex Cult to Self Discovery | Joe Dageforde | TEDxDerryLondonderryStudio",
      "description": "Joe has seen a lot of life, and often says he feels like he’s lived many lives already. It’s been unconventional to say the least.\nBut even though there have been many hurdles and challenges, he lives by the Moto of just taking one step at a time with positive gratitude, and not stopping.\nMany steps make a long journey, but they are only taken one at a time.\nAbove all, he loves his kids, and is perpetually excited for what is ahead. Joe has seen a lot of life, and often says he feels like he’s lived many lives already. It’s been unconventional to say the least.\nBut even though there have been many hurdles and challenges, he lives by the Moto of just taking one step at a time with positive gratitude, and not stopping.\nMany steps make a long journey, but they are only taken one at a time.\nAbove all, he loves his kids, and is perpetually excited for what is ahead. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2021-12-03T22:11:58Z",
      "duration": "00:10:45",
      "explicit": false,
      "youTubeId": "hePgllBlQ3c",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hePgllBlQ3c"
      }
    },
    {
      "id": "bc405f36-7da8-4393-9c6b-082e65593d84",
      "title": "Cliques and Cults | Michelle Chang \u0026 Avni Varshney | TEDxYouth@SAS",
      "description": "Sophomores at Singapore American School (SAS), Michelle Chang and Avni Varshney became friends through the National History Day (NHD) program in 8th grade. Both of them display an aptitude for public speaking, having taken (and are currently taking) active roles in the public speaking community at SAS through Forensics and Model United Nations. They also share keen interests in exploring sociology and human psychology, which inspired the contents of their talk. The idea of exploring the dynamics in different social groups through looking at cliques and cults arose from their personal experiences in being part of social circles and interest in human psychology. Taking their joint NHD experience as inspiration, they identified that these social groups often form due to common interests and people’s desire to have a sense of belonging. Sophomores at Singapore American School (SAS), Michelle Chang and Avni Varshney became friends through the National History Day (NHD) program in 8th grade. Both of them display an aptitude for public speaking, having taken (and are currently taking) active roles in the public speaking community at SAS through Forensics and Model United Nations. They also share keen interests in exploring sociology and human psychology, which inspired the contents of their talk. \n\nThe idea of exploring the dynamics in different social groups through looking at cliques and cults arose from their personal experiences in being part of social circles and interest in human psychology. Taking their joint NHD experience as inspiration, they identified that these social groups often form due to common interests and people’s desire to have a sense of belonging.\n\nSophomores at Singapore American School (SAS), Michelle Chang and Avni Varshney became friends through the National History Day (NHD) program in 8th grade. Both of them display an aptitude for public speaking, having taken (and are currently taking) active roles in the public speaking community at SAS through Forensics and Model United Nations. They also share keen interests in exploring sociology and human psychology, which inspired the contents of their talk. \n\nThe idea of exploring the dynamics in different social groups through looking at cliques and cults arose from their personal experiences in being part of social circles and interest in human psychology. Taking their joint NHD experience as inspiration, they identified that these social groups often form due to common interests and people’s desire to have a sense of belonging. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2021-05-24T16:52:02Z",
      "duration": "00:09:16",
      "explicit": false,
      "youTubeId": "agyrEsHyLQQ",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=agyrEsHyLQQ"
      }
    },
    {
      "id": "80cef580-ef1c-4990-bc72-6e71f1147294",
      "title": "Have you heard of the cult next door?  | Tracy Simmons | TEDxSpokane",
      "description": "Tracy is a Journalism Lecturer and Religion Reporter. \n During her time on the TEDxSpokane stage, Tracy wants to normalize the cult experience. She hopes to “shed the shame that comes from it (cults)”. Tracy shares her unique experience growing up in a cult and will make you rethink your definition of a cult. Not all cults are on compounds, they might just be starting on the couch next door. \n Tracy is a Journalism Lecturer and Religion Reporter. She favors \u0022Ted Radio Hour:NPR” because listening to other\u0027s views opens her mind to new ideas.  When she is not nurturing her houseplants, she is riding her road bike. \nIn her time on the TEDxSpokane stage, Tracy wants to\nnormalize the cult experience. She hopes to “shed the shame that\ncomes from it (cults).” Tracy shares her experience growing up in a cult, how her and her mother found themselves on that living room\ncouch, and the shape of their relationship now.\n\nFun Fact: Tracey’s favorite food is chips and spicy salsa. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2020-11-18T19:39:35Z",
      "duration": "00:12:15",
      "explicit": false,
      "youTubeId": "-K4aMVwEww4",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-K4aMVwEww4"
      }
    },
    {
      "id": "b2bea790-0f94-492b-83ed-ef9eefba6aae",
      "title": "What working with psychopaths taught me about leadership | Nashater Deu Solheim | TEDxStavanger",
      "description": "Are you always authentic ? Nashater challenges you that we are not. And we probably shouldnt be. Can your life depend on it ? And if you are not authentic, save your life ? Watch her compelling takeaway - dont be authentic if you need to save the relationship..... Dr Nashater Deu Solheim is CEO of Progressing Minds and  Amazon bestselling author of  “The Leadership PIN Code”, which debuted on the 2020 Forbes list of 8 books “..that will change the way you handle relationships”. She is an HBR contributor and advisor to businesses and executive coach on leadership influence based on the approach within her book. She is a popular  keynote speaker onher experience as a psychologist in forensic and business settings and an accomplished moderator onthe international stage.. She has 25 years of practical business experience across diverse sectors for governments, NGOs, corporate, healthcare and more recently in oil and gas. Nashater has held executive leadership positions within strategy, competence \u0026 learning roles and leadership development in international corporations and SMEs. She holds a doctorate in Psychology from the University of Surrey and trained as an Expert Negotiator at Harvard Law School. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2020-11-03T19:47:41Z",
      "duration": "00:13:49",
      "explicit": false,
      "youTubeId": "pKMgG9xIfEg",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pKMgG9xIfEg"
      }
    },
    {
      "id": "7f00c3cb-973e-40cb-a0b6-a8822fb8da8b",
      "title": "I was sex trafficked for years. Brothels are hidden in plain sight. | Casandra Diamond | TEDxToronto",
      "description": "Sex trafficking may be happening behind the walls of businesses you pass daily - including the some of the massage parlours and holistic centres in your community. Casandra Diamond shares a harrowing story of her experience inside these modern day brothels:  in this raw and honest talk, learn about the systemic issues that enable businesses to operate in plain sight and how you can help to advocate for change. Casandra is the founding director of BridgeNorth, a survivor-led charitable organization that provides programs to assist victims of sexual exploitation and human trafficking. Her work includes investing in public education, awareness, and advocacy at all levels of government including supporting Bill C-36 which is now law as the Protection of Communities and Exploited Persons Act. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2020-02-12T15:16:53Z",
      "duration": "00:17:06",
      "explicit": false,
      "youTubeId": "Rg6xCRemYw4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Rg6xCRemYw4"
      }
    },
    {
      "id": "451a0c76-255d-4385-9fb0-6882d88ee260",
      "title": "I Own Me: Understanding Our Property Rights to Our Own Bodies | Faith Jones | TEDxWilsonPark",
      "description": "How often do we, as women, not speak up when someone is violating our personal space, in particular when a man is touching us and it is unwanted? Our experiences of violation can be horrific or seemingly insignificant which, in reality, seems to have little correlation to whether the psychological effects are severe or mild. Yet, all of our experiences share a common message about the nature of what it is to be a woman. At its core, it is about property rights – Do I own me? Do I have a full and unfettered property right to my own body? What does that actually look like? Faith Jones is an international corporate attorney and executive coach who capitalized on her unusual background to create her unique “I Own Me” framework which works to empower women in business and personal relationships. Her passion and focus is to inspire women to take back responsibility for their own lives, decisions, businesses, and bodies through education and by changing the societal systems and laws that have prejudiced them for centuries. Faith, who graduated summa cum laude from Georgetown’s School of Foreign Service and with honors from UC Berkeley Law School, was named the Top 40 Under 40 M\u0026A Advisor in 2015. She began her career as an attorney with Skadden Arps where she represented clients in a wide variety of cross-border corporate transactions. After Skadden, Faith headed up Walton \u0026 Walton LLP’s corporate practice where she represented varying clients from start-ups to Fortune 500s. Her multi-cultural background and wide variety of experience and interests adds to her ability to develop creative solutions for non-profit as well as for-profit companies across the globe. As a world traveler, she spent much of her early life in South East Asia and speaks Mandarin Chinese. She has worked with businesses and government leaders in the Pacific Rim and uses this insight to assist clients in understanding the unique opportunities available in Asia. She is the inventor of the Personal Air Filter device, a non-mask, wearable air filter for polluted areas, and she has experience as a humanitarian aid worker in Kazakhstan, Russia, Japan, and Taiwan. She is currently writing her Memoir with HarperCollins Publishers. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2019-11-13T18:00:01Z",
      "duration": "00:16:46",
      "explicit": false,
      "youTubeId": "18oDUTQ14ME",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=18oDUTQ14ME"
      }
    },
    {
      "id": "bdd1baaf-784b-4498-971d-62df45a9ee4e",
      "title": "The power of conspiracy theories und cults | Giulia Silberberger | TEDxUniMannheim",
      "description": "Why do people believe in conspiracy theories or in extreme cases join a cult-like the Jehovah\u0027s Witnesses? What value do these beliefs hold and what do they say about society on a greater scheme? Guilia Silberberger tackles all of these questions and presents ways we can help the affected and reduce the power of conspiracies and cults by also referencing her own experience leaving the Jehovah\u0027s Witnesses. Giulia Silberberger is the founder of the non-profit-organization \u0022Der goldene Aluhut\u0022 which educates about conspiracy theories and their dangers by giving out prizes for the \u0027best\u0027 ones. She used to be a member of the Jehova Witnesses and managed to step out of the cult a few years ago. Now her mission is to educate about cults and conspiracy theories and to help those who have fallen into the traps. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2019-10-29T15:04:44Z",
      "duration": "00:17:36",
      "explicit": false,
      "youTubeId": "ILRxLKZ6o6M",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ILRxLKZ6o6M"
      }
    },
    {
      "id": "efe99d22-a639-4126-befb-ef75c1607593",
      "title": "What Cults Tell Us About Ourselves | Amber Scorah Scorah | TEDxPaloAltoSalon",
      "description": "Amber Scorah is author of the memoir Leaving the Witness. Growing up in the Jehovah\u0027s Witness faith, Scorah moved to mainland China to become an underground missionary. In China, she came to question these beliefs and left the religion. Shunned by family and friends as an apostate, Scorah was alone in Shanghai and thrown into a world she had only known from the periphery, with no education or support system. After growing up in the Jehovah\u0027s Witness faith, Amber learned Mandarin Chinese and moved to Mainland China to become an underground missionary. In China, encountering a new culture and making friends outside the faith for the first time, Amber came to question the beliefs she had been taught from childhood and ended up leaving the religion.  \nAmber later moved to New York City, where she began a new life. Several years later, her three-month old son died on his first day in childcare. After this tragedy, Amber became a parental leave advocate. Combining forces with a Republican mother, their bipartisan efforts brought the cause of parental leave to the forefront of the 2016 presidential campaign. She was named one of the 100 most influential people in Brooklyn culture by Brooklyn Magazine. \n\nHer writing has appeared in The New York Times, The Believer, The Boston Globe, The Cut, The Globe and Mail and USA Today. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2019-10-22T17:10:30Z",
      "duration": "00:14:56",
      "explicit": false,
      "youTubeId": "e7wFPAQcqCw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e7wFPAQcqCw"
      }
    },
    {
      "id": "17485ac3-322a-497b-b365-6b7bc2584ca8",
      "title": "Lessons from a cult survivor about freedom | Claire Ashman | TEDxMelbourne",
      "description": "Having escaped from two cults, Claire Ashman recounts what it was like to live the first 36 years of her life within the confines of strict rules and locked gates. In this honest talk, Claire shares how she built up the strength and courage to finally escape, and the lessons she learnt about freedom.  Having escaped from two cults, Claire Ashman recounts what it was like to live the first 36 years of her life within the confines of strict rules and locked gates. In this honest talk, Claire shares how she built up the strength and courage to finally escape, and the lessons she learnt about freedom. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2019-01-17T17:23:58Z",
      "duration": "00:09:51",
      "explicit": false,
      "youTubeId": "HagAuIu1RkM",
      "subjects": [
        "Order of St Charbel"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HagAuIu1RkM"
      }
    },
    {
      "id": "4fa200d4-58e1-4cfc-8fc4-1d292ff4af55",
      "title": "Why I chose my LGBTQ daughter over the Evangelical Church | Susan Cottrell | TEDxMileHigh",
      "description": "What happens when the most important parts of your life come into conflict? When Evangelical Christian mom Susan Cottrell’s daughter came out, she faced an impossible choice: her LGBTQ child or her non-affirming church. In this heartwarming talk, Susan explains why she chose her LGBTQ child and how she fights for progress inside the Christian Church. Susan Cottrell is a prominent voice for faith parents of LGBTQI children. She is an international speaker, acclaimed author, and public theologian with a Masters in Theological Studies. After spending 25 years in the Evangelical church, she founded FreedHearts to champion the LGBTQI community and their families. She served as the Vice-President of PFLAG Austin (Texas) and was endorsed by The Human Rights Campaign and The Gay Christian Network. She has five children, two of whom are in the LGBTQI community, with her husband of 30 years, Rob. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2019-01-04T18:35:58Z",
      "duration": "00:16:06",
      "explicit": false,
      "youTubeId": "rP01bH9Ljf4",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rP01bH9Ljf4"
      }
    },
    {
      "id": "26739844-e62f-4071-9016-0c6afabb324f",
      "title": "Why I Left an Evangelical Cult | Dawn Smith | TEDxNatick",
      "description": "With humor and piercing observations, Dawn Smith sheds light on growing up in a religious cult and what it takes to leave everything you’ve ever known. This poignant story will make you cry and laugh as she shares her struggles with joining the outside world. Dawn grew up in California and moved to Chicago to work in media. She now lives in Brookline, MA, where she works on screenplays, political and issue advertising, standup comedy, and produces the comedy web series, PAID FOR BY. Visit Dawn’s website at www.pushbackfilms.com This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2018-03-06T17:00:01Z",
      "duration": "00:16:49",
      "explicit": false,
      "youTubeId": "-U4Cq-dgNnw",
      "subjects": [
        "Geftakys Assembly",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-U4Cq-dgNnw"
      }
    },
    {
      "id": "bf979965-ba6a-4a26-8949-a7e399256fb2",
      "title": "My descent into America\u0027s neo-Nazi movement \u0026 how I got out | Christian Picciolini | TEDxMileHigh",
      "description": "At 14-years-old, Christian Picciolini went from naive teenager to white supremacist, and soon, the leader of America’s first neo-Nazi skinhead gang. How was he radicalized, and how did he ultimately get out? In this courageous talk, Christian shares a surprising and counterintuitive solution to hate in all forms. After leaving the white-supremacist skinhead movement that he helped build in the 1980s and 90s, Christian Picciolini co-founded Life After Hate, a nonprofit dedicated to helping people disengage from violent extremism. His memoir, White American Youth: My Descent into America\u0027s Most Violent Hate Movement—and How I Got Out (Hachette), which details his involvement, and eventual disengagement, from the early American white nationalist movement, will be published on December 26, 2017. Christian lives in Chicago. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2017-12-20T16:30:10Z",
      "duration": "00:20:31",
      "explicit": false,
      "youTubeId": "SSH5EY-W5oM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SSH5EY-W5oM"
      }
    },
    {
      "id": "f272c59b-a959-4966-a0c8-0adf4c1c2f14",
      "title": "I grew up in a cult. It was heaven -- and hell. | Lilia Tarawa | TEDxChristchurch",
      "description": "Lilia Tarawa was brought up in the Gloriavale Christian Community on the West Coast of the South Island of New Zealand, where she was constantly surrounded by everyone she loved. But over time, she began to see the dark side of her community, and ultimately realised that she had to get out. In this raw and emotional talk, Lilia shares the reality of life in a cult, and her heart-wrenching journey to break free. \n\nLilia Tarawa is a New Zealand writer, speaker, holistic health consultant and business coach. She is a member of the Māori Ngāi Tahu tribe. Lilia was born into New Zealand\u0027s infamous religious cult, Gloriavale, and fled with her eleven family members at eighteen years of age. Her extraordinary life experience compelled her to pursue a career promoting human rights, welfare and empowerment.\n\nhttps://www.liliatarawa.com/  \nhttps://www.youtube.com/liliatarawa\nhttps://nz.linkedin.com/in/liliatarawa\nhttps://www.facebook.com/liliatarawa  \nhttps://www.instagram.com/liliatarawa \n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2017-11-16T21:47:42Z",
      "duration": "00:20:06",
      "explicit": false,
      "youTubeId": "qS7mBbXxJYA",
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qS7mBbXxJYA"
      }
    },
    {
      "id": "59392cb6-feec-484d-b5bf-5d5d94939c8b",
      "title": "Breaking Mormon | Andie Kemmerle | TEDxYouth@AnnArbor",
      "description": "A talk about how it can be difficult to stop practicing your religion, but you shouldn\u0027t feel afraid to. \n\nAndie is a senior at Pioneer High School. She enjoys traveling and being exposed to new cultures and ideas. Born and raised in the Mormon church, she has recently undergone a religious transformation and is fascinated by all religious discussion.\n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2017-08-02T17:12:27Z",
      "duration": "00:09:01",
      "explicit": false,
      "youTubeId": "psI_rBrNyG0",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=psI_rBrNyG0"
      }
    },
    {
      "id": "5aa9975b-0c34-4768-8a5b-fafea33bbb11",
      "title": "IT IS ABOUT TIME TO BRING AWARENESS TO HUMAN TRAFFICKING | Tika Thornton | TEDxCanonDriveWomen",
      "description": "Tina Thornton\u0027s talk is about sex trafficking and as a survivor herself she has a vast knowledge to share and help others. \n\nChild Sex Trafficking Survivor\r\n​\r\n​Tika Thornton is an advocate against sex trafficking. A survivor herself, Tika in her early 20s started a management company and a detail company. She then moved into mentoring and speaking to raise awareness of sex trafficking. She speaks at a group home called Crittenton, where she spreads awareness of trafficking and provides one-on-one peer counseling. Tika also mentors at Long Beach GRIP, an organization that helps at-risk youth.\r\n\r\n​She serves as a mentor to girls who have been arrested, getting them the resources they need for GED prep, trauma counseling, medical assistance, and housing. Tika also shares her personal story as a survivor to help kids in the Long Beach area understand trauma and guide them to accessing therapy. Tika is a graduate of the Two Wings Qualified Academy, a nonprofit organization that provides survivors job skills and resources to start careers. Tika has joined the organization and co-facilitates trauma information training. Tika plans to major in Business Administration or Psychology in order to start her own organization helping incarcerated girls connect to mental health specialists.\n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
      "release": "2017-05-23T16:45:16Z",
      "duration": "00:14:37",
      "explicit": false,
      "youTubeId": "rdsTMY33F8s",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rdsTMY33F8s"
      }
    },
    {
      "id": "b9f57cdd-d4d2-430f-a7ee-4aa796fe73b2",
      "title": "How Asking Too Many Questions Saved Me | Claire Ashman | TEDxNorwichED",
      "description": "\u0022How often do we follow rules blindly? When is it right to question authority?  Living by giving into other people’s thoughts, ideas and actions can kill you.  \r\n\r\nCult survivor Claire Ashman was born and raised in a cult.  She left it all behind at 18, only to then promptly marry, joining yet another cult. She birthed 9 children before exiting out.  Questioning everything saved their lives and exposed Australia’s largest doomsday cult.  \r\n\r\nIn this talk, she breaks down 3 questions you need to ask yourself daily to know yourself and live your truth.  Questioning everything may save your life.\n\nClaire Ashman is a cult survivor, independence enthusiast and is always looking to learn something new. Passionate about educating women and young girls, she aims to encourage self-preservation, promote education and encourage the next generation of women to value themselves in a world that can be determined to hold them down. Her story is one of survival, strength and perseverance against the odds. Brave, hardworking and down to earth, Claire Ashman is a woman who was raised in an environment of ingrained subjugation and renewed a life for herself and her children, based on faith, love and courage.\n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at http://ted.com/tedx",
      "release": "2017-03-30T16:04:57Z",
      "duration": "00:08:50",
      "explicit": false,
      "youTubeId": "JwWKGYYDXWU",
      "subjects": [
        "Order of St Charbel"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JwWKGYYDXWU"
      }
    },
    {
      "id": "76964ca8-6334-49f3-a5f1-6c04076712cd",
      "title": "Cult Survivor to Free Thinking Driver | Claire Ashman | TEDxIpswich",
      "description": "Ever wondered what it might be like inside a cult? Claire Ashman will take you on her insightful and inspirational journey of what it is like to be in a cult - and what it\u0027s like to \u0027escape\u0027 and live life to the fullest.\n\nClaire Ashman, born, raised, and birthed 9 children in a cult, shares how the prevalence of cults and cult-like thinking affects everyday people – even your neighbours who may have just popped into a few personal development meet-ups.\r\n\r\nHer upcoming autobiography “A Phoenix Rising” focuses on her cult experiences. She shares awakening for cult-member’s friends, colleagues and family members to recognise the signs and be present to support upon exiting.\r\n\r\nAshman is now happily married, of her own free will, to her supportive husband Mark raising their 10 kids together.\r\n\r\nBy day she motivates women to take control of their own lives. By night she drives people to free thinking in her Uber. She powers herself up with Crossfit, coffee curation and patchwork quilting.\n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at http://ted.com/tedx",
      "release": "2016-12-20T19:50:46Z",
      "duration": "00:11:12",
      "explicit": false,
      "youTubeId": "SaKrGKxRl0s",
      "subjects": [
        "Order of St Charbel"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SaKrGKxRl0s"
      }
    },
    {
      "id": "4a3a344a-5fb1-4e8c-9f09-3ef3a5c4caf5",
      "title": "Lessons From A Cult Survivor | Claire Ashman | TEDxUQ",
      "description": "Claire Ashman was born, raised, and birthed 9 children in a cult. She shares how the prevalence of cults and cult-like thinking affects everyday people. In Australia there are over 3000 cults, with some 600,000 members, meaning we all know, or have had contact with at least one person who is a member of a cult. Cults and secretive groups fill certain voids that all people feel at some point in their lives. Everyone has had a time in their lives when they\u0027ve felt vulnerable or directionless. For some people, it\u0027s easier to have someone give you the answer than living through the pain. \n\nAshman shares awakening for cult-member’s friends, colleagues and family members to recognize the signs and be present to support upon exiting a cult. Ashman is now happily married, of her own free will, to a supportive raising their 10 kids together. By day she motivates women to take control of their own lives, by night she drives people to free thinking in her Uber.\n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at http://ted.com/tedx",
      "release": "2016-09-02T21:18:02Z",
      "duration": "00:08:37",
      "explicit": false,
      "youTubeId": "k8zo29Kw7zg",
      "subjects": [
        "Order of St Charbel"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k8zo29Kw7zg"
      }
    },
    {
      "id": "f50f8baf-0263-4db8-ab08-fbd608964c84",
      "title": "From Endurance to Empathy: Lessons I learned from leaving a cult | Cherish Weiler | TEDxTUJ",
      "description": "Born into a religious cult, Cherish Weiler spent her life watching her parents leave behind the world they knew and start a new life in the United States. She learned powerful lessons of endurance from the ex-member community, lessons that pushed her to earn two engineering degrees as a first generation university student. Yet, she faced her own set of challenges; while she was too young to be accepted as an ex-member, her upbringing markedly set her apart from her peers. In this talk, she aims to share her experiences growing up and how building empathy empowered her to overcome her failures.\n\nBorn into a religious cult, Cherish Weiler spent her life watching her parents leave behind the world they knew and start a new life in the United States. She learned powerful lessons of endurance from the ex-member community, lessons that pushed her to earn two engineering degrees as a first generation university student. \n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at http://ted.com/tedx",
      "release": "2016-05-21T23:52:41Z",
      "duration": "00:17:14",
      "explicit": false,
      "youTubeId": "tacQETO-DUs",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tacQETO-DUs"
      }
    },
    {
      "id": "8b66fbb6-e545-4036-b4ba-72599d18b7eb",
      "title": "The Dark Side of Self Improvement | Suzanne Eder | TEDxWilmington",
      "description": "Suzanne Eder talks about self improvement at a 2015 TEDX event in Wilmington, Delaware.\n\nSuzanne Eder is a world-class teacher, facilitator and mentor.  She founded Solid Ground Transformational Life Coaching in 2003 to help people wake up to their magnificence and create lives they truly love. Suzanne currently authors an award-winning monthly column in Living Well Magazine and has published a book, 10 Ways to Find Peace Rather Than Panic, which earned a full 5-star rating on Amazon. She is a graduate of the Barbara Brennan School of Healing, an intense 4-year program in mind-body-spirit health and healing. Suzanne also has degrees in both Accounting and Economics and graduated summa cum laude from the University of Delaware. Currently resides in Wilmington, Delaware.\n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at http://ted.com/tedx",
      "release": "2015-11-30T21:14:13Z",
      "duration": "00:11:13",
      "explicit": false,
      "youTubeId": "wljRiAofFJ8",
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wljRiAofFJ8"
      }
    }
  ]
}