{
  "_ts": 0,
  "id": "0d5a38ca-2196-4b2e-9252-c9eea4b1eaa8",
  "name": "TelewizjaTychy",
  "youTubeChannelId": "UCKgBM6v0WS4gdQ_TBWEZpNg",
  "episodes": [
    {
      "id": "01a18d5a-a66d-4a93-9139-7b5c4f3d2826",
      "title": "HIDDEN CAMERA: unexpected visit of Jehovah\u0027s Witnesses in my home",
      "description": "... Unexpectedly, Jehovah\u0027s Witnesses visited me on Sunday afternoon. (I live in Poland, I run a YT channel and a Christian telephone helpline). This religion deprives Jesus of his deity, does not believe in the existence of hell or biblical salvation, and promotes many other heresies.\nWe started by explaining who Jesus is, who they degrade to an obscure notion of an angel...\nIn their understanding, Jesus is not God. - Let\u0027s look at the disastrous effects of this belief: if Jesus is NOT God - then ... do not worship Him! - The first and the second commandment orders to worship only God, no one else.\nThus (perhaps completely unknowingly), Jehovah\u0027s Witnesses refuse to honor God.\nIn this way they break the commandments to which they refer most often. Although they are eagerly called \u0022true worshipers\u0022 - this way they bypass God\u0027s commandments.\nThe consequences of not worshiping God are described in the Letter of St. Paul to the Romans in chapter 1; 18-32:\n\u0022Because, although they knew God, they did not worship Him as God and thank Him not, but they vanished in their thoughts and their heart\u0027s mind was eclipsed [...] And because they did not consider it right to keep God true, God gave them away for nothing inconceivable reason, that they did what is not reconciled ... \u0022(Rom.18-18-32)\n\n... And if anyone had any doubts about worshiping Jesus as God, let him listen to the Word of God:\n\u0022...that all may honor the Son, just as they honor the Father. Whoever does not honor the Son does not honor the Father who sent him. Truly, truly, I say to you, whoever hears my word and believes him who sent me has eternal life. He does not come into judgment, buthas passed from death to life.\u0022  (John 5; 23-24)\n\n---------------------------------------------------------------------------------------------------------------------------------------------------\n\nBecause I think what you watch now is extremely important - I\u0027m giving you this movie for free; although I devote a lot of work, time and funds to run the channel where apart from municipal information you may find several dozen films about the message of evangelization.\nThey are published on my website of a “municipal” name:TelewizjaTychy.pl in the \u0022Warto obejrzeć\u0022 tab. The JESUS LIVES! helpline is integrated with the film channel, which I have been running for over 3 years for Polish-speaking viewers. Already some 400 people used it and in the conversations I discussed the Gospel, and some have already decided to entrust their lives to Jesus.\nEven though I live in a \u0022Catholic\u0022 country, I cannot count on the support of either the government, or the city, or the Catholic church. We pay for the video channel and the helpline mainly with our own family contribution of work and funds. However, despite the fact that we are \u0022run against the stream\u0022 of contemporary materialistic ideology to show the splendor of the Gospel and the truth about the man - values not popular in this world - our channel audience is growing rapidly. This is surprising a bit, but I see it as a personal God\u0027s blessing for the work of Evangelization.\n\nSo the free issue of this and other movies on my channel is possible thanks to the prayers and dedication of people who are truly devoted to God.\n- Join them and spend a small amount of money on a monthly basis; I am grateful for any support! In this way, you become a shareholder of Internet evangelism.\nIt is said that \u0022the wallet is converted last\u0022 - but it is mainly where one can distinguish a true Christian. Even small, but regular payments will enable further activity of this channel, which will allow you to participate in the work of the Gospel propagation.\nYour support will help in preparing the English translation of the remaining dozens of evangelistic videos on my YouTube channel...\n\nBANK ACCOUNT FOR TRANSFER:\n\nfor  USD  currency:\nING Bank Śląski:   PL  48 1050 1399 1000 0091 2610 5122    code swift:    INGBPLPW\nwith a note:  \u0022Support for Internet Evangelism\u0022\n\nfor  GBP currency:\nING Bank Śląski:   PL  30 1050 1399 1000 0091 2610 8647    code swift:    INGBPLPW\nwith a note:  \u0022Support for Internet Evangelism\u0022\n\nfor  EUR  currency:\nING Bank Śląski:   PL  74 1050 1399 1000 0091 2610 9116    code swift:    INGBPLPW\nwith a note:  \u0022Support for Internet Evangelism",
      "release": "2018-01-19T20:16:26Z",
      "duration": "00:07:52",
      "explicit": false,
      "youTubeId": "7MHK8Yp20B4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7MHK8Yp20B4"
      }
    }
  ]
}