{
  "_ts": 0,
  "id": "7a64686d-754d-46cc-a085-9f57419656d2",
  "name": "Telediario",
  "youTubeChannelId": "UCxh_zFUyGTadP_rTjYbhuzA",
  "episodes": [
    {
      "id": "eb4ff639-7147-43c9-8e41-7bd2a66b5694",
      "title": "Integrante de la secta Lev Tahor es requerido por México por el delito de trata de personas",
      "description": "Integrante de la secta Lev Tahor es requerido por México por el delito de trata de personas, así lo dieron a conocer las autoridades de Guatemala.",
      "release": "2025-03-07T13:15:47Z",
      "duration": "00:02:42",
      "explicit": false,
      "youTubeId": "L2PdWEhdCM4",
      "subjects": [
        "Lev Tahor",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L2PdWEhdCM4"
      }
    },
    {
      "id": "90580593-54ab-4682-9222-d8cc8bf49cbd",
      "title": "Manifestantes de Lev Tahor bloquean Puente del Incienso",
      "description": "Un grupo de al menos 12 integrantes de la comunidad Lev Tahor bloqueó esta mañana dos carriles del Puente del Incienso, afectando la conexión entre las zonas 7 y 1 de la Ciudad de Guatemala.",
      "release": "2025-03-06T14:11:12Z",
      "duration": "00:07:00",
      "explicit": false,
      "youTubeId": "FrlHolE6KsE",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FrlHolE6KsE"
      }
    },
    {
      "id": "ce8e2a5a-6526-42df-9610-23e5e89c296f",
      "title": "Miembros de Lev Tahor fueron ligados a proceso penal",
      "description": "Dos integrantes de la comunidad judía Lev Tahor fueron ligados a proceso penal por el delito de maltrato a menores de edad. \n\nEl magistrado resolvió procesar penalmente a los acusados, quienes deberán enfrentar las acusaciones en un juicio. \n\nLa defensa de los acusados indicó que tienen cuatro meses para probar la inocencia de sus defendidos, lo que añade una nueva dimensión a este caso.",
      "release": "2025-03-05T03:21:16Z",
      "duration": "00:02:56",
      "explicit": false,
      "youTubeId": "LpW4qCv-CVI",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LpW4qCv-CVI"
      }
    },
    {
      "id": "5a466d71-1987-4436-9a83-57fc65e5e9d6",
      "title": "Policía de Belice busca a menores desaparecidos de Lev Tahor",
      "description": "Las autoridades de Belice iniciaron un operativo para localizar a un grupo de niños guatemaltecos que estarían ocultos por miembros de la secta Lev Tahor.",
      "release": "2025-03-03T14:45:36Z",
      "duration": "00:01:14",
      "explicit": false,
      "youTubeId": "0Dc23IKq4qc",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0Dc23IKq4qc"
      }
    },
    {
      "id": "e37b76cc-443b-4092-8222-7b13c5c79dee",
      "title": "PGN se pronuncia tras localización de menores Lev Tahor en hoteles",
      "description": "Tras conocer que menores de la comunidad Lev Tahor, reportados como desaparecidos, fueron localizados por las autoridades en hoteles de la zona 1 y 3 de la ciudad capital en compañía de otros miembros adultos de su comunidad, autoridades de la Procuraduría General de la Nación (PGN) se pronunciaron al respecto.\n\nJulio Saavedra, procurador general de la nación, en conferencia de prensa, manifestó la postura de la institución ante los últimos acontecimientos en el caso Lev Tahor. Aseguró que el cumplimento de la ley busca proteger los derechos de los niños y niñas de dicha comunidad.\n\n“El cumplimiento de la ley no se negocia, especialmente cuando se trata de proteger los derechos de los niños, niñas y adolescentes”,  afirmó Julio Saavedra, procurador general de la nación.",
      "release": "2025-01-20T14:45:41Z",
      "duration": "00:08:04",
      "explicit": false,
      "youTubeId": "uLM1YZfhePw",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uLM1YZfhePw"
      }
    },
    {
      "id": "ba4d4b58-724e-4369-b190-51e065864645",
      "title": "Conozca el significado de la vestimenta de los miembros de la comunidad Lev Tahor",
      "description": "Desde el pasado mes de diciembre, la comunidad Lev Tahor ha causado polémica tras ser acusada de tráfico de personas y abuso sexual. Su peculiar vestimenta también ha llamado la atención de los guatemaltecos. En esta nota te contamos el significado de su vestimenta.",
      "release": "2025-01-19T04:30:01Z",
      "duration": "00:04:14",
      "explicit": false,
      "youTubeId": "abfeEr9EVzM",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=abfeEr9EVzM"
      }
    }
  ]
}