{
  "_ts": 0,
  "id": "7a64686d-754d-46cc-a085-9f57419656d2",
  "name": "Telediario",
  "youTubeChannelId": "UCxh_zFUyGTadP_rTjYbhuzA",
  "episodes": [
    {
      "id": "2c54a845-f4d3-4784-8b97-790061d3bf6f",
      "title": "Capturan a miembro de secta Lev Tahor que se hacía pasar por médico",
      "description": "Luis Fernando Guzmán fue detenido cuando se presentaba como familiar idóneo en un proceso de menores, haciéndose pasar por médico.",
      "release": "2025-05-21T03:00:55Z",
      "duration": "00:02:22",
      "explicit": false,
      "youTubeId": "tlmzUEM96m0",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tlmzUEM96m0"
      }
    },
    {
      "id": "ddaf7c83-eed7-4d0e-9219-6ce0f76c69f1",
      "title": "Manifestantes bloquean paso en apoyo a comunidad de Lev Tahor",
      "description": "La acción afecta a usuarios de San Rafael, Puente Belice o rumbo a calle Martí.",
      "release": "2025-03-17T12:54:24Z",
      "duration": "00:02:51",
      "explicit": false,
      "youTubeId": "aStjwDq4SOI",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aStjwDq4SOI"
      }
    },
    {
      "id": "e5e3876c-d5f3-4153-860c-c7966095a949",
      "title": "Tres niños miembros de Lev Tahor fueron reunificados a familia ampliada",
      "description": "Tres menores integrantes de la secta Lev Tahor fueron reunificados con su familia ampliada después de que la Procuraduría General de la Nación (PGN) confirmara la vulneración de sus derechos fundamentales. \n\nLa decisión, tomada como parte del proceso de restitución de derechos, establece que los familiares deberán participar en programas de seguimiento diseñados para garantizar el bienestar de los menores y prevenir futuros riesgos.",
      "release": "2025-03-15T03:00:18Z",
      "duration": "00:02:03",
      "explicit": false,
      "youTubeId": "ML3-x6dP5-I",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ML3-x6dP5-I"
      }
    },
    {
      "id": "63f69d6f-19d7-4394-ad5f-846094f89dec",
      "title": "Audiencia definirán custodia de menores miembros de Lev Tahor",
      "description": "Este 12 de marzo comenzaron las audiencias para definir la custodia legal de 130 niños rescatados de la comunidad Lev Tahor, quienes están actualmente bajo el resguardo de la Secretaría de Bienestar Social. \nEl procurador general de la nación señaló que se presentarán tres documentos clave: un peritaje cultural sobre las prácticas de la secta, la opinión de un experto en sectas y un estudio especializado en niñez y adolescencia, que aborda los impactos psicológicos y sociales sufridos por los menores.",
      "release": "2025-03-13T04:15:00Z",
      "duration": "00:01:24",
      "explicit": false,
      "youTubeId": "9c5GTZ6UcWk",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9c5GTZ6UcWk"
      }
    },
    {
      "id": "67de45a6-9c9b-4cec-8bce-cbe99a115bb3",
      "title": "Finalizan primeras audiencias audiencias definitivas en el caso Lev Tahor",
      "description": "En la zona 1 capitalina, finalizaron las primeras audiencias del caso Lev Tahor, que definirán el destino de los menores que pertenecen a la secta. \nSe determinará si los menores serán devueltos a sus padres o entregados a un recurso familiar idóneo en Guatemala o fuera del país. \nSegún la información disponible, se celebrarán más de 160 audiencias en los próximos días para resolver el caso.",
      "release": "2025-03-13T02:28:59Z",
      "duration": "00:02:43",
      "explicit": false,
      "youTubeId": "LTWCaO83SOw",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LTWCaO83SOw"
      }
    },
    {
      "id": "6dcf400f-f255-4bd0-919c-9f02d0f635e2",
      "title": "PGN documenta el comportamiento de la Secta Lev Tahor",
      "description": "La Procuraduría General de la Nación informó que ha documentado casos de manipulación y dominación psicológica en una secta que opera en Guatemala desde 2016. \n\nLas audiencias definitivas del caso comenzarán el próximo miércoles 12 de marzo, permitiendo a las autoridades presentar sus hallazgos en detalle y buscar justicia para las víctimas afectadas.\n\nInformaron que se ha solicitado un peritaje cultural a las judicaturas que tienen a sus cargos los procesos que abordan todos los aspectos fundamentales que caracterizan a Lev Tahor y cómo funciona en Guatemala.",
      "release": "2025-03-11T04:00:29Z",
      "duration": "00:02:57",
      "explicit": false,
      "youTubeId": "dnHuaJabBhU",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dnHuaJabBhU"
      }
    },
    {
      "id": "eb4ff639-7147-43c9-8e41-7bd2a66b5694",
      "title": "Integrante de la secta Lev Tahor es requerido por México por el delito de trata de personas",
      "description": "Integrante de la secta Lev Tahor es requerido por México por el delito de trata de personas, así lo dieron a conocer las autoridades de Guatemala.",
      "release": "2025-03-07T13:15:47Z",
      "duration": "00:02:42",
      "explicit": false,
      "youTubeId": "L2PdWEhdCM4",
      "subjects": [
        "Lev Tahor",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L2PdWEhdCM4"
      }
    },
    {
      "id": "90580593-54ab-4682-9222-d8cc8bf49cbd",
      "title": "Manifestantes de Lev Tahor bloquean Puente del Incienso",
      "description": "Un grupo de al menos 12 integrantes de la comunidad Lev Tahor bloqueó esta mañana dos carriles del Puente del Incienso, afectando la conexión entre las zonas 7 y 1 de la Ciudad de Guatemala.",
      "release": "2025-03-06T14:11:12Z",
      "duration": "00:07:00",
      "explicit": false,
      "youTubeId": "FrlHolE6KsE",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FrlHolE6KsE"
      }
    },
    {
      "id": "ce8e2a5a-6526-42df-9610-23e5e89c296f",
      "title": "Miembros de Lev Tahor fueron ligados a proceso penal",
      "description": "Dos integrantes de la comunidad judía Lev Tahor fueron ligados a proceso penal por el delito de maltrato a menores de edad. \n\nEl magistrado resolvió procesar penalmente a los acusados, quienes deberán enfrentar las acusaciones en un juicio. \n\nLa defensa de los acusados indicó que tienen cuatro meses para probar la inocencia de sus defendidos, lo que añade una nueva dimensión a este caso.",
      "release": "2025-03-05T03:21:16Z",
      "duration": "00:02:56",
      "explicit": false,
      "youTubeId": "LpW4qCv-CVI",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LpW4qCv-CVI"
      }
    },
    {
      "id": "5a466d71-1987-4436-9a83-57fc65e5e9d6",
      "title": "Policía de Belice busca a menores desaparecidos de Lev Tahor",
      "description": "Las autoridades de Belice iniciaron un operativo para localizar a un grupo de niños guatemaltecos que estarían ocultos por miembros de la secta Lev Tahor.",
      "release": "2025-03-03T14:45:36Z",
      "duration": "00:01:14",
      "explicit": false,
      "youTubeId": "0Dc23IKq4qc",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0Dc23IKq4qc"
      }
    },
    {
      "id": "e37b76cc-443b-4092-8222-7b13c5c79dee",
      "title": "PGN se pronuncia tras localización de menores Lev Tahor en hoteles",
      "description": "Tras conocer que menores de la comunidad Lev Tahor, reportados como desaparecidos, fueron localizados por las autoridades en hoteles de la zona 1 y 3 de la ciudad capital en compañía de otros miembros adultos de su comunidad, autoridades de la Procuraduría General de la Nación (PGN) se pronunciaron al respecto.\n\nJulio Saavedra, procurador general de la nación, en conferencia de prensa, manifestó la postura de la institución ante los últimos acontecimientos en el caso Lev Tahor. Aseguró que el cumplimento de la ley busca proteger los derechos de los niños y niñas de dicha comunidad.\n\n“El cumplimiento de la ley no se negocia, especialmente cuando se trata de proteger los derechos de los niños, niñas y adolescentes”,  afirmó Julio Saavedra, procurador general de la nación.",
      "release": "2025-01-20T14:45:41Z",
      "duration": "00:08:04",
      "explicit": false,
      "youTubeId": "uLM1YZfhePw",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uLM1YZfhePw"
      }
    },
    {
      "id": "ba4d4b58-724e-4369-b190-51e065864645",
      "title": "Conozca el significado de la vestimenta de los miembros de la comunidad Lev Tahor",
      "description": "Desde el pasado mes de diciembre, la comunidad Lev Tahor ha causado polémica tras ser acusada de tráfico de personas y abuso sexual. Su peculiar vestimenta también ha llamado la atención de los guatemaltecos. En esta nota te contamos el significado de su vestimenta.",
      "release": "2025-01-19T04:30:01Z",
      "duration": "00:04:14",
      "explicit": false,
      "youTubeId": "abfeEr9EVzM",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=abfeEr9EVzM"
      }
    }
  ]
}