{
  "id": "5db321ee-f897-4b33-b415-a59baa70b558",
  "name": "Temple Barred Podcast",
  "spotifyId": "3WOIOjUeQ0K2LDgVMa5sRt",
  "appleId": 1740912270,
  "youTubeChannelId": "UC9QjTCxXYO6lKorwzrnpZGA",
  "episodes": [
    {
      "id": "8040fbf6-9aa9-4e70-8aef-b99fd625d649",
      "title": "Episode 61 – Cults",
      "description": "CULTS, CONSCIOUSNESS \u0026 FAME: Are religions just cults that went mainstream?\nIs football a cult? Music fandoms? Corporations? Governments?\nAnd what happens when belief systems are taken too far?\n\nIn Episode 61 of The Temple Bar Podcast, Jim and Philip take on one of their most wide-ranging and thought-provoking conversations yet — moving from David Koresh, Jim Jones, and Scientology to Sikhism, Jesus, modern celebrity worship, and the illusion of reality itself.\n\nThis episode explores how cults form, why people follow them, and how power, fame, and belief can slowly distort even the purest messages. Along the way, the conversation expands into consciousness, duality, free will, simulation theory, and the Law of One, while keeping things grounded with sharp humour, Irish storytelling, and real-world examples.\n\nIn this episode, we discuss:\n • What actually defines a cult\n • David Koresh, Waco \u0026 Jonestown explained\n • Religion vs cults: Jesus, Sikhism \u0026 reformers\n • How belief systems get corrupted over time\n • Celebrity \u0026 fame as modern cults (Bono, Kanye, Taylor Swift)\n • Football fandom and tribal identity\n • Free will, manipulation \u0026 power\n • Consciousness, duality \u0026 reality as a simulation\n • Why light and dark must coexist\n • Christmas parties, chaos \u0026 human nature 🍻\n\nThis episode doesn’t tell you what to believe — it encourages you to question everything, take what resonates, and leave the rest behind.\n\n👇 Like, subscribe \u0026 comment —\nIs everything a cult when taken to extremes?\n\n⸻\n\n🔔 Subscribe for weekly episodes\n\nNew episodes of The Temple Bar Podcast drop weekly — featuring deep conversations, cultural commentary, and unfiltered Irish perspectives on life, belief, and society.\n\n⸻\n\n🔎 Tags / Keywords\n\ncult documentary discussion, cult psychology, Temple Bar Podcast, Irish podcast, David Koresh Waco, Jim Jones Jonestown, Scientology explained, religion vs cults, Sikhism podcast, Jesus reformer, Law of One explained, simulation theory podcast, consciousness discussion, celebrity worship, fame and power, football fandom psychology, philosophy podcast",
      "release": "2025-12-16T14:41:21Z",
      "duration": "00:40:51",
      "explicit": false,
      "spotifyId": "6eCqnXXpA6Ekt1Yi39D1IE",
      "appleId": 1000740635265,
      "youTubeId": "NUim2S0YWgU",
      "subjects": [
        "Branch Davidians",
        "Peoples Temple",
        "_Ireland",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6eCqnXXpA6Ekt1Yi39D1IE",
        "apple": "https://podcasts.apple.com/podcast/episode-61-cults/id1740912270?i=1000740635265",
        "youtube": "https://www.youtube.com/watch?v=NUim2S0YWgU"
      }
    }
  ]
}