{
  "_ts": 0,
  "id": "a4db59a6-ca65-457a-b347-d14bd928d621",
  "name": "Terror Talk - Horror, True Crime and Humor",
  "spotifyId": "07JEm5Qm7cohukkEUOYt7P",
  "appleId": 1435529687,
  "episodes": [
    {
      "id": "76a40b3f-f15c-45d7-8645-7d8687ca66af",
      "title": "Female Narcissist in Cult Control - The Breath of Fire HBO Documentary",
      "description": "In this episode of Terror Talk Podcast, we dive into the chilling HBO documentary The Breath of Fire. This harrowing true crime story explores cult-like manipulation, the psychology of power, and the dangerous dynamics of a female narcissist in control. We analyze the psychological themes of coercion, trauma bonding, and the shocking psychological grip cult leaders hold over their victims. How does The Breath of Fire expose the terrifying reality of cult leaders? What psychological tactics were used to control and isolate victims? How does female narcissism manifest differently in these extreme cases? We break down the case behind the documentary, examining the real-life impact and the eerie patterns seen in similar cult-like groups. This is a spoiler-heavy discussion, so watch the documentary first if you want to go in blind! Instagram: @terrortalkpodcast YouTube: TerrorTalk Podcast Facebook: Halloween All Year Long TikTok: @dark.psychology.girls Music by: Mannequin Uprising#TerrorTalkPodcast #TrueCrimePsychology #FemaleNarcissist #CultPsychology #TheBreathOfFire #TrueCrimeDocumentary #DarkPsychology #CriminalMindset #ToxicManipulation #NarcissisticAbuse #HBOTrueCrime #PsychologicalControl",
      "release": "2025-04-02T09:00:00Z",
      "duration": "00:30:37.7270000",
      "explicit": false,
      "spotifyId": "0j4lJPgy9LoQgZoBjnbTM4",
      "appleId": 1000701874576,
      "subjects": [
        "Guru Jagat",
        "3HO",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0j4lJPgy9LoQgZoBjnbTM4",
        "apple": "https://podcasts.apple.com/podcast/female-narcissist-in-cult-control-the-breath-of-fire/id1435529687?i=1000701874576"
      }
    }
  ]
}