{
  "_ts": 0,
  "id": "ee5e157b-8fa4-4a8a-9569-64c165c12018",
  "name": "That\u0027s Where I\u0027m At",
  "spotifyId": "0Lmc87ro6rDrHWtw4MXV1x",
  "appleId": 1704083491,
  "youTubeChannelId": "UCmreacStStM3fLYbgwceT5w",
  "episodes": [
    {
      "id": "078b4c05-85e4-45e0-970c-433e134c8107",
      "title": "Healing From A Cult: Amanda’s Story of Finding Hope Again",
      "description": "In this episode, Laura is joined by Amanda, a wife, stay-at-home mama, and former cult member. Although it took years, she has found healing and understanding of the “why” and “how” this could happen to someone like her. She aims to help others avoid her path and know there is hope if they’re ON it. In this episode, Amanda shares her story and journey of healing. She discusses her experiences with domestic violence, emotional abuse, church hurt, and infidelity in marriage. She offers insights into the reasons behind her involvement in the cult and how she found healing and understanding. Through her story, Amanda aims to help others avoid similar paths and find hope in their situations. She emphasizes the importance of taking responsibility for one’s actions and well-being, highlighting the negative impact of constantly being blamed for someone else’s actions. Listen to Amanda\u0027s captivating journey and learn from her resilience and growth. Timestamps [00:01:10] Amanda’s story [00:04:07] Losing friends and church community [00:07:49] Moving from Catholicism to a more engaging, uplifting church atmosphere [00:14:10] Realizing the allure of belonging and structure, joining a controlling church, and gradual awareness of its impact [00:16:06] Persecution and finding purpose [00:21:25] Isolation and breaking ties [00:24:18] Restricted freedom and isolation [00:28:39] Frustration with spiritual mentorship [00:31:46] Losing sense of self [00:36:00] Disciples\u0027 decisions to move [00:40:11] Freedom in spiritual submission [00:46:02] Systemic abuses within the church [00:49:08] Holy gossip and transparency [00:52:11] Rebuilding Relationships After Leaving [00:56:32] Holding onto past mistakes [01:00:47] Marriage struggles and counseling [01:13:29] Cardboard testimonies [01:22:37] Considering leaving the marriage [01:25:09] Abuse and staying in relationships [01:30:44] Unexpected encounters and a twist of fate that lead to a surprising and joyful love story [01:34:30] Dealing with infertility and miscarriage [01:39:07] Boundaries and Safe People [01:41:05] Toxic churches and what that looks like Notable Quotes It\u0027s so much easier than you think to end up in a controlling situation, whether that\u0027s a religious situation, a marriage, or a toxic friendship. Many times, you don\u0027t realize it until you reach that point where you\u0027re more uncomfortable with what you\u0027re going through than the comfort you\u0027re getting from the situation. I want people to know that this could happen to you, too. It\u0027s really easy. I was not a stupid person. I graduated from the best high school in the city with honors. Like, I\u0027m not dumb. That\u0027s not what it was. It filled a need for me.\u0022You may want to try those things out and whatever they look like. Lots of little compromises over time result in you not even knowing who you are anymore. I felt like I wasn\u0027t worth staying for. I had a lot of health issues. I still do. But they were unknown at that point. You\u0027re getting something out of it, too. That\u0027s why we stay in unhealthy situations. Sometimes, it\u0027s that we\u0027re scared of what we would have to do if we left, and that\u0027s still what we\u0027re getting out of it. RESOURCES: FOLLOW THE PODCAST: http://www.thatswhereimatpodcast.com AMAZON JOURNALS STORE: https://www.amazon.com/stores/Laura-Richards/author/B09TX5ZW46?ref=ap_rdr\u0026store_ref=ap_rdr\u0026isDramIntegrated=true\u0026shoppingPortalEnabled=true Cult Resources: http://www.reveal.org https://icoc-icclawsuits.com https://freedomofmind.com/cult-mind-control/bite-model https://thecultishshow.com/new-page https://culteducation.com/warningsigns.html Domestic Violence Resources https://www.thehotline.org https://ncadv.org/get-help https://nnedv.org/content/red-flags-of-abuse Connect with Amanda\u0027s through her website: https://busymamadesigns.com",
      "release": "2023-12-13T14:01:00Z",
      "duration": "01:42:56.5560000",
      "explicit": true,
      "spotifyId": "1uJaTLpyL6UKMcTSIEbFSa",
      "appleId": 1000638442443,
      "youTubeId": "c2qYHZ1Z-GE",
      "subjects": [
        "International Churches Of Christ",
        "Cult Recovery",
        "Catholicism",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1uJaTLpyL6UKMcTSIEbFSa",
        "apple": "https://podcasts.apple.com/podcast/healing-from-a-cult-amandas-story-of-finding-hope-again/id1704083491?i=1000638442443",
        "youtube": "https://www.youtube.com/watch?v=c2qYHZ1Z-GE"
      }
    }
  ]
}