{
  "id": "5ea70fcc-62ef-45af-bc1d-122835e34e17",
  "name": "That1 Podcast",
  "spotifyId": "0tDQr3GRkwKJko59XraLrm",
  "appleId": 1777810398,
  "youTubeChannelId": "UCDGyAUnB81zotquyf7f6DLg",
  "episodes": [
    {
      "id": "e2d1667b-53d8-4590-9a9f-872a4dfc2c52",
      "title": "Married Into a Cult: Peter Young Reveals the Nightmare You’d Never Expect",
      "description": "In this jaw-dropping episode of That1 Podcast, Peter Young shares his unbelievable journey in and out of a tiny but dangerous religious cult—one that slowly consumed his marriage, family, and faith from the inside out. From marrying into what seemed like a loving family to uncovering the manipulative grip of a self-proclaimed prophet known only as “Uncle Robert,” Peter’s story is a chilling reminder of how easy it is to fall into darkness when you’re just trying to hold your family together. \u0026#x1f4d6; Peter is the author of Stop the Tall Man, Save the Tiger, a memoir that exposes the emotional, spiritual, and psychological abuse he endured—and how he rebuilt his life with unshakable faith. \u0026#x1f494; Parental alienation \u0026#x1f628; Spiritual manipulation \u0026#x1f4a5; Mind control and cult tactics \u0026#x1f6e1;️ The power of truth, faith, and reclaiming your identity Mike C-Roc and Peter dive deep into uncomfortable—but necessary—topics that many are too afraid to talk about. Peter’s courage to speak out will leave you questioning everything you think you know about control, charisma, and the cost of staying silent. \u0026#x1f3a7; Listen now on Apple Podcasts, Spotify, Amazon Music, and iHeartRadio \u0026#x1f4da; Grab Peter’s book on Amazon: Stop the Tall Man, Save the Tiger Find Peter on: Instagram - @peterbyoung LinkedIn - Peter Young YouTube - @authorpeteryoung Facebook - Peter Young Find Mike on: Instagram - @mikeycroc LinkedIn - Mike “C-Roc” Ciorrocco Facebook - Mike Ciorrocco",
      "release": "2026-01-06T13:40:02Z",
      "duration": "00:31:41.7400000",
      "explicit": false,
      "spotifyId": "7qKhq9UfTNYYO1HrI4cS0M",
      "appleId": 1000743972301,
      "youTubeId": "oMU1uWhfyRs",
      "subjects": [
        "Family Cult",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qKhq9UfTNYYO1HrI4cS0M",
        "apple": "https://podcasts.apple.com/podcast/married-into-a-cult-peter-young-reveals-the/id1777810398?i=1000743972301",
        "youtube": "https://www.youtube.com/watch?v=oMU1uWhfyRs"
      }
    }
  ]
}