{
  "id": "275a8139-1fff-4087-a494-2af1ff560f2e",
  "name": "That Sounds Fun with Annie F. Downs",
  "spotifyId": "6W24Yt5oA8G4U44LIgfVGb",
  "appleId": 944925529,
  "youTubeChannelId": "UCa-tPvY6HODihpmzjDV_KxA",
  "episodes": [
    {
      "id": "112f818f-2ffb-45c2-8acc-67d4a44dfcda",
      "title": "Starring in One Tree Hill, Fleeing a Cult, and Finding Identity in Christ with Bethany Joy Lenz- Episode 935",
      "description": "You may remember Bethany Joy Lenz from One Tree Hill (she was Haley James Scott on the show), but today she is being generous with her story of faith and freedom and identity, as she talks about the journey of finding herself in a cult, the manipulation she experienced, and the empowerment she found to break way from it all. She shares even more of this story and the destruction narcissism can cause in her brand new memoir, Dinner for Vampires , which, y’all, I seriously couldn\u0027t put down. . . . . Want to watch this episode on YouTube? Head on over to our YouTube Channel and be sure to like and subscribe! . . . . . Join our Patreon community Single Purpose League as we tackle the question: What is my single purpose and what is my purpose while single? . . . . . Sign up to receive the AFD Week In Review email and ask questions to future guests! #thatsoundsfunpodcast . . . . . Thank you to our sponsors! AG1: Every week of November, AG1 will be running a special Black Friday offer for a free gift with your first subscription, in addition to the Welcome Kit with Vitamin D3\u0026#43;K2. So make sure to check out DrinkAG1.com/soundsfun to see what gift you can get this week! Great American Family: For all the Great American Family goodness, go to pureflix.com to start your free trial! . . . . . If you’d like to partner with Annie as a sponsor for the That Sounds Fun podcast, fill out our Advertise With Us form! . . . . . NYTimes bestselling Christian author, speaker, and host of popular Christian podcast, That Sounds Fun Podcast, Annie F. Downs shares with you some of her favorite things: new books, faith conversations, entertainers not to miss, and interviews with friends. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-04T09:00:00Z",
      "duration": "01:08:18.2200000",
      "explicit": false,
      "spotifyId": "2bY7WH6OSxUZy3ABT7oscW",
      "appleId": 1000675586274,
      "youTubeId": "voGxyIBuvxA",
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bY7WH6OSxUZy3ABT7oscW",
        "apple": "https://podcasts.apple.com/podcast/starring-in-one-tree-hill-fleeing-a-cult-and/id944925529?i=1000675586274",
        "youtube": "https://www.youtube.com/watch?v=voGxyIBuvxA"
      }
    }
  ]
}