{
  "_ts": 0,
  "id": "490da15a-30dd-4b6e-b9ae-c2157fe71379",
  "name": "That Was Stupid",
  "spotifyId": "5fblAglkMLduLVh0x0UJdI",
  "appleId": 1683215848,
  "youTubeChannelId": "UCtj90RxgFMV_ultaWULsZIQ",
  "episodes": [
    {
      "id": "e6d077a7-45bb-4a2a-8a8a-72cf82810957",
      "title": "The one where the woman leaves a cult (Episode 16)",
      "description": "Carrie Sheffield vividly remembers finding her father’s writings and realizing something was wrong. Up until that point, she and her family were convinced her dad was a prophet in the LDS church. They traveled around the country, living in tents and motorhomes. The abuse she encountered was her “normal.” However, shortly after finding her father’s letters she found the courage to leave the cult her family had created. Not surprisingly, those she loved told her she was “stupid.” But that’s just the beginning: her father quickly “prophesied” that she would be raped for leaving. What happened after? How did she end up becoming a Harvard-educated pundit that now appears on cable new? Well, that’s Episode 16 of “That Was Stupid.” In this episode, Carrie talks about: • What her family cult experience looked like • The abuse she endured • How her family reacted when she left • What motivated her to rise above her circumstances • The decision to forgive her father • Her other “stupid” decision • Her new book about her life, “ Motorhome Prophecies ” • And more! Be sure to read pick up Carrie’s new book, “ Motorhome Prophecies: A Journey of Healing and Forgiveness .” If you’d like to watch the video version of the podcast, it’s available at readdearjon.com. Get full access to \u0022Dear Jon\u0022 at jonseidl.substack.com/subscribe",
      "release": "2024-09-18T18:00:00Z",
      "duration": "01:00:40.7750000",
      "explicit": false,
      "spotifyId": "6MWPE6NLllP0jZ1q1TfgRS",
      "appleId": 1000669965763,
      "youTubeId": "9f4CzwlFjdg",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6MWPE6NLllP0jZ1q1TfgRS",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-the-woman-leaves-a-cult-episode-16/id1683215848?i=1000669965763",
        "youtube": "https://www.youtube.com/watch?v=9f4CzwlFjdg"
      }
    }
  ]
}