{
  "id": "ff376457-529b-4edf-aa5b-7308fd220408",
  "name": "The Recovering Hunbot",
  "spotifyId": "",
  "appleId": null,
  "youTubeChannelId": "UCX8b5D9_f7vMHG1paZ74psA",
  "episodes": [
    {
      "id": "1ab22b31-4b65-4932-83ec-051901c98642",
      "title": "Chris Shelton \u0026 Jon Atack Analyze Potential Mind Control in the Business Opportunity ONPASSIVE",
      "description": "I began listening to Chris Shelton and Jon Atack in late 2018 or early 2019. Their words resonated with me and I began to question the business opportunity I had joined. Eventually, r/antimlm content enterd my recommended videos and I started watching. Chris and Jon helped me wake up and to begin to think critically once again. Their expert insight helped me see what I experienced was not something unusual or in a vaccum. Others who were involved in differet organizations had many of the same feelings as I did. I owe much of my healing to both Chris and Jon. I thank them for putting out such meaningful content that is so very helpful to those of us who have been involved in an organization that dominates your life with coercive conrtol.\r\n\r\nI also began to do independent research, that is how I became friends and colleagues with them, Robert Fitzpatrick, Doug Brooks, Dr. William Keep, and others who have spoken out about the many problems of multilevel marketing companies. When I found out they were having a conference, I asked if I could also present. Hence, I have been part of the Multilevel Marketing The Consumer Protection Challenge ever since.\n\nDonate/Support The Channel Here:\nVenmo: @recoveringhunbot\nCashApp: $TheRecoveringHunbot\n\nSUBSCRIBE TO THE RECOVERING HUNBOT\nhttps://www.youtube.com/@RecoveringHunbot?sub_confirmation=1\n\nSUBSCRIBE TO UNSCRIPTED\nhttps://www.youtube.com/channel/UC51leKQidL_isplO1hq0AVA?sub_confirmation=1\n\nAll clips used for fair use commentary, criticism, and educational purposes.  See Hosseinzadeh v. Klein, 276 F.Supp.3d 34 (S.D.N.Y. 2017) Equals Three, LLC v. Jukin Media, Inc., 139 F. Supp. 3d 1094 (C.D. Cal. 2015).\n\nAs was ruled in Hosseinzadeh v. Klein, 276 F.Supp.3d 34 (S.D.N.Y. 2017), clips from an original work may be used to “comment on and critique a work”, and the use of clips is “reasonable to accomplish the transformative purpose of critical commentary”.  See also NXIVM v. The Ross Institute, Inc., 364 F.3d 471 (2nd Cir. 2004) (quotations from course materials for critical commentary was fair use).  I believe my video is transformative in nature in order to criticize and comment, and is not intended as a market substitute for the original video.\n\n**DISCLAIMER**\nThe contents of this video is based on my research, experience and opinions. It is intended entertainment purposes. Please, do your own research. You are welcome to use my sources listed in the video description. \n\n*-*-*-*-*-*-*-*-\nThis video was created and published by The Recovering Hunbot in her personal capacity. The opinions expressed in this article are the author\u0027s own and should not be taken as fact. The validity of any evidence provided should be independently checked for authenticity, and The Recovering Hunbot takes no responsibility for the actions of those viewing this video.\n\n\n***Copyright/Fair Use Disclaimer\nUnder Section 107 of the Copyright Act 1976, allowance is made for \u0022fair use\u0022 for purposes such as criticism, comment, news reporting, teaching, scholarship and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.\n\nBecome a  Patreon https://www.patreon.com/therecoveringhunbot\n*_*_*_*_\n\nSUBSCRIBE https://www.youtube.com/channel/UCX8b5D9_f7vMHG1paZ74psA?\nSHARE YOUR STORY WITH ME https://forms.gle/HAFsLZtwpg6ExcQt5\nTEE SPRING STORE https://teespring.com/stores/the-recovering-hunbot\n\n*_*_*_*_\nFollow Me on Twitter - https://twitter.com/r_hunbot\nFollow Me on IG: https://www.instagram.com/the_recovering_hunbot\nLike My FB Page: https://www.facebook.com/recoveringhunbot\nRequest to Join my FB Group - https://www.facebook.com/groups/478231729691989/\n\n*_*_*_*_*\n\nReport fraud, scams, and bad business practices at ReportFraud.ftc.gov. OR If you believe that you are a victim of a false, misleading, or deceptive business practices in the US, submit a complaint to TINA.org. \nFraudulent or suspicious activity can be reported to the Canadian Anti-Fraud Centre, through its website at www.antifraudcentre.ca, or by telephone at 1-888-495-8501.\nReport instances of misleading or deceptive marketing practices to the Competition Bureau using the online complaint form or by telephone at 1-800-348-5358.  \n\nThe SEC strongly encourages the public (whistleblowers and non-whistleblowers) to submit any tips, complaints, and referrals (TCRs) using the SEC\u0027s online TCR system and complaint form at https://www.sec.gov/tcr. \n\n*_*_*_*_*\nAMAZON STORE\nhttps://www.amazon.com/shop/therecoveringhunbot\n\n\nSTUFF I USE\nStream Yard (My Affiliate Link) https://streamyard.com?fpr=recoveringhunbot\nTube Buddy (My Affiliate Link) - https://www.tubebuddy.com/Alanda\nVideo Editing Fillmora 9(My affiliate link) - https://filmora.wondershare.com/invite-new-user.html?invite_code=eyJ1aWQiOjIxNTQ3NzQ1Nywibmlja25hbWUiOiIifQ==\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/4624427018092544",
      "release": "2023-08-27T21:23:41Z",
      "duration": "02:02:52",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "ZM4LgOUn11Y",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=ZM4LgOUn11Y"
      }
    }
  ]
}