{
  "id": "9dde7f53-59b0-4165-b46c-e2bbd122adad",
  "name": "The Jan Broberg Show",
  "spotifyId": "4AQmMbpuuMXlbty7sFX6HJ",
  "appleId": 1643071063,
  "episodes": [
    {
      "id": "2afa13a9-c84f-433c-b441-a8d34e381135",
      "title": "Pushing Back the Darkness : Surviving Cult Abuse and Spiritual Manipulation with Jennifer Redcay [Part 2]",
      "description": "[Content Warning]: Religious cult, physical abuse, sexual abuse, psychological abuse, abortion, self-harm Today, Jan is again joined by Jennifer Redcay to finish her story of cult abuse and escape. Said abuse turned sexual when the cult leader claimed Jennifer’s \u0022fantasies about him\u0022 required \u0022acting out\u0022 to purge demons. For nearly two years, he coerced her into increasingly degrading acts—always framed as \u0022spiritual cleansing.\u0022 When she became pregnant, he froze her out for three days, then ordered her to get an abortion. His wife took her across state lines to a clinic, where Jennifer endured the procedure alone. That trauma became a turning point. \u0022How could God want this?\u0022 she asked herself. Small rebellions followed: a customer’s prayer about God’s love (\u0022Greater is He that is in you\u0022) clashed with the cult’s teachings. Finding a book on deliverance ministries, thinking it would help reaffirm her belief in the cult, turned out to be literature denouncing the practice and exposed the leader’s identical tactics. After a couple of failed attempts and a discussion with fellow christians at her waitressing job, she finally fled. Now 17 years free, Jennifer shares how forgiveness (of herself and her abusers) and motherhood—adopting five children from trauma—rebuilt her life. \u0022Healing is like an onion,\u0022 she says. \u0022You peel layers over years.\u0022 Buy Jennifer’s Book: Pushing Back The Darkness by Becca Anderson and Jennifer Redcay Where To Find Jennifer: JenniferRedcay.com Tiktok: @jenniferredcayauthor If you or someone you know is experiencing emotional distress or suicidal ideation, please access the resources below: National Suicide and Crisis Lifeline: Call/Text 988 National Sexual Assault Hotline (RAINN) : 1-800-656-HOPE (4673) National Alliance for Mental Illness: 1-800-950-6264 Subscribe / Support / Contact: \u0026#x1f34e; Review on Apple \u0026#x1f3b6; Review on Spotify ✍ Share Your Story \u0026#x1f310; Podcast Website \u0026#x1f534; YouTube \u0026#x1f4f7; Instagram Jan Broberg Foundation: \u0026#x1f49d; Foundation Website \u0026#x1f4d2; The Jan Broberg Story \u0026#x1f5de; Sign Up For Our Newsletter \u0026#x1f49e; Thrivivors",
      "release": "2025-04-22T09:00:00Z",
      "duration": "00:43:53.8740000",
      "explicit": false,
      "spotifyId": "3UPPKEghSzqBBrstB9XqTM",
      "appleId": 1000704430619,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3UPPKEghSzqBBrstB9XqTM",
        "apple": "https://podcasts.apple.com/podcast/pushing-back-the-darkness-surviving-cult-abuse/id1643071063?i=1000704430619"
      }
    },
    {
      "id": "056e04a6-77c2-4416-aab6-47a8b373843e",
      "title": "Pushing Back the Darkness : Surviving Cult Abuse and Spiritual Manipulation with Jennifer Redcay [Part 1]",
      "description": "[Content Warning]: Religious cult, physical abuse, sexual abuse, psychological abuse Today, Jan is joined by Jennifer Redcay, who spent 10 years of her late 20s and early 30s in a cult that nearly extinguished her soul, spirit, and life. Jennifer opens with her childhood—abandoned by her father and raised by a mother whose remarriage to a bipolar man left her longing for love. That void made her vulnerable when a charismatic couple running a \u0022deliverance ministry\u0022 lured her in, promising spiritual fulfillment. What began as Bible study spiraled into total control: she sold her home, cut off family, and handed over $400,000 to her abusers. The cult leader, just nine years her senior, declared himself her \u0022father\u0022 and rewrote her identity—forcing her to call his wife \u0022Mother\u0022 and her own mom by her first name. Jennifer describes the escalating abuse: sleep deprivation, food restrictions, and brutal beatings for disobedience. She recounts horrifying rituals like watching movies (even porn) to \u0022expose her sins,\u0022 followed by hours of \u0022exorcisms\u0022 for fabricated demons. All of this and more were overshadowed by the cult’s isolation tactics. Though Jennifer and her mom lived together, they were forbidden from speaking unless supervised, which was supported by the cult leader somehow knowing when they had broken that rule. \u0022He didn’t want us comparing stories,\u0022 she says. By the time physical violence became routine, Jennifer was trapped—convinced leaving would condemn her to hell. The abuse turned sexual when the cult leader claimed Jennifer’s \u0022fantasies about him\u0022 required \u0022acting out\u0022 to purge demons. For nearly two years, he coerced her into increasingly degrading acts—always framed as \u0022spiritual cleansing.\u0022 Buy Jennifer’s Book: Pushing Back The Darkness by Becca Anderson and Jennifer Redcay Where To Find Jennifer: JenniferRedcay.com Tiktok: @jenniferredcayauthor If you or someone you know is experiencing emotional distress or suicidal ideation, please access the resources below: National Suicide and Crisis Lifeline: Call/Text 988 National Sexual Assault Hotline (RAINN) : 1-800-656-HOPE (4673) National Alliance for Mental Illness: 1-800-950-6264 Subscribe / Support / Contact: \u0026#x1f34e; Review on Apple \u0026#x1f3b6; Review on Spotify ✍ Share Your Story \u0026#x1f310; Podcast Website \u0026#x1f534; YouTube \u0026#x1f4f7; Instagram Jan Broberg Foundation: \u0026#x1f49d; Foundation Website \u0026#x1f4d2; The Jan Broberg Story \u0026#x1f5de; Sign Up For Our Newsletter \u0026#x1f49e; Thrivivors",
      "release": "2025-04-15T09:00:00Z",
      "duration": "00:44:40.6330000",
      "explicit": false,
      "spotifyId": "2aeugRS7Yi1bIm09Mu6Ggj",
      "appleId": 1000703574373,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2aeugRS7Yi1bIm09Mu6Ggj",
        "apple": "https://podcasts.apple.com/podcast/pushing-back-the-darkness-surviving-cult-abuse/id1643071063?i=1000703574373"
      }
    }
  ]
}