{
  "id": "429c8db8-ba27-486d-86fd-1930613dc040",
  "name": "The Moscow Murders and More",
  "spotifyId": "3NRdSMmnAp37uIXqXFcJqL",
  "appleId": 1686267498,
  "episodes": [
    {
      "id": "41d243bb-a581-447f-a264-8794960039de",
      "title": "From The Archives:  What Could Bryan Kohberger Learn From The Lori Vallow Trial",
      "description": "Lori Vallow Daybell did not receive the death penalty due to a combination of factors primarily related to the management and timing of evidence disclosures by the prosecution. The defense argued that the prosecution\u0027s late submission of thousands of documents and pieces of evidence impeded their ability to adequately prepare for trial. Judge Steven Boyce ruled to remove the death penalty to ensure that Vallow Daybell\u0027s constitutional rights were protected, allowing her defense team sufficient time to review the evidence. The judge emphasized that his decision was not to penalize the state but to avoid potential reversible errors that could arise from discovery issues if a death sentence were imposed​.  \n\nThe implications of this decision might influence Bryan Kohberger\u0027s case, as his defense team could leverage similar arguments regarding evidence handling and procedural fairness. Kohberger, charged with the murders of four University of Idaho students, is facing the death penalty. His defense has been actively challenging the prosecution on various procedural grounds, including the handling and disclosure of DNA evidence and other investigative materials​.\n\nIn this episode, we dive in and take a look at the possibility of Bryan Kohberger avoiding the death penalty due to prosecutorial misconduct.\n\n\n\n(commercial at 9:31)\n\nto contact me:\n\nbobbycapucci@protonmail.com\n\n\nsource:\n\nIdaho suspect Bryan Kohberger\u0027s team could use same tactic as cult mom Lori Vallow to avoid death penalty if convicted | The US Sun (the-sun.com)",
      "release": "2024-11-22T21:15:06Z",
      "duration": "00:14:09",
      "explicit": false,
      "spotifyId": "1ZF9dV4s8XDlP6QTDObqoL",
      "appleId": 1000677948510,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ZF9dV4s8XDlP6QTDObqoL",
        "apple": "https://podcasts.apple.com/podcast/from-the-archives-what-could-bryan-kohberger-learn/id1686267498?i=1000677948510"
      }
    },
    {
      "id": "90304dee-33b5-4ec3-9422-bc70d6612ab6",
      "title": "Lori Vallow And Her Ridiculous Attempt To Craft An Alibi",
      "description": "Lori Vallow has been found guilty for the murder of her two children, JJ and Tylee and a slew of other charges connected to their murder. The state of Idaho alleges that she, along with her husband Chad Daybell, murdered the two children and buried them on Daybell\u0027s Idaho property.Lori Vallow has a different version of events and she says that she has an alibi to prove it. In this episode, we take a look at her alibi and the sates response to her filing of it.(commercial at 7:21)to contact me:bobbycapucci@protonmail.comsource:Shock twist in Lori Vallow\u0027s case as alibi \u0027won\u0027t clear \u0022cult mom\u0022\u0027 in trial for murdering kids, lawyers say | The US Sun (the-sun.com)This show is part of the Spreaker Prime Network, if you are interested in advertising on this podcast, contact us at https://www.spreaker.com/show/5852883/advertisement",
      "release": "2023-12-08T23:30:02Z",
      "duration": "00:10:30.6890000",
      "explicit": true,
      "spotifyId": "4BBBbGt7trgTZRyp0dxzaB",
      "appleId": 1000637983376,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BBBbGt7trgTZRyp0dxzaB",
        "apple": "https://podcasts.apple.com/podcast/lori-vallow-and-her-ridiculous-attempt-to-craft-an-alibi/id1686267498?i=1000637983376"
      }
    },
    {
      "id": "32fc12cb-8440-4410-a8a8-6f57d644c109",
      "title": "A Second Juror Who Sat In Judgement Of Lori Vallow Discusses How They Came To A Guilty Verdict",
      "description": "Lori Vallow Daybell is a woman from the United States who gained national attention in 2019 and 2020 for the disappearance of her two children, Joshua \u0022JJ\u0022 Vallow and Tylee Ryan. She was born Lori Norene Cox on June 26, 1973, in San Bernardino, California.Lori Vallow Daybell had a troubled personal life and was married multiple times before marrying her fifth husband, Chad Daybell, in 2019. Her previous husband, Charles Vallow, was killed in July 2019 by her brother, Alex Cox, who claimed self-defense.Cox himself died a few months later of what was initially believed to be natural causes, but was later determined to be due to a pulmonary embolism.Lori Vallow Daybell\u0027s children were last seen in September 2019, and she and Chad Daybell were eventually charged with several crimes related to their disappearance. The children\u0027s remains were later found on Chad Daybell\u0027s property in Idaho in June 2020. Lori Vallow Daybell is currently facing charges including conspiracy to commit murder, murder, and first-degree burglary.In this episode, we hear from another Juror, this time an alternate about her thoughts regarding the trial and the verdict and how the trial and the gruesome details were haunting.(commercial at 8:19)to contact me:bobbycapucci@protonmail.comsource:Lori Vallow trial juror says the cult mom couldn’t hide behind Chad Daybell’s ‘manipulation’ | The IndependentThis show is part of the Spreaker Prime Network, if you are interested in advertising on this podcast, contact us at https://www.spreaker.com/show/5852883/advertisement",
      "release": "2023-12-08T21:30:02Z",
      "duration": "00:10:51.5910000",
      "explicit": true,
      "spotifyId": "3Z8Nmz18hrJwfSpfTLMWiM",
      "appleId": 1000637975257,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Z8Nmz18hrJwfSpfTLMWiM",
        "apple": "https://podcasts.apple.com/podcast/a-second-juror-who-sat-in-judgement-of-lori/id1686267498?i=1000637975257"
      }
    },
    {
      "id": "89b950c1-0e0d-44ed-8ae3-96d682b7579b",
      "title": "Author Joe Glatt Dishes All The Dirt On Lori Vallow Daybell",
      "description": "John Glatt, the author of the book Doomsday Mother gave an interview to The Mirror recently and talked about some of the findings he uncovered while talking to those closest to Lori and those who knew her and Chad the best.In this episode, we hear from John Glatt who discusses his book and his impression of Lori Vallow and what might happen during her trial.(commercial at 8:41)to contact me:bobbycapucci@protonmail.comsource:\u0027Cult mum\u0027 Lori Vallow a \u0027narcissist convinced murdered kids were zombies\u0027, says author - Mirror OnlineThis show is part of the Spreaker Prime Network, if you are interested in advertising on this podcast, contact us at https://www.spreaker.com/show/5852883/advertisement",
      "release": "2023-12-08T19:30:02Z",
      "duration": "00:14:49.5940000",
      "explicit": true,
      "spotifyId": "3fg4HZiye4xmZIplvD0SkS",
      "appleId": 1000637966758,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3fg4HZiye4xmZIplvD0SkS",
        "apple": "https://podcasts.apple.com/podcast/author-joe-glatt-dishes-all-the-dirt-on-lori-vallow-daybell/id1686267498?i=1000637966758"
      }
    },
    {
      "id": "eb6d1dc1-982e-47c0-8fe5-1747e020fd08",
      "title": "One Of The Lori Vallow Jurors Discusses Why The Jury Found Her Guilty",
      "description": "Lori Vallow Daybell is a woman from the United States who gained national attention in 2019 and 2020 for the disappearance of her two children, Joshua \u0022JJ\u0022 Vallow and Tylee Ryan. She was born Lori Norene Cox on June 26, 1973, in San Bernardino, California.Lori Vallow Daybell had a troubled personal life and was married multiple times before marrying her fifth husband, Chad Daybell, in 2019. Her previous husband, Charles Vallow, was killed in July 2019 by her brother, Alex Cox, who claimed self-defense.Cox himself died a few months later of what was initially believed to be natural causes, but was later determined to be due to a pulmonary embolism.Lori Vallow Daybell\u0027s children were last seen in September 2019, and she and Chad Daybell were eventually charged with several crimes related to their disappearance. The children\u0027s remains were later found on Chad Daybell\u0027s property in Idaho in June 2020. Lori Vallow Daybell is currently facing charges including conspiracy to commit murder, murder, and first-degree burglary.In this episode, we hear from one of the jurors about the process they followed and what finally convinced him that Lori Vallow was guilty.(commercial at 8:00)to contact me:bobbycapucci@protonmail.comsource:Juror in murder trial of Lori Vallow Daybell breaks silence - ABC News (go.com)This show is part of the Spreaker Prime Network, if you are interested in advertising on this podcast, contact us at https://www.spreaker.com/show/5852883/advertisement",
      "release": "2023-12-08T17:30:02Z",
      "duration": "00:11:08.7420000",
      "explicit": true,
      "spotifyId": "2NR36ESPsmjtzMzEIcUf6p",
      "appleId": 1000637958925,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NR36ESPsmjtzMzEIcUf6p",
        "apple": "https://podcasts.apple.com/podcast/one-of-the-lori-vallow-jurors-discusses-why-the/id1686267498?i=1000637958925"
      }
    }
  ]
}