{
  "_ts": 0,
  "id": "5c845373-1d8d-4f6c-92aa-b9d251538a28",
  "name": "The HoneyDew with Ryan Sickler",
  "spotifyId": "077u0EzRRZBWR7UkZvOg3b",
  "appleId": 527446250,
  "youTubeChannelId": "UCBXPTYli_MdWNaMt3fsvl4w",
  "episodes": [
    {
      "id": "a6624597-138c-4a18-a536-b058d34c5f2b",
      "title": "332: Craig Shoemaker: What Comes Around,  Cults Around",
      "description": "My HoneyDew this week is comedian Craig Shoemaker! Be sure to check out his newest book, Laffirmations: A 40-Day Cleanse. Craig joins me to Highlight the Lowlights of a life shaped by chaos, cults, comedy, and complicated family ties. We get into what it was like growing up with a scam-artist father who ran his own cult, the terrifying week-long kidnapping Craig survived at just 13 years old, and the emotional wreckage he\u0027s faced more recently after his wife left him and abducted their kids to join a cult of her own. With sharp wit, a survivor’s resilience, and a passion for mentorship, Craig shares what it truly means to find your voice when life keeps trying to silence it. SUBSCRIBE TO MY YOUTUBE and watch full episodes of The Dew every toozdee! https://youtube.com/@rsickler SUBSCRIBE TO MY PATREON - The HoneyDew with Y’all, where I Highlight the Lowlights with Y’all! Get audio and video of The HoneyDew a day early, ad-free at no additional cost! It’s only $5/month! AND we just added a second tier. For a total of $8/month, you get everything from the first tier, PLUS The Wayback a day early, ad-free AND censor free AND extra bonus content you won\u0027t see anywhere else! https://www.patreon.com/TheHoneyDew What’s your story?? Submit at honeydewpodcast@gmail.com Get Your HoneyDew Gear Today! https://shop.ryansickler.com/ Ringtones Are Available Now! https://www.apple.com/itunes/ http://ryansickler.com/ https://thehoneydewpodcast.com/ SUBSCRIBE TO THE CRABFEAST PODCAST https://podcasts.apple.com/us/podcast/the-crabfeast-with-ryan-sickler-and-jay-larson/id1452403187 SPONSORS: Rocket Money -Cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money. Go to https://www.RocketMoney.com/HONEYDEW today.",
      "release": "2025-05-05T07:00:00Z",
      "duration": "01:25:28.7510000",
      "explicit": false,
      "spotifyId": "2HIaRdU8TZ4LVQmX4ICoa8",
      "appleId": 1000706327379,
      "youTubeId": "jGk3rFQstXE",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2HIaRdU8TZ4LVQmX4ICoa8",
        "apple": "https://podcasts.apple.com/podcast/craig-shoemaker-what-comes-around-cults-around/id527446250?i=1000706327379",
        "youtube": "https://www.youtube.com/watch?v=jGk3rFQstXE"
      }
    }
  ]
}