{
  "_ts": 0,
  "id": "37c8a3e2-6635-4c47-917b-a96d7456be52",
  "name": "The Imagination Podcast",
  "spotifyId": "2645EemW8tLhffTnaxyqu4",
  "appleId": 1526743863,
  "youTubeChannelId": "UCUI2O6cTTbstaVMUCtvGkxA",
  "episodes": [
    {
      "id": "9c02db22-1921-4c52-9cf0-99b869ef75fa",
      "title": "NXIVM Cult \u0026 Trafficking Survivor India Oxenberg: \u0027Still Learning\u0027 After Being \u0027Seduced\u0027",
      "description": "What an incredible honor to get to have NXIVM and human trafficking survivor, author, executive producer and an all around inspirational sweetheart, India Oxenberg, join us on this week\u0027s podcast episode! India was a personal inspiration for the creation of our ongoing \u0027Survivor Series\u0027 as her story is one of just a few to break national and international headlines. It\u0027s not often a survivor has their voice or story heard by the public and this episode was very timely with India\u0027s new book release for \u0027Still Learning\u0027 (on Audible) and with recent news breaking regarding the sentencing of NXIVM\u0027s Allison Mack (3 years) and Keith Raniere (120 years).\n\nYou can hear India\u0027s incredible survivor story in full on the incredible docuseries she executive produced on STARZ called \u0027Seduced\u0027, and we used our time together to dive into some aspects of being a survivor that aren\u0027t as commonly talked about such as grooming, cults, mind control, healing, relationships, her inspiration for going public with her story, and the importance of self care. The reality is that a survivor is never \u0027free\u0027 from what they go through and no one is better at humanizing a survivor\u0027s experiences of abuse than India.\n\nThis conversation brings light to asking the important question: \u0022What does human trafficking really look like?\u0022 and (as you\u0027ll see), the answer to that question isn\u0027t as linear as one would think.\n\nPlease support India\u0027s new book and check out her series on STARZ - these are valuable tools to learn more on human trafficking and they pave the way for conversations to be had regarding the psychology of both the abuser and the survivor. India is an absolute delight and I know this episode will impact you as much as it did me!\n\nConnect with India:\nInstagram: @IndiaOxenberg\nLinkTree: https://linktr.ee/Indiaox\n\nCONNECT WITH THE IMAGINATION:\nAll links here:\nhttps://direct.me/theimaginationpodcast",
      "release": "2021-07-12T19:30:06Z",
      "duration": "00:50:02",
      "explicit": false,
      "spotifyId": "355X9QCa6tOx7IraozZyCr",
      "appleId": 1000528584061,
      "youTubeId": "-yJ9dJdwebg",
      "subjects": [
        "NXIVM",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/355X9QCa6tOx7IraozZyCr",
        "apple": "https://podcasts.apple.com/podcast/ep-36-nxivm-cult-and-human-trafficking-survivor-india/id1526743863?i=1000528584061",
        "youtube": "https://www.youtube.com/watch?v=-yJ9dJdwebg"
      }
    }
  ]
}