{
  "_ts": 0,
  "id": "f338959d-2fb2-4838-8a56-1e9ab331f4c2",
  "name": "The Afro Atheist",
  "youTubeChannelId": "UC-Vn8JbQ4sbMKYzz7HFMtFg",
  "episodes": [
    {
      "id": "7e91a31a-aba5-4747-a4a5-ccebb89329c1",
      "title": "Jerry Eze and the cult of NSPPD - A conversation about God",
      "description": "Join in the conversation \r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5719281357291520",
      "release": "2024-08-24T03:14:52Z",
      "duration": "06:10:44",
      "explicit": false,
      "youTubeId": "yaQOvzZY2Hs",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yaQOvzZY2Hs"
      }
    },
    {
      "id": "c563e4d6-beea-4d39-89f6-cf959dc620c6",
      "title": "Jerry Eze and the Cult of NSPPD: A Critical Look at Blind Faith",
      "description": "#jerryeze #nsppd #nsppdian Join us for an in-depth analysis of the recent UK conference hosted by Pastor Jerry Eze, known for his online ministry and controversial \u0027miracle\u0027 claims. While his mumu followers are passionately defending these supposed miracles, the evidence tells a different story. They show a complete lack of rational reasoning defending their cult leader.!We\u0027ll dissect the claims, expose the critical thinking flaws in these defences, and explore why so many people are drawn to these easily debunked events. Prepare for a no-holds-barred discussion as we separate fact from fiction in the world of faith and miracles.",
      "release": "2024-08-23T17:55:33Z",
      "duration": "01:38:08",
      "explicit": false,
      "youTubeId": "aQXadc9PuRs",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aQXadc9PuRs"
      }
    },
    {
      "id": "63baaca6-df85-420a-8e98-287d3162f49b",
      "title": "Is Jerry Eze a Cult Leader?",
      "release": "2024-08-18T06:35:05Z",
      "duration": "01:51:35",
      "explicit": false,
      "youTubeId": "PcCyyMxLa2Q",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PcCyyMxLa2Q"
      }
    },
    {
      "id": "8245c022-bcd3-4612-b0f6-809c96e3f7be",
      "title": "Debunking Jerry Eze’s \u0027Miracle\u0027 at London Conference: The Truth Behind the Cerebral Palsy Claim",
      "description": "Welcome to today\u0027s livestream where we critically examine the recent claims made by Jerry Eze at his London conference. In an event that has captured significant attention, Eze has asserted that he healed a child with cerebral palsy, allowing her to walk. However, a closer look at this so-called \u0027miracle\u0027 reveals a disheartening and, frankly, disgusting reality. While the child may have been able to walk, she has not been cured of cerebral palsy.\r\n\r\nAs an atheist committed to truth and rationality, we find it essential to challenge these narratives that exploit vulnerable individuals and perpetuate false hope. We\u0027ll dissect the claims, scrutinise the evidence, and discuss the ethical implications of such assertions. Join us as we seek to uncover the truth behind Jerry Eze’s controversial statement and advocate for genuine, science-based understanding and support for those living with cerebral palsy.\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-08-16T09:44:09Z",
      "duration": "01:41:30",
      "explicit": false,
      "youTubeId": "76ChWP072Ds",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=76ChWP072Ds"
      }
    },
    {
      "id": "17d13cd7-2e91-426a-9177-ac95255188c7",
      "title": "Jerry Eze\u0027s London Crusade: Miracles or Scam? Exploring Claims and Controversies",
      "description": "Join us as we dive deep into the recent sensational crusade by Pastor Jerry Eze in London. Thousands flocked to witness purported miracles and powerful sermons, but is everything as it seems? In this live stream, we will: Examine Jerry Eze\u0027s claims of genuine miracles.\r\nInvestigate accusations and evidence of potential scams.\r\nDiscuss allegations of child abuse within the context of these events.\r\nEngage with us in the chat, share your thoughts, and let\u0027s uncover the truth behind the headlines\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-08-13T00:19:33Z",
      "duration": "02:20:56",
      "explicit": false,
      "youTubeId": "cxQDvLt5WUc",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cxQDvLt5WUc"
      }
    },
    {
      "id": "65e10cd3-7b8f-4d9c-b865-cab8e9f6c94c",
      "title": "Exposing Abel Damina\u0027s Hypocrisy: The Grift of African Preachers",
      "description": "Join me for a revealing live stream as I delve into the controversial shift of Abel Damina. A African Preacher claiming to have the true gospel of Jesus and Christianity a religion brought to Africa by colonialism and missionaries. Once a staunch advocate for the collection of tithes, Damina has now reversed his stance, presenting himself as a champion of transparency and integrity. But is this change genuine, or is it just another facade to continue exploiting followers for profit?\r\nI will:\r\nUnpack Damina\u0027s contradictory sermons on tithing.\r\nExamine what he teaches under the guise of spirituality. Discuss the broader issue of religious exploitation and the role of pastors in modern-day scams. Don\u0027t miss this eye-opening discussion about the true motives behind Abel Damina\u0027s actions. Tune in, share your thoughts, and help uncover the truth about religious hypocrisy and financial manipulation and ultimately the scam of religion. \r\n\r\n👉 Subscribe and hit the notification bell to stay updated on all our latest exposés and discussions.",
      "release": "2024-07-21T07:55:00Z",
      "duration": "01:46:53",
      "explicit": false,
      "youTubeId": "dl_tBGyDOf8",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dl_tBGyDOf8"
      }
    },
    {
      "id": "4e54d8e5-bca1-4c6a-8232-f600ffc97950",
      "title": "Unmasking the Ohio Cult: Queen Belemzy\u0027s Reign of Power \u0026 Online Witch Hunts",
      "description": "Join us as we delve deep into the disturbing world of the School of Power Ministries, led by the enigmatic Queen Belemzy. In this eye-opening stream, we uncover how this Ohio-based cult operates online, targeting and demonising women who dare to disagree with their leader. Learn how loyal followers, eager to please Queen Belemzyof, produce videos speaking evil, branding dissenters as witches and much worse. Hear from the cult leader Belema and her followers and discover the shocking truth behind this dangerous and manipulative group. Don’t miss this critical exposé",
      "release": "2024-06-29T09:42:57Z",
      "duration": "01:25:09",
      "explicit": false,
      "youTubeId": "8EBxz1m1rwc",
      "subjects": [
        "Queen Belemzy"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8EBxz1m1rwc"
      }
    },
    {
      "id": "5f1f9fee-b1f4-4c65-9dc7-766bf4495909",
      "title": "Africa’s Deadliest Christian Cult- over 400 dead including kids. @Paul Mackenzie",
      "description": "Join me for this one, exposing the evil in the religion of Christianity. This is Kenya’s doomsday cult where victims have crossed the 400 mark as detectives exhumed 12 more bodies on believed to be followers of a pastor who ordered them to fast to death in order to meet Jesus. Apparently the number of those who died has risen to 403, with 95 people rescued.\r\nPaul Mackenzie has been charged with murder after the bodies were found buried in shallow graves in the remote forest of Shakahola in the east of the country.\r\nSurvivors and victims\u0027 families have said Paul Mackenzie urged followers to fast in order to \u0022go see Jesus\u0022.\r\nHe and 29 others pleaded not guilty in a court in the coastal town of Malindi.\r\nMackenzie has already been charged with committing acts of terror, child cruelty and torture, which he denied.",
      "release": "2024-03-24T23:04:48Z",
      "duration": "02:20:47",
      "explicit": false,
      "youTubeId": "fK5AwjB6A2k",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fK5AwjB6A2k"
      }
    }
  ]
}