{
  "_ts": 0,
  "id": "f8c4e942-d3cd-438e-8a87-98e3ebf42274",
  "name": "The Angela Rose Show",
  "spotifyId": "59agC2zKBtisN45ZOIiExv",
  "appleId": 1801317091,
  "youTubeChannelId": "UCM9AB_LDTtDivgesW7IAMIg",
  "episodes": [
    {
      "id": "41cf6254-bd18-4cac-a6ae-6d48028de572",
      "title": "From Cults to Clarity: Michelle Stewart’s Journey Out of Religious Control",
      "description": "What happens when obedience becomes survival, and silence is enforced through fear of eternal damnation?\n\n\n\nIn this episode of The Angela Rose Show, I sit down with Michelle Stewart, activist, survivor, and author of JUDAS GIRL. Michelle grew up moving through a series of religious cults, including Hutterite, Bruderhof, River Brethren, Russian Orthodox, and an off-grid Amish-style commune led by a former Pathway Publishing editor. Each group claimed to hold “truth,” but used fear, shame, and religious coercion to suppress identity, voice, and thought.\n\n\n\n🔍 We explore:\n\nWhy Michelle used the word cult, and what actually qualifies as one\nGender hierarchy, obedience, and early objectification in Hutterite and Bruderhof life\nThe psychological toll of being called “worse than Judas” by her father at age 14\nHer struggle to reconcile faith, autonomy, and loyalty as a teenage church member\nThe role purity culture played in grooming, coercion, and sexual violation\nHow indoctrination prevented her from recognizing abuse, and her own worth\nThe impact of untreated mental illness and betrayal within religious systems\nThe life-saving power of education, language, and the right resources\n\n\nMichelle’s story is one of surviving impossible choices, reclaiming power, and choosing to name the truth, even when it’s not welcome. As she says in the episode:\n\n\n\n“You can only make choices from the mindset you know.”\n\n\n\n📕 Her memoir JUDAS GIRL doesn’t offer a tidy ending.. It offers validation, insight, and a path toward clarity.\n\n\n\n🛑 Trigger warning: This episode includes honest discussions of sexual abuse, spiritual manipulation, and suicide ideation. Please take care as you listen.\n\n\n\n💬 If something in this conversation resonates with your story, comment below or message privately. You’re not alone.\n\n\n\n📕 Get the Book\n\nJUDAS GIRL by Michelle Stewart\n\nAlso available on Amazon and major bookseller platforms\n\n\n\n🔗 Follow Michelle Stewart:\n\nInstagram: @michelle_stewart_author - https://www.instagram.com/michelle_stewart_author\n\nFacebook: @Michelle-StewartAuthor-61552318056042 - https://www.facebook.com/p/Michelle-StewartAuthor-61552318056042/\n\nMichelle Stewart\u0027s Official Website: https://michellestewartauthor.com/\n\n\n\n🔗 Follow Angela Rose:\n\nInstagram: @angelarosemartin\n\nFacebook: @angelarosemartin\n\nTikTok: @angelaroseshow\n\n\n\n🔖 Crisis Support Resources\n\nIf you or someone you know is in crisis, please reach out to one of the following:\n\n\n\nCrisis Text Line – Text TWLOHA to 741741\nSuicide \u0026 Crisis Lifeline – Call 988\nNational Child Abuse Hotline – Call 800-422-4453\nNational Domestic Violence Hotline – Call 800-799-7233\nRAINN (Rape, Abuse \u0026 Incest National Network) – Call 800-656-4673\n\n\nYou are not alone. Help is available.",
      "release": "2025-06-25T11:30:16Z",
      "duration": "01:52:55",
      "explicit": false,
      "spotifyId": "7DD09febm7S7vOUmDjYM3k",
      "appleId": 1000714495964,
      "youTubeId": "ATVSUK8ns0Q",
      "subjects": [
        "Hutterites",
        "Amish",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7DD09febm7S7vOUmDjYM3k",
        "apple": "https://podcasts.apple.com/podcast/from-cults-to-clarity-michelle-stewarts-journey-out/id1801317091?i=1000714495964",
        "youtube": "https://www.youtube.com/watch?v=ATVSUK8ns0Q"
      }
    },
    {
      "id": "330af42d-daee-4e7f-a9f9-195a01b953c7",
      "title": "Individuality, Diversity, And The Power of Potential",
      "description": "“When I began to succeed, I found out quickly who was truly for me.\u0022\n\n\n\nIn this deeply personal episode of The Angela Rose Show, I sit down once again with my soul-friend and fellow survivor, Jessica Witmer of Wild Olive Branch Coaching. We’re not just talking about healing today, we’re talking about thriving. About reclaiming agency, success, and voice after a lifetime of compliance and oppression. \n\n\n\nComing from Amish and Mennonite cultures where entrepreneurship was “a man’s lane,” Jess and I open up about what it really means to launch a business as a woman from a high-control religious environment. This isn’t about hustle culture. It’s about health, ownership, and self respect. It\u0027s about choosing courage over what mind control had instilled in us.\n\n\n\n🔍 We unpack:\n\nThe loneliness of stepping into your potential\nHow gender role expectations didn\u0027t work for us and why we broke those rules\nThe painful loss of relationships when we stopped struggling and started thriving\nWriting as reclamation: turning our stories into strength\nWhy success as a survivor is revolutionary\n\n\nIf you’ve ever felt like your healing or ambition made others uncomfortable, this episode is for you. \n\n💬 Drop a comment, share your story, or just know this: you’re not too much. You have all you need to live out your deepest passion. Dream on!\n\n\n\n\n🔗 Follow Jessica Witmer:\n\nInstagram: @wildolivebranchcoaching\n\nFacebook: @jessicawitmer\n\nCoaching: Wild Olive Branch Coaching\n\n\n\n🔗 Follow Angela Rose:\n\nInstagram: @angelarosemartin\n\nFacebook: @angelarosemartin\n\nTikTok: @angelaroseshow\n\n\n\n📢 Support This Work\n\nPlease like, comment, and share to help us reach more survivors ready to step into freedom.\n\n\n\n📍 CRISIS SUPPORT RESOURCES\n\nCrisis Text Line – Text TWLOHA to 741741\n\nSuicide \u0026 Crisis Lifeline – Call 988\n\nNational Child Abuse Hotline – Call 800-422-4453\n\nNational Domestic Violence Hotline – Call 800-799-7233\n\nRAINN – Call 800-656-4673",
      "release": "2025-05-20T17:00:00Z",
      "duration": "00:35:06.3830000",
      "explicit": false,
      "spotifyId": "4O5lQMmU8bPwqKly4PjSMA",
      "appleId": 1000709164657,
      "youTubeId": "aMJQKuR3z_w",
      "subjects": [
        "Amish",
        "Cult Psychology",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4O5lQMmU8bPwqKly4PjSMA",
        "apple": "https://podcasts.apple.com/podcast/individuality-diversity-and-the-power-of-potential/id1801317091?i=1000709164657",
        "youtube": "https://www.youtube.com/watch?v=aMJQKuR3z_w"
      }
    },
    {
      "id": "319d8367-ba09-4069-ace3-f809fbf92634",
      "title": "Amish, Addicted, And My Recovery",
      "description": "In today’s episode of The Angela Rose Show, I sit down with someone I deeply admire — Jessica Witmer of Wild Olive Branch Coaching. This is her story as a teenager, but it’s also the story of so many of us who grew up silenced, oppressed, and searching for safety in high-control religious environments.\n\n\n\nJessica was raised in an Amish household with 15 siblings, a strict environment, with emotional neglect and physical abuse that ran deep. She opens up about being the “outsider” in a church she would never be fully accepted into, dissociation and self-harm, and the unbearable shame that engulfed her for years. Her courage to revisit her teenage years and speak so vulnerably is nothing short of stunning.\n\n\n\nWe talked about what it’s like to wake up from survival mode and realize you’ve never been taught how to live. How even after escaping abuse, the battle isn\u0027t over—it just changes. Jessica shares what helped her begin to heal, the poem she wrote that still gives me chills, and the powerful meaning behind her “I think you should stay” hat and self harm transformation tatoo.\n\n\n\n💬 What we dive into:\n\nJessica’s experience growing up Amish and feeling like an outsider\nSelf inflicted violence, and how it became a way of coping\nHow she escaped her abusive home at 17 \nWhat healing actually looked like… messy, non-linear, and painfully beautiful\nWhy her scars and her story no longer carries shame\n\n\nIf you are struggling with your mental health, I hope this episode reminds you: there is nothing wrong with you. You were never the problem. And you are absolutely worthy of compassion and recovery. I think you should stay.\n\n\n\n🖤 Follow Jessica:\n\nInstagram: @wildolivebranchcoaching\n\nFacebook: @jessicawitmer\n\nCoaching \u0026 Support: Search Wild Olive Branch Coaching\n\n\n\n🎙️ Follow me (Angela Rose):\n\nInstagram: @angelarosemartin\n\nFacebook: @angelarosemartin\n\nTikTok: @angelaroseshow\n\n\n\n🔔 Subscribe for more real stories from survivors who’ve turned pain into purpose.\n\n\n\n❤️ If You Need Immediate Help\n\n\n\n📍 CRISIS SUPPORT RESOURCES\n\nCrisis Text Line – Text TWLOHA to 741741\n\nSuicide \u0026 Crisis Lifeline – Call 988\n\nNational Child Abuse Hotline – Call 800-422-4453\n\nNational Domestic Violence Hotline – Call 800-799-7233\n\nRAINN (Rape, Abuse \u0026 Incest National Network) – Call 800-656-4673\n\n\n\nYou matter. Your story matters. And healing is possible.",
      "release": "2025-05-06T19:00:00Z",
      "duration": "01:08:45.8570000",
      "explicit": true,
      "spotifyId": "6Gxl3yAQSbw6htQW8ImBak",
      "appleId": 1000706577431,
      "youTubeId": "a8wzHi4wt5k",
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Gxl3yAQSbw6htQW8ImBak",
        "apple": "https://podcasts.apple.com/podcast/amish-addicted-and-my-recovery/id1801317091?i=1000706577431",
        "youtube": "https://www.youtube.com/watch?v=a8wzHi4wt5k"
      }
    },
    {
      "id": "51a818b9-08f2-428c-9a25-67e491dce82a",
      "title": "Hidden Trauma, Religious Control, and Realistic Recovery",
      "description": "I’ll never forget the moment Jessica said, “Before I ever abandoned myself, I was abandoned by others.” That line was profound.\n\nIn this episode of The Angela Rose Show, I sit down with my friend Jessica Witmer, trauma coach and founder of Wild Olive Branch Coaching, to have a raw conversation on what realistic trauma recovery might look like.\n\nJessica grew up with 15 siblings in a high-control religious community where abuse, silencing, and survival became the norm. In this episode, we go there. The hard parts. The invisible wounds. The parts nobody wants to talk about in church. \n\nWe unpack:\n-How self-abandonment starts early in religious trauma\n-How fear and shame are baked into obedience\n-How abuse doesn’t always leave bruises—but always leaves impact\n-The grief of discovering what was done to you was never your fault\n-And how reconnecting with your body changes everything \n\nThis isn’t surface-level healing. This is real. This is raw. This is recovery.\n\n💬 Drop a comment if this resonates, because you’re not alone. Feel free to email Jessica or Angela Rose if you are looking for professional trauma recovery resources.\n🧠 \u0022If no one else believed you, I hope you still find the courage to believe yourself.\u0022 ~Wild Olive Branch Coaching\n\n—\n\n🔗 Connect with Jessica Witmer\nInstagram: @wildolivebranchcoaching\nFacebook: @jessicawitmer\nCoaching \u0026 Support: Search Wild Olive Branch Coaching\n\n🎙️ Follow Angela Rose:\nInstagram: @angelarosemartin\nFacebook: @angelarose\nTikTok: @angelaroseshow\n\n📢 If this conversation meant something to you, please like, comment, and share. It helps us reach more survivors and amplify these powerful stories.  \n\n#TheAngelaRoseShow #ReligiousAbuse #SpiritualAbuseRecovery #ReligiousTrauma #WildOliveBranchCoaching #Jessicawitmer #ComplexTrauma #SelfAbandonment #SurvivorStories #cultrecovery #traumarecovery #amish #mennonite #mentalhealth #abusesurvivors #mentalhealthawareness #religiousabuse #hiddenabuse",
      "release": "2025-05-02T10:00:00Z",
      "duration": "01:00:58.2660000",
      "explicit": false,
      "spotifyId": "7EqtqCzbFZ6JZC7QcXPE4z",
      "appleId": 1000705827939,
      "youTubeId": "yOusvgSL4zQ",
      "subjects": [
        "Cult Recovery",
        "Amish",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7EqtqCzbFZ6JZC7QcXPE4z",
        "apple": "https://podcasts.apple.com/podcast/hidden-trauma-religious-control-and-realistic-recovery/id1801317091?i=1000705827939",
        "youtube": "https://www.youtube.com/watch?v=yOusvgSL4zQ"
      }
    },
    {
      "id": "bf96342b-6db5-463e-be8c-5111b716afc8",
      "title": "Tattoos, Trauma \u0026 Truth, Not Wrapped in a Bow",
      "description": "What happens when your body becomes both the site of trauma and the canvas for healing?\n\nIn this vulnerable conversation, I sit down with Ann, a survivor of sexual and spiritual abuse within a Mennonite community. Together, we unravel the weight of twisted love messages, the cost of silence, and what it means to reclaim the parts of yourself once stolen.\n\nWe talk about the long-term impact of childhood rape, the tangled lines between church and God, and how healing doesn’t always look like a testimony with a pretty ending. Ann  shares how her tattoos became symbols of resilience, authenticity, and ownership of her own body.\n\nIf you’ve ever felt silenced, confused by love, or blamed for your pain, this space is for you.\n\nWe are not here to perform healing. We’re here to tell the truth, even when it’s still unfinished.\n\n🕊 Subscribe for more unfiltered stories from survivors. Your voice matters.\n\n🎙 The Angela Rose Show\n\n▪️ Connect with Ann Detweiler:\nBlog: abundantredemptionblog.wordpress.com\nFacebook: facebook.com/abundantredemptionblog\nInstagram: @mrs_anndetweiler\n\n\n▪️ Follow Angela Rose:\nInstagram: @angelarosemartin\nFacebook: @angelarosemartin\nTikTok: @angelaroseshow\n\nIf You Need Immediate Help‼️\n\n☑️CRISIS TEXT LINE\nText TWLOHA to 741741\n\n☑️NATIONAL SUICIDE PREVENTION LIFELINE\nCall 988\n\n☑️NATIONAL CHILD ABUSE HOTLINE\n800-422-4453\n\n☑️NATIONAL DOMESTIC VIOLENCE HOTLINE\n800-799-7233\n\n☑️RAPE, ABUSE, INCEST NATIONAL NETWORK (RAINN)\n800-656-4673",
      "release": "2025-04-11T12:00:00Z",
      "duration": "00:59:01.7600000",
      "explicit": true,
      "spotifyId": "4ua45iaEEQLR7A5kx7Idpd",
      "appleId": 1000703149872,
      "youTubeId": "F8KOLe7XZ1I",
      "subjects": [
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ua45iaEEQLR7A5kx7Idpd",
        "apple": "https://podcasts.apple.com/podcast/tattoos-trauma-truth-not-wrapped-in-a-bow/id1801317091?i=1000703149872",
        "youtube": "https://www.youtube.com/watch?v=F8KOLe7XZ1I"
      }
    },
    {
      "id": "4dfdcfb9-f98f-4dbd-9a48-b8fa4d0c0fcb",
      "title": "Mennonite Cult Survivor Exposes Abuse: My Journey from Spiritual Torment to Near-Suicide Despair",
      "description": "In this raw and unfiltered testimony, a Mennonite cult survivor bravely recounts her harrowing experiences of spiritual, emotional, physiological, and physical abuse. Plunged into despair with thoughts of suicide, her story is a powerful reminder of the impact of abuse and the difficult road to recovery. Viewer discretion is advised. Please like, comment, and subscribe for more honest accounts and support for survivors.\n\nhttps://www.tiktok.com/@angelaroseshow?_t=ZT-8uULHDDIf0g\u0026_r=1\n\nhttps://www.instagram.com/angelarosemartin?igsh=OGQ5ZDc2ODk2ZA%3D%3D\u0026utm_source=qr\n\nhttps://www.facebook.com/angelarosemartin?mibextid=LQQJ4d\n\n‼️If You Need Immediate Help‼️\n\n☑️CRISIS TEXT LINE\nText TWLOHA to 741741\n\n☑️NATIONAL SUICIDE PREVENTION LIFELINE\nCall 988\n\n☑️NATIONAL CHILD ABUSE HOTLINE\n800-422-4453\n\n☑️NATIONAL DOMESTIC VIOLENCE HOTLINE\n800-799-7233\n\n☑️RAPE, ABUSE, INCEST NATIONAL NETWORK (RAINN)\n800-656-4673",
      "release": "2025-03-06T20:00:00Z",
      "duration": "00:53:00.8000000",
      "explicit": true,
      "spotifyId": "0LPjlpYBrgGF56zt7ZAOp5",
      "appleId": 1000698653263,
      "youTubeId": "KUVXCrRk9qk",
      "subjects": [
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0LPjlpYBrgGF56zt7ZAOp5",
        "apple": "https://podcasts.apple.com/podcast/mennonite-cult-survivor-exposes-abuse-my-journey-from/id1801317091?i=1000698653263",
        "youtube": "https://www.youtube.com/watch?v=KUVXCrRk9qk"
      }
    }
  ]
}