{
  "_ts": 0,
  "id": "2f5e189c-1e0f-43cd-9aac-52aaa71375c7",
  "name": "The Outlook Podcast Archive",
  "spotifyId": "3nQLe8rTw6DrMd79d9v4qT",
  "appleId": 1618960891,
  "episodes": [
    {
      "id": "8eaa9b84-44ec-4520-8528-e5393bf20901",
      "title": "The cult, the crocodile and my journey back to love",
      "description": "This podcast contains references to child sexual abuse.    Juliana Buhring was born into a religious cult that she says brought her up with a warped idea of love. She was separated from her mum at the age of three and ended up living in communes in more than 20 different countries. When she left the group at the age of 23, she went on to discover healthier, less exploitative ways to love. But when a crocodile took the life of the man she had fallen in love with, Juliana hatched a plan to deal with the grief and embarked on a journey that would get her into the record books. Her book about her experience is called This Road I Ride. If you\u0027ve been affected by any of the issues in the programme, you can find information about where to get help and support at Befrienders Worldwide or through the BBC Action Line.Get in touch: outlook@bbc.comPresenter: Jo Fidgen Producer: Edgar Maddicott(Photo: Juliana Buhring. Credit: Courtesy of Juliana Buhring)",
      "release": "2021-12-06T12:56:00Z",
      "duration": "00:41:02.2230000",
      "explicit": true,
      "spotifyId": "5NW6BeGohYdWR7SM53pUVO",
      "appleId": 1000557373229,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5NW6BeGohYdWR7SM53pUVO",
        "apple": "https://podcasts.apple.com/podcast/the-cult-the-crocodile-and-my-journey-back-to-love/id1618960891?i=1000557373229",
        "bbc": "https://www.bbc.co.uk/sounds/play/w3ct1jv2"
      }
    },
    {
      "id": "4d334566-abe3-4bc8-a954-f1871a6ba352",
      "title": "The perilous world of a ‘cult deprogrammer’",
      "description": "Rick Alan Ross was selling and restoring cars when his grandmother’s Jewish nursing home was secretly infiltrated by a Christian group that tried to convert her. Rick started investigating, which lead him to a career as a world-renowned cult intervention specialist, or cult deprogrammer. Now, he helps people leave destructive cults or controversial groups and movements. But it’s work that can be demanding, problematic and perilous – especially if interventions don\u0027t go to plan.This podcast is part of Cult Behaviour, a mini-series from Outlook exploring how a cult can manipulate a person’s sense of reality, and what it can take to break free. Radio listeners, if you are searching for the combined podcast version of Rick’s interview – this is it. Presenter: Saskia Edwards Producer: Maryam Maruf Music: Joel CoxPicture: Man with \u0027the end of the world is nigh\u0027 placard Credit: Getty Images",
      "release": "2021-06-02T11:40:00Z",
      "duration": "00:40:25.9390000",
      "explicit": false,
      "spotifyId": "3gZHAfkaeFlIKD9FzPjbtk",
      "appleId": 1000557369404,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3gZHAfkaeFlIKD9FzPjbtk",
        "apple": "https://podcasts.apple.com/podcast/the-perilous-world-of-a-cult-deprogrammer/id1618960891?i=1000557369404",
        "bbc": "https://www.bbc.co.uk/sounds/play/p09k7djp"
      }
    },
    {
      "id": "d9e3d338-6028-4a1f-949f-b489acf7ac77",
      "title": "Fighting to free my daughter from the Nxivm \u0027sex cult\u0027",
      "description": "In 2011, the former Dynasty actor Catherine Oxenberg and her 19-year-old daughter India took a course from the self-help organisation Nxivm (pronounced Nexium). It was a pivotal experience for India as she had been struggling to find a career and Nxivm seemed to offer her purpose. She ended up working for them as a coach and moving away from her mother. What India didn’t know was that Nxivm was in fact a dangerous cult. Eventually she would be trapped in a secret subgroup, which was really a sex-trafficking ring operated by the cult leader, Keith Raniere.This episode is part of Cult Behaviour, a mini-series from Outlook exploring how a cult can manipulate a person’s sense of reality, and what it can take to break free. Radio listeners, if you are searching for the combined podcast version of India and Catherine’s interview – this is it. Presenter: Saskia Edwards Producers: Saskia Edwards, Maryam Maruf Music: Joel CoxPicture: Catherine and India Oxenberg, with Catherine\u0027s mother Princess Elizabeth of Yugoslavia on the left Credit: Courtesy Starz Entertainment",
      "release": "2021-05-31T11:06:00Z",
      "duration": "00:43:42.4320000",
      "explicit": false,
      "spotifyId": "4azpRwwe7nc6ndgi2xlU1I",
      "appleId": 1000557369574,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4azpRwwe7nc6ndgi2xlU1I",
        "apple": "https://podcasts.apple.com/podcast/fighting-to-free-my-daughter-from-the-nxivm-sex-cult/id1618960891?i=1000557369574",
        "bbc": "https://www.bbc.co.uk/sounds/play/p09jyxgs"
      }
    },
    {
      "id": "3eb38003-71cf-4c44-9d6c-ddffafa28604",
      "title": "The music star who was born into a cult",
      "description": "Mikel Jollett started life in a California-based cult called Synanon. What began as a drug rehabilitation programme that helped his father kick a heroin addiction later turned into a cult where children were taken away from their parents at just six months old and married couples were forced to split up and take new partners. As the cult turned increasingly violent, Mikel’s mother managed to escape with him and his brother, but Mikel’s hardships didn’t end there. For years he never spoke about his childhood. It was only later - when he discovered a love for music and formed a successful band, The Airborne Toxic Event - that he began to open up and write about those early years. Mikel’s book is called Hollywood Park.Get in touch: outlook@bbc.comPresented by: Emily Webb Produced by: Patrick Kiteley and Andrea RangecroftPicture: Mikel Jollett performs with The Airborne Toxic Event in 2015  Credit: Andrew Benge/Redferns via Getty Images",
      "release": "2021-05-10T11:45:00Z",
      "duration": "00:40:42.5270000",
      "explicit": false,
      "spotifyId": "2BfSSErW1iBe2FGbdSSJ1E",
      "appleId": 1000557369608,
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2BfSSErW1iBe2FGbdSSJ1E",
        "apple": "https://podcasts.apple.com/podcast/the-music-star-who-was-born-into-a-cult/id1618960891?i=1000557369608",
        "bbc": "https://www.bbc.co.uk/sounds/play/p09h4r47"
      }
    },
    {
      "id": "6e5d2f9d-4f9c-4e5a-9d11-32fb6e19b878",
      "title": "The supermodel who escaped a cult",
      "description": "Hoyt Richards has been called the first male supermodel. In the 1980s and 90s he jet-setted around the world doing shoots for Versace and Ralph Lauren, and moving in the same circles as stars like Cindy Crawford, Christy Turlington and Madonna. But outside of working hours he was involved with a cult called Eternal Values. They believed there would be a catastrophe at the turn of the century and the group would have a crucial role to play. This episode was first released on 29th March 2018. Presenter: Jo Fidgen. Producer: Catrin Manel. Picture: Hoyt Richards. Credit: Fabrizio Gianni.",
      "release": "2020-08-10T11:00:00Z",
      "duration": "00:40:08.9900000",
      "explicit": false,
      "spotifyId": "2EqSJK0hh2VFVTJzZEnyXL",
      "appleId": 1000557338761,
      "subjects": [
        "Eternal Values"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2EqSJK0hh2VFVTJzZEnyXL",
        "apple": "https://podcasts.apple.com/podcast/the-supermodel-who-escaped-a-cult/id1618960891?i=1000557338761",
        "bbc": "https://www.bbc.co.uk/sounds/play/p08myhf8"
      }
    },
    {
      "id": "30a4fda5-51db-4c84-9afa-c6ffdcc1fb04",
      "title": "The Supermodel who Took Down a Cult",
      "description": "Hoyt Richards has been called the first male supermodel. In the 1980s and 90s he was jet-setting around the world doing shoots for Versace and Ralph Lauren, and moving in the same circles as stars like Cindy Crawford, Christy Turlington and Madonna. But outside of working hours he was involved with a cult called Eternal Values. They believed there would be a catastrophe at the turn of the century and the group would have a crucial role to play. So partying wasn\u0027t allowed. Image: Hoyt Richards Credit: Fabrizio Gianni",
      "release": "2018-04-02T12:00:00Z",
      "duration": "00:40:41.4040000",
      "explicit": false,
      "spotifyId": "7oKVXUSLQL0fHsgNkLzy0c",
      "appleId": 1000651884984,
      "subjects": [
        "Eternal Values",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7oKVXUSLQL0fHsgNkLzy0c",
        "apple": "https://podcasts.apple.com/podcast/the-supermodel-who-took-down-a-cult/id1618960891?i=1000651884984",
        "bbc": "https://www.bbc.co.uk/sounds/play/w3cswkxz"
      }
    }
  ]
}