{
  "id": "1cec3b0d-60df-460f-ab1e-7b1c1666bd92",
  "name": "The Emily Show",
  "spotifyId": "7rEbYHcwlxtBO2jEF8HHu3",
  "appleId": 1486229281,
  "youTubeChannelId": "UCE-laOeM9gLfTcWF4HRBPpA",
  "episodes": [
    {
      "id": "8ff2691d-454b-45ea-826f-99d5d55a431e",
      "title": "Leah Remini v Scientology \u0026 Lizzo Case’s Anti-SLAPP Arguments",
      "description": "The Leah Remini v Scientology case was in court last week. The judge has scheduled the Anti-SLAPP hearing at a later date for further argument. Scientology Leader, David Miscavige, continues his efforts to be removed from the case stating he was never properly served. Remini details that her process server made 32 separate visits to 9 different addresses on 16 separate dates from August 2023 to December 2023, costing her thousands of dollars. They will be in court on Valentine\u0027s Day to rule on the motion to quash. Lizzo\u0027s Anti-SLAPP motion is partly granted. I break down the court\u0027s minute order and which portions of case law are moving forward.This podcast uses the following third-party services for analysis: Podsights - https://podsights.com/privacyPodscribe - https://podscribe.com/privacyChartable - https://chartable.com/privacy",
      "release": "2024-02-07T10:44:00Z",
      "duration": "01:21:43",
      "explicit": true,
      "spotifyId": "6CeRdyxybJFQkdZjy0P7vz",
      "appleId": 1000644472174,
      "youTubeId": "mOZEnCpNAFQ",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6CeRdyxybJFQkdZjy0P7vz",
        "apple": "https://podcasts.apple.com/podcast/leah-remini-v-scientology-lizzo-cases-anti-slapp-arguments/id1486229281?i=1000644472174",
        "youtube": "https://www.youtube.com/watch?v=mOZEnCpNAFQ"
      }
    },
    {
      "id": "b8c01ba7-3d40-4df1-99ff-2e927ce45697",
      "title": "Quick Bits: Murdaugh New Trial Hearing. Leah Remini v.  Scientology. Alec Baldwin is Indicted Again.",
      "description": "Murdaugh was in court before Justice Toal on Tuesday, January 16, 2024. The status conference set the tone for the upcoming Evidentiary Hearing on Murdaugh’s motion for a new trial. Justice Toal made it clear that deliberating jurors and Clerk of Court Becky Hill will be called as witnesses. I\u0027ll be covering that proceeding, gavel to gavel, starting on January 29, 2024Also, on Tuesday, January 16, 2024, Leah Remini v Scientology was in court in Los Angeles for the oral arguments on Scientology’s Anti-Slapp motion. A final order isn’t out yet, but I expect we will see that soon.   In New Mexico, Alec Baldwin was indicted on one count of involuntary manslaughter again. This is the second time the state has charged Alec with the crime. The first time, the state withdrew the charges because they wanted more time for forensic testing.Connect With Me. Get the App! Join The Members-Only CommunityLooking for my YouTube videos?  This podcast uses the following third-party services for analysis: Podsights - https://podsights.com/privacyPodscribe - https://podscribe.com/privacyChartable - https://chartable.com/privacy",
      "release": "2024-01-22T10:44:00Z",
      "duration": "00:05:32",
      "explicit": true,
      "spotifyId": "3h0wjYTMsyos5VI1xEDe1y",
      "appleId": 1000642479148,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3h0wjYTMsyos5VI1xEDe1y",
        "apple": "https://podcasts.apple.com/podcast/quick-bits-murdaugh-status-conference-leah-v-scientology/id1486229281?i=1000642479148"
      }
    },
    {
      "id": "7039af36-1bb8-47ff-8f3f-84882f4e3ed0",
      "title": "Leah Remini v Scientology. Litigation Heats Up Ahead of Hearing.",
      "description": "Leah Remini’s court battle with Scientology has been met with tons of additional litigation. Both sides have made it clear they will not go into mediation regarding this lawsuit, making a court showdown highly likely.David Miscavige, the ecclesiastical leader, claims he was never properly served by Leah’s team and should be removed from the lawsuit. Leah has requested the court place an injunction on the church of Scientology due to their continued harassment campaign against her. The manner of which has become so severe that by the time the trial is over, her reputation could be irreparably damaged. The Church of Scientology has additionally filed an anti-SLAPP motion claiming their reciprocal right to speech is based on public interest. The court has been so overwhelmed with their back and forth that they requested both sides to stop filing motions while the court takes the time to review and consider the current motions prior to the hearing.This podcast uses the following third-party services for analysis: Podsights - https://podsights.com/privacyPodscribe - https://podscribe.com/privacyChartable - https://chartable.com/privacy",
      "release": "2024-01-17T10:44:00Z",
      "duration": "01:19:04.0460000",
      "explicit": true,
      "spotifyId": "0OoOa5EH6Xmq9tKkbPxhUI",
      "appleId": 1000641958658,
      "youTubeId": "YKUly-imUQ4",
      "subjects": [
        "Scientology",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0OoOa5EH6Xmq9tKkbPxhUI",
        "apple": "https://podcasts.apple.com/podcast/leah-remini-v-scientology-litigation-heats-up-ahead/id1486229281?i=1000641958658",
        "youtube": "https://www.youtube.com/watch?v=YKUly-imUQ4"
      }
    }
  ]
}