{
  "_ts": 0,
  "id": "0c793636-1844-4c19-a8b5-8d0287e84ae7",
  "name": "The Quicky",
  "spotifyId": "4omeoOVsGWXhhFObFWGTvT",
  "appleId": 1451469361,
  "episodes": [
    {
      "id": "0c294185-a864-42e0-b52c-7c3a01243233",
      "title": "The Brazilian Influencer Who Exposed The Dark Side Of Life Coaches",
      "description": "Have you heard of a lifestyle influencer named Kat Torres? She\u0027s recently been jailed on human trafficking and slavery charges, the dark underbelly of her online life coaching business exposed. This might be an extreme case of life coaching gone wrong, but what else should we know about the industry? Is this a cautionary tale not dissimilar to that of multi level marketing schemes? THE END BITS Subscribe to Mamamia Read more about Kat Torres here Read more about Life Coaching here Check out our sister podcast True Crime Conversations here Check out the BBC Documentary on this topic here GET IN TOUCH Share your story, feedback, or dilemma! Send us a voice note or email us at podcast@mamamia.com.au and one of our Podcast Producers will come back to you ASAP. CONTACT US Got a topic you\u0027d like us to cover? Send us an email at thequicky@mamamia.com.au CREDITS Host: Claire Murphy With thanks to: Rick Allan Ross, CEO of the Cult Education Institute and author of Cults Inside Out Producer: Claire Murphy Senior Producer: Taylah Strano Audio Producer: Thom Lion Become a Mamamia subscriber: https://www.mamamia.com.au/subscribe See omnystudio.com/listener for privacy information.",
      "release": "2024-07-31T19:40:12Z",
      "duration": "00:20:15.7120000",
      "explicit": false,
      "spotifyId": "5OdXxnaMX3bhOA8jHPihQN",
      "appleId": 1000663959253,
      "subjects": [
        "Human Trafficking",
        "Kat Torres"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5OdXxnaMX3bhOA8jHPihQN",
        "apple": "https://podcasts.apple.com/podcast/the-brazilian-influencer-who-exposed-the-dark-side/id1451469361?i=1000663959253"
      }
    }
  ]
}