{
  "id": "b9b34ff4-dfcb-438c-992b-882059d5753c",
  "name": "The Sleep Scholar",
  "youTubeChannelId": "UClWzZ3zjJ8Pfhx_ooYbJhJw",
  "episodes": [
    {
      "id": "bb4e9e2d-99b0-4231-8d0e-e6170630ac41",
      "title": "The Hidden Switch in Your Brain That Salesmen and Cults Exploit",
      "description": "Have you ever agreed to a small favor, only to find yourself trapped in a massive commitment later? That feeling is not an accident. It\u0027s a psychological principle known as the Foot-in-the-Door Technique, and it\u0027s one of the most powerful tools of influence ever discovered.\n\nThis deep-dive documentary explores the invisible thread of agreement that guides our decisions. We journey back to a groundbreaking 1960s experiment that proved how a tiny, insignificant \u0022yes\u0022 could dramatically change future behavior. We uncover the science behind why our brains crave consistency, exploring concepts like Self-Perception Theory and Cognitive Dissonance to reveal why we are so vulnerable to this form of persuasion.\n\nFrom the scripts of the world\u0027s best salespeople and the design of your favorite apps, to the dark recruitment tactics of cults and the chilling methods of psychological warfare, this technique is everywhere. By the end of this video, you will not only see this hidden force at work in the world, but you will also learn how to build a mental shield to protect your own choices and become the true author of your own decisions.\n\n🔔 Subscribe for more deep dives into psychology and human behavior!\n\n👇 CHAPTERS / TIMESTAMPS 👇\n\nPart I: The Invisible Mechanism\n0:00 - The Thread of Agreement: Have You Felt This?\n4:21 - Section 1: What is the Foot-in-the-Door Technique?\n10:13 - Section 2: The Shocking California \u0022Drive Carefully\u0022 Experiment\n\nPart II: The Science of Your Mind\n17:24 - Section 3: The Psychology of Consistency\n17:55 - \u0022I Am What I Do\u0022: Understanding Self-Perception Theory\n21:48 - The Unbearable Discomfort of Cognitive Dissonance\n\nPart III: The Technique in Your World\n24:38 - Section 4: The Technique in the Wild\n25:15 - The \u0022Yes-Ladder\u0022: How Car Salesmen Use It On You\n28:44 - Free Samples, Newsletters, and the \u0022Like\u0022 Button\n30:57 - How Apps Use \u0022Gradual Engagement\u0022 to Get Your Data\n\nPart IV: The Social \u0026 The Sinister\n31:54 - Section 5: Weaving the Social Fabric\n32:40 - How a Small \u0022Yes\u0022 Builds Relationships \u0026 Helps in Parenting\n35:11 - The Lifeblood of Activism and Charitable Giving\n37:46 - Section 6: The Dark Side - Manipulation \u0026 Control\n38:33 - The Gradual Path of Cult Recruitment\n41:19 - Psychological Warfare: The POWs of the Korean War\n\nPart V: Your Defense and Conclusion\n43:31 - Section 7: The Ethical Compass - Using the Small Yes for Good\n44:15 - How to Use \u0022Micro-Habits\u0022 to Change Your Own Life\n49:18 - Section 8: The Shield of Awareness - How to Defend Yourself\n53:42 - Conclusion: The Freedom of the Second Choice\n\nKEYWORDS \u0026 CONCEPTS COVERED:\nFoot in the Door Technique, Psychology, Persuasion, Influence, Manipulation, Mind Control, Social Psychology, Cognitive Dissonance, Self-Perception Theory, Consistency Bias, Freedman and Fraser, Sales Techniques, Marketing Strategy, Negotiation Tactics, Digital Marketing, App Onboarding, Cult Recruitment, Psychological Warfare, Brainwashing, Self-Improvement, Critical Thinking, Human Behavior Explained.\n\n#Psychology #Manipulation #Persuasion #DeepDive #Documentary",
      "release": "2025-08-10T18:51:58Z",
      "duration": "00:53:44",
      "explicit": false,
      "youTubeId": "mx75XJSaS58",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mx75XJSaS58"
      }
    }
  ]
}