{
  "id": "9cd58029-f283-4593-82e8-8771b5e69c77",
  "name": "The McMasters’ Chronicles",
  "youTubeChannelId": "UC-Mh54QdIgA_5jRXLsULOhQ",
  "episodes": [
    {
      "id": "3b463a62-bf6a-4a97-9852-3c815458443a",
      "title": "Naming the psychological methods used to enforce compliance",
      "description": "In this video, we begin a two-part series documenting interrogation tactics used in high-control religious environments, paired with real examples from our own lives.\nThis is not speculation or exaggeration. We are naming psychological and spiritual interrogation methods that were repeatedly used to create fear, compliance, confusion, and shame — often under the guise of care, discipleship, or concern.\nIn Part 1, we cover the first half of a longer list of interrogation tactics, explaining:\n* What each tactic is\n* How it functions psychologically\n* What it looked like when it was used on us\nThese tactics are often subtle and normalized in high-control churches, which can make them difficult to recognize while you’re still inside. Naming them can be a critical step toward clarity and healing.\nThis video is intended to help:\n* Survivors of spiritual abuse\n* People questioning high-control religious dynamics\n* Those trying to understand coercive questioning and control\nPart 2 continues the list with the remaining interrogation tactics and additional real-life examples.\nIf any of this feels familiar, you’re not alone — and you’re not imagining it.\n\n#ReligiousTrauma\n#cultrecovery \n#SpiritualAbuse\n#PsychologicalAbuse\n#ChurchAbuse\n#CoerciveControl\n#excult \n#interrogation",
      "release": "2026-01-28T23:30:15Z",
      "duration": "00:40:07",
      "explicit": false,
      "youTubeId": "Mss0lRdveZM",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Mss0lRdveZM"
      }
    },
    {
      "id": "29ca90e3-1ddc-428b-bde4-8a7deb467a60",
      "title": "The Evangelism Double Bind",
      "description": "We were required to evangelize, given strict rules for how to do it, and then mocked for following those rules.This is how high-control religious systems create no-win situations and keep people trapped in shame.\n\nIn this video, we talk about how leaders demanded evangelism while constantly changing the rules — and then shamed people for “not doing it right” or “not doing enough.”\n\nThis tactic exploits empathy and a genuine desire to help others, turning compassion into a tool for control. It’s a classic psychological pattern found in cults and high-control groups:\n\n• Double binds (you’re wrong no matter what you do)\n• Moving goalposts\n• Moral perfectionism\n• Shame conditioning\n• Emotional manipulation disguised as spiritual growth\n\nIf you’ve ever felt like your sincerity was never enough, this video is for you.\n\n#ReligiousTrauma\n#SpiritualAbuse\n#Cult\n#CoerciveControl\n#PsychologicalManipulation\n#NoWin\n#Control\n#Shame\n#moralinjury \n#EmotionalManipulation",
      "release": "2026-01-25T23:30:06Z",
      "duration": "00:35:20",
      "explicit": false,
      "youTubeId": "EQwgK2j_f-c",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EQwgK2j_f-c"
      }
    },
    {
      "id": "9dd8b6a1-7c79-4e99-9f57-806d45fa0408",
      "title": "How High Demand Religious Leaders Rebrand Abuse as “Love”",
      "description": "In this video, we expose how leaders in our former church reframed abuse as “love” — and how redefining harm allowed them to justify control, coercion, and mistreatment while claiming biblical authority.\nWe break down:\n* How abusive behavior was rebranded as “care,” “discipline,” or “love”\n* How scripture was weaponized to excuse harmful actions\n* How victims were taught to doubt their own pain\n* Why redefining abuse is one of the most dangerous tools of spiritual manipulation\nWhen leaders control the definition of love, obedience becomes morality — and abuse becomes righteousness.\nThis video is for anyone who has experienced:\n* spiritual abuse\n* religious trauma\n* coercive control in church leadership\n* manipulation disguised as biblical love\n\nIf this resonates with you, you’re not alone.\n\n#SpiritualAbuse #ReligiousTrauma #ChurchAbuse #SpiritualManipulation\n#CoerciveControl #CultRecovery #cult #highdemandreligion",
      "release": "2026-01-21T23:50:55Z",
      "duration": "00:37:49",
      "explicit": false,
      "youTubeId": "dyK_MJZnd34",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dyK_MJZnd34"
      }
    },
    {
      "id": "85c0fcfb-fa7a-4aee-9968-2522359cbf7d",
      "title": "The Emotional Weight Placed on Members When People Leave the Church",
      "description": "When someone leaves a high-control church or ministry, the members who remain are often left carrying an overwhelming emotional weight — not because they lack faith, but because their devotion is being used against them.\nIn this video, we talk about the emotional weight placed on church members when people leave — including the confusion, responsibility, and pressure to keep serving when things no longer make sense.\nWe share what it feels like to genuinely care about God and people, to be giving everything you have, and to suddenly feel responsible for someone else’s departure or for holding the system together.\nWe also explain why we cared so deeply about the people still inside, why we knew our presence mattered, and why leaving was one of the hardest decisions we’ve ever made — even though it was necessary.\nIf you’re still in a high-control religious environment, please hear this clearly: what is being placed on you is not fair, and it is not your fault.\nYou are not failing. You are surviving.\n\n#spiritualabuse\n#religioustrauma \n#emotionalmanipulation \n#churchabuse \n#coercivecontrol",
      "release": "2026-01-18T23:30:18Z",
      "duration": "00:25:11",
      "explicit": false,
      "youTubeId": "lQDUnDE3XZ8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lQDUnDE3XZ8"
      }
    },
    {
      "id": "c261f18a-0b92-4a22-aa46-d10857c18312",
      "title": "Blamed for the Church’s Failures: How Cults Trap You in Impossible Cycles",
      "description": "In this video, we share how we were repeatedly accused of not bringing in enough money to provide for all of the pastors, not evangelizing enough, not communicating enough, and ultimately not loving God or people enough—all while being told we were responsible for the failures of the ministry itself.\nWe explain how high-control religious groups and cult-like churches shift blame onto sincere members, constantly changing the rules and expectations so that nothing is ever enough. One moment the focus is money. The next, evangelism. But no matter what changes, the responsibility—and guilt—always stays with you.\n\nThis video is for anyone who has been told they are the problem in a religious organization that demands the impossible. If you’ve ever felt exhausted, ashamed, or spiritually defective for things that were never fair or achievable to begin with—this is not because you are a bad person.\n\nYou are not failing God.You are not selfish.You are not the reason the system doesn’t work.\n\nWe break down the manipulation tactics used by cults and abusive churches so that those still inside—or healing after leaving—can finally understand what was happening and begin to reclaim their sense of worth.\n\n💬 If this resonates, you are not alone.\n🔔 Subscribe for more content on spiritual abuse, coercive control, and recovery.\n\n#spiritualabuse \n#manipulation \n#coercivecontrol \n#religioustrauma \n#cultsurvivor \n#cultrecovery \n#ChurchAbuse\n#ReligiousManipulation\n#DeconstructingFaith",
      "release": "2026-01-14T23:30:04Z",
      "duration": "00:22:58",
      "explicit": false,
      "youTubeId": "CBwsckGzsrE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CBwsckGzsrE"
      }
    },
    {
      "id": "e9480740-52ef-4a12-a35d-fffbba11b941",
      "title": "When Churches Demand Money AND Free Labor: A Survivor’s Story",
      "description": "In this video, we share our story of forced labor and financial abuse within a high-control church. Jonathan was pressured to give large sums of money while also being required to work at the pastor’s home — unpaid — as part of what was framed as “obedience” and “service to God.”\nThis is a deeply personal and vulnerable account of how religious authority can cross into coercion, exploitation, and abuse. What was presented as voluntarily giving, slowly became an expectation — and then a requirement.\n\nWe’re sharing this story to help others recognize the warning signs of financial abuse, labor exploitation, and spiritual coercion in religious settings. If you’ve ever felt pressured to give beyond your means, work without consent, or comply out of fear of spiritual consequences, you’re not alone.\n\nThis channel exists to bring awareness, support survivors, and help people name experiences that were normalized but deeply harmful.\n\n#spiritualabuse \n#financialabuse \n#coercivecontrol \n#unpaidwork  \n#cultsurvivor \n#ChurchHurt\n#coercivecontrol",
      "release": "2026-01-11T23:00:12Z",
      "duration": "01:00:02",
      "explicit": false,
      "youTubeId": "BahdG5VFkQg",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BahdG5VFkQg"
      }
    },
    {
      "id": "346e9e5b-f1fb-4193-9464-16f81b07dd94",
      "title": "Signs of Financial Abuse in Religious Settings",
      "description": "Financial abuse can occur in religious environments when giving, obedience, or “faithfulness” are tied to money, pressure, or fear. In this video, we discuss common warning signs of financial abuse in religious settings, including coercive giving, lack of transparency, spiritual consequences attached to money, and patterns that often appear in high-control groups.\n\nThis video is based on our personal experiences and observations and is shared to bring awareness, encourage healing, and help others recognize unhealthy financial dynamics in faith-based environments. Not every religious community operates this way, but these patterns show up repeatedly in coercive systems.\n\nOur content reflects our opinions and lived experiences and is intended for education, advocacy, and discussion.\n#FinancialAbuse \n#SpiritualAbuse \n#ChurchAbuse \n#ReligiousTrauma\n#cultsurvivor \n#coercivecontrol \n#FaithAndMoney\n#recovery",
      "release": "2026-01-07T23:30:15Z",
      "duration": "00:35:19",
      "explicit": false,
      "youTubeId": "es_Kt30mGfs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=es_Kt30mGfs"
      }
    },
    {
      "id": "28a344de-f7f5-45b2-9f85-e1beac3257b4",
      "title": "When Survivors Aren’t Believed: The Harm of Calling It “Gossip”",
      "description": "When survivors speak about abuse, trauma, or harmful experiences, disbelief or accusations about their story being merely “gossip” can cause deep and lasting harm.\nIn this video, we talk about why questioning, minimizing, or labeling survivor stories as “gossip” doesn’t protect anyone—it silences survivors and discourages people from speaking about what happened to them.\nDoubting survivors often leads to shame, isolation, and self-doubt, especially for those leaving high-control groups, religious trauma, or abusive environments. We explore how disbelief reinforces trauma and why listening to survivors matters more than protecting comfort, reputation, or image.\nThis video is not about gossip. It’s about survivor awareness, accountability, and creating space for truth to be spoken without punishment.\nIf you’re a survivor, you are not wrong for telling your story. And if you’re listening, believing survivors can be life-changing.\n\n\n#BelieveSurvivors\n#ReligiousTrauma\n#TraumaAwareness\n#SurvivorVoices\n#SpiritualAbuse",
      "release": "2025-12-28T23:45:02Z",
      "duration": "00:23:20",
      "explicit": false,
      "youTubeId": "Rorr2kZzzek",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Rorr2kZzzek"
      }
    },
    {
      "id": "e1acac50-bfd5-4fa9-8eb7-0b3837510b3c",
      "title": "It\u0027s Not Gossiping-It\u0027s Truth \u0026 Bringing Awareness to Church Abuse",
      "description": "For years, we were told that asking questions or talking about what was happening to others was “gossip.”\nBut what we later realized is that this wasn’t about protecting people—it was about controlling information.\nIn this video, we talk about how the label of “gossip” was used to silence conversations, isolate individuals, and prevent people from knowing what was really happening inside a high-control religious environment.\nWe also break down what gossip actually is—and why sharing lived experiences, patterns of abuse, and systemic harm is not gossip, but awareness.\nOur channel is not about tearing people down. It’s about naming harmful systems, validating survivors, and making sure others have the information we didn’t.\nIf you’ve ever felt confused, isolated, or ashamed for speaking up—this conversation is for you.\n#ReligiousTrauma\n#InformationControl\n#CultRecovery\n#HighControlGroups\n#SpiritualAbuse",
      "release": "2025-12-24T23:30:13Z",
      "duration": "00:24:05",
      "explicit": false,
      "youTubeId": "ZyRLy6MIBNE",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZyRLy6MIBNE"
      }
    },
    {
      "id": "3c421da6-4369-4d1d-aab5-37c92ec0d50c",
      "title": "Raised to Fundraise:  We Were Taught that We Had to Make Money for the Church Since Childhood",
      "description": "In this video, we talk about the many ways we were required and expected to make money for our church—and how this began when we were very young.\n\nWhat was framed as “serving,” “discipline,” or “faithfulness” slowly became a system where financial contribution was tied to obedience, approval, and belonging.\n\nWe’re sharing our lived experiences to help others recognize patterns of financial control, especially when children are involved, and to remind survivors that these systems are not normal or healthy.\n\n#ReligiousTrauma #ChurchAbuse #FinancialControl #CultRecovery #deconstruction #SurvivorVoices #SpiritualAbuse",
      "release": "2025-12-21T23:45:01Z",
      "duration": "00:29:41",
      "explicit": false,
      "youTubeId": "IP2GH2Sk40U",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IP2GH2Sk40U"
      }
    },
    {
      "id": "264d8126-1063-43e9-8143-f3ae559a137c",
      "title": "Christmas In a High Control Christian Cult",
      "description": "Christmas is supposed to be a season of joy, generosity, and peace.\nBut inside a high-control Christian group, joy itself was used as a tool of control.\n\nIn this video, we share what Christmas was like inside a Christian cult—where the “joy of the season” wasn’t about connection or rest, but about pulling people deeper into spiritual performance and further away from reality. Joy was emphasized not to bring safety, but to suppress fear, doubt, and discomfort. If something felt wrong, you were taught to push deeper into “joy” instead of listening to your instincts.\n\nThe Christmas season was also used to increase financial pressure. Giving was spiritualized, generosity was monitored, and money was framed as proof of faith—especially during a time when people were already emotionally vulnerable.\n\nEvery Christmas followed rigid rules. Everyone was required to read Luke 2. Presents could only be opened on Christmas. Traditions weren’t flexible or personal—they were enforced. What looked like reverence was often about compliance, and what looked like unity was maintained through fear of disobedience.\n\nThis video is not an attack on Christianity.\nIt is an honest account of spiritual abuse, coercive control, and religious trauma—especially how these dynamics intensify during the holidays.\n\nIf you’ve ever felt anxious, numb, or disconnected during Christmas while everyone around you insisted you should feel joyful, this story may resonate.\n\n#religioustrauma \n#cultsurvivor \n#spiritualabuse \n#religiousabuse \n#christmas \n#ChristianCult\n#HighControlReligion\n#Trauma\n#FaithAndControl\n#Deconstruction",
      "release": "2025-12-17T23:30:21Z",
      "duration": "00:31:54",
      "explicit": false,
      "youTubeId": "TIpf3Pxz3Pg",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TIpf3Pxz3Pg"
      }
    },
    {
      "id": "9424caff-ca40-4c12-9677-5bd644f83bac",
      "title": "Coercive Control in High-Control Religious Environments",
      "description": "In this video, we talk openly about coercive control and the psychological tactics that were used on us in the high-control religious environment we left. These tactics are often subtle, normalized, and difficult to recognize while you’re inside them — which is why leaving can feel confusing, frightening, and overwhelming.\n\nWe discuss how fear, obedience, guilt, isolation, and spiritual authority were used to shape behavior and suppress autonomy, and how these patterns mirror what experts describe as coercive control in cults and abusive systems. There were no physical chains — but the psychological pressure was constant.\n\nOur goal isn’t to attack faith or people, but to name the mechanisms of control so others can better understand their experiences. If you’ve ever questioned why it was so hard to leave, why you doubted yourself, or why the impact lasted long after you walked away — you’re not alone.\n\nThis conversation is for anyone navigating religious trauma, recovering from high-control groups, or trying to make sense of a system that demanded loyalty at the expense of personal freedom.\n\n💬 If this resonates with you, feel free to share your story in the comments.\n🔔 Subscribe for more conversations about healing, autonomy, and life after high-control environments.\n\n#CoerciveControl #ReligiousTrauma #HighControlReligion #CultRecovery #SpiritualAbuse #TraumaBonds #PsychologicalAbuse #Deconstruction #ReligiousTraumaRecovery #HealingJourney",
      "release": "2025-12-14T23:30:09Z",
      "duration": "00:34:33",
      "explicit": false,
      "youTubeId": "Qmf5ivkYaQE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Qmf5ivkYaQE"
      }
    },
    {
      "id": "5a700c3f-1407-48a3-9be4-c58f82626931",
      "title": "Why Leaving a Trauma Bond is So Hard",
      "description": "Are you wondering if you’re in a trauma bond? In this video, we break down 12 signs of a trauma bond—the emotional, psychological, and behavioral patterns that keep people stuck in abusive or controlling relationships. Trauma bonds are common in narcissistic abuse, toxic family systems, coercive control, and high-control religious groups.\n\nWe explain how trauma bonds form, why they’re so hard to leave, and how abusers create cycles of fear, reward, guilt, and dependency. We also share insights from our own experience growing up and leaving a high-control environment, and how recognizing these signs helped us finally break free.\nIn this video, you’ll learn:\n• What a trauma bond is\n• 12 common signs you may be in a trauma bond\n• How narcissistic and controlling people create these cycles\n• Why victims feel stuck, guilty, or responsible\n• How trauma bonds affect your identity and decision making\n\nIf you’re researching trauma bonding, narcissistic abuse, emotional manipulation, or coercive control, this breakdown will help you understand the patterns and take the first steps toward clarity and healing.\nYou are not alone, and what you’re feeling makes sense.Your story matters. Your healing matters.\n\n\n#traumabond #traumabonding #signsofatraumabond #narcissisticabuse\n#narcissisticabuserecovery #narcissisticfamily #coercivecontrol #emotionalabuse #toxicrelationships #healingfromabuse #religiousabuse #highcontrolgroups #cultsurvivor #cptsdrecovery",
      "release": "2025-12-07T23:00:56Z",
      "duration": "00:33:59",
      "explicit": false,
      "youTubeId": "ieXZrwnCGnM",
      "subjects": [
        "One-on-one",
        "Family Cult",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ieXZrwnCGnM"
      }
    },
    {
      "id": "ea90b8c5-8e10-4ea7-b246-65adccb57d5a",
      "title": "Inside a High-Control \u0022Church\u0022: Growing Up Under Extreme Control, Punishment, and Abuse",
      "description": "In this video, I share the truth about the childhood abuse that we experienced growing up inside a high-control, Christian environment that justified physical punishment and emotional harm in the name of “discipline\u0022 and \u0022obedience.”\n\nThis video is about exposing systems of abuse: the punishments, the fear, the silence, and the heavy expectations placed on children who were taught they had to be “broken” to be good.\n\nWhat I talk about in this video:\n• The forms of abuse that were normalized in childhood\n• How church leaders and parents enforced punishment\n• The emotional and physical impact years later\n\nIf you grew up in a religious setting where abuse was masked as discipline or spirituality, you’re not alone. Your story matters. You deserve freedom, safety, and your own voice.\n\n✨ Subscribe for more healing-centered videos about abuse recovery, and spiritual trauma.\n\n#ChildhoodAbuse #ReligiousTrauma #SpiritualAbuse #AbuseSurvivor #HealingJourney #ChristianCult",
      "release": "2025-11-26T23:00:36Z",
      "duration": "00:26:19",
      "explicit": false,
      "youTubeId": "Pn90XXvDA1I",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Pn90XXvDA1I"
      }
    },
    {
      "id": "e0c8e014-efe5-41de-b1c1-4b7466a4e11f",
      "title": "Inside the Hierarchy of a High-Control Christian Group",
      "description": "In this video, we break down the hierarchy, structure, and power system of the Christian cult we grew up in, and the impact that this had on our upbringing. Before talking about the punishments, rules, and daily life, it’s important to explain how the group was built — who held authority, how decisions were made, and how obedience was demanded.\n\nThis video explains:\n-How the leadership structure worked\n-How the hierarchy in the group was established. \n-How control was maintained through fear, and obedience. \n-How the specific behavior demands like saying Yes Sir, Yes ma\u0027am, or \u0022Delayed obedience is disobedience,\u0022 groomed an entire generation of followers. \n\nGrowing up in a high-control religious environment shapes your identity, your trust in yourself, and your understanding of the world. Our goal with this video is to help others recognize the signs of unhealthy power structures and understand how these groups operate from the inside. \n\nIf you grew up in a restrictive Christian group, high-control religion, or a system that demanded unquestioning obedience, you’re not alone. Your story matters. And healing is possible.\n\nThank you for watching and for supporting our journey at The McMasters’ Chronicles!\n\n#narcissisticabuse #ReligiousTrauma #CultSurvivor #SpiritualAbuse #HighControlGroup #Christianity #Deconstruction #GrowingUpInACult",
      "release": "2025-11-24T00:01:07Z",
      "duration": "00:45:40",
      "explicit": false,
      "youTubeId": "x3kAzHk_3Tk",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x3kAzHk_3Tk"
      }
    },
    {
      "id": "563e48f7-33d4-47e4-9b96-6af9341e89bd",
      "title": "How Narcissistic Pastors Blame You for Their Abusive Behavior",
      "description": "In this video we describe five ways our former pastors used accusations, twisted scripture, and weaponized shame to hurt and entrap the very people that they were supposed to protect. We also discuss how narcissists accuse in order to maintain their power and to avoid accountability. If you\u0027ve ever been blamed, scapegoated or told you were the problem when you were just trying to survive. . . this video is for you. \n\nIf you\u0027ve left an abusive church like us, have come out of a high-control environment, or you\u0027re trying to make sense of the confusion and spiritual gaslighting- you are not alone! Healing is possible and your story matters! \n\n#cultsurvivor #narcissisticabuse #spiritualabuse #healingjourney #exvangelical #healingjourney",
      "release": "2025-11-20T00:30:39Z",
      "duration": "00:30:44",
      "explicit": false,
      "youTubeId": "dqZL4dJOYVM",
      "subjects": [
        "Cult Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dqZL4dJOYVM"
      }
    },
    {
      "id": "9fc585d5-2b2c-4b10-8e17-2034ffd1e212",
      "title": "What Isolation Looks Like in High-Control Churches",
      "description": "Many high-control religious groups use isolation as one of their most powerful tactics. It doesn\u0027t start all at once- it starts with subtle shifts, quiet pressure, and spiritual language that makes you feel like you\u0027re the problem for wanting connection outside of the group. \n\nIn this video we break down 5 ways high-control religious groups isolate victims, how these tactics were used in the specific group that we were in, and how these methods changed the perception of ourselves, our faith, and others. \n\nIf you\u0027ve ever felt cut off from family, friends, community, or even your own sense of self, because of a church or a pastor you are not alone. \n\nOur hope is that this video gives language to what you lived through- and reminds you that your story matters. \n\nIf this resonates with you, share your experience in the comments! \n\n#religioustrauma #spiritualhealing #cultsurvivor #culttactics #isolation #escaping #recovery #recoveryjourney",
      "release": "2025-11-16T20:30:03Z",
      "duration": "00:38:22",
      "explicit": false,
      "youTubeId": "YsRjQVutMBA",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YsRjQVutMBA"
      }
    },
    {
      "id": "8082626c-2cd9-4dab-baca-4af3e5d79716",
      "title": "Part 2: The Truth About Leaving- How Our Pastors (Cult Leaders) Responded to Being Confronted",
      "description": "We continue our discussion on how it feels impossible to leave abusive churches/cult-like organizations. We tell how we knew it was time to go, and how we left. We also discuss how the \u0022pastor\u0027s\u0022 responded to that. \n\nShare your story in the comments below! \nSubscribe for more conversations on faith, healing, and breaking free from religious control. \n\n#spiritualabuse #narcissisticabuse #boundedchoice #religiousabuse #faithjourney #faithoverfear #trapped",
      "release": "2025-11-03T01:01:13Z",
      "duration": "00:17:07",
      "explicit": false,
      "youTubeId": "sngsCNElyyY",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sngsCNElyyY"
      }
    },
    {
      "id": "98ccd834-6f39-4409-b24c-ee5ad0b33ca6",
      "title": "Part 1: The Truth About Leaving a Controlling and Abusive Church (Cult)",
      "description": "We didn’t stay because we wanted to — we stayed because we felt like we couldn’t leave. We stayed because we knew we wouldn\u0027t be able to talk with people we knew our whole lives. We stayed because leaving felt like we were betraying God and leaving his will for our lives. \n\nIn this episode of the McMasters Chronicles, we share our real story of spiritual abuse, control, and fear inside a toxic church environment. We talk about how manipulation and guilt made leaving feel impossible. \n\nIf you’ve ever felt trapped in a controlling church or pressured to stay silent, you’re not alone. There’s hope, healing, and truth waiting for you.\n\n💬 Share your story in the comments below \n🔔 Subscribe for more conversations on faith, healing, and breaking free from religious control.\n\n#spiritualabuse  #narcissisticabuse #cultsurvivor #religiousabuse #faithjourney #horror #scary #trapped",
      "release": "2025-10-30T00:01:30Z",
      "duration": "00:28:29",
      "explicit": false,
      "youTubeId": "usBz0N3qoNg",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=usBz0N3qoNg"
      }
    },
    {
      "id": "49ce1eca-617f-48ef-acd9-02d5ad679dd0",
      "title": "🚩11 Warning Signs That Your Church May Be Toxic🚩",
      "description": "Are you seeing red flags in your church? \n\nIn this video we share warning signs that may indicate a church is spiritually abusive or controlling. These are patterns we personally experienced- and now we want to help others recognize the same signs before they cause deeper harm. \n\nWe talk honestly about manipulation, fear-based leadership, and how love and obedience can be twisted to control people. Our goal is to bring clarity, hope, and freedom to those who have felt trapped, confused or silenced in unhealthy religious environments. \n\n#redflags #relationshipredflags #religioustrauma #spiritualabuse #coercivecontrol #cultsurvivor",
      "release": "2025-10-26T23:30:05Z",
      "duration": "00:35:54",
      "explicit": false,
      "youTubeId": "L8ZIm5ZV22w",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L8ZIm5ZV22w"
      }
    },
    {
      "id": "8a05e453-64a8-4ddb-9a10-57ce33eb05cf",
      "title": "Part 2: Our Honest Account of Spiritually Abusive Sunday Services",
      "description": "In this episode of the McMasters\u0027 Chronicles, we open up about the pressures we faced during our former \u0022church\u0027s\u0022 services- the expectations, the fear, the constant criticism and the leaderships demands for us to follow their distorted rules. We talk honestly about how spiritual abuse can disguise itself as \u0022obedience\u0022 or \u0022worship.\u0022 All of these demands were given in the context of this is what God required from us. We believe these situations occurred because it was what the abusive leadership needed to pressure us with in order for them to maintain their control over the congregation. These conditions kept us afraid, ashamed, worried of our standing before God, and vulnerable to the financial demands that often followed the services. \n\nWhile we remembered several stories, it is impossible to recount the numerous times and situations these tactics were use against the congregation in our former church (cult).\n\n#cultsurvivor #spiritualabuse #faithoverfear #faithjourney #coercivecontrol #abusesurvivors",
      "release": "2025-10-23T00:00:52Z",
      "duration": "00:34:27",
      "explicit": false,
      "youTubeId": "jxYruZU_cpw",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jxYruZU_cpw"
      }
    },
    {
      "id": "cabc8ce3-f829-4e9e-8a37-55ecd671c979",
      "title": "Part 1: Our Honest Account of Spiritually Abusive Wednesday Night Prayer Meetings",
      "description": "In this episode of the McMasters\u0027 Chronicles, we open up about the pressures we faced during our former \u0022church\u0027s\u0022 services- the expectations, the fear, the constant criticism and the leaderships demands for us to follow their distorted rules. We talk honestly about how spiritual abuse can disguise itself as \u0022obedience\u0022 or \u0022worship.\u0022 All of these demands were given in the context of this is what God required from us. We believe these situations occurred because it was what the leadership needed to pressure us with in order for them to maintain their control over the congregation. These conditions kept us afraid, ashamed, worried of our standing before God, and vulnerable to the financial demands that often followed the services. \n\nWhile we remembered several stories, it is impossible to recount the numerous times and situations these tactics were use against the congregation in our former church (cult).\n\n#cultsurvivor #narcissisticabuse #spiritualabuse #coercivecontrol #abusesurvivors #faithoverfear",
      "release": "2025-10-20T02:16:45Z",
      "duration": "00:19:09",
      "explicit": false,
      "youTubeId": "tbreh5lEOks",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tbreh5lEOks"
      }
    },
    {
      "id": "09ee365a-b13f-4235-928e-f16c799072de",
      "title": "Exposing the Cycle of Coercion and Control in Our Former \u0022Church\u0022",
      "description": "In this episode of The McMasters\u0027 Chronicles we ask a simple but powerful question- Why is there always a \u0022need?\u0022 In our former church there was always a great degree of financial need even with all the tithes coming into the ministry.\n\nWe share our personal experience in a ministry that consistently demanded more- more time, more sacrifice- all under the banner of these WORKS being a requirement to be closer with God and the leadership. While they would speak on Ephesians and the efficacy of grace, their actions were very different from their occasional expositions. What you did for THEM, was of the utmost importance. Not serving them would lead to messages, sermons, verbal assaults, and public shaming in person, by phone, or by message apps. \n\n#spiritualabuse #churchhurt #narcissisticabuse #financialabuse #narcissisticabuseawareness #cultsurvivor",
      "release": "2025-10-08T21:30:03Z",
      "duration": "00:20:52",
      "explicit": false,
      "youTubeId": "5t_4BPaIPzw",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5t_4BPaIPzw"
      }
    },
    {
      "id": "cdd87e6d-0e94-432f-ad65-70dbce2edbcf",
      "title": "The Need: How Our Church Used Spiritual Abuse for Financial Gain",
      "description": "In our former \u0022church\u0022 we were required to give above the regular 10% of tithes. While we tried to tell the leaders that we could not always make this quota, they did not accept this and said that we could \u0022not muzzle the ox\u0022 and the pastors couldn\u0027t go without a paycheck. \n\n#coercivecontrol #cultsurvivor #narcissisticabuse #churchabuse #financialabuse #spiritualabuse",
      "release": "2025-10-05T18:30:40Z",
      "duration": "00:20:21",
      "explicit": false,
      "youTubeId": "Vu9ZDDrr9A8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Vu9ZDDrr9A8"
      }
    },
    {
      "id": "da82b9c4-c2cc-47f4-b08d-2148d80a4f48",
      "title": "How Toxic Churches Weaponize Communication",
      "description": "Jonathan and I discuss how the leaders of our former \u0022church\u0022 would require  detailed communication in services and over message boards and relate it to our spiritual standing before Christ. Using the backdrop of scripture, they would highlight how the Bible encourages communication, and thus use this to demand personal details and daily communication. What was communicated  would include, intimate, personal and private information that would not normally be required in healthy churches and relationships. \u0022Not communicating\u0022 or \u0022silence\u0022 became the ultimate \u0022sin\u0022 and at any moment you could be accused of this. Not communicating \u0022enough\u0022 meant that you were lesser and flawed. On occasion one of the leaders would post the Simon and Garfunkel song, The Sound of Silence, to scold members publicly for not communicating. \n\n#cult #emotionalabuse #cultsurvivor #spiritualabuse #churchtrauma #spiritualmanipulation #thesoundofsilence #narcissisticabuse #narcissisticabuseawareness #narcissisticabuserecovery",
      "release": "2025-10-01T22:07:56Z",
      "duration": "00:22:49",
      "explicit": false,
      "youTubeId": "FFUdZ0udfi8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FFUdZ0udfi8"
      }
    },
    {
      "id": "d336610b-eeeb-46ec-8e22-ee2d3315d3f1",
      "title": "This Story was Used to Scare Us Into Not Questioning Authority",
      "description": "In this video we discuss how yet another biblical passage was used by our former \u0022church\u0022 to cause fear and gain control over the congregation. The \u0022preaching\u0022 on specific passage made the congregants feel like they could not question or criticize leadership under penalty of spiritual or physical harm. \n\n#spiritualabuseawareness #narcissisticabuse #cultsurvivor #coercivecontrol #religioustrauma #elisha",
      "release": "2025-09-24T22:04:00Z",
      "duration": "00:17:38",
      "explicit": false,
      "youTubeId": "kjPPSGjcv-s",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kjPPSGjcv-s"
      }
    },
    {
      "id": "7a9389b4-afc4-4ca1-8d35-a3ef481a5ab9",
      "title": "The Story of Korah: Misused Scripture, Control and Fear",
      "description": "In this video we detail how this biblical passage is used by the leaders of our former church/cult to intimidate the congregation and deter them from speaking up about abuses and injustices that go on. \n\n#spiritualabuse #faithoverfear #narcissisticabuse #bible #cultsurvivor #numbers16 #churchaccountability #faithjourney",
      "release": "2025-09-21T22:00:51Z",
      "duration": "00:17:39",
      "explicit": false,
      "youTubeId": "dZ_d4KW3tq0",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dZ_d4KW3tq0"
      }
    },
    {
      "id": "32c151b6-bd40-4a44-94a7-183847e213a6",
      "title": "The Shocking Way our Former Church used Ananias \u0026 Sapphira",
      "description": "We discuss how the story of Ananias and Sapphira was told by our former \u0022pastors\u0022 in order to manipulate the congregation into giving everything they had. The twisting of this Biblical passage was used to perpetuate financial abuse, create fear and spur financial giving. \n\n#financialabuse #coercivecontrol #spiritualabuse #churchhurt #narcissisticabuse #jesuslovesyou #jesussaves #cultsurvivor #churchabuse #church #ananias\u0026sapphira #acts5",
      "release": "2025-09-17T18:24:50Z",
      "duration": "00:15:10",
      "explicit": false,
      "youTubeId": "1DNy0s7KA9g",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1DNy0s7KA9g"
      }
    },
    {
      "id": "d45d0024-645b-4add-b654-e975d0bef38a",
      "title": "How our Former \u0022Church\u0022 used Matthew 18 to Avoid Accountability",
      "description": "In this video we describe how our former \u0022pastors\u0022 twisted the Matthew 18 passage to avoid accountability. This twisting of scripture specifically was and is currently being used to keep people in their congregation who love God and who want to address problems in a \u0022godly\u0022 manner. They skillfully avoid accountability by finding fault in how problems are brought up. We use examples from our leaving story to show how we tried to follow Matthew 18. Jonathan first went to the pastors prior to leaving and then we went to the church by putting a letter on the church door. However, no matter what we did, we would have always been considered wrong because the sin of our \u0022pastor\u0022 wasn\u0027t the issue, it was the fact that we were questioning their \u0022God-given authority.\u0022\n\n#church #cultsurvivor #spiritualabuse #narcissisticabuse #bible #jesuslovesyou #jesussaves #narcissisticabuseawareness #churchhurt #churches #churchabuse #matthew18",
      "release": "2025-09-14T18:00:54Z",
      "duration": "00:13:57",
      "explicit": false,
      "youTubeId": "yM4UFmAnuDM",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yM4UFmAnuDM"
      }
    },
    {
      "id": "d795bdec-ece3-4c47-ac94-115e26685d6e",
      "title": "DARVO",
      "description": "In this new series, Our Abusive \u0022Pastor\u0027s\u0022 Playbook, we outline different tacts that our former church used to confuse and manipulate the congregation. These tactics made it difficult to leave the group. Today we talk about DARVO, which stands for deny, attack/accuse, reverse the victim and offender. \n\n#narcissisticabuse #cultsurvivor #churchhurt #spiritualabuse #coercivecontrol #jesuslovesyou #jesussaves",
      "release": "2025-09-10T18:00:00Z",
      "duration": "00:17:07",
      "explicit": false,
      "youTubeId": "05sYRAUKbKM",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=05sYRAUKbKM"
      }
    },
    {
      "id": "ded706a0-ba3e-402c-ac42-03c35db0845c",
      "title": "Freedom and Betrayal: The Cost of Leaving an Abusive \u0022Church\u0022",
      "description": "We discuss the pain of dealing with someone leaving the group and the emotional, and verbal abuse that came from our former \u0022church\u0022 leaders toward us to further isolate us from the people that left. We also discuss the difficulties of leaving our former \u0022church\u0022 and not being able to speak with our lifelong friends. We talk about how leaving is difficult, but it is possible. Talking with former friends or outside counselors can help you identify toxic patterns in your relationships. \n\n#religion #christianity #spiritualabuse #narcissisticabuse #narcissist #narcissisticabuseawareness #recovery",
      "release": "2025-08-31T23:39:46Z",
      "duration": "00:31:01",
      "explicit": false,
      "youTubeId": "OZa7SpgJ8ZI",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OZa7SpgJ8ZI"
      }
    },
    {
      "id": "30985bbd-9132-4fbc-9d1f-eabbd56349d1",
      "title": "Forced Labor Disguised as \u0022Unity\u0022",
      "description": "We talk about how owning a business in our former \u0022church\u0022 meant that the \u0022pastor\u0022 could interfere at whim in the day to day running of the business. Our emotional and spiritual wellbeing would be tied to the success of the business and providing. Others who didn\u0027t own businesses were expected to work at the business to help bring in funds for the church. \n\n#exploitation #cultsurvivor #narcissisticabuseawareness #spiritualabuse #financialabuse #narcissisticabuse #coercivecontrol #religion",
      "release": "2025-08-28T22:00:22Z",
      "duration": "00:20:34",
      "explicit": false,
      "youTubeId": "K8z52xRDFVY",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K8z52xRDFVY"
      }
    },
    {
      "id": "e1161171-1986-46cc-a8eb-abf23f73c438",
      "title": "The Love Bombing Week",
      "description": "Our \u0022Church\u0022 called us Ahab and Jezebel in order to spiritually manipulate us after we left. \n\n#narcissisticabuse #spiritualabuse #cultsurvivor #",
      "release": "2025-08-18T00:14:23Z",
      "duration": "00:24:53",
      "explicit": false,
      "youTubeId": "8QmKGzP-dAQ",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8QmKGzP-dAQ"
      }
    },
    {
      "id": "468f77ce-0129-4213-928f-c61548a6a702",
      "title": "Leaving for good!",
      "description": "After receiving the shocking text message from an elder pastor, we are reeling. While we were on the trip, we come to terms with the fact that we cannot continue in this \u0022church.\u0022 We mourn the loss of friendships because we knew that we would not be able to speak with our friends again or relate with them in the same way. Jonathan mourns the relationships he thought he had with the leaders. Jonathan wanted to make sure that he was leaving in the right way- although this was not possible in this organization. We leave our trip to Tennessee early to head back and attend the Sunday night service for the last time. The elder pastor spent the entire sermon criticizing us going on the trip and then doubles down on the sentiments expressed in the heinous text message. \n\n#churchabuse #cultsurvivor #cultabuse #narcissisticabuse #spiritualabuse #coercivecontrol",
      "release": "2025-08-11T22:54:05Z",
      "duration": "00:34:48",
      "explicit": false,
      "youTubeId": "f-0MaAeg6kA",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f-0MaAeg6kA"
      }
    },
    {
      "id": "8634712f-cd10-4b40-a6c2-92730e2761ee",
      "title": "August 7, 2024: Realizing Things Will Never Change",
      "description": "This Wednesday Jonathan met with the lead \u0022pastor\u0022 to address the mistreatments and issues that were going on. He was gaslit and made to feel like he was the one with the issues and sinning. While Jonathan started to believe them he was realizing that they were never going to address their misdeeds or change. \n\n#abusesurvivors #spiritualabuse #narcissisticabuse #cultsurvivor #cultabuse",
      "release": "2025-08-06T16:48:48Z",
      "duration": "00:14:31",
      "explicit": false,
      "youTubeId": "0fPvD_3S_i4",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0fPvD_3S_i4"
      }
    },
    {
      "id": "1bfea7a6-dcec-4c4a-ba57-f4e4c6ecd740",
      "title": "July 24, 2024 - The Beginning of Our Exit: Leaving An Abusive \u0022Church\u0022 Part 2",
      "description": "A year ago, on July 24th, 2024 Jonathan began to realize that the pastors and friends that he had for his whole life were abusive to him. While being confronted in front of the whole church, shamed, damned and criticized loudly, was not a new occurrence in this organization, Jonathan\u0027s willingness to accept this abuse was waning. We remember this defining moment when he decided not to receive the abuse any longer. This day was the first in an 18 day assault on our lives and our position before God. #abusesurvivors #cultsurvivor #spiritualabuse #McMastersChronicles",
      "release": "2025-07-26T16:09:28Z",
      "duration": "00:12:32",
      "explicit": false,
      "youTubeId": "qTOCkAv15m4",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qTOCkAv15m4"
      }
    },
    {
      "id": "6d683637-b1d4-478a-95d8-c7543e0505e8",
      "title": "July 24, 2024 - The Beginning of Our Exit: Leaving An Abusive \u0022Church\u0022 Part 1",
      "description": "A year ago, on July 24th, 2024 Jonathan began to realize that the pastors and friends that he had for his whole life were abusive to him. While being confronted in front of the whole church, shamed, damned and criticized loudly, was not a new occurrence in this organization, Jonathan\u0027s willingness to accept this abuse was waning. We remember this defining moment when he decided not to receive the abuse any longer. This day was the first in an 18 day assault on our lives and our position before God. #abusesurvivors #cultsurvivor #spiritualabuse #McMastersChronicles\n\nLink for Part 2: https://youtu.be/qTOCkAv15m4",
      "release": "2025-07-26T16:08:14Z",
      "duration": "00:13:19",
      "explicit": false,
      "youTubeId": "-1KK6w23Uyg",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-1KK6w23Uyg"
      }
    }
  ]
}