{
  "id": "86264f2a-04f4-4686-92fa-1500e6a4670f",
  "name": "The Real NIFB Parody",
  "youTubeChannelId": "UC6v2VdNS2yawdwSUr_RFKmA",
  "episodes": [
    {
      "id": "a57998b1-507d-432a-8b88-e1239b694aeb",
      "title": "It\u0027s a Beautiful Day (To Watch a Cult Collapse) | Sunshine Pop Celebration",
      "description": "☀️ Pour yourself a coffee and let me tell you about the most beautiful day... ☕\nThis is the anthem for everyone who left and was told they were wrong.\nFor twenty years, they said you were bitter. They said you didn\u0027t understand. They said you were the problem.\nBut you knew the truth. Deep down in your bones, you knew.\nAnd this week? The whole world saw it too.\nThis isn\u0027t a revenge song. This is a FREEDOM song.\nNo more running. No more hiding. No more trying to explain or prove what you went through.\nThe truth came out all on its own. In two tweets. With \u0022LOL\u0022 at the end.\nYou don\u0027t have to fight anymore. You were always right. And now everyone knows it.\n\nWHAT YOU\u0027LL HEAR:\n🎺 Big band swing-pop celebration\n🎹 Jazzy piano and warm strings\n☕ Morning coffee optimism energy\n💃 Finger snaps and brass horns\n🌅 Pure survivor vindication\n✨ The soundtrack to freedom\n\nTHIS SONG IS FOR:\n\nEveryone who escaped and felt alone\nEveryone who carried shame that wasn\u0027t theirs\nEveryone who was told they were \u0022too sensitive\u0022\nEveryone who knew something was wrong\nEveryone who chose safety over silence\nEveryone who rebuilt their life from scratch\n\nYou were brave. You were strong. You were always right.\nAnd now? It\u0027s a beautiful day. The sun is shining. The nightmare\u0027s over.\nWelcome home, survivor. Welcome to peace.\n\nLYRICS HIGHLIGHTS:\n\u0022The truth came out all on its own and we were right!\u0022\n\u0022No more running, no more hiding from the truth\u0022\n\u0022You were brave, you were strong, you were always right\u0022\n\u0022Welcome home, survivor... welcome to peace\u0022\n\nIf this makes you smile, if this validates something you\u0027ve been carrying, subscribe and share it with someone who needs to hear: \u0022You were always right.\u0022\nRaise your coffee to freedom. Toast to truth. Celebrate the beautiful day when a cult collapsed under its own weight—and you didn\u0027t have to do a thing except wait.\nThe nightmare\u0027s over. We\u0027re free to stay. And we\u0027re okay.\n☀️☕✨\n—Lionel\nP.S. To everyone still healing: Take your time. There\u0027s no rush. This song will be here when you\u0027re ready. And so will we.\n\n#ItsABeautifulDay #SunshinePop #SurvivorAnthem #YouWereRight #CultCollapse #FreedomSong #ExNIFB #ExFundamentalist #VindicationAnthem #BigBandPop #CelebrationSong #ReligiousTrauma #CultRecovery #SurvivorVictory #TruthWins #WelcomeHome #NoMoreFighting #BeautifulDay #JazzPop #SwingMusic #MorningOptimism #ChosenFamily #HealingJourney #FreedomCelebration #NIFBParody #FWBC #NIFB #stevenanderson",
      "release": "2025-11-08T14:44:45Z",
      "duration": "00:04:30",
      "explicit": false,
      "youTubeId": "lxOTtpauoNM",
      "subjects": [
        "New Independent Fundamental Baptist Movement"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lxOTtpauoNM"
      }
    },
    {
      "id": "8d3e448b-b58d-4a74-9fd2-063962d6c819",
      "title": "You Were Always Right Watching a Cult Collapse ",
      "description": "You Were Always Right: Watching a Cult Collapse\nHey. If you\u0027ve ever been hurt by the NIFB or any group like it, this one\u0027s for you.\nYesterday, Steven Anderson posted tweets that proved everything you\u0027ve ever said about the hypocrisy, the theology, and the dysfunction.\nYou don\u0027t have to argue anymore. You don\u0027t have to prove anything.\nHe did it himself. Publicly. Permanently.\nThis isn\u0027t shock content. This is vindication content.\nThis is me, sitting with you, with snacks and teddy bears, watching a cult implode under its own weight—just like you always knew it would.\nYou were right. You were always right. And now it\u0027s undeniable.\nTOPICS COVERED:\n\nWhy healthy coping (like comfort objects) is nothing like hypocrisy\nThe tweets that contradicted 20 years of preaching\nThe theological irony even innocent observers could see\nWhy you don\u0027t have to fight anymore\nCelebrating vindication and freedom\n\nIf this resonates with you, subscribe. Share with someone who needs to hear: \u0022You were right.\u0022\nStay soft. Stay safe. Hug your teddy bears.\n—Lionel (and Monsieur Lapin) 🐰\n#ExNIFB #CultRecovery #YouWereRight #Vindication #SpiritualAbuse #ExFundamentalist #ReligiousTrauma #HealingJourney #ComfortContent #FreedomFromCults #NIFBParody #EventZero #TruthWins #NIFB #FWBC",
      "release": "2025-11-07T15:27:57Z",
      "duration": "00:06:40",
      "explicit": false,
      "youTubeId": "Dy20E2ZuCMU",
      "subjects": [
        "New Independent Fundamental Baptist Movement"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Dy20E2ZuCMU"
      }
    }
  ]
}