{
  "_ts": 0,
  "id": "039c1a37-0b76-4506-ac0d-bfea17468851",
  "name": "The Flying Kitchen by Shannon Vavich",
  "youTubeChannelId": "UCUHqhyuOo_uztDjiWOal6zQ",
  "youTubePlaylistId": "PL3MO9pfT6J4S2UycQbLqWEsonnRj_hxH6",
  "episodes": [
    {
      "id": "61e0e013-8667-4ebb-95b0-5f3462a51e98",
      "title": "Why Do MAGA Catholics HATE Pope Francis So Much???",
      "description": "In this episode, Shannon Vavich engages with Mark Shea to explore the complex relationship between MAGA Catholics and Pope Francis. They discuss the historical context of the pro-life movement, the concept of heresy within Catholicism, and the implications of nationalism and tribalism in faith. The conversation delves into how political agendas have shaped Catholic beliefs and practices, particularly regarding abortion and social justice. Shea emphasizes the need for a holistic understanding of Catholic teaching that transcends partisan divides, advocating for a faith that prioritizes the dignity of all human life. In this conversation, Shannon Vavich and Mark Shea explore the complexities of contemporary Christianity, particularly in relation to the MAGA movement, the pro-life stance, and the broader implications of legalism and cruelty in society. They discuss the absurdity of imposing law as a means of salvation, the mystery of evil, and the dangers of a culture that promotes scarcity and fear. The dialogue emphasizes the importance of empathy, the need to address victims of cruelty, and the role of laypeople in evangelism. Ultimately, they highlight the revolutionary force of Christianity and the hope that persists amidst historical challenges, advocating for a return to the core teachings of the Gospel and Catholic social teaching.\n\nShannon\u0027s Socials can be found here:\nhttps://linktr.ee/TheFlyingKitchen\n\nFind Mark on Facebook: https://www.facebook.com/share/12KTEEYCRWR/?mibextid=wwXIfr\n\nTakeaways\nMAGA Catholics harbor significant discontent towards Pope Francis due to his inclusive approach to social issues.\nThe pro-life movement has evolved into a heretical interpretation of Catholic teaching, focusing narrowly on abortion.\nHeresy is defined as a monomania, where one aspect of faith is emphasized to the exclusion of others.\nFamily and nation are often idolized in conservative Catholic circles, overshadowing the kingdom of God.\nEconomic policies significantly impact abortion rates, challenging the narrative that solely focuses on legal restrictions.\nMedia plays a crucial role in shaping Catholic beliefs, often simplifying complex teachings into sound bites.\nThe Church\u0027s stance on war and torture has been compromised by political agendas, particularly among conservative Catholics.\nThe election of Pope Francis marked a shift towards a more inclusive and socially aware Catholicism, which has faced backlash.\nRacial and national identities have become intertwined with religious beliefs, complicating the Church\u0027s universal message.\nThe Church\u0027s teachings are intended for all humanity, not just specific tribes or nations. Imposing law as a means of salvation is absurd.\nLegalism leads to failure in understanding salvation.\nCruelty and judgment are prevalent in contemporary Christianity.\nEvil is a mystery that often defies logic.\nGrave evil disguises itself as courage.\nEmpathy is increasingly labeled as a sin.\nA culture of scarcity breeds fear and hostility.\nThe Great Replacement Theory fuels racism and xenophobia.\nThe pro-life movement has strayed into moral heresy.\nHope exists in the revolutionary force of Christianity.\n\nChapters\n00:00\nIntroduction to the Conversation\n03:21\nUnderstanding MAGA Catholics\u0027 Discontent with Pope Francis\n09:10\nThe Concept of Heresy in Catholicism\n10:08\nThe Two Greatest Commandments and Their Implications\n15:28\nThe Idolatry of Family and Nation\n17:21\nThe Pro-Life Movement\u0027s Evolution and Misconceptions\n25:33\nPolitical Manipulation of the Pro-Life Movement\n31:05\nConsequences of a Narrow Focus on Abortion\n39:22\nThe Role of Media in Shaping Catholic Perspectives\n50:40\nThe Impact of Republican Policies on Abortion Rates\n51:48\nThe Evolving Non-Negotiables of Catholicism\n58:27\nEuthanasia and the Death Penalty: A Catholic Dilemma\n01:03:51\nPolitical Dynamics: Obama, Abortion, and the Pro-Life Movement\n01:10:07\nPope Francis vs. American Nationalism\n01:19:54\nThe Culture of Cruelty and the Sin of Empathy\n01:39:18\nReturning to the Gospel: A Path Forward\n01:42:08\nConfronting Cruelty and Intimidation\n01:44:56\nThe Role of Prudence in Faith\n01:47:50\nAddressing Victims of Injustice\n01:52:06\nThe Importance of Community and Safety\n01:55:59\nThe Power of Personal Witness\n02:00:13\nHope Amidst Historical Challenges\n02:02:57\nThe Revolutionary Force of Christianity\n02:07:08\nRecognizing Goodness in a Divided World\n02:10:50\nThe Call for Unity and Understanding",
      "release": "2025-02-19T15:31:17Z",
      "duration": "02:19:58",
      "explicit": false,
      "youTubeId": "Mss0TUjsms0",
      "subjects": [
        "Catholicism",
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Mss0TUjsms0"
      }
    },
    {
      "id": "6a799bc5-a432-4516-a8f1-b9b303528a9c",
      "title": "Groomed \u0026 Abused by Opus Dei",
      "description": "My story of Catholicism, Opus Dei and Democracy. Plus my explanation of how Opus Dei became the real power behind Project 2025, and what they intend to do with that power.  #catholicking \n#project2025 #opusdei",
      "release": "2025-02-11T22:17:18Z",
      "duration": "02:05:55",
      "explicit": false,
      "youTubeId": "6yV0EAade9o",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6yV0EAade9o"
      }
    },
    {
      "id": "4aee2a92-5c8f-4ccc-aebc-013e93dca30f",
      "title": "Fascism in The Church - Our Experiences Watching Opus Dei and MAGA Infiltrate and Divide",
      "description": "First Episode of \u0022opus deiNOT GONNA GET AWAY WITH IT\u0022 - Exposing the hidden powers behind Project 2025.  Episode 1: From Catholicism to Deconstruction: Michele\u0027s Story\n\nIn this episode, Shannon Vavich and Michele Quigley delve into the complexities of Project 2025, exploring its implications on democracy and the influence of far-right Catholic ideologies. Michele shares her personal journey from a Methodist upbringing to deep involvement in Catholicism, discussing the impact of strict teachings on family life, contraception, and the challenges faced when questioning authority within the church. The conversation also touches on the political polarization within religious communities and the fallout experienced after leaving the church, highlighting the intersection of faith and fascism in contemporary society. In this conversation, Michele Quigley and Shannon Vavich explore the complexities of motherhood, societal expectations, and the value of women beyond childbearing. They discuss the impact of patriarchy, the importance of religious freedom, and the role of artistic expression in personal healing. The dialogue emphasizes the need for community support, resilience in the face of judgment, and the power of individuality. Through their shared experiences, they highlight the significance of finding joy and beauty in everyday life, encouraging listeners to embrace their unique paths and foster connections with like-minded individuals.\n\nChapters\n00:00\nIntroduction to Project 2025\n06:56\nThe Impact of Catholic Teachings on Family Life\n14:31\nThe Role of Diocesan and Religious Orders\n22:47\nCultural Practices and Personal Choices in Faith\n30:43\nPublic Revelation and Community Response\n36:00\nThe Impact of Abuse Scandals on Faith\n41:51\nPolitical Polarization and Faith\n46:04\nPrivilege in Parenting Choices\n49:35\nRacism and Representation in Faith Communities\n52:59\nThe Challenges of Homeschooling in a Conservative Context\n55:12\nThe Harsh Reality of Religious Judgment\n57:53\nDeconstructing Faith and Identity\n01:00:40\nThe Burden of Perfectionism in Faith\n01:01:36\nPublic Perception and Scandal in Faith Communities\n01:02:47\nThe Impact of Social Media on Personal Narratives\n01:04:31\nThe Intersection of Faith and Feminism\n01:06:23\nConfronting Extremism in Religious Circles\n01:09:41\nThe Role of Women in Religious Narratives\n01:12:54\nMaternal Health and Reproductive Rights\n01:15:14\nThe Value of Women Beyond Childbearing\n01:18:11\nThe Dangers of Religious Dogma\n01:20:45\nCommunity Pressure and Individual Faith\n01:25:29\nReflections on Leadership and Responsibility\n01:27:22\nThe Role of Women in Society\n01:28:59\nArtistic Expression as a Means of Liberation\n01:32:06\nNavigating Community Expectations\n01:36:31\nFinding Compassion in a Divided World\n01:39:46\nEmpowerment Through Agency and Resources\n01:43:31\nThe Universal Desire for Connection and Understanding\n01:52:14\nCreating a Personal Studio Space\n01:55:28\nThe Impact of Historical Events on Fashion\n01:58:41\nPhotography as a Means of Empowerment\n02:02:04\nFinding Joy in Art and Community\n02:05:21\nBreaking Free from Restrictive Norms\n02:12:05\nThe Role of Community in Personal Growth\n\n#Project2025 \n#catholicism\n#MicheleQuigley\n#ShannonVavich \n#ReligiousIdentity\n#familyplanning\n#politicalpolarization\n#deconstruction\n#faith\n#fascism\n#community\n#motherhood\n#societalexpectations\n#womensvalue\n#religious\n#artisticfreedom\n#patriarchy\n#communitypressure\n#artisticexpression\n#selfdiscovery\n#resilience\n#individuality\n\nAudio version coming to all podcast streaming platforms.  \n\nThank you so much Michele.  It was an absolute heartwarming joy conversing with you.\n\nSincerely,\nShannon Vavich\n\nMichele’s Socials: \n\nhttps://www.instagram.com/michelequigley\n\nFacebook: \n\nhttps://www.facebook.com/share/14s9sDawmh/?mibextid=wwXIfr\n\nWebsite (BEAUTIFUL PORTRAITURE PHOTOGRAPHY) \n\nhttps://michelequigley.com/\n\nShannon’s Socials: \n\nYouTube: https://youtube.com/@TheFlyingKitchen\n\nFacebook: https://www.facebook.com/profile.php?id=100057690218799\n\nIG: https://www.instagram.com/shannonvavich_theflyingkitchen?igsh=eWM1bDJ4cHp5eXVq\u0026utm_source=qr\n\nThreads: https://www.threads.net/@shannonvavich_theflyingkitchen?igshid=NTc4MTIwNjQ2YQ==\n\nTiktok: https://www.tiktok.com/@theflyingkitchen?_t=ZN-8tgbYjQpoWc\u0026_r=1\n\nSubstack: https://shannonvavich.substack.com?r=u71n9\u0026utm_medium=ios\n\nBluesky: https://bsky.app/profile/theflyingkitchen.bsky.social\n\nLinked In:  https://www.linkedin.com/in/shannon-vavich-087290172?utm_source=share\u0026utm_campaign=share_via\u0026utm_content=profile\u0026utm_medium=ios_app",
      "release": "2025-02-06T22:54:09Z",
      "duration": "02:18:16",
      "explicit": false,
      "youTubeId": "MYC_RZSCTis",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MYC_RZSCTis"
      }
    },
    {
      "id": "25a6886c-7249-419c-b921-13ca963ee535",
      "title": "Project 2025, A Catholic King, Christendom, and a Holy War",
      "description": "After America is a Christian nation, the Christians will war for as long as it takes until the Far Right Catholics achieve “Christendom”. I was pulled into this cult 25 years so. See what I learned.",
      "release": "2025-01-28T19:31:02Z",
      "duration": "00:09:51",
      "explicit": false,
      "youTubeId": "0Z5_-1lzGKs",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0Z5_-1lzGKs"
      }
    },
    {
      "id": "7951059a-a015-4eea-a66b-e3a595c56a59",
      "title": "My Escape From a Far Right Catholic Cult, Part 2: Kathie Socks it to The Apostate (me)",
      "release": "2025-01-26T17:42:33Z",
      "duration": "00:09:55",
      "explicit": false,
      "youTubeId": "HhbuNbvHfZ4",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HhbuNbvHfZ4"
      }
    },
    {
      "id": "58e34a3d-5b0e-41be-9790-16ac98203471",
      "title": "My Escape From A Far Right Catholic Cult part 1: Troll Hunting",
      "description": "My escape from a far right Catholic cult, Part 1.  Sorry, we’re talking about a decades long plan to bring “Christendom” to America and demand compliance. There will be more than 1 part, cause I’ve got a lot to spill.",
      "release": "2025-01-25T12:54:48Z",
      "duration": "00:09:54",
      "explicit": false,
      "youTubeId": "dgdOiIn3_Uo",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dgdOiIn3_Uo"
      }
    }
  ]
}