{
  "id": "c5632712-89be-4a18-a08b-05a29cdf443f",
  "name": "The Gaslight Effect Podcast",
  "spotifyId": "1XdjMoLzr9s0T8QIvXThn0",
  "appleId": 1645322193,
  "episodes": [
    {
      "id": "d338158e-89ff-4a9a-8f77-55acb06f8f99",
      "title": "033 - Gaslighting Inside the Oath Keepers\u0027 Founder\u0027s Family with Dakota Adams",
      "description": "On this episode, Dr. Robin Stern talks with  Dakota Adams, son of Stewart Rhodes, the founder and leader of the Oath Keepers organization. Dakota opens up about a life that was not only entangled with the controversial Oath Keepers but also shadowed by the dark clouds of gaslighting and abuse. Gaslighting, a form of psychological manipulation that seeks to make victims doubt their reality, is a theme woven into the fabric of Dakota\u0027s narrative. He recounts the harrowing escape from an environment marked by violence and chaos, where he and his siblings\u0027 perceptions were constantly manipulated. Dakota reveals the intricate layers of his father\u0027s personality, from the early days of criticism against political figures to a surprising evolution that ultimately led to Stewart Rhodes\u0027 involvement in the infamous events at the U.S. Capitol on  January 6, 2021. But it\u0027s not just a story of political activism; it\u0027s a story of survival. Dakota shares the devastating effects of gaslighting on a family, detailing the struggles of breaking free from a cycle of manipulation, fear, and isolation. Join Robin and Dakota as they unravel the complexities of Dakota\u0027s life, a life shaped by an organization founded on principles that devolved into chaos. This episode will take you beyond the headlines, providing a closer look at the impact of gaslighting on individuals, families, and communities. You can read the full transcript of this episode and listen to other episodes over at robinstern.com, and please leave a rating and review wherever you listen to this podcast!  Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer:  The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2023-12-19T03:00:00Z",
      "duration": "01:00:45.8300000",
      "explicit": false,
      "spotifyId": "5y3VzBfxNqEnkw8DZTn3zp",
      "appleId": 1000638102959,
      "subjects": [
        "Qanon",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5y3VzBfxNqEnkw8DZTn3zp",
        "apple": "https://podcasts.apple.com/podcast/033-gaslighting-inside-the-oath-keepers-founders/id1645322193?i=1000638102959"
      }
    },
    {
      "id": "6eb4fe58-909d-4bb5-9d20-4a4d7df538b2",
      "title": "031 - Understanding Gaslighting Through the Lens of Emotional Intelligence: A Conversation with Dr. Marc Brackett",
      "description": "On this episode, the intricate realms of gaslighting, human behavior and emotional intelligence intersect, as Dr. Robin Stern talks with her colleague and good friend, Dr. Marc Brackett.  Dr. Brackett is the Director of the  Yale Center for Emotional Intelligence, and author of \u0022Permission to Feel.\u0022  On this episode, Dr. Stern and Dr. Brackett unravel the subtle dynamics of gaslighting, a pervasive issue affecting relationships, workplaces, and self-perception. Dr. Brackett, with a wealth of expertise, illuminates the profound connection between emotional intelligence and gaslighting. Gaslighting, fundamentally rooted in the manipulation of emotions, finds itself at the intersection of emotional intelligence. Dr. Brackett\u0027s insights go beyond defining gaslighting; they explore the pivotal role emotional intelligence plays in both perpetuating and countering this intricate form of manipulation. Robin and Marc discuss insights into the significance of recognizing and validating emotions, which is one of the foundational aspects of emotional intelligence. Dr. Brackett shares strategic approaches for harnessing emotional intelligence to fortify against gaslighting tactics and nurture resilient, healthier relationships. This episode promises to be an invaluable compass for navigating the nuanced waters of emotions and relationships. To read the full transcript of this episode and to listen to other episodes, head over to robinstern.com, and please be sure to leave a rating and review wherever you listen to this podcast!  Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer:  The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.  ",
      "release": "2023-11-21T00:00:00",
      "duration": "00:52:25.2290000",
      "explicit": false,
      "spotifyId": "5iY4Xy4KFSaJ72hjigaBqn",
      "appleId": 1000635496533,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5iY4Xy4KFSaJ72hjigaBqn",
        "apple": "https://podcasts.apple.com/podcast/031-understanding-gaslighting-through-the-lens/id1645322193?i=1000635496533"
      }
    },
    {
      "id": "c7798e6d-1e0a-4fe2-b018-2013a20ea2f0",
      "title": "020 - Surviving and Thriving Beyond The Sarah Lawrence Cult",
      "description": "On this episode, Dr. Robin Stern interviews writer and producer, Daniel Levin.  Daniel Levin holds an MFA in poetry from the University of California, Irvine, where he taught creative writing and rhetoric, and a bachelor’s degree from Sarah Lawrence College. He is the winner of the Stanley and Evelyn Lipkin Prize for Poetry, the Lynn Garnier Memorial Award and is the recipient of fellowships from The Frost Place, Tent, The Sarah Lawrence Summer Seminar for Writers, and The Community of Writers at Squaw Valley. His writing has appeared in Provincetown Arts, Bat City Review, The Sarah Lawrence Review, The Westchester Review, The Offbeat, The Fourth River, and The Bennington Review. He lives in Los Angeles. Daniel is the author of  Slonim Woods 9: A Memoir, which recounts Daniel\u0027s involvement, and subsequent escape from the college cult that rocked the nation in 2019.  Daniel is also an Executive Producer of  Stolen Youth: Inside the Cult at Sarah Lawrence, a three-part series airing on Hulu, that documents \u0022A group of bright Sarah Lawrence College students\u0022 that \u0022fall under the dark influence of a friend’s father, Larry Ray. With unprecedented access to the survivors who lived with Ray, the film follows the cult from its origins through its still-unfolding aftermath.\u0022 Daniel and Robin discuss the path that led Daniel into this cult, the bizarre and often terrifying experiences he had, and ultimately his escape from the grip of Larry Ray.  Daniel not only survived the ordeal, but is now thriving as an author and teacher.  To read the full transcript of this episode and to hear other episodes, head over to robinstern.com, and please leave a rating and review wherever you listen to this podcast! ",
      "release": "2023-06-20T00:00:00",
      "duration": "00:56:36.2000000",
      "explicit": false,
      "spotifyId": "5PVcntrmHc96yXHMFG1q1G",
      "subjects": [
        "Larry Ray"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5PVcntrmHc96yXHMFG1q1G"
      }
    },
    {
      "id": "57a5f32f-75eb-49d0-a21e-2e7b46947c95",
      "title": "018 - Cults, Mind Control, and How it Can Happen to You",
      "description": "On this episode Dr. Robin Stern interviews her friend and colleague Dr. Steven Hassan.  Dr. Hassan is a leading expert on cults and has dedicated his life to preventative education and helping people recover from their own experiences.  Dr. Hassan is the author of four books: Combating Cult Mind Control;  Releasing The Bonds; Freedom Of Mind; and his most recent book,  The Cult Of Trump.  Dr. Hassan  describes in great detail how he became part of a cult in college, the techniques that were used on him (and ultimately by him) to exert mind control, and the steps he took to get out.  Dr. Hassan describes mind control as a three step process:  Unfreezing the person\u0027s identity Indoctrination Refreezing the person\u0027s new identity  Robin and Steven discuss the influence of cell phones on the masses and the flood of information from sometimes radical sources. Dr. Stern and Dr. Hassan also explain that human beings are emotionally driven, rationalize a lot, and are incredibly adaptive to people in their environment as well as to leaders that they think are legitimate.  Dr. Hassan identifies the signs to look for if you think someone you know may be in a cult, and the importance of showing love toward that person to help them break free.  As Dr. Hassan says, \u0022Love is stronger than mind control.\u0022 To see the full transcript of this episode and to listen to other episodes, head over to robinstern.com, and pelase be sure to leave a rating and review wherever you listen to this podcast!         ",
      "release": "2023-05-23T00:00:00",
      "duration": "00:48:10",
      "explicit": false,
      "spotifyId": "6WUGV22b8IqU09Lofiwj9Z",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6WUGV22b8IqU09Lofiwj9Z"
      }
    },
    {
      "id": "9abd7b6a-26e8-40bd-a020-310b30fb2ef0",
      "title": "015 - Am I Crazy? Or Am I Being Gaslighted?",
      "description": "On this episode, Dr. Robin Stern talked with her close friend and colleague, Alice Forrester, the CEO of Clifford Beers Community Health Partners. Alice discussed how growing up as a teenager in the 1970s, she was aware of the culture shift that was occuring at that time in our country, and how her father struggled with this changing dynamic.  Alice recalled often being told she was wrong by her father, about certain opinions she was formulating at that time, and how that did not leave her unscathed.  Alice and Robin unpacked Alice\u0027s feelings of being \u0022wrong\u0022 and how that has impacted her adult life. Alice shared a deeply personal account of when her nephew recently passed away at a young age from COVID and how she felt she couldn\u0027t say the right words to comfort her sister in her grief, and how this stirred up deeply emotional feelings of not being good enough.  Alice also shared that at the same time, her marriage was going through a difficult time, and how she was being gaslighted by her partner regarding their relationship.  Robin and Alice worked through the the idea that these multiple experiences of gaslighting can cause you to think that maybe you are wrong, and to second guess your own reasoning. Often, giving yourself space allows you to gain a better understanding of what is happening and spurs you to change or get out of the gaslighting situation.  Alice shared how understanding what gaslighting means and what to look for, has helped her in raising her daughters in these unsettled times during the pandemic and post pandemic, when we  often are told to believe things that are constantly changing and things that we know are not accurate.  To read the full transcript of this episode and to listen to other episodes, please head over to robinstern.com.  And don\u0027t forget to leave a rating and review wherever you listen to this podcast!         ",
      "release": "2023-04-11T00:00:00",
      "duration": "00:40:46.8370000",
      "explicit": false,
      "spotifyId": "6PbQwk5i92sHnGgChRjXW5",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6PbQwk5i92sHnGgChRjXW5"
      }
    },
    {
      "id": "7fb874c0-9859-4387-8472-4f44b54ef519",
      "title": "014 - The Horror of Gaslighting",
      "description": "On this episode, Dr. Robin Stern talks with Ian Nichols, co-host of  It\u0027s Only A Podcast - a horror movie review show.  Robin has been a guest on several of Ian\u0027s podcast episodes that explore gaslighting in horror movies.  Ian shares his personal experience with gaslighting, both within a romantic relationship as well as with his parents.  Ian describes himself as an empath and a very emotional person who often cries during emotional moments in his life.  As a child, Ian\u0027s parents instilled the thought in himself that he \u0022cried too much.\u0022  His childhood was marred by abuse, an alcoholic mother, an often distant father, and parents who continually told him he was too sensitive.  Growing up, Ian felt he had to hide the emotional side of himself in friendships and relationships, and he often used humor to deflect away from getting \u0022too emotional.\u0022 This ultimately led to Ian falling into a deep depression.  Ian also shares about a relationship in which his partner was from a different culture that didn\u0027t value feminity and vulnerablity.  This again made Ian feel that something was wrong with him.  Thankfully, Ian was able to work through these issues with a therapist and discovered that he was involved in gaslighting situations with both his parents and in his relationship.  Robin and Ian discuss the importance of having a strong support network to help you process painful interactions with gaslighters...and the value of \u0022healthy emotion snacks!\u0022 To read the full transcript of this episode and to hear other episodes, head over to robinstern.com.  And please leave a rating and review wherever you listen to this podcast!",
      "release": "2023-03-28T00:00:00",
      "duration": "00:48:12.6090000",
      "explicit": false,
      "spotifyId": "6d8lSCkyin6xRIaZalT7lN",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6d8lSCkyin6xRIaZalT7lN"
      }
    },
    {
      "id": "4e27155b-2095-441f-906a-9a2ea2998569",
      "title": "008 - Exploring The Trauma of Gaslighting",
      "description": "On this episode, Dr. Robin Stern talks with Dr. George Bonanno, Professor of Clinical Psychology at Columbia University. Dr. Bonanno is the author of two amazing books - The End of Trauma and  The Other Side of Sadness.  From Dr. Bonanno\u0027s website :  \u0022He is recognized by the Web of Science as among the top one percent most cited scientists in the world, and has been honored with lifetime achievement awards by both the Association for Psychological Science and the International Positive Psychology Association. In addition to the books, The End of Trauma and  The Other Side of Sadness, George has published hundreds of peer-reviewed scientific articles, many appearing in leading journals such as Nature, JAMA, American Psychologist, and the Annual Review of Psychology. He is also an avid painter (when he has time), reads widely, and loves music.\u0022   Robin and Dr. Bonanno explore how human trauma plays a role in gaslighting and some tools of resilience that can help in dealing with and healingl the trauma of gaslighting.    Robin points out that gaslighters are not born.  Gaslighting is the result of social learning.  A gaslighter tries something and it works, and they need to be in control of a moment, so they continue to use this tactic.    Dr. Bonanno talks about the flexibility mindset and using this to determine ways to not allow the gaslighter to control you.     Robin and Dr. Bonanno also look into the grief and sadness that can accompany the ending of a gaslighting relationship.  Even though the gaslightee can be happy and relieved, they are also susceptible to being sad at the loss of a relationship that they may have had for a very long time.    To read the complete transcript of this episode and to hear other episodes of The Gaslight Effect Podcast, head over to robinstern.com.  And please leave a rating and review if you enjoyed this episode!            ",
      "release": "2023-01-03T00:00:00",
      "duration": "00:38:52.5830000",
      "explicit": false,
      "spotifyId": "0a3rhnGngH2gwG5zAJ3Aju",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0a3rhnGngH2gwG5zAJ3Aju"
      }
    }
  ]
}