{
  "_ts": 0,
  "id": "ca8e728c-56a6-4c3a-8cd2-ae18a960543e",
  "name": "The Tragedy Academy",
  "spotifyId": "0Xqy5gkOKSXwoQji4t8M9n",
  "appleId": 1491958207,
  "episodes": [
    {
      "id": "6a60adb7-eadb-4bff-bd2b-ac6ca92d5646",
      "title": "The Covert Control of Cults: Peter Young\u0027s Story",
      "description": "Welcome to The Tragedy Academy, a show created to bridge societal divides in a judgment-free zone using candor and humor. In this episode, hosts Jay Hicks and Gary DeFranco are joined by Peter Young, a former sports broadcaster turned author, who shares his extraordinary story of being entangled in a cult and his journey to freedom. Join us as Peter Young, a New Jersey native and former aspiring sports star, delves into his unexpected journey from aspiring athlete to sports broadcaster and, ultimately, to a man caught in the web of a cult. Peter opens up about his life-changing encounter with a small cult leader, Uncle Robert, and its profound impact on his life and relationships. Peter illuminates the often-overlooked world of small cults and the insidious nature of mind control through his story. This episode is not just a recount of personal trials but a cautionary tale that sheds light on cult influence\u0027s subtle yet powerful dynamics. Key Takeaways: 🌀 [00:00:50] Peter\u0027s transition from sports to being part of a cult. 🧠 [00:02:10] The core nature of cults: Undue, manipulative, coercive mind control. 🎭 [00:06:31] The role of the cult leader in shaping members\u0027 identities. 🖤 [00:09:28] The intense emotional and mental abuse within the cult. 🕵️ [00:21:33] The calculated methods used by the cult leader for control and manipulation.   Guest Bio: Once a sports broadcaster, Peter Young shares his life-altering experiences in and out of a tiny religious cult. His best-selling memoir, \u0022Stop The Tall Man, Save The Tiger,\u0022 chronicles this journey, offering insights and warnings about the dangers of such groups. Peter\u0027s story is a powerful example of resilience and recovery, driven by faith, friends, and family. Guest Quotes: 🗣️ [00:16:47] \u0022Cult leaders often use excellent information to gain your trust.\u0022 - Peter Young 🛑 [00:38:12] \u0022The isolation and cutting off of fellowship enabled all of this to happen.\u0022 - Peter Young CTA for Show:  Remember to subscribe to The Tragedy Academy Podcast for more insightful episodes like this. We delve into the human experience, unmasking the complexities of life\u0027s challenges. Share this episode and help spread awareness about the hidden realities of cults and mind control. Join us on this journey of enlightenment, and remember, \u0022Be cool and keep learning.\u0022 📚🌐 CTA for Guest:  Learn more about Peter Young\u0027s journey and insights by reading his best-selling memoir, \u0022Stop The Tall Man, Save The Tiger.\u0022 Follow his efforts to educate the public about the dangers of cults and discover how he turned a harrowing experience into a source of empowerment and awareness. 📖✨ Author Peter Young https://www.instagram.com/peterbyoung https://www.facebook.com/Peteryoung32 Peter B. Young - YouTube Conclusion:  Thank you for tuning in to this powerful The Tragedy Academy Podcast episode. Join us next week for another thought-provoking discussion that aims to educate, entertain, and inspire. Remember, \u0022Be cool and keep learning.\u0022 🌟🎧 📲 Connect with us at https://www.thetragedyacademy.com and follow us on social media for more engaging content.",
      "release": "2024-01-17T04:00:00Z",
      "duration": "01:05:16.4740000",
      "explicit": true,
      "spotifyId": "6ExLjpUdhG54l3NdKjJ0Oz",
      "appleId": 1000641920695,
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ExLjpUdhG54l3NdKjJ0Oz",
        "apple": "https://podcasts.apple.com/podcast/the-covert-control-of-cults-peter-youngs-story/id1491958207?i=1000641920695"
      }
    }
  ]
}