{
  "_ts": 0,
  "id": "88ac23cc-4ea7-42d3-911e-9cdf170b1057",
  "name": "The Deconstructionists",
  "spotifyId": "6Ds1MOzs0z4o4prkkMQ6on",
  "appleId": 1080170463,
  "youTubeChannelId": "UCeePhqoUaiwmi63s6u3XSyg",
  "episodes": [
    {
      "id": "60a92f1f-0e32-4f7a-85e2-44b73c897e90",
      "title": "Ep 22 - Steve Hassan ”Cults, Brainwashing and Freedom of Mind”",
      "description": "If you’re digging what we’re doing here consider making a small donation. Maintaining a podcast isn’t cheap and every dollar donated helps us to keep this thing going. Money donated goes to helping to purchase research materials, maintenance of the website, storage of episodes, etc. Click the link below to donate and thank you so much: https://squareup.com/store/thedeconstructionists This week we speak with Steven Hassan. Steven is widely considered to be one of the foremost experts in mind control, controlling groups, and destructive cults. He holds a Masters degree in counseling psychology from Cambridge College, is a Licensed Mental Health Counselor (LMHC) in the Commonwealth of Massachusetts, and a Nationally Certified Counselor (NCC). Steven Hassan speaks to national and international audiences and concerned groups about how they can be most effective in the struggle against cults and other dangerous groups. He has specific ideas for educators, mental health professionals, politicians, law enforcement personnel, parents and community groups. Steven has written three books that have received extensive praise from former cult members, families of former members, clergy, cult experts, and psychologists. His most recent is Combating Cult Mind Control: The #1 Best Selling Guide to Protection, Rescue, and Recovery from Destructive Cults (2015). In July 2012, he published the paperback and ebook, Freedom of Mind: Helping Loved Ones Leave Controlling People, Cults \u0026 Beliefs. www.freedomofmind.com Facebook: @FOMInc Twitter: @CultExpert Special guest music on this episode provided by: George Cosby Instagram: @GeorgeCosby Twitter: @georgecosby Facebook: www.facebook.com/georgecosbymusic/ Enjoy the songs? Songs featured on this episode were: Ritual Blush, Black Moon, State of Undress, Vacant Grace, \u0026 All of your Love from the Human Touch EP \u0026 Live for Burberry EP. George’s music is available on iTunes, Spotify, Pandora, YouTube, \u0026 Soundcloud https://soundcloud.com/georgecosby The Deconstructionist’s Podcast is mixed and edited by Nicholas Rowe at National Audio Preservation Society: A full service recording studio and creative habitat, located in Heath, Ohio. Find them on Facebook and Twitter or visit their website for more information. www.nationalaudiopreservationsociety.weebly.com www.facebook.com/nationalaudiopreservationsociety Twitter: @napsrecording\n\n\n\n\n\nSupport this podcast at — https://redcircle.com/the-deconstructionists/donations\n\n\n\nAdvertising Inquiries: https://redcircle.com/brands\n\n\n\nPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-12-25T17:36:26Z",
      "duration": "01:23:45",
      "explicit": false,
      "spotifyId": "7MhGBxY4SWiuuzI0nY5TqP",
      "appleId": 1000373638017,
      "youTubeId": "nrdVLNJC91M",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MhGBxY4SWiuuzI0nY5TqP",
        "apple": "https://podcasts.apple.com/podcast/ep-22-steve-hassan-cults-brainwashing-and-freedom-of-mind/id1080170463?i=1000373638017",
        "youtube": "https://www.youtube.com/watch?v=nrdVLNJC91M"
      }
    },
    {
      "id": "cc85c043-6010-4300-b6c0-46945ad8ab28",
      "title": "Doug Smith ”Growing up in a cult”",
      "description": "Guest Info/Bio: This week’s guest is comedian Doug Smith. Doug is a former Jehovah’s Witness who is searching for silver lining in growing up inside a doomsday cult. We talk about how his family got involved with the Jehovah’s Witnesses and what it was like to walk away. Check out Doug’s podcast: Jehovah Boy with Doug Smith Guest Website/Social Media: www.dougsmithcomedy.com Twitter, Instagram, Tik Tok, \u0026 YouTube: @whodougsmith Special Theme Music by: Forrest Clay Instagram: @forrestclaymusic Twitter: @clay_k YouTube: www.youtube.com/claykmusic Songs featured on this episode were from the Recover EP You can find Clay’s music on iTunes, Apple Music, Spotify, YouTube, or anywhere good music is found! This episode of the Deconstructionists Podcast was edited, mixed, and produced by John Williamson Stay on top of all of the latest at www.thedeconstructionists.com Go there to check out our blog, snag a t-shirt, or follow us on social media Join our Patreon family here: www.patreon.com/deconstructionists Website by Ryan Battles All photos by Jared Hevron Logos designed by Joseph Ernst \u0026 Stephen Pfluig T-shirt designs by Joseph Ernst, Chad Flannigan, Colin Rigsby, and Jason Turner. Starting your own podcast? Try Riverside! https://riverside.fm/?utm_campaign=campaign_1\u0026utm_medium=affiliate\u0026utm_source=rewardful\u0026via=john-williamson Support this podcast at — https://redcircle.com/the-deconstructionists/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-01-22T05:05:00Z",
      "duration": "00:52:27.5460000",
      "explicit": false,
      "spotifyId": "0TyKFLpeS76W4KCxjnFr9l",
      "appleId": 1000642445556,
      "youTubeId": "eafSE0k4fZw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0TyKFLpeS76W4KCxjnFr9l",
        "apple": "https://podcasts.apple.com/podcast/doug-smith-growing-up-in-a-cult/id1080170463?i=1000642445556",
        "youtube": "https://www.youtube.com/watch?v=eafSE0k4fZw"
      }
    }
  ]
}