{
  "id": "d7d99434-e29a-42af-9b1e-8871c116d474",
  "name": "The COSMIC Bridge",
  "spotifyId": "2NZ6py4qbMgoOzkXp0DcPQ",
  "appleId": 1655674787,
  "youTubeChannelId": "UCJTQtjLxWD38fV3aO-zwFkw",
  "episodes": [
    {
      "id": "df39b3ad-f791-4329-8499-add71c36bad2",
      "title": "Growing Up in The Children of God Cult! Ep 68 Petra Velzeboer",
      "description": "Petra Velzeboer is a renowned author, psychotherapist, TedX speaker, and CEO of mental health consultancy PVL.\n\nBorn into a notorious cult ‘’The Children of God’’, Petra was raised in a strict environment where individuality and self expression were discouraged. Travelling the globe, she learned firsthand about cultures and people but was sheltered from education, books or friendships outside of the community. \n\nRaised to believe the world was going to end, she took her birthright as god\u0027s endtime soldier seriously, turning a blind eye to cruel and unusual punishments, abuse and the fact that the world never did in fact, end.\n\nLeading a double life for many years, she knows firsthand the toll it takes to wear a mask of conformity on one side while leading a hedonistic escapist life on the other. \n\nEventually the cracks started to show, falling pregnant at 22 and moving to London to start a new life with a boyfriend outside of the community. Life had enabled her to escape and offered up a new path. \n\nIn this episode of the show we take a deep look into Petra’s journey, from her time in the cult, to her life afterwards and the struggles she faced along the way, eventually leading her to a life of service and leadership.\n\nEnjoy the show, subscribe and let us know what you think!\n\nTo get in touch with Petra or to find out more about a few of the things we discussed:\n- Petra’s Website: https://www.petravelzeboer.com/ \n- Petra’s LinkedIn: https://www.linkedin.com/in/petra-velzeboer/ \n- Petra’s Instagram: https://www.instagram.com/petra.velzeboer/\n- An Apple Documentary on the Cult: https://tinyurl.com/3ux67sjw \n- An Amazon Documentary on the Cult: https://tinyurl.com/5n8b8ft4 \n- A Podcast on the Cult: https://tinyurl.com/2b7hcj6t \n- A Second Podcast: https://tinyurl.com/3p5886rw \n\nPodcast Chapters:\n0.00 - Trailer\n0.51 - Intro\n1.34 - Petra’s Childhood and Upbringing\n3.44 - The Children of God Cult\n5.35 - The Cult’s Beliefs\n7.45 - The Tyranny of the Majority\n13.11 - Looking into the Abyss\n16.40 - Petra’s Problems After the Cult\n19.05 - Victim Mentality\n23.15 - Working with Fear\n28.17 - Think About Other People!\n31.25 - Petra’s Relationship with Religion and Spirituality Now\n34.40 - Psychedelics and Mental Health\n37.36 - The Importance of Creativity!\n40.45 - Some Actionable Takeaways\n48.57 - Setting Boundaries\n51.02 - What Advice Would You Give to Yourself as a Teenager?\n53.12 - Outro\n\nMichael Hanson is the host of the COSMIC Bridge podcast that inspires its listeners to find their higher purpose and connect their material and spiritual life through stories of breathwork teachers, shamans and stroke survivors. He is also the CEO of Growth Genie, an international B2B sales consultancy.\n\n- The COSMIC Bridge website: https://thecosmicbridge.com/\n- Growth Genie Website: https://growthgenie.co/",
      "release": "2024-03-06T12:15:00Z",
      "duration": "00:53:34",
      "explicit": false,
      "spotifyId": "7y3WuiIN9DGJE5cXiA5mAi",
      "appleId": 1000648201159,
      "youTubeId": "L3Q92A1TxBg",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7y3WuiIN9DGJE5cXiA5mAi",
        "apple": "https://podcasts.apple.com/podcast/growing-up-in-the-children-of-god-cult-ep-68-petra-velzeboer/id1655674787?i=1000648201159",
        "youtube": "https://www.youtube.com/watch?v=L3Q92A1TxBg"
      }
    }
  ]
}