{
  "id": "b60bb45b-3fbe-4609-9541-d6802fa4b570",
  "name": "The Daily T",
  "spotifyId": "4m8VUURbHVccXOxne8NaUP",
  "appleId": 1489612924,
  "youTubeChannelId": "UCPgLNge0xqQHWM5B5EFH9Cg",
  "youTubePlaylistId": "PLJnf_DDTfIVBV8Pt89mSFIFfZBPkWUoB6",
  "episodes": [
    {
      "id": "43fc7309-5a22-44c0-9b37-47e5312b3184",
      "title": "The year that rocked the Royal Family | The Daily T",
      "description": "This episode was recorded before the release of the latest tranche of Jeffrey Epstein documents by Donald Trump’s justice department\n\nThe Duke of York was stripped of his remaining royal titles, patronages and protections as damaging emails with convicted sex offender Jeffrey Epstein came to light. His fall from grace culminated in the loss of royal property, while Sarah, Duchess of York, was once again pulled into a scandal she had long insisted was firmly in the past.\n\nThis was not just another crisis for the Royal Family. It marked the moment the House of York collapsed — exactly as foretold in royal biographer Andrew Lownie’s explosive book, The Rise and Fall of the House of York.\n\nSo how did Prince Andrew’s downfall finally unfold — and what does it mean for the future of the British monarchy in 2026?\n\nIn this episode, Camilla is joined by Andrew Lownie and Hannah Furness, Royal Editor of The Telegraph, to examine how Prince Andrew was stripped of his royal titles, the impact of Virginia Giuffre’s posthumous memoir, the Palace’s shifting strategy, and what — if any — future remains for the disgraced Duke of York.\n\nThe discussion also explores whether Princesses Beatrice and Eugenie have survived the fallout, contrasts Andrew’s collapse with the cautious re-emergence of Prince Harry following a security ruling U-turn and a rare meeting with King Charles, and assesses the ongoing controversies surrounding Meghan Markle.\n\nFinally, the episode examines the growing influence of the Prince and Princess of Wales, the death of the Duchess of Kent, and whether a slimmed-down monarchy is now facing an existential crisis.\n\n\nWe want to hear from you! Email us at thedailyt@telegraph.co.uk or find @dailytpodcast on TikTok, Instagram and X\n\n► Sign up to our most popular newsletter, From the Editor. Look forward to receiving free-thinking comment and the day\u0027s biggest stories, every morning. telegraph.co.uk/fromtheeditor\n\n#PrinceAndrew #DukeOfYork #RoyalFamily #BritishMonarchy #HouseOfYork #AndrewLownie #RoyalScandal #JeffreyEpstein #VirginiaGiuffre #SarahFerguson #PrincessBeatrice #PrincessEugenie #PrinceHarry #MeghanMarkle #KingCharles #PrinceWilliam #KateMiddleton #RoyalNews #UKRoyalFamily #MonarchyCrisis",
      "release": "2025-12-23T13:10:11Z",
      "duration": "00:37:57",
      "explicit": false,
      "spotifyId": "4OTX32lVL6b4qlVrLKcrBw",
      "appleId": 1000742462304,
      "youTubeId": "9Xw0ajkhydE",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4OTX32lVL6b4qlVrLKcrBw",
        "apple": "https://podcasts.apple.com/podcast/the-year-that-rocked-the-royal-family-andrews-not/id1489612924?i=1000742462304",
        "youtube": "https://www.youtube.com/watch?v=9Xw0ajkhydE"
      }
    },
    {
      "id": "a23ab477-3512-495f-9b94-15991ca04d62",
      "title": "Prince Andrew’s biographer - disgraced Duke of York should face trial",
      "description": "Following the news that Prince Andrew is to give up his titles and honours, after more damaging headlines about the extent of his friendship with Jeffrey Epstein and the publication of Virginia Giuffre’s posthumous memoir, Andrew Lownie, the Prince’s biographer, joins Camilla and Tim in the studio on today’s Daily T. Lownie tells Camilla and Tim that he believes Prince William drove the move to Andrew relinquish his titles, in an attempt at damage control ahead of more potentially embarrassing revelations. He claims that it’s “too little, too late” and that he should have been stripped of his titles by parliamentary act if necessary, as “nothing much has actually changed”. He also explains how the Prince’s links to the Chinese spy scandal may have played a role in the decision, claiming his behaviour over the years can be explained by a childhood in which he was “shown no boundaries and no discipline”. ► Sign up to our most popular newsletter, From the Editor. Look forward to receiving free-thinking comment and the day\u0027s biggest stories, every morning. telegraph.co.uk/fromtheeditor Producer: Georgia Coan Senior Producer: John Cadigan Video Producer: Will Walters Studio Operator: Meghan Searle Executive Producer: Charlotte Seligman Social Producer: Nada Aggour Editor: Camilla Tominey Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-10-20T17:40:31Z",
      "duration": "00:31:26.9020000",
      "explicit": false,
      "spotifyId": "0La73SnulDhrODmqxfVHd6",
      "appleId": 1000732686991,
      "youTubeId": "eFWM2q5jq5g",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0La73SnulDhrODmqxfVHd6",
        "apple": "https://podcasts.apple.com/podcast/prince-andrews-biographer-disgraced-duke-of-york/id1489612924?i=1000732686991",
        "youtube": "https://www.youtube.com/watch?v=eFWM2q5jq5g"
      }
    },
    {
      "id": "d08f94b5-d53f-42a6-a617-c47a0ac3db94",
      "title": "Rupert Lowe: \u0022Farage is leading a cult, I might start my own party\u0022",
      "description": "As the row inside Reform rumbles on, Camilla speaks to the man behind the headlines: Rupert Lowe. In the wake of his blistering attack on his former ally Nigel Farage, Lowe tells The Daily T the Reform leader is “running a cult” and a “narcissist”. He also says he might start a new party to the right of Reform, calling for “a satisfactory alternative” that is “more than just a mobile PR machine”. Later, we bring you part two of The Daily T’s interview with veteran Tory MP and father of the house Sir Edward Leigh, who’s leading the charge against the legalisation of assisted dying. Ahead of another debate by MPs on Friday, Sir Edward explains why he has joined forces with Labour grandee Diane Abbott in an attempt to halt the Bill’s progress. Producers: Georgia Coan and Lilian Fawcett Senior Producer: John Cadigan Planning Editor: Venetia Rainey Executive Producer: Louisa Wells Social Media Producer: Rachel Duffy Video Editor/Camera Operator: Aaron Wheeler Studio Operator: Meghan Searle Editor: Camilla Tominey Original music by Goss Studio Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-05-15T16:21:26Z",
      "duration": "00:35:07.0620000",
      "explicit": false,
      "spotifyId": "5kfk0oeHIXY2VI7h8XK1vx",
      "appleId": 1000708621346,
      "youTubeId": "aQHMWIHZgq0",
      "subjects": [
        "Political Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5kfk0oeHIXY2VI7h8XK1vx",
        "apple": "https://podcasts.apple.com/podcast/rupert-lowe-farage-is-leading-a-cult-i-might-start/id1489612924?i=1000708621346",
        "youtube": "https://www.youtube.com/watch?v=aQHMWIHZgq0"
      }
    }
  ]
}