{
  "id": "414b5a88-b7bb-4a11-b035-3937dfe4b72b",
  "name": "The Sister Wives Professor",
  "spotifyId": "5RLa60djZ76O33cJbR6qDH",
  "appleId": 1719547118,
  "episodes": [
    {
      "id": "2aaea9b5-3cd6-446a-bd5c-3014f6cd9be1",
      "title": "Sister Wives 5.4 - Polygamist Cults (W. Notes to Self 444)",
      "description": "We\u0027re back to season 5, folks, and i\u0027m tagging in some help. I\u0027ll be honest, I was planning on taking a break from collaborations for a bit, but then this episode was a struggle for me right away. The Brown teenagers (or a few of them) go to meet with and help Holding out Help, the organization that helps former polygamists and cult members escape and establish their new lives. Well, we all know a lot more about these things than we did when this first aired. So Melanie and Cory of Notes to Self 444 (themselves former members of the Browns\u0027 sect the AUB) were kind enough to come on and help me understand what\u0027s all going on beneath the surface here. To me it\u0027s the most enlightening podcast i\u0027ve ever done, thanks to them, so I hope you enjoy. Notes to Self on Youtube. Notes to Self on TikTok. Notes to Self on Instagram. Listen to my sister podcast I\u0027m Already Scared! Check out The Sister Wives Professor Campus Book Store (merch shop) right here! Follow TSWP on Facebook ⁠⁠⁠⁠right here and join the Facebook group! Follow TSWP on Instagram and TikTok ! Intro/outro music by ⁠⁠There Will Be Fireworks⁠ , used with permission. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2026-02-09T06:00:00Z",
      "duration": "01:05:02.6930000",
      "explicit": false,
      "spotifyId": "1E99puBSvWsbhSTA6H5X16",
      "appleId": 1000748860116,
      "subjects": [
        "Apostolic United Brethren"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1E99puBSvWsbhSTA6H5X16",
        "apple": "https://podcasts.apple.com/podcast/sister-wives-5-4-polygamist-cults-w-notes-to-self-444/id1719547118?i=1000748860116"
      }
    },
    {
      "id": "51468fb1-a75e-4559-acb5-f436535b756a",
      "title": "Polygamy, Sister Wives, and Stigma with Notes to Self 444",
      "description": "Welcome to Plathville will be back next week, but I had the chance to talk to Melanie and Cory of Notes to Self 444 about any number of things, including their first-hand experiences with the AUB - the same cult that brought us the Brown family. We talk all about that and a lot more, so I hope you enjoy. Notes to Self on Youtube. Notes to Self on TikTok. Notes to Self on Instagram. Enjoy this podcast early and ad-free, along with monthly bonus podcasts ⁠⁠⁠⁠on Patreon or the Faculty Lounge on Apple Podcasts! Listen to my sister podcast I\u0027m Already Scared! Check out The Sister Wives Professor Campus Book Store (merch shop) right here! Follow TSWP on Facebook ⁠⁠⁠⁠right here and join the Facebook group! Follow TSWP on Instagram and TikTok ! Intro/outro music by ⁠⁠There Will Be Fireworks⁠ , used with permission. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2026-01-14T06:00:00Z",
      "duration": "01:01:22.5340000",
      "explicit": false,
      "spotifyId": "1pI0S80B3qh5QE1PtRyWq3",
      "appleId": 1000745093733,
      "subjects": [
        "Apostolic United Brethren"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1pI0S80B3qh5QE1PtRyWq3",
        "apple": "https://podcasts.apple.com/podcast/polygamy-sister-wives-and-stigma-with-notes-to-self-444/id1719547118?i=1000745093733"
      }
    }
  ]
}