{
  "_ts": 0,
  "id": "102a7ba2-f21b-44ba-9913-2dec0e32c308",
  "name": "The Chalene Show | Diet, Fitness \u0026 Life Balance",
  "spotifyId": "2tMSXYHSsz1ZYfMlbl5fHE",
  "appleId": 911042029,
  "episodes": [
    {
      "id": "893b334f-ec98-4e95-ab3f-d335d557b347",
      "title": "Did I Just Join A Cult? Plus 11 Surprise Sleep Mistakes Keeping You Awake - 1202",
      "description": "Why do some women feel totally exhausted all day—only to be wide awake the second their head hits the pillow? It might not be your hormones (or at least, not just your hormones). In this episode, Chalene shares 11 surprisingly common habits that could be wrecking your sleep—no matter how many wellness hacks or supplements you’ve already tried. We\u0027re talking mouth breathing, blood sugar crashes, sneaky tech triggers, and some habits you thought were healthy but are actually sabotaging your rest. But first—Chalene spills the story of a bizarre and hilariously awkward experience at a recent wellness conference that had her wondering… Did I just join a cult? Trust us, it’s worth the listen. Watch on YouTube this Sunday!! \u0026#x1f449; https://www.youtube.com/@chalenejohnson/videos Join the FREE 14-Day Walking Challenge!! \u0026#x1f449; http://myselfagain.com \u0026#x1f3af;Join Chalene on Patreon for 7 Days FREE for Ad Free The Chalene Show Episodes PLUS all of the other FUN content not suited for the regular show!! \u0026#x1f449; http://chalene.com/more \u0026#x1f3af; Need a clinician who is trained in women\u0027s health and accepts insurance? Book your virtual visit today with MIDI Health! I use and love it! \u0026#x1f449; http://chalene.com/MIDI ✅ What You Will Learn 11 surprising daily habits that may be silently destroying your sleep Why mouth breathing at night wreaks havoc on your rest (and how to fix it) The link between intimacy, hormone balance, and better sleep How certain supplements and sleep aids might be working against you Why a cooler, darker bedroom matters more than you think Easy, science-backed sleep upgrades you can implement tonight \u0026#x1f3af;Join Chalene on Patreon for 7 Days FREE for Ad Free The Chalene Show Episodes PLUS all of the other FUN content not suited for the regular show!! \u0026#x1f449; http://chalene.com/more \u0026#x1f3af;Join the all-new Phase It!! A Personalized Plan Plus Workouts to Fit Your Life \u0026#x1f449;Go to https://phaseitup.com \u0026#x1f4a5;Related Links: Xylimelts \u0026#x1f449; https://amzn.to/4kZAIyK Mouth Tape \u0026#x1f449; https://amzn.to/3ZZQJwA 8sleep \u0026#x1f449; Chalene.com/bettersleep Light Blocking LED covers \u0026#x1f449; https://amzn.to/4kFT74a Sound Machine \u0026#x1f449; https://amzn.to/44c71VF Portable Blackout Shades \u0026#x1f449; https://amzn.to/3SNedRJ Sleep Smarter Book \u0026#x1f449; https://amzn.to/3FJy3dR \u0026#x1f913;Related Episode: #1 Intimacy Expert Reveals the 20-Min Rule No One Ever Talks About Watch: https://youtu.be/d-GmrWNpwjY?si=Lxz8IMz7b2J4Ou9F Listen: https://podcasts.apple.com/us/podcast/the-chalene-show-diet-fitness-life-balance/id911042029?i=1000711816713 How To Improve Overall Health With Sleep - Full Playlist Watch: https://youtube.com/playlist?list=PLb8hDoRky2_JkAEi7D0wPxws-PXoyfRRZ\u0026si=7R0NwPviouqafNRX \u0026#x1f3af;Try Sleep Breakthrough: visit https://chalene.com/sleep to get your special discount and free gifts with link when you use code CHALENE at checkout \u0026#x1f3af;Thank you to our show sponsor Blissy! Sleep better with Blissy and use CHALENE to get an additional 30% off at blissy.com/CHALENE We would love to hear from you! Leave your questions or messages for Chalene RIGHT HERE To advertise on our podcast, please reach out to thechaleneshow@gmail.com and mention The Chalene Show Sign Up For MY WEEKLY NEWSLETTER Connect with me on your fav social platform: Instagram: www.Instagram.com/ChaleneJohnson Facebook: www.Facebook.com/Chalene TikTok: @chaleneOfficial Twitter: www.Twitter.com/ChaleneJohnson",
      "release": "2025-06-13T10:00:00Z",
      "duration": "00:38:12.3750000",
      "explicit": false,
      "spotifyId": "4p2bOdPZgSxp8OeaE2ng3u",
      "appleId": 1000712731547,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4p2bOdPZgSxp8OeaE2ng3u",
        "apple": "https://podcasts.apple.com/podcast/did-i-just-join-a-cult-plus-11-surprise-sleep/id911042029?i=1000712731547"
      }
    }
  ]
}