{
  "id": "1562fef3-2310-42d1-bd07-c4dd404e9acc",
  "name": "The Fourcast",
  "spotifyId": "2EhZ0sS3ysxrx0NmJ6ESKz",
  "appleId": 1542796249,
  "youTubeChannelId": "UCTrQ7HXWRRxr7OsOtodr2_w",
  "youTubePlaylistId": "PLXjqQf1xYLQ6jvo0ErJ2a-UVlnDrAon8G",
  "episodes": [
    {
      "id": "cd29dd6f-1a53-4fbe-85f9-6b902d767cf3",
      "title": "Virginia Roberts Giuffre was ‘gaslit’ by UK government, Met police and Prince Andrew say her family",
      "description": "In 2011, Virginia Roberts Giuffre became known as the most outspoken victim of Jeffrey Epstein and Ghislaine Maxwell. Her campaigning against their abuse and trafficking helped to get justice for many women, but she was perhaps best known for a now-infamous photograph, taken when she was aged just 17, meeting with Prince Andrew. She claimed it was taken prior to one of three times she was forced to have sex with the King\u0027s brother. Encounters he vehemently denies took place but which have led to his public downfall, with Prince Andrew reportedly paying around £12 million to Roberts Giuffre, formally ending a civil case brought against him in the US without admitting liability. Earlier this year, Virginia took her own life. Before she died, she wrote a memoir, determined for the world to finally hear her story in her own words. In this episode of The Fourcast, Jackie Long speaks to Virginia’s brother and sister-in-law, Sky and Amanda Roberts, about the woman behind the headlines, the legacy she leaves, and the campaigning she wanted to be remembered for. They also express their frustration with the Metropolitan Police response - but the Met reiterated to Channel 4 News today that they do not consider themselves the appropriate authority to investigate alleged crimes in the UK related to the Jeffrey Epstein case.This episode includes conversation around suicide and abuse.",
      "release": "2025-10-21T05:33:02Z",
      "duration": "00:35:10.5280000",
      "explicit": false,
      "spotifyId": "0jF5rRzGBntCavwLy0DF83",
      "appleId": 1000732768122,
      "youTubeId": "raob3aTxEJI",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0jF5rRzGBntCavwLy0DF83",
        "apple": "https://podcasts.apple.com/podcast/virginia-roberts-giuffre-was-gaslit-by-uk-government/id1542796249?i=1000732768122",
        "youtube": "https://www.youtube.com/watch?v=raob3aTxEJI"
      }
    }
  ]
}