{
  "_ts": 0,
  "id": "545a1e3a-e1b8-40b0-8fa4-4b9f540fe1d6",
  "name": "The Life After Leaving Podcast: An Ex-Christadelphian Podcast",
  "spotifyId": "5Fd0eW3vMCt1w5MfqD0jgJ",
  "appleId": 1775771759,
  "episodes": [
    {
      "id": "240195f0-d6a0-4a85-9c88-af3be631fc7c",
      "title": "Ep. 15 Fellowship with Brian",
      "description": "Today we’re chatting with Brian! Brian is our first guest to come on the podcast from the Church of God of the Abrahamic Faith (COGAF). While they technically have a different name than Christadelphians, the groups were founded by former associates at about the same time. Members of COGAF hold the same beliefs as Christadelphians, fellowship with them, and even attend Christadelphian activities, camps, and bible schools! In today’s episode, we hear about Brian’s former ecclesia using pancakes to convince people to attend services, about that time he was brought to Jamaica for a school project to learn about the life of Christadelphian missionaries as a teenager, and about the “wave theory” of doubt and faith that eventually washed him ashore to solid ground without faith in God. We also chat about surprise ambushes by Christadelphians who create confrontations about faith and church attendance in the most unexpected times and places. Please join us for another episode of fellowship among those who have left the fold! If you have any questions that you would like addressed in the upcoming episode on religious trauma, please email ⁠lifeafterleavingpodcast@gmail.com⁠ Listener discretion advised. Resources and References: Church of God of the Abrahamic Faith (COGAF)/Church of the Blessed Hope: ⁠https://en.m.wikipedia.org/wiki/Church_of_the_Blessed_Hope⁠ Church of the Blessed Hope Beliefs: https://www.cotbh.org/Our-Belief/our-belief.html ⁠https://www.cotbh.org/Who-Are-We/who-are-we.html⁠ John Thomas: His Friends and His Faith by Peter Hemingray Page 132, 153-154, 189, pages 197-207 “Chapter 21: Dr. Thomas, Marsh, and Wilson- Founders of COGAF” Netflix: Keep Sweet: Pray and Obey Terror, Love, and Brainwashing: Attachment in Cults and Totalitarian Systems by Alexandra Stein ⁠https://www.amazon.com/Terror-Love-Brainwashing-Attachment-Totalitarian/dp/1138677973⁠",
      "release": "2025-01-26T13:00:00Z",
      "duration": "02:18:19.3330000",
      "explicit": true,
      "spotifyId": "5ioubBE294Sm5CSR5vIq8L",
      "appleId": 1000685502667,
      "subjects": [
        "Christadelphians",
        "FLDS Church",
        "Cult Psychology",
        "Cult-Expert",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ioubBE294Sm5CSR5vIq8L",
        "apple": "https://podcasts.apple.com/podcast/ep-15-fellowship-with-brian/id1775771759?i=1000685502667"
      }
    },
    {
      "id": "f05f5395-3cc0-4015-9c34-d544cbd0d510",
      "title": "Ep. 14 Fellowship with Zinnia",
      "description": "Today we’re flipping the script and Heather is chatting with Zinnia! Zinnia shares her story of growing up as an undiagnosed neurodivergent child and being bullied during her childhood inside and outside of the ecclesia. The first half of this episode is a bit heavy as Zinnia discusses how her environment contributed to severe depression and how growing up in a high control environment among other factors may have groomed her for domestic violence in her relationships. However, things took a turn for the better when Zinnia chose to leave the group, shut down their harassment, reported perpetrators to the police. She also reclaimed her life and her voice by changing her name, moving out on her own, creating a new environment where she could thrive in secular friendships and relationships, and connecting with other ex-Christadelphians in the Facebook community. She also shares her story of living in a haunted apartment, explains why she is skeptical of Christadelphians claiming that they’ll report the criminal activity of other Christadelphians, and about the circumstances that led her to create this podcast. This episode was also released alongside Episode 13 on Spiritualism due to some overlapping themes and topics. We hope you enjoy this podcast double feature! See you in 2025! Also, thank you to Heather for editing this episode! Resources: Vibe Music: If I die young Pt 2 by Kimberly Perry https://open.spotify.com/track/7LjN25ppKfSfjIPOJxbH7v?si=yHeXK6SBQZuXw-hRbuyfzw And The Wolves by Madeline Edwards https://open.spotify.com/wrapped/share/share-9077a96b07504179b35f468201191afb?si=sK7wgMTERAeOTj8EutWLmw\u0026track-id=2v71B92AHjGB0FgfIB4bch On Leaving Cults \u0026 High Control Groups: Take Back Your Life: Recovering from Cults and Abusive Relationships by Janja Lalich https://www.goodreads.com/book/show/234869.Take_Back_Your_Life Unfollow: A Memoir of Loving and Leaving the Westboro Baptist Church by Megan Phelps-Roper https://www.amazon.com/Unfollow-Memoir-Leaving-Westboro-Baptist/dp/0374275831 The Sound of Gravel: A Memoir by Ruth Wariner https://www.ruthwariner.com/the-sound-of-gravel/ Educated by Tara Westover https://www.goodreads.com/book/show/35133922-educated Pure: Inside the Evangelical Movement That Shamed a Generation of Women and How I Broke Free by Linda Kay Klein https://lindakayklein.com/pure/ Chocolat by Joanne Harris (Okay, this one is more of a role model for living outside religious influence, not bending to that pressure, and embracing the more magical side of life) https://www.goodreads.com/book/show/47401.Chocolat Quarter Life Crisis Netflix special, Taylor Tomlinson The Holy Bible: The Best Damned Version by Steve Ebling https://www.goodreads.com/book/show/21218494-holy-bible---best-god-damned-version---genesis Instagram: religious.harm.recovery https://www.instagram.com/religious.harm.recovery?igsh=ZTc1amo2OWFicXpv On Sexual Assault: Know My Name by Chanel Miller https://www.goodreads.com/book/show/50196744-know-my-name On Childhood Trauma \u0026 Relationships: Recovering from Emotionally Immature Parents by Lindsay Gibson (And Adult Children of Emotionally Immature Parents) https://www.goodreads.com/book/show/40890214-recovering-from-emotionally-immature-parents Running on Empty: Overcome your Childhood Emotional Neglect by Jonice Webb (Sequel: Running on Empty No More) https://drjonicewebb.com/the-book/ The Journey from Abandonment to Healing by Susan Anderson https://www.goodreads.com/book/show/77805.The_Journey_from_Abandonment_to_Healing Healing Your Aloneness: Finding Love and Wholeness Through Your Inner Child by Erika Chopich and Margaret Paul https://www.amazon.com/Healing-Your-Aloneness-Finding-Wholeness/dp/0062501496 Attached by Amir Levine and Rachel Heller https://www.goodreads.com/book/show/9547888-attached The Emotionally Absent Mother: A Guide to Self-Healing and Getting the Love You Missed by Jasmin Lee Cori https://www.goodreads.com/book/show/9268619-the-emotionally-absent-mother Mothers Who Can’t Love: A Healing Guide for Daughters by Susan Forward https://www.goodreads.com/book/show/17331330-mothers-who-can-t-love When the Body Says No by Gabor Mate https://drgabormate.com/book/when-the-body-says-no/ On Embracing Neurodivergence, Masking, and Susceptibility to Abuse: Hayley Honeyman Ted Talk “Unmasking ADHD” https://youtu.be/fRUkPHnltuI?si=foRFIm5fEK2NumuO On the impact of growing up undiagnosed Neurodivergent: https://medium.com/@nikkibutler_autisticjoyologist/the-negative-narrative-and-the-impact-on-being-autistic-adhd-61ce7d4c1d6b And https://medium.com/@nikkibutler_autisticjoyologist/bullying-and-autism-adhd-the-shocking-truth-dc9383d5d7b8 Feminism \u0026 Politics: Rage becomes her: The Power of Women\u0027s Anger by Soraya Chemaly https://www.goodreads.com/book/show/38532207-rage-becomes-her On Healing through Humor: https://www.scientificamerican.com/article/how-humor-can-help-you-get-through-hard-times/ On the Paranormal: Life with the Afterlife: 13 Truths I Learned About Ghosts by Amy Bruni https://www.amazon.com/Life-Afterlife-Truths-Learned-Ghosts/dp/1538754142 Do Dead People Watch You Shower? By Concetta Bertoldi https://www.goodreads.com/book/show/1245993.Do_Dead_People_Watch_You_Shower_ “Ecclesia Safe” Initiative: https://tidings.ecclesiasafe.org/resources-for-elders/ecclesiasafe-consultation-group-engagement/ https://tidings.ecclesiasafe.org/ https://tidings.org/articles/caring-for-the-vulnerable/",
      "release": "2024-12-22T19:39:51Z",
      "duration": "04:22:08.5090000",
      "explicit": true,
      "spotifyId": "2qHfO9cr6qqvhyWFCQr1FP",
      "appleId": 1000681330006,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qHfO9cr6qqvhyWFCQr1FP",
        "apple": "https://podcasts.apple.com/podcast/ep-14-fellowship-with-zinnia/id1775771759?i=1000681330006"
      }
    },
    {
      "id": "dd8b4489-d778-40b6-b7c5-b6a8a440ab56",
      "title": "Ep. 13 Hypnosis, Telepathy, and Ghosts: The History of Spiritualism and the Christadelphians",
      "description": "Today we’re chatting about ghosts! More specifically, about how the Christadelphians have historically tried to disprove the existence of ghosts and the beliefs of Spiritualists to their followers! It’s time for science class with John Thomas as he explains the (now considered pseudoscience) \u0022science\u0022 of odology, explains how Jesus Christ (electric medium) used hypnosis on his disciples, speculates on whether followers will be able to be invisible and teleport when they’re resurrected (sorry, you can only hold eyeballs), and how God’s Holy Spirit is actually… electricity. We discover the story of a Christadelphian with psychic abilities and end the episode with the most legendary ghost story to ever be told in Christadelphia! It’s going to get spoooooooky! This episode was also released alongside Episode 14, Fellowship with Zinnia, due to some overlapping themes and topics. We hope you enjoy this podcast double feature! See you in 2025! Resources and References “Other Powers: The Age of Suffrage, Spiritualism, and the Scandalous Victoria Woodhull” by Barbara Goldsmith, Page 78 Some background information on Spiritualism in the Britannica: ⁠https://www.britannica.com/topic/spiritualism-religion⁠ Dr. Thomas: His Life and His Work by Robert Roberts Popular Figures who were Spiritualists: ⁠https://www.history.com/news/spiritualism-communication-dead-figures⁠ The First Woman to Run for President in the US, Victoria Woodhull: ⁠https://www.nps.gov/articles/the-first-woman-to-run-for-president-victoria-woodhull.htm⁠ Talking to the Dead: Kate and Maggie Fox and the Rise of Spiritualism by Barbara Weisberg The Birmingham Amended Statement of Faith: ⁠https://christadelphianvideo.org/wp-content/uploads/2021/10/BASF.pdf⁠ The Oprah Winfrey Show Herald of the Kingdom and Age to Come, July 1852 ⁠https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald52.PDF⁠ 2023 Pew Research: ⁠https://www.pewresearch.org/religion/2023/12/07/spiritual-beliefs/⁠ 2024 Article: ⁠https://thehill.com/blogs/blog-briefing-room/4400922-americans-ghosts-aliens-devil-survey/⁠ Last Week Tonight: Psychics ⁠https://www.youtube.com/watch?v=WhMGcp9xIhY⁠ Harry Houdini: ⁠https://www.smithsonianmag.com/history/for-harry-houdini-seances-and-spiritualism-were-just-an-illusion-180978944/⁠ The Ambassador of the Coming Age: July 1868, Aug1868 and Sept 1868 The Herald of the Kingdom and Age to Come by John Thomas, July and August 1852 A Demon’s Guide to Wooing a Witch by Sarah Hawley Twilight by Stephenie Meyer The Princess Bride Movie, 1987 Prosopagnosia, medical condition Jim Jones Healings ⁠https://people.com/crime/jim-jones-jonestown-massacre-demagogue-biography-jeff-guinn/⁠ Rapidash Pokemon ⁠https://pokemondb.net/pokedex/rapidash⁠ The Bible: 1 Kings 19 2 Corinthians 12 Habakkuk 2:2-3 Joel 2:28 Job 33 Acts 10 Revelation 1 Matthew 22 1 Samuel 28 Odology: ⁠https://en.wikipedia.org/wiki/Odic_force⁠ Louis Cahagnet’s “Celestial Telegraph, or Secrets of the Life to Come revealed through Magnestism” Robert Roberts: A Study of Life And Character by Islip Collyer The Christadelphian: April 1869 February 1895 February 1888 May 1887 June 1876 January 1877 May 1955 November 1919 August 1913 November 1926 Spiritualists’ Association Bookstore: ⁠https://nsac.org/bookstore/⁠ The Girl with Silver Eyes by Willo Davis Roberts The Wizard of Oz (movie), 1939 Spiritualism by Michael Ashton Read Online at: ⁠https://thisisyourbible.com/library/show/175⁠ The Christadelphian, Nov1871 The Christadelphian, January 1872 Medium and Daybreak, Nov 24 1871 edition Full article provided from the University of Oxford Bodleian Library and from the Hamilton College. The Church of the Flying Spaghetti Monster Lily Dale: The True Story of the Town That Talks to the Dead by Christine Wicker Life with the Afterlife: 13 Truths I learned about Ghosts by Amy Bruni Other Resources: If you want to learn more about Spiritualism, check out the Dig Podcast: ⁠https://digpodcast.org/category/spiritualism/⁠",
      "release": "2024-12-22T13:00:00Z",
      "duration": "02:42:31.4160000",
      "explicit": true,
      "spotifyId": "7vRpnlnnhR0643HkClitoa",
      "appleId": 1000681301292,
      "subjects": [
        "Christadelphians",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vRpnlnnhR0643HkClitoa",
        "apple": "https://podcasts.apple.com/podcast/ep-13-hypnosis-telepathy-and-ghosts-the/id1775771759?i=1000681301292"
      }
    },
    {
      "id": "4079a894-b672-4bdf-a497-782ac116f11f",
      "title": "Ep. 12 Fellowship with Paul",
      "description": "Today we’re chatting with Paul! In this episode, Paul shares his story of joining the Christadelphians with his parents as a young convert, to stirring up trouble in the capital city as a young man handing out pamphlets on the Holy Spirit, to eventually not only leaving the Christadelphians, but eventually becoming an atheist studying theology! Paul also shares his controversial experience giving his one and only public lecture as a Christadelphian, his time as part of a group of Christadelphians nicknamed “the four horsemen of the apocalypse”, and about his thesis project on the roots of Christianity which he started after going back to school *again*. There’s no box big enough to fit Paul into as he’s explored careers, countries, and theology throughout his lifetime. I hope you enjoy this episode and hearing about the twists and turns of his fascinating life! Resources and References Harry Whittaker, Author List of Books here: https://bibliabooks.org.uk/harry-whittaker-books/ Carl Sagan; astronomer, scientist, author, and science educator: https://en.wikipedia.org/wiki/Carl_Sagan Richard Dawkins; biologist, author, prominent atheist: https://en.wikipedia.org/wiki/Richard_Dawkins Christopher Hitchens, Author https://en.wikipedia.org/wiki/Christopher_Hitchens Paul’s website, “Religion Free World”: https://religionfreeworld.org/ A link to Paul’s Book “On Christian Origins”: https://religionfreeworld.org/books/",
      "release": "2024-12-15T13:00:00Z",
      "duration": "01:28:33.3740000",
      "explicit": true,
      "spotifyId": "0iEBGR9mNGrwzSsDzaKBUg",
      "appleId": 1000680426306,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0iEBGR9mNGrwzSsDzaKBUg",
        "apple": "https://podcasts.apple.com/podcast/ep-12-fellowship-with-paul/id1775771759?i=1000680426306"
      }
    },
    {
      "id": "a1c54478-39d3-4727-9904-18d613f37620",
      "title": "Ep. 11 Fellowship with Luke",
      "description": "Today we’re chatting with Luke! Luke shares his experience growing up in a small, insular ecclesia disconnected from the wider community of Christadelphians and singing the same hymns every week. In this episode, we’ll hear about his process of trying to fit into the wider Christadelphian world after growing up in isolation, about his first experience attending an ecclesia that drank Christ’s blood from a shared cup (ew), and on the pressure to leave his new ecclesia and to end his relationship with a non-Christadelphian. We also speculate on his prospects of an American speaking tour, argue for Australia to have its own major winter holiday, and wonder if Christadelphian music will ever be a topic for a pub trivia night at last!? And remember… watch out because the “Christadelphian Police” can be anywhere! Please join us for yet another fun episode of fellowship among the heathens! Listener discretion is advised. Resources and References: Seven Brides for Seven Brothers (Movie)",
      "release": "2024-12-08T13:51:54Z",
      "duration": "01:56:59.7910000",
      "explicit": true,
      "spotifyId": "00MGyF4XNnGLidXIgit70q",
      "appleId": 1000679646049,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/00MGyF4XNnGLidXIgit70q",
        "apple": "https://podcasts.apple.com/podcast/ep-11-fellowship-with-luke/id1775771759?i=1000679646049"
      }
    },
    {
      "id": "7b221409-14d3-40f4-a5f3-c2facbbf0223",
      "title": "Ep. 10 The Bearded Wisdom of Christadelphians: Talking Masculinity and Facial Hair with Mako",
      "description": "Today we’re chatting with Mako in this “mini-episode” on beards and their cultural history within Christadelphia. Mako and Zinnia discuss the experiences shared by some ex-Christadelphians about beards and compare it to the historical views of Christadelphians during the time of Doctor John Thomas and Robert Roberts. We also joke about drag names, the British slang for penis, and moustaches on firemen! Please join us for a chat about this hairy topic! As a friendly reminder, please be advised that the humor in today’s episode is pretty “worldly” and this podcast is marked “explicit” across platforms. Listener discretion is advised. Resources and References: Monty Python’s The Meaning of Life: https://youtu.be/Xt53afFXbrg?t=74 Dictionary entry for “John Thomas”: https://en.wiktionary.org/wiki/John_Thomas The Bible, 2 Samuel 10 The Herald of the Kingdom and Age to Come by John Thomas, May 1856, Page 113 “The Gentile and the Jew” https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald56.PDF The Herald of the Kingdom and Age to Come by John Thomas, March 1852, Page 62 (782 if using link below) https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald%20Jan1851%20through%20Feb1854%20-%20Text.pdf Herald of the Kingdom and Age to Come by John Thomas December 1851 Page 280-281(Page 626 if using the link below) https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald%20Jan1851%20through%20Feb1854%20-%20Text.pdf The Herald of the Kingdom and Age to Come, May 1853, page 119 by John Thomas reprinting “Why Israelites were Forbidden to Shave” from the “Journal of Sacred Literature pp. 65, 66” https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald53.pdf My Days and My Ways by Robert Roberts, page 5, 67, 139 https://www.antipas.org/pdf_files/my_days_and_my_ways.pdf “Robert Roberts: A Study of the Life and Character” by Islip Collyer https://christadelphianlibrary.com/products/robertroberts-collyer Drag Name Inspo and the name “Lourdes Prayer” https://chelseacommunitynews.com/2021/01/12/the-150-best-new-drag-names-try-one-on/ On my comments on Leviticus: https://www.jpost.com/jerusalem-report/article-700876 https://www.nytimes.com/2007/04/03/world/africa/03iht-moses.4.5130043.html On some religions using beards as a statement: https://dralun.wordpress.com/2014/01/07/the-medical-case-for-beards-in-the-19th-century/ https://credomag.com/2016/07/they-will-know-we-are-calvinists-by-our-beards-timothy-raymond/ The Christadelphian July 1871 https://www.antipas.org/library/Magazines/The%20Christadelphian%20Magazine/The%20Christadelphian%20-%201871.pdf July edition starting page 199, quote on page 219 On the Victorians using hair from the dead for mementos: https://www.orderofthegooddeath.com/article/theyre-not-morbid-theyre-about-love-the-hair-relics-of-the-midwest/#:~:text=Hair%20was%20sometimes%20taken%20from,a%20year%20and%20a%20day . Misc Research into Beards: https://www.theenglishshavingcompany.com/en_gb/blog/beard-psychology-science/#:~:text=Beards%20also%20impact%20perceptions%20of,than%20the%20clean%2Dshaven%20men",
      "release": "2024-12-01T13:00:00Z",
      "duration": "00:44:06.8860000",
      "explicit": true,
      "spotifyId": "4xEBmQZ98qjwBD30gcUhvh",
      "appleId": 1000678782552,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xEBmQZ98qjwBD30gcUhvh",
        "apple": "https://podcasts.apple.com/podcast/ep-10-the-bearded-wisdom-of-christadelphians/id1775771759?i=1000678782552"
      }
    },
    {
      "id": "dce3fd5c-04c4-4fa4-930f-66a8dd914836",
      "title": "Ep. 9 Fellowship with Mike",
      "description": "Today we’re chatting with Mike! Mike shares his story of growing up in the Brotherhood with many surprises including sourcing bootleg copies of the Simpsons for the Christadelphian youth group, finding a wife at the Christadelphian nursing home, and about his path to eventually becoming “unequally yoked” before leaving the group. Mike also shares his experience of unintentionally framing the Editor of the Christadelphian magazine for vandalism (whoops) and answers whether or not he saw any unattached beard hair in the Christadelphian Magazine Archives. And of course, he asks the hard hitting questions such as ”...have you got a hat?”. Please join us for yet another fun episode of fellowship among the heathens! Resources and References: Praise the Lord Hymn Book: https://www.christadelphianbooks.com/detail/2059 Music can be listened to here: https://www.wcfoundation.org/praise-the-lord The Book of Mormon: On Broadway: https://bookofmormonbroadway.com/ Watch online at: https://archive.org/details/book.-of.-mormon.-broadway-upscale-720x-480",
      "release": "2024-11-24T15:49:48Z",
      "duration": "02:03:05.3740000",
      "explicit": true,
      "spotifyId": "6ZworPm7qc1Wk3HfNapshd",
      "appleId": 1000678072303,
      "subjects": [
        "Christadelphians",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ZworPm7qc1Wk3HfNapshd",
        "apple": "https://podcasts.apple.com/podcast/ep-9-fellowship-with-mike/id1775771759?i=1000678072303"
      }
    },
    {
      "id": "ce51113d-6440-473a-8651-fd22d61a57c4",
      "title": "Ep. 8 Robert Roberts and the Fandom of John Thomas",
      "description": "Today we’re learning about the unofficial president of the John Thomas fan club, Robert Roberts. In this episode, we’ll be taking a critical look at whether this famous Christadelphian leader was actually just a follower. I’ll be sharing with you “respectable heathens” stories about Robert Roberts’ childhood, his quirks, and the chance he missed to leave behind the drama of the Christadelphians forever. I hope you’re as surprised as I was to learn the bizarre ways that he honored John Thomas throughout his lifetime, and even in death. I’ll also share a Christadelphian exhortation drinking game, a request for the whereabouts of a lost object, and a story about a legendary exhortation at the Moorestown ecclesia. Please also stay tuned to the end for another “ad” from one of our “sponsors”. Resources and References: “My Days and My Ways” by Robert Roberts, 1894 https://www.antipas.org/pdf_files/my_days_and_my_ways.pdf “Robert Roberts: A Study of the Life and Character” by Islip Collyer https://christadelphianlibrary.com/products/robertroberts-collyer John Thomas His Friends and His Faith by Peter Hemingray, 2003 https://christadelphianlibrary.com/products/johnthomashisfriends-hisfaith-hemingray GIlmore Girls tv series, Season 6 episode 8 “Why did you drop out of Yale?” “Elpis Israel” by John Thomas https://christadelphia.net/PDF/jtEI.pdf *fourteenth edition https://ia803407.us.archive.org/7/items/elpisisraelexpos00thomiala/elpisisraelexpos00thomiala.pdf *ninth edition Goosebumps tv series, “Welcome to Dead House” Ex-Christadelphians.com, “Who was Robert Roberts?” https://www.ex-christadelphians.com/2021/02/who-was-robert-roberts.html “Escaping Twin Flames” Documentary, Netflix Jonestown, https://en.wikipedia.org/wiki/Jonestown The Christadelphian magazine,formerly The Ambassador of the Coming Age, accessed via https://thechristadelphianlibrary.com/category/digital-library/magazines/ (Subscription required) -November 1869, free version available to view at: https://www.antipas.org/library/Magazines/The%20Christadelphian%20Magazine/The%20Ambassador%20\u0026%20The%20Christadelphian%20-%201869.pdf -July 1871 edition, free version available to view at: https://www.antipas.org/library/Magazines/The%20Christadelphian%20Magazine/The%20Christadelphian%20-%201871.pdf July edition starting page 199, quotes can be found page 217 and 219 “The Early History of the Gospel of the Kingdom of God in Britain with Historical, Critical, and Social Reminiscences of Persons, Places, and Events” compiled by William Norrie, Vol III https://christadelphia.net/PDF/norrie3.pdf Ancestry.com, Roberts Family Tree https://www.ancestry.com/family-tree/tree/174807481?cfpid=272267503058\u0026dtid=100 Tidings article mentioning Roberts’ son Edward leaving the Christadelphians: https://tidings.org/articles/robert-roberts-in-north-america/ Coraline (book) by Neil Gaiman, 2002 Coraline Movie adaption 2009",
      "release": "2024-11-17T16:45:52Z",
      "duration": "02:08:00.0080000",
      "explicit": true,
      "spotifyId": "43fE28eQt2wegRXzAZJf4W",
      "appleId": 1000677235366,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/43fE28eQt2wegRXzAZJf4W",
        "apple": "https://podcasts.apple.com/podcast/ep-8-robert-roberts-and-the-fandom-of-john-thomas/id1775771759?i=1000677235366"
      }
    },
    {
      "id": "a835b49d-d371-46e8-9fe3-fbacea914702",
      "title": "Ep. 7 Fellowship with Leah",
      "description": "Today we’re chatting with Leah! Leah shares her story of pushing the boundaries of respectable behavior for a Christadelphian woman by saying prayers at the podium, giving exhortations, and pushing the community to support the fair-trade movement. Leah wasn’t about to let gender roles get her down and now she’s living her best life re-enacting Sister Act, voting in elections, and saying farewell to her good enemies in the ecclesia. Leah also shares her one rule that sets her new standard when visiting and evaluating a church. Please also enjoy a special guest appearance by Leah’s cats… meow… References \u0026 Resources: Chasing the Scream: The First and Last Days of the War on Drugs by Johann Hari I Don’t by Clementine Ford See What You Made Me Do: Power, Control, and Domestic Violence by Jess Hill Leah’s choir performance: https://www.facebook.com/share/v/18G6pRecip/ Ten Steps to Nanette by Hannah Gadsby",
      "release": "2024-11-10T13:10:02Z",
      "duration": "01:41:03.0220000",
      "explicit": true,
      "spotifyId": "3bLeVyRlF5vEvY88DoHu3X",
      "appleId": 1000676364506,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3bLeVyRlF5vEvY88DoHu3X",
        "apple": "https://podcasts.apple.com/podcast/ep-7-fellowship-with-leah/id1775771759?i=1000676364506"
      }
    },
    {
      "id": "b8306607-d3ed-497a-9e72-1238f2cd50ee",
      "title": "Ep. 6 Christadelphian True Crime",
      "description": "Today we\u0027re chatting with Keturah about true crime stories from the Christadelphians! History certainly isn\u0027t always boring with Zinnia sharing the history of five notorious Christadelphians from around the world. Just in time for spooky season, let\u0027s talk about body snatchers, poison, and even murder... References mentioned in this episode: Story One: John Thomas Story References: John Thomas: His Life and His Work by Robert Roberts John Thomas: His Friends and His Faith by Peter Hemingray, Page 90-92 John Thomas’s article in the Lancet on the Anatomy Bill in May 1829 (Full article received via email after contacting Elsevier) ⁠https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(02)98765-9/fulltext⁠ Articles on the Richards Riot: -YouTube video on Richard’s Riot \u0026 the identity of the young woman ⁠https://youtu.be/CecD1prIOZs⁠ -Patch.com ⁠https://patch.com/illinois/stcharles-il/bp--grave-robbing-riots-and-murder-the-story-of-a-st-19dfeab964⁠ -St Charles History Museum ⁠https://www.stcmuseum.org/history-news/2020/4/18/grave-robbing-gunfights-and-sances-the-story-of-the-richards-riot-of-1849⁠ -The Resurrectionists ⁠https://www.howderfamily.com/blog/resurrectionist/⁠ Story Two: Albert Chernov Kidney Stealing Story: ⁠https://www.haaretz.com/2003-11-26/ty-article/police-believe-organ-trafficking-suspect-has-fled-israel/0000017f-dbf1-df62-a9ff-dff784dd0000⁠ The report on “Jerry” is not publicly available and was sourced from a member of the Ex-Christadelphian Facebook Group. The full section of the report that was referenced is quoted here: “Albert Chernov, baptized by [“Jerry” real name redacted], was financially supported by BBFU (CCM) as a recruiter for the Brotherhood. Chernov was arrested in Jul 2003 on suspicion of rounding up Russian immigrants in Israel and compelling them, with threats and extortion, into undergoing nephrectomies (removal of a kidney). The charges detailed that the organs were sold, by Chernov and his two accomplices, on the black market. [Source: Haaretz.] He was released on bail in Nov 2003 and fled the authorities. [Source: Washington Post.]” United Nations definition of organ trafficking: ⁠https://www.unodc.org/unodc/frontpage/2024/June/explainer_-understanding-human-trafficking-for-organ-removal.html⁠ Story Three: Judith Ann Venn Murder: Article 1: ⁠https://www.theguardian.com/australia-news/2023/jul/28/queensland-woman-who-laced-husbands-soup-with-pills-pleads-guilty-to-manslaughter⁠ Article 2: ⁠ https://www.abc.net.au/news/2023-08-04/judith-ann-venn-jailed-for-killing-abusive-husband-spiked-soup/102689162 -Chicago, the musical. Song: Cell Block Tango Story Four: “Uncle Murder”/ Roger Hammond: Phoenix New Times: “Mr. Fix-it is Guilty” March 1 1989 ⁠https://www.phoenixnewtimes.com/news/mr-fix-it-is-guilty-6412893⁠ Man convicted in Arkansas in Louisville woman\u0027s death Associated Press ⁠https://www.newspapers.com/newspage/109894222/⁠ Obituary ⁠https://vermontjournal.com/obituaries/roger-hammond-1945-2022/⁠ Story Five: Gary Schaefer Murders: Book: In The Shadow of Death: The Hunt for a Serial Killer by Philip Ginsburg ⁠https://www.newspapers.com/article/the-burlington-free-press-schaefer-plea/41890009/⁠ Podcast: Haunted New England, Episode 10 Podcast: Thrice Cursed: A True Crime and Paranormal Podcast: Heavens\u0027ta Betsy aka Gary Lee Schaefer ⁠https://www.reformer.com/local-news/vermont-convicted-murderer-kidnapper-dies-in-kentucky-prison/article_ec3d2b9c-8dfe-11ee-a2f9-77f7c5811a85.html⁠ ⁠https://en.wikipedia.org/wiki/Gary_Schaefer⁠ ⁠https://www.newspapers.com/article/rutland-daily-herald-schaefer-arrested/41893267/⁠ ⁠https://murderpedia.org/male.S/s/schaefer-gary-lee.htm⁠ Book Mentioned by Keturah: To Believe In Women: What Lesbians Have Done For America - A History by Lillian Faderman https://www.amazon.com/Believe-Women-Lesbians-America-History/dp/0618056971",
      "release": "2024-10-27T12:14:27Z",
      "duration": "02:06:07.7840000",
      "explicit": true,
      "spotifyId": "1W03tdhI0vbBuLl733fjWI",
      "appleId": 1000674605820,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1W03tdhI0vbBuLl733fjWI",
        "apple": "https://podcasts.apple.com/podcast/ep-6-christadelphian-true-crime/id1775771759?i=1000674605820"
      }
    },
    {
      "id": "849fe40a-a810-406a-bb68-f64e5a80df6d",
      "title": "Ep 1. Fellowship with Heather",
      "description": "Today we\u0027re chatting with Heather! Let\u0027s cozy up by a babbling stream with our favorite transcendental books for this one! You can visit Heather\u0027s blog at: https://callunararis.com/category/religion-spirituality/",
      "release": "2024-10-24T12:50:44Z",
      "duration": "01:57:44.3510000",
      "explicit": true,
      "spotifyId": "46GgOLT7AEU3xRSnNmuJc1",
      "appleId": 1000674294350,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/46GgOLT7AEU3xRSnNmuJc1",
        "apple": "https://podcasts.apple.com/podcast/ep-1-fellowship-with-heather/id1775771759?i=1000674294350"
      }
    },
    {
      "id": "6cb37ea6-545e-437e-910a-36c826200e28",
      "title": "Ep. 5 Harbingers of Destruction! Talking with Amy about Women in Christadelphia",
      "description": "Today we\u0027re chatting with Amy! She has a master\u0027s degree in Religious Studies, and wrote her thesis using the Christadelphians as a test case for theories of conservative women. There\u0027s no need to don a skirt or headcovering this Sunday morning! Join us as we delve into the reason why nothing ever changes in Christadelphia; talk about the limited roles for women in the ecclesia; reminisce on the dramas of headcoverings and pants-wearing (that\u0027s trousers for the Brits); and much, much more. Resources: Amy’s thesis is not publicly available, but if you\u0027re interested, email lifeafterleavingpodcast@gmail.com to request a digital copy Christadelphian Moms Survey Results, May 2024 https://tidings.org/articles/the-moms-survey/ Tidings magazine, May 2024 Issue https://tidings.org/wp-content/uploads/2024/04/2024-05-May.pdf Tidings magazine, article on race from August 2020 https://tidings.org/articles/an-exploration-of-christadelphians-racism-and-activism/ The Ecclesial Guide by Robert Roberts https://gs-cd.com/wp-content/uploads/2012/08/the-ecclesial-guide.pdf Esme Louie Tradwife Video: https://www.instagram.com/reel/C8JOQkfvLGr/?igsh=MTZyZnFrcG9oenFnaw== Books referenced: The Psychology of Religious Doubt by Philip Helfaer Educated by Tara Westover The Holy Bible by Vanessa Russell (an ex-christadelphian!) Leaving the Fold by Marlene Winell",
      "release": "2024-10-24T00:22:35Z",
      "duration": "02:16:03.6310000",
      "explicit": true,
      "spotifyId": "7JLX5DeZUUZ2tb1cFqFQ34",
      "appleId": 1000674225886,
      "subjects": [
        "Christadelphians",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7JLX5DeZUUZ2tb1cFqFQ34",
        "apple": "https://podcasts.apple.com/podcast/ep-5-harbingers-of-destruction-talking-with-amy/id1775771759?i=1000674225886"
      }
    },
    {
      "id": "a6ab7cfb-8e89-4a1c-8ceb-6ed09ea4aad0",
      "title": "Ep. 4 Fellowship with Rob",
      "description": "Today we’re chatting with Rob! Rob had reached the pinnacle of success as an international Christadelphian lecturer and prominent leader in his ecclesia before his journey to explore the root of his faith took him on an unexpected “reverse road to Damascus” and to leaving religion for good. This episode is the perfect accompaniment to a leisurely Sunday morning spent sleeping in, enjoying a fresh cup of coffee, and savoring not having to rush to the Sunday morning meeting anymore. Pull on your most colorful underwear for this episode and enjoy! Resources: Unbelievable: A journey from faith via evidence. Why a university professor gave up religion and became an unbeliever by Rob Hyndman Available for free at: https://robjhyndman.com/unbelievable/ Or print copies are available at: https://www.amazon.com/Unbelievable-Rob-J-Hyndman/dp/1517363195 The bibliography from his book: https://robjhyndman.com/unbelievable/bibliography.html The Tidings article on being seekers of truth: https://tidings.org/articles/seeking-truth/ Book: Good without God by Greg Epstein https://www.amazon.com/Good-Without-God-Billion-Nonreligious/dp/006167012X Book: The Righteous Mind: Why Good People are Divided by Politics and Religion By Jonathan Haidt https://www.amazon.com/Righteous-Mind-Divided-Politics-Religion/dp/0307455777",
      "release": "2024-10-24T00:18:24Z",
      "duration": "01:34:02.0640000",
      "explicit": true,
      "spotifyId": "2QMWFIlgoOzOStV24ooWxC",
      "appleId": 1000674225861,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2QMWFIlgoOzOStV24ooWxC",
        "apple": "https://podcasts.apple.com/podcast/ep-4-fellowship-with-rob/id1775771759?i=1000674225861"
      }
    },
    {
      "id": "e3a9e3c6-602c-44d7-8f69-f7b56fe21127",
      "title": "Ep. 3 Fellowship with Keturah",
      "description": "Today we\u0027re chatting with Keturah! There are some heavy topics in today\u0027s episode but this was still so much fun! We wonder, why do Christadelphians love one room schoolhouses so much? What is the proper gender neutral term for a baptized Christadelphian? Why did tights have such a chokehold on Christadelphian women for so long? The world may never know but we can laugh about it anyway! Resources: The youtuber that Keturah mentions in this episode is linked below: https://www.youtube.com/@jezebelvibes",
      "release": "2024-10-24T00:14:58Z",
      "duration": "01:22:44.2940000",
      "explicit": true,
      "spotifyId": "3mMKn0il1eCAmpDhQIMIii",
      "appleId": 1000674225920,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mMKn0il1eCAmpDhQIMIii",
        "apple": "https://podcasts.apple.com/podcast/ep-3-fellowship-with-keturah/id1775771759?i=1000674225920"
      }
    },
    {
      "id": "450d7660-8d08-43c3-87e6-82cbb4251c89",
      "title": "Ep. 2 John Thomas: The Man, the Myth, the Founder of the Christadelphians",
      "description": "Today we\u0027re diving into the origin of the Christadelphians and taking a look at their founder/rediscover-er Doctor John Thomas! Let\u0027s count how many times he got baptized and see what lengths he went to in order to get away from the priest-ridden society of England. This story is probably a little different than the Christadelphian origin story you thought you knew... Works Cited: Appletons\u0027 Cyclopedia of American Biography, 1600-1889- Dr. Thomas entry on page 84 Dr. Thomas: His Life \u0026 Work By Robert Roberts 1873 https://www.thedailybeast.com/how-joseph-dispenza-seduced-america-with-pseudoscience/ John Thomas and his Rediscovery of Bible Truth by Norman Fadelle, 2004 https://www.christadelphianbooks.com/detail/1488 https://christadelphia.net/history.htm John Thomas His Friends and His Faith by Peter Hemingray, 2003 Ancestry.com, John Thomas in the England \u0026 Wales, Non-Conformist and Non-Parochial Registers, 1567-1936, Page 46 https://www.ancestry.com/discoveryui-content/view/143843:2972?tid=\u0026pid=\u0026queryid=9a44aaa7-e1d6-4b10-b0a1-bf26672955d8\u0026_phsrc=oGi9\u0026_phstart=success Alexander Campbell Shipwreck and Journey to Glasgow, Scotland Memoirs of Alexander Campbell, by Robert Richardson, Volume 1, Chapters 7 \u0026 8, pages 104-128. https://www.therestorationmovement.com/_international/scotland/glasgow.htm History of the Restoration Movement Christadelphian Standards by H.P. Mansfield in 1961 Page 104 “Brother Mansfield’s remarks here were primarily with regard to the Pioneer works, although we acknowledge that there are other very good works available which have been written by other brethren. However, we would sound a note of caution. During the years since Brother Mansfield penned the above words, many works have been offered to us by an ever-increasing number of writers. Experience has shown us that many of these works are of doubtful value; others, paraded as Christadelphian literature, will prove quite dangerous to the unwary. Exercise care in this regard.” “My Days and My Ways” by Robert Roberts, 1894 Eureka volume III The preface of Eureka Vol III",
      "release": "2024-10-24T00:13:04Z",
      "duration": "01:20:57.0250000",
      "explicit": true,
      "spotifyId": "2F9za1sNRGHNnXir05IMQJ",
      "appleId": 1000674225919,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2F9za1sNRGHNnXir05IMQJ",
        "apple": "https://podcasts.apple.com/podcast/ep-2-john-thomas-the-man-the-myth/id1775771759?i=1000674225919"
      }
    },
    {
      "id": "b9eb0fc2-af9d-4df1-901b-1652b50695c2",
      "title": "Welcome, Start Here!",
      "description": "Welcome to the Life After Leaving Podcast! Check out this episode to learn about who we are, what we plan to do, and get some background on who the Christadelphians are before listening to our full episodes.",
      "release": "2024-09-22T20:39:26Z",
      "duration": "00:15:59.3640000",
      "explicit": false,
      "spotifyId": "0KnWKRHgUhMcZqSaav4Sgv",
      "appleId": 1000674202305,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0KnWKRHgUhMcZqSaav4Sgv",
        "apple": "https://podcasts.apple.com/podcast/welcome-start-here/id1775771759?i=1000674202305"
      }
    }
  ]
}