{
  "id": "6b0dcece-86fc-4bfd-ad3c-c2290aa1a1b8",
  "name": "The Black Docket",
  "spotifyId": "00RSMnOHYbxXJZKxu5Fwum",
  "appleId": 1788795642,
  "youTubeChannelId": "UCTdWnaGIj37kxqf9yePrlcw",
  "episodes": [
    {
      "id": "a80d5596-b092-43fd-8b78-5116ca687403",
      "title": " Prophet, Paperwork \u0026 Prison: The Many Cults of Dwight York ",
      "description": "A Black Docket deep dive into Malachi Z. York, from Brooklyn storefront sermons to the 476-acre Tama-Re compound in Eatonton, Georgia. We trace the reinventions (Imam Isa → Dr. York → Malachi Z. York), the shifting banners (Ansaaru Allah Community, Holy Tabernacle Ministries, United Nuwaubian Nation of Moors), the migration south with roughly 300 followers, and the investigation that ended in a 135-year federal sentence. Along the way we unpack the Sudan/Ansar claims, the Passion Productions music push, the sovereign-citizen pivot, RICO and Mann Act charges, and what happened to the land—and the people—after the fall. This is a case study in myth-making, paperwork, and power: how a persona can move money, bodies, and belief… until the facts close in. Content warning: discussion of child sexual abuse, coercion, and manipulation. ✨✨Blacklight Spotlight ✨✨ Katherine White Improve Instructor IG, TikTok \u0026 YouTube @kwhitewrites \u0026#x1f54a;️\u0026#x1f54a;️The Lost Docket\u0026#x1f54a;️\u0026#x1f54a;️ Erlinda Thompson Age: 31 Height: 5’3 Weight: 145lbs Eyes: Brown Hair: Black If you see her or know anything please contact the Toledo Police Department 419-255-1111 Listen to The Black Docket Podcast \u0026#x1f3a7; Spotify: The Black Docket on Spotify \u0026#x1f34e; Apple Podcasts: The Black Docket on Apple Podcast \u0026#x1f49b; iHeartRadio Podcasts: The Black Docket on iHeartRadio Podcast \u0026#x1f399;️ Amazon Music: The Black Docket on Amazon Join the Investigation \u0026#x1f514; Hit the bell to never miss an episode. \u0026#x1f4ac; Comment your theories—we read every one. \u0026#x1f575;️‍♀️ Follow me on social media for behind-the-scenes updates, case breakdowns, and my occasional rants about why the justice system needs a makeover: \u0026#x1f4f8; Instagram: The_black_docket \u0026#x1f3a5; TikTok: TheBlackDocketPodcast \u0026#x1f426; Twitter: TheBlackDocket",
      "release": "2025-10-02T05:16:25Z",
      "duration": "01:47:26.2310000",
      "explicit": true,
      "spotifyId": "5jK1LmuNiKW6z9RLgC2cl0",
      "appleId": 1000729649993,
      "subjects": [
        "Nuwaubian Nation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jK1LmuNiKW6z9RLgC2cl0",
        "apple": "https://podcasts.apple.com/podcast/prophet-paperwork-prison-the-many-cults-of-dwight-york/id1788795642?i=1000729649993"
      }
    },
    {
      "id": "7cc961f2-d031-4092-8ae0-fc1e3a46c112",
      "title": "Live from the Cult: The Story of Carbon Nation \u0026 Nature Boy",
      "description": "What happens when a spiritual movement becomes a tool for domination? This week on The Black Docket, we pull back the curtain on Carbon Nation a self-styled “conscious community” that spiraled into accusations of abuse, manipulation, and cult control under the leadership of Eligio Bishop, better known online as Nature Boy From his troubled beginnings in Harlem to his digital rise as a messiah-like figure, Bishop captivated hundreds with promises of enlightenment, natural living, and divine order. But behind the hashtags and tropical backdrops was a darker truth: allegations of sexual coercion, psychological abuse, isolation, and mind control all of which would eventually lead to criminal charges and a courtroom reckoning. In this episode, we trace the journey from so-called spiritual awakening to legal fallout, featuring survivor accounts, courtroom drama, and the digital breadcrumbs that unraveled Bishop’s cult-like following. This isn’t just a story about Carbon Nation. It’s about the collision of vulnerability, influence, and unchecked power in the social media age. \u0026#x1f3a7; If you’ve ever asked how someone ends up in a cult—or how a livestreamed ideology turns into a criminal case—this is the episode you can’t miss. \u0026#x1f54a;️\u0026#x1f54a;️The Forgotten Docket\u0026#x1f54a;️\u0026#x1f54a;️ Thaina Noresca Age: 27 Height: 5’8 Weight: 140 lbs. Eyes: Brown Hair: Black If you see her or know anything please contact the Lawrenceville Police Department at (770) 963- 2443 Listen to The Black Docket Podcast \u0026#x1f3a7; Spotify: The Black Docket on Spotify \u0026#x1f34e; Apple Podcasts: The Black Docket on Apple Podcast \u0026#x1f49b; iHeartRadio Podcasts: The Black Docket on iHeartRadio Podcast \u0026#x1f399;️ Amazon Music: The Black Docket on Amazon Join the Investigation \u0026#x1f514; Hit the bell to never miss an episode. \u0026#x1f4ac; Comment your theories—we read every one. \u0026#x1f575;️‍♀️ Follow me on social media for behind-the-scenes updates, case breakdowns, and my occasional rants about why the justice system needs a makeover: \u0026#x1f4f8; Instagram: The_black_docket \u0026#x1f3a5; TikTok: TheBlackDocketPodcast \u0026#x1f426; Twitter: TheBlackDocket",
      "release": "2025-06-23T23:04:31Z",
      "duration": "02:59:53.2610000",
      "explicit": true,
      "spotifyId": "4czDnhcWqlnOydlZO4GGub",
      "appleId": 1000714259733,
      "youTubeId": "B18DZvxHARk",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4czDnhcWqlnOydlZO4GGub",
        "apple": "https://podcasts.apple.com/podcast/live-from-the-cult-the-story-of-carbon-nation-nature-boy/id1788795642?i=1000714259733",
        "youtube": "https://www.youtube.com/watch?v=B18DZvxHARk"
      }
    }
  ]
}