{
  "_ts": 0,
  "id": "800aadef-939e-4282-9b83-ac05c4c2b465",
  "name": "The Dating Detectives",
  "spotifyId": "5EFfjKxcZ7AskDVCUcrt7a",
  "appleId": 1684156849,
  "episodes": [
    {
      "id": "320e73e4-9672-437c-9dda-4fd318bdede5",
      "title": "The Twin Flame Fight School",
      "description": "Lindsey and her husband were everyone\u0027s favorite couple, until the values of a cult like group seeped into their lives and turned him into a dogfish. Click here to join our Patreon! For only $5 a month you will get 2 extra episodes a month, monthly virtual live events, and access to our community page! If you\u0027ve been dogfished and want to share your story on the show, email investigate@thedatingdetectivespodcast.com or contact us through our website using this link This episode of The Dating Detectives is sponsored by BetterHelp. Visit betterhelp.com/tdd today to get 10% off your first month. This episode of The Dating Detectives is sponsored by Quince. For free shipping on your order visit quince.com/TDD This episode of The Dating Detectives is sponsored by Dipsea. For listeners of the show, Dipsea is offering an extended 30 day free trial when you go to DipseaStories.com/ TDD Stop putting off those doctors appointments and go to Zocdoc.com/tdd find and instantly book a top-rated doctor today. ***The following Program contains names, places and events that have been anonymized or fictionalized for the purposes of protection and safety. The following Program is provided for entertainment purposes only and any commentary from the hosts are strictly conjecture and should not be held as making any definitive statements about the truth or identity of any particular individuals or circumstances. If you or a loved one are involved in an abusive relationship, please call the National Domestic Violence Hotline at 1-800-799-7233 for support",
      "release": "2024-10-07T09:00:00Z",
      "duration": "01:41:14.2800000",
      "explicit": true,
      "spotifyId": "0CHIpRNzOoTYDQLvCdXYtq",
      "appleId": 1000672033118,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CHIpRNzOoTYDQLvCdXYtq",
        "apple": "https://podcasts.apple.com/podcast/the-twin-flame-fight-school/id1684156849?i=1000672033118"
      }
    }
  ]
}