{
  "id": "1afb49b9-7afc-4c23-aa72-b61432129586",
  "name": "The Bookshop Podcast",
  "spotifyId": "2jXCQbkHhZXVCbi2h2HMmA",
  "appleId": 1538220707,
  "episodes": [
    {
      "id": "b1f73e02-6093-4085-88fe-40bf01e13dd4",
      "title": "From Cult to Community: Dr. Kate Gale\u0027s Journey in Nonprofit Publishing and Advocacy",
      "description": "Send us a Text Message. In this episode, I chat with the accomplished author, editor, educator, speaker, and prominent figure in contemporary American literature, Dr. Kate Gale, Dr. Gale is the Publisher, Co-founder, and Managing Editor of Red Hen Press, one of the largest independent literary publishers in the United States. Under her stewardship, Red Hen Press has earned a reputation for championing diverse voices and publishing high-quality literature that challenges and inspires readers worldwide. As an author, Kate has penned numerous acclaimed works, including poetry collections such as The Loneliest Girl and The Goldilocks Zone, which showcase her distinctive voice and keen observation of life\u0027s intricacies. Her debut novel, Under a Neon Sun, interrogates the epidemic of unhoused community college students in California, with her insights on this subject gaining momentum through additional writing in the Los Angeles Times. Her work delves into complex themes with a narrative style that captivates and engages readers across genres. Additionally, Dr. Gale is a passionate advocate for arts education and has been involved in numerous initiatives aimed at promoting literacy and creative expression among aspiring writers and students. With a deep-rooted commitment to fostering a vibrant literary culture, Dr. Kate Gale continues to make a lasting impact through her work with Red Hen Press, as well as her writing, editing, and advocacy efforts. Her career embodies a blend of intellectual rigor, emotional depth, and a profound belief in the power of literature to illuminate and transform lives. Red Hen Press Kate Gale Under a Neon Sun, Kate Gale All Fours, Miranda July James, Percival Everett Los Angeles Times Opinion: I was homeless in college. California can do more for students who sleep in their cars, Kate Gale Support the Show. The Bookshop Podcast Mandy Jackson-Beverly Social Media Links",
      "release": "2024-08-26T12:00:00Z",
      "duration": "00:37:59.8360000",
      "explicit": false,
      "spotifyId": "04guS9oKojEfrG9WbtyfzS",
      "appleId": 1000666647270,
      "urls": {
        "spotify": "https://open.spotify.com/episode/04guS9oKojEfrG9WbtyfzS",
        "apple": "https://podcasts.apple.com/podcast/from-cult-to-community-dr-kate-gales-journey-in-nonprofit/id1538220707?i=1000666647270"
      }
    }
  ]
}