{
  "_ts": 0,
  "id": "660e1e29-2847-4fec-b240-5896e527ea3c",
  "name": "The Flo Show, no filter",
  "spotifyId": "1i2SwF7ZykPG57kiQiLHP0",
  "appleId": 1777113518,
  "episodes": [
    {
      "id": "250c49cb-8fab-4b82-b14e-7881978a966a",
      "title": "Hollywood\u0027s Dark Underbelly Exposed: Misha\u0027s Chilling Story and Diddy\u0027s High-Stakes Legal Battle...Will Diddy Get Bail Monday???",
      "description": "Send us a text Brace yourself for an eye-opening exploration into the dark secrets of Hollywood as we reveal the harrowing experiences of Misha, a courageous survivor who lifts the veil on the sinister underbelly of the entertainment industry. Misha\u0027s shocking revelations about the abuse and manipulation she endured at the hands of powerful figures, including Mohawk Diddy, bring to light the systemic failures that allowed such horrors to persist. Her story is a chilling testament to the courage it takes to confront such evils and demand accountability from those who wield power in the shadows. This episode is a call to action, challenging us to acknowledge and address the dark side of fame and fortune. As we navigate the high-stakes courtroom drama surrounding Sean \u0022Diddy\u0022 Combs, we dive into the legal intricacies of his bail hearing, where he faces serious charges like sex trafficking and racketeering. With tension mounting, we scrutinize the proposals from Diddy\u0027s legal team for a stringent bail package amidst widespread skepticism about the ability of his private security to enforce the restrictions. The lenient stance of the judge raises eyebrows and concerns about the potential risks involved if bail is granted. Join us for an intense and compelling discussion on the fight for justice, the courage of survivors like Misha, and the broader implications for the entertainment industry. Support the show follow me on all social media platforms @flodaddyflo please subscribe to support my channel!",
      "release": "2024-11-23T13:00:00Z",
      "duration": "00:33:52.6920000",
      "explicit": true,
      "spotifyId": "5EwnVkqSKngokurYC65jMg",
      "appleId": 1000678007617,
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5EwnVkqSKngokurYC65jMg",
        "apple": "https://podcasts.apple.com/podcast/hollywoods-dark-underbelly-exposed-mishas-chilling/id1777113518?i=1000678007617"
      }
    }
  ]
}