{
  "_ts": 0,
  "id": "5170f0cb-4871-4703-b751-aca5472a9018",
  "name": "The Private Record",
  "spotifyId": "64vTrkBLqTCGY10SwAjkkO",
  "appleId": 1726136077,
  "youTubeChannelId": "UC-BoXTT0jVpt6Dew_T7Mcgw",
  "episodes": [
    {
      "id": "28c7ec72-de3c-4261-9a3a-8a76190ffa2b",
      "title": "\u0022LEAKED CULT FOOTAGE\u0022 - CLIP",
      "description": "Excerpt from Episode 006 of \u0027The Private Record\u0027 - \u0022When You Are Born Into An Unhinged Modern-Day Cult— and Then You Escape\u0022\n\nWelcome to \u0027The Private Record\u0027, where ordinary people tell their most extraordinary stories.\n\nNew episodes every Wednesday!\n\nIf you liked this episode, please hit that \u0027like\u0027 button and subscribe to this channel AND Matt\u0027s personal channel,  @mattdelia  for ALL NEW episodes, clips, announcements and more!\n\nAnd if YOU have a crazy story of your own and want to be on the show, go to theprivaterecord.com to submit yourself as a potential guest! We look forward to hearing from you!\n\nFollow us  @ThePrivateRecord  on all socials! And find Matt on IG  @mattdelia  for additional content related to the show and more!\n\n\n\nSubmit your story at https://www.theprivaterecord.com\nSend us an email @ theprivaterecord@gmail.com\nFollow for more on socials @theprivaterecord\ntiktok - https://www.tiktok.com/theprivaterecord\ninstagram - https://www.instagram.com/theprivaterecord",
      "release": "2024-02-28T17:15:00Z",
      "duration": "00:08:10",
      "explicit": false,
      "youTubeId": "2hsTlXxN_Lw",
      "subjects": [
        "Gospel Outreach"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2hsTlXxN_Lw"
      }
    },
    {
      "id": "52160d51-527f-4b37-b0cc-060c780c160b",
      "title": "When You Are Born Into An Unhinged Modern-Day Cult-- and Then You Escape",
      "description": "\u0027The Private Record\u0027 - Episode 006 - \u0022When You Are Born Into An Unhinged Modern-Day Cult— and Then You Escape\u0022 Well. This is a wild one! Our guest (a kind, extremely tatted-up gentleman named Ben) was born and raised into a very strange, very scary, very secretive, and VERY little-known Christian sect called Gospel Outreach. By the time Ben turned 18, he knew he had to get out— so that’s exactly what he did. But it wasn’t easy! In fact, it was probably the hardest part of all. And now, for the first time ever, Ben tells Matt everything — the whole story — and it is ABSOLUTELY INSANE. Matt, for his part, is blown away, not just by Gospel Outreach’s wicked (and plain old weird!) ways, but also by Ben’s rare ability to tell his story with such clear-eyed perspective, and in incredible detail. Call us crazy but something tells us the powers that be over at Gospel Outreach won’t be very happy with Ben for airing out their business like this! So let us know in the comments if you would like to see Ben in a follow-up episode, to discuss the fallout that is sure to come— as well as any other dark and dirty details he may have left out the first time around! Welcome to \u0027The Private Record\u0027, where ordinary people tell their most extraordinary stories. New episodes every Wednesday! If you liked this episode, please hit that \u0027like\u0027 button and subscribe for all new episodes, clips, announcements and more! And if YOU have a crazy story of your own and want to be on the show, go to theprivaterecord.com to submit yourself as a potential guest! We look forward to hearing from you! Follow us @ThePrivateRecord on all socials! And find Matt on IG @mattdelia for additional content related to the show and more! Submit your story at https://www.theprivaterecord.com Send us an email @ theprivaterecord@gmail.com Follow for more on socials @theprivaterecord tiktok - https://www.tiktok.com/theprivaterecord instagram - https://www.instagram.com/theprivaterecord",
      "release": "2024-02-28T08:01:00Z",
      "duration": "01:22:57.4080000",
      "explicit": true,
      "spotifyId": "3DCufB8n7acKmPYwqmKftN",
      "appleId": 1000647359501,
      "youTubeId": "bVoZuOvvNaM",
      "subjects": [
        "Gospel Outreach"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3DCufB8n7acKmPYwqmKftN",
        "apple": "https://podcasts.apple.com/podcast/when-you-are-born-into-an-unhinged-modern-day-cult/id1726136077?i=1000647359501",
        "youtube": "https://www.youtube.com/watch?v=bVoZuOvvNaM"
      }
    }
  ]
}