{
  "id": "9497683f-3786-44a7-ab7f-ea996e00f171",
  "name": "The William Montgomery Show",
  "spotifyId": "6SJj2pPh4QJaP2u7U1UumP",
  "appleId": 1596006008,
  "youTubeChannelId": "UCQJ2SBnAMI8SSm5qpLXBRiw",
  "episodes": [
    {
      "id": "65c07456-975f-4a5b-b8d0-dcdd0d6a0b82",
      "title": "Ezra Miller Started a Cult!? | The William Montgomery Show with Casey Rocket Ep. 180",
      "description": "William and Casey are back for more stiff riffs! It’s The William Montgomery Show with Casey Rocket! \u0026#x1f3af; Join our Patreon and become a Mercenary, Child Soldier, or Bounty Hunter. YOU choose your path, but watch out for the mole! No one escapes the mole! Plus find out when you can watch LIVE/thewilliammontgomeryshow ★ Watch new episodes of The William Montgomery Show with Casey Rocket on YouTube every Wednesday at 8:30 PM Central William Montgomery\u0026#x1f4f7; Instagram: /william.f.montgomery1\u0026#x1f943; Cameo: ⁠⁠⁠⁠https://www.cameo.com/williammontgomery⁠⁠⁠⁠ \u0026#x1f455; Merch: ⁠⁠⁠⁠⁠⁠⁠ https://william-montgomery-town.creator-spring.com/\u0026#x1f4e7; Email: ⁠⁠⁠⁠TheWilliamMontgomeryShow@gmail.com⁠⁠⁠⁠ ☎️ Voicemail: 1 (737) 471-1098 Casey Rocket\u0026#x1f4f7; Instagram: /caseyrocket\u0026#x1f578;️ Website: ⁠⁠⁠⁠http://www.CaseyRocketComedy.com⁠⁠⁠⁠\u0026#x1f4ac; Patreon: /caseyrocket\u0026#x1f4fd;️ YouTube: @CaseyRocket\u0026#x1f455; Merch: https://rawpaw.ink/search?q=casey\u0026#43;rocket\u0026#43;\u0026options%5Bprefix%5D=last ★★★ ★ The William Montgomery Show on ALL Major Audio Platforms!♦ Apple Podcast: ⁠⁠⁠⁠https://podcasts.apple.com/us/podcast⁠⁠⁠⁠ ...♦ Spotify Podcast: ⁠⁠⁠⁠https://open.spotify.com/show/6SJj2pP⁠⁠⁠⁠ ... ★ For More William Montgomery and Casey Rocket, check out ‘Kill Tony’ live every Monday at The Comedy Mother Ship in Austin TX and on YouTube: @KillTony ★ Original cover art illustration by Ryan J. Ebelt: ⁠⁠⁠⁠https://ryanjebelt.com⁠⁠⁠⁠ ★ Recorded in Austin Texas at Record ATX. ★ Send your letters \u0026 packages to:♦ P.O. Box 40316 Austin, TX 78704 ★ The William Montgomery Show is produced by William Montgomery William F Montgomery is an American stand-up comedian. A native of Memphis Tennessee, William now resides in Austin, Texas. Under the tutelage of a top young rising comedian, Tony Hinchcliffe, \u0026 Brian ‘The Podfather’ Redban, William has become a fan favorite \u0026 the longest serving Kill Tony Regular. William has performed in front of comedy icons such as Joe Rogan, Whitney Cummings, Russell Peters, Tiffany Haddish, Doug Stanhope, Tim Dillon, Doug Benson, Donnell Rawlings, Jeff Ross, Dane Cook, Tom Segura, Bert Kreischer, Ron White, Ari Shaffir, Big Jay Oakerson, Luis J Gomez, Dan Soder, Jim Gaffigan, Andrew Santino, Dom Irrera, Steve Simone, Brian Holtzman, Sal Vulcano, Ian Edwards, Greg Fitzsimmons, Shane Gillis, Kyle Dunnigan, Ms. Pat, Josh Potter, Mark Normand, Ryan Sickler, Eddie Pepitone, Josh Wolf, Moshe Kasher, Bonnie McFarlane, Steve Lee, Adam Ray, Andrew Shultz, Pauly Shore, Bob Saget, Michael Rapaport \u0026 Don Barris. Montgomery has garnered many monikers over the years: The Big Red Machine, The Vanilla Gorilla, The Memphis Madman, The Tennessee Tickler, The Strawberry Twist \u0026 The Raisin-Bread Kid. William regularly opens for Joe Rogan in the Austin area. Along with David Lucas, William has previously hosted ‘Brothers in Cursive’ \u0026 ‘Are We Really Brothers’. William has appeared on podcast such as ‘Jeremiah Wonders with Jeremiah Watkins’, ‘Unlicensed Therapy with Ari Mannis’, ‘Dead Air with Brian Holtzman’, ‘Shenk with Sara Weinshenk’ \u0026 ‘The Fat Pessimist with David Lucas’.",
      "release": "2025-05-15T01:30:00Z",
      "duration": "01:03:55.7330000",
      "explicit": true,
      "spotifyId": "6IztLP3QB4HS9sEpH2G9rY",
      "appleId": 1000708530330,
      "youTubeId": "cyUHP_mQWnY",
      "subjects": [
        "Spiritual Narcissist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6IztLP3QB4HS9sEpH2G9rY",
        "apple": "https://podcasts.apple.com/podcast/ezra-miller-started-a-cult-the-william-montgomery/id1596006008?i=1000708530330",
        "youtube": "https://www.youtube.com/watch?v=cyUHP_mQWnY"
      }
    }
  ]
}