{
  "id": "95c09c87-bbf9-4048-aeb6-ae48a382cb29",
  "name": "The Future Workplace",
  "spotifyId": "1knOUEjjMiqVFUSdw7ReRm",
  "youTubeChannelId": "UC91TrfwwZLjrsRCQOhRS9Qw",
  "episodes": [
    {
      "id": "7a5e8625-ae84-4b2c-af0d-937e87c064d6",
      "title": "Born in a Cult, Spiraled Into Addiction, Now Advises Fortune 500s | Petra Velzeboer",
      "description": "From a religious cult to rock bottom addiction to helping Fortune 500 companies transform their workplace culture - Petra Velzeboer\u0027s story will stop you in your tracks.\nIn this raw and powerful conversation, mental health consultant and author Petra Velzeboer shares her journey from being born into a religious cult, spiraling into addiction as a young single mother, to becoming one of the leading voices on digital wellness and mental health in the workplace.\n\nWhat We Cover:\n🔹 Growing up in a religious cult and the moment everything changed\n🔹 The brutal reality of addiction - and why one glass of wine led to checking her car for bodies after 2 weeks\n🔹 Why \u0022do the next right thing\u0022 became her life-saving mantra\n🔹 The crisis of meaning and connection destroying modern workplaces\n🔹 Why your phone is stealing your ability to feel your feelings (and why that\u0027s dangerous)\n🔹 How to actually disconnect in a world that demands you\u0027re always on\n🔹 The truth about digital detoxes and what actually works\n🔹 Why wellness programs with yoga and pink posters completely miss the point\n🔹 How to build real connection when everything is remote\n🔹 What AI and technology are doing to our mental health (and what to do about it)\n\nKey Takeaways:\n✅ The number one skill for happiness is practicing bravery\n✅ Your algorithm reveals who you are - use it intentionally\n✅ Digital wellbeing = when technology supports YOUR intentions, not the other way around\n✅ Things have to get worse before they get better\n✅ The biggest workplace issue isn\u0027t perks - it\u0027s meaning and connection\n\nAbout Petra Velzeboer:\nPetra is a psychotherapist, mental health consultant, and author of \u0022Digital Wellbeing\u0022 and \u0022Begin With You.\u0022 She works with global organizations helping them create mentally healthy cultures and high-performing teams. 17 years sober, she\u0027s living proof that transformation is possible.\n\n📚 Get Petra\u0027s book \u0022Digital Wellbeing\u0022: https://www.amazon.com/Digital-Wellbeing-Recharge-Focus-Reboot-ebook/dp/B0DFYZ8YKW/ref=sr_1_2?crid=WYFWM3LTP2KU\u0026dib=eyJ2IjoiMSJ9.54GqSHQnMiHVebYAf5n2rLha4URpSdKLRRoSnlqO59qP3loxSyhETJwKuvZJ9xm9.oHoC4nWLKmm2mmtLFDwUAL5oSzGBCpD5MLdbvXKqfsk\u0026dib_tag=se\u0026keywords=petra\u002Bvelzeboer\u0026qid=1770622967\u0026sprefix=petra\u002Bvelzeb%2Caps%2C159\u0026sr=8-2\n\n🔗 Connect with Petra: https://petravelzeboer.com\n\n💼 LinkedIn: https://www.linkedin.com/in/petra-velzeboer/\n\nRelated Videos You\u0027ll Love:\nThis Is How You Go Viral - https://youtu.be/d16kOaay5f0?si=owbPm3-y0YqLuw3M\n\n🎙️ About The Future Workplace Podcast:\nWe explore what the workplace will look like in the next 5 years - from office design to mental health, leadership to technology. Real conversations with experts who are shaping the future of work.\n\n👉 Subscribe for weekly episodes on workplace culture, leadership, and human performance.",
      "release": "2026-02-11T08:55:55Z",
      "duration": "01:05:08",
      "explicit": false,
      "spotifyId": "32e2hK5gQDP9dTrIHnzeJl",
      "youTubeId": "RbNlbKe3GZU",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/32e2hK5gQDP9dTrIHnzeJl",
        "youtube": "https://www.youtube.com/watch?v=RbNlbKe3GZU"
      }
    }
  ]
}