{
  "id": "015a9857-4d36-43a4-9989-716f7061f1de",
  "name": "The Central Cast",
  "spotifyId": "4SYDKJHY57QvQEvMnKmLqU",
  "appleId": 1813883462,
  "episodes": [
    {
      "id": "cc76b271-18ad-4f7c-9518-04ff46ccc364",
      "title": "12/14/25: What Is the Meaning of Life? Four Paths to Purpose",
      "description": "In this episode the host tackles the timeless question: what is the meaning of life?\n\nHe outlines four overlapping ways people find meaning — the religious, the metaphysical, the social, and the material — and explores how each can sustain us. Stories and reflections include faith and deconstruction, a mystical view of being the universe experiencing itself, the power of relationships and politics, and finding joy in ordinary pleasures like sports.\n\nThe episode emphasizes our ability to create meaning, the importance of community, and offers a hopeful benediction to commit to love, justice, and the courageous embrace of life.",
      "release": "2025-12-14T21:11:36Z",
      "duration": "00:38:30",
      "explicit": false,
      "spotifyId": "0wltYMf4mXtgGCieWMc8L4",
      "appleId": 1000741261172,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0wltYMf4mXtgGCieWMc8L4",
        "apple": "https://podcasts.apple.com/podcast/12-14-25-what-is-the-meaning-of-life-four-paths-to-purpose/id1813883462?i=1000741261172"
      }
    },
    {
      "id": "260b4ef0-d2f9-4a2f-b887-e734017b28e2",
      "title": "12/7/25: Peter Rollins: Communion of the Broken: Grace, Symptoms, and Shared Lack",
      "description": "Peter Rollins starts with a parable about a mystic, an evangelical pastor, and a fundamentalist who each meet Jesus in the afterlife. From that story Peter explores three kinds of unknowing, the paradox that the divine can share our lack, and how that insight reframes salvation and love.\n\nThe conversation contrasts community, the commons, and a deeper communion forged around shared wounds and symptoms, using AA as an example of radical acceptance. The episode closes with a short guided reflection inviting listeners to imagine a circle of people and the burdens they carry.",
      "release": "2025-12-07T21:44:17Z",
      "duration": "01:02:58",
      "explicit": false,
      "spotifyId": "1DXNK3zxx3Wz4qNQ9OMSbo",
      "appleId": 1000740119734,
      "subjects": [
        "Alcoholics Anonymous",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1DXNK3zxx3Wz4qNQ9OMSbo",
        "apple": "https://podcasts.apple.com/podcast/12-7-25-peter-rollins-communion-of-the-broken/id1813883462?i=1000740119734"
      }
    },
    {
      "id": "f34ea7d2-6a6b-4c57-8ec7-ae61485997d9",
      "title": "11/23/25: Beyond Binaries: Luke’s Hidden Image of Male Intimacy",
      "description": "This episode examines a censored detail in Luke’s story of Lazarus and the rich man — the original Greek term kolpon, often translated as \u0022bosom,\u0022 which evokes male intimacy, nurture, and vulnerability — and explores how gender norms, translation choices, and cultural expectations shape who we are allowed to be.\n\nThe conversation expands into personal stories and audience reflections about gender as a social construct, how binaries limit everyone (including men), and how younger generations practice a more inclusive \u0022and\u0022 thinking. The episode closes with a benediction inviting listeners toward love, justice, and humility.",
      "release": "2025-12-03T00:47:39Z",
      "duration": "00:40:10",
      "explicit": false,
      "spotifyId": "1w98LVhoyBvJF22TNu3Lts",
      "appleId": 1000739411537,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1w98LVhoyBvJF22TNu3Lts",
        "apple": "https://podcasts.apple.com/podcast/11-23-25-beyond-binaries-lukes-hidden-image-of-male-intimacy/id1813883462?i=1000739411537"
      }
    },
    {
      "id": "a0526d7f-21df-4980-bc3b-cc6bdcb9988f",
      "title": "11/16/25: Born Different, Loved Anyway: Deconstruction, Brain Science \u0026 Holiday Peace",
      "description": "In this episode we talk about navigating tense holiday gatherings with conservative family and friends, exploring recent brain research (Ohio State, 2023) that suggests liberals and conservatives process moral and political issues differently. The host reflects on deconstruction, identity, and how recognizing different brain wiring can foster compassion instead of contempt. The episode closes with a simple loving-kindness meditation to extend compassion toward difficult relatives and practical perspectives for keeping peace while holding to one’s values.",
      "release": "2025-11-16T21:39:04Z",
      "duration": "00:44:49.7910000",
      "explicit": false,
      "spotifyId": "6P2fSc8nHMuA7oeYiPvd5p",
      "appleId": 1000736995366,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6P2fSc8nHMuA7oeYiPvd5p",
        "apple": "https://podcasts.apple.com/podcast/11-16-25-born-different-loved-anyway-deconstruction/id1813883462?i=1000736995366"
      }
    },
    {
      "id": "a4865e09-5f11-4373-b8f0-d3d782455488",
      "title": "11/2/25: Ghosts, Guilt, and Grace: Reframing Demons This Halloween",
      "description": "This episode explores how beliefs about demons shaped evangelical childhoods during the Satanic Panic, the harm of fear-based theology, and how deconstruction can feel like deliverance. Through stories, scripture, and audience conversation, the host reframes the demonic as inward fears, oppressive ideologies, and cultural control, ending with a communal benediction.",
      "release": "2025-11-03T22:55:58Z",
      "duration": "00:34:41.7020000",
      "explicit": false,
      "spotifyId": "3DjUJxcZPYj5P1Jg2XB2Tb",
      "appleId": 1000735117457,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3DjUJxcZPYj5P1Jg2XB2Tb",
        "apple": "https://podcasts.apple.com/podcast/11-2-25-ghosts-guilt-and-grace-reframing-demons-this/id1813883462?i=1000735117457"
      }
    },
    {
      "id": "523ca151-0030-4671-81ff-17e97c007bff",
      "title": "10-19-25: Swim Between the Canyons: Identity, Faith, and Passing It On",
      "description": "This episode explores lineage—who taught us it was OK to be ourselves—through personal stories: a pilgrimage to Matthew Shepard\u0027s murder site in Laramie, reflections on erasure and visibility, and memories of Indigo Girls shows that helped the host reconcile queer identity and faith. Julie also shares a niece\u0027s coming-out essay about \u0027swimming\u0027 between faith and identity, and a live audience offers stories of mentors, family, and younger generations who model authenticity. It’s an honest conversation about holding on to original selfhood, resisting erasure, and passing courage to the next generation.",
      "release": "2025-10-24T21:15:48Z",
      "duration": "00:36:15.1260000",
      "explicit": false,
      "spotifyId": "3YfXZE4e0iDpQDHzFecBuR",
      "appleId": 1000733381912,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3YfXZE4e0iDpQDHzFecBuR",
        "apple": "https://podcasts.apple.com/podcast/10-19-25-swim-between-the-canyons-identity-faith/id1813883462?i=1000733381912"
      }
    },
    {
      "id": "2a68073b-acd9-4a36-8d51-8f76c93ecddd",
      "title": "10/12/25: A Spiritual Guide to Resilience in Hard Times",
      "description": "In this episode we wrestle with fear, anger, and despair in today’s political moment, exploring how faith and a broad spiritual sensibility can provide resilience. Drawing on history, philosophy (Gabriel Marcel, Paul Tillich), Indigenous worldview, and personal practices like loving‑kindness meditation, they argue that seeing life as connected and centering ultimate concerns—love, justice, community—sustains resistance. The conversation balances urgency and nonviolence, honoring diverse roles in collective struggle, and offers a benediction to commit to love, honesty, humility, and justice as the way forward.",
      "release": "2025-10-12T21:21:56Z",
      "duration": "00:39:54.5300000",
      "explicit": false,
      "spotifyId": "4BzGakQSsv0QsXCXegNSWH",
      "appleId": 1000731496562,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BzGakQSsv0QsXCXegNSWH",
        "apple": "https://podcasts.apple.com/podcast/10-12-25-a-spiritual-guide-to-resilience-in-hard-times/id1813883462?i=1000731496562"
      }
    },
    {
      "id": "feafb583-b0a3-4e8d-985e-7432401395fa",
      "title": "10/5/25: Touching the Scars: Why Doubt Leads to Deeper Faith",
      "description": "This episode explores the story of Doubting Thomas and argues that doubt can lead to a deeper, more authentic encounter with the divine. The hosts introduce the idea of the “fidelity of betrayal,” drawing on Jesus’ challenges to religious law and thinkers like Peter Rollins and Meister Eckhart to show how critiquing or leaving institutions can be an act of faith. Conversation moves into modern concerns—politics, moral equivalency, homelessness, and mental health—closing with a call to justice, compassion, and communal care.",
      "release": "2025-10-08T21:07:38Z",
      "duration": "00:43:14.4180000",
      "explicit": false,
      "spotifyId": "5kBIQ0NkbpJzAOuAXX4hoS",
      "appleId": 1000730888693,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5kBIQ0NkbpJzAOuAXX4hoS",
        "apple": "https://podcasts.apple.com/podcast/10-5-25-touching-the-scars-why-doubt-leads-to-deeper-faith/id1813883462?i=1000730888693"
      }
    },
    {
      "id": "613ca7f9-8588-4bc0-94f6-120aa9d2f579",
      "title": "9/21/25: Religion-Induced Psychosis: Resurrections, Charlie Kirk, and Social Reality",
      "description": "Aaron opens with a humorous chimpanzee \u0022resurrection\u0022 story and uses it to examine how the resurrection has shaped Christian belief—contrasting early Christian social-justice roots with modern evangelical otherworldliness. The episode critiques \u0022religion-induced psychosis,\u0022 the role of social media and political figures in spreading magical thinking, and urges listeners to hold beliefs with humility while prioritizing compassionate action in the world.",
      "release": "2025-09-21T20:27:06Z",
      "duration": "00:51:13.1130000",
      "explicit": false,
      "spotifyId": "6DYNH2eMvCHG62jKXDZGDe",
      "appleId": 1000727768443,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6DYNH2eMvCHG62jKXDZGDe",
        "apple": "https://podcasts.apple.com/podcast/9-21-25-religion-induced-psychosis-resurrections-charlie/id1813883462?i=1000727768443"
      }
    },
    {
      "id": "26238cbe-64a7-4e55-9871-b9bb4d0ee20d",
      "title": "9/14/25: When Faith and Fury Collide: The Charlie Kirk Fallout",
      "description": "This episode explores what Charlie Kirk\u0027s assassination reveals about modern American Christianity: the tension between being Christian and being Christ‑like, how religion can be molded by culture, the rise of cult‑like evangelicalism, and the danger of theological movements that seek political dominance. Hosts reflect on grief, outrage, boundary‑setting, and reasons for cautious hope that epistemic breakdowns and human suffering ultimately curtail authoritarian movements.",
      "release": "2025-09-14T20:21:14Z",
      "duration": "00:35:02.2500000",
      "explicit": false,
      "spotifyId": "3K2Y0NbarxyU6MmNh1A30p",
      "appleId": 1000726799601,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3K2Y0NbarxyU6MmNh1A30p",
        "apple": "https://podcasts.apple.com/podcast/9-14-25-when-faith-and-fury-collide-the-charlie-kirk-fallout/id1813883462?i=1000726799601"
      }
    },
    {
      "id": "360ff69c-db46-4689-a901-d0326afde736",
      "title": "9/7/25: Starlight \u0026 Second Chances: Embracing Change at The Livery",
      "description": "This episode explores change and spiritual growth as the church celebrates its first service in a new space. Aaron shares a stargazing story—how starlight becomes part of us—to illustrate that life and faith are always evolving, and invites the community to reflect on deconstruction, healing, and adaptability. Members share personal stories of transition, loss, and renewal, highlighting how openness to change brings peace, resilience, and new purpose. The episode closes with communal reflections and a benediction.",
      "release": "2025-09-07T21:47:09Z",
      "duration": "00:25:41.9720000",
      "explicit": false,
      "spotifyId": "3uzMF8IR60LJMiQdAjUZ8v",
      "appleId": 1000725423859,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uzMF8IR60LJMiQdAjUZ8v",
        "apple": "https://podcasts.apple.com/podcast/9-7-25-starlight-second-chances-embracing-change-at/id1813883462?i=1000725423859"
      }
    },
    {
      "id": "f7f3644a-2b3d-4bb4-96f4-c2338547cf4e",
      "title": "8/24/25: When Faith Collapses: Owning Your Beliefs After Deconstruction",
      "description": "This episode follows the host\u0027s journey from seminary doubt to spiritual re-discovery. He recounts wrestling with atonement, the collapse of traditional beliefs, and the friendships that shaped his faith. The conversation explores what it means to take ownership and responsibility for your beliefs, how we project ourselves onto gods, and why freedom to choose can feel overwhelming. Drawing on stories of Abraham and Moses, reflections on mysticism, and recent cultural moments, the episode invites listeners to think critically and form a values-based, relational faith.",
      "release": "2025-08-24T22:44:13Z",
      "duration": "00:15:29.4580000",
      "explicit": false,
      "spotifyId": "0SodZdzEpaANSHpRciAjiA",
      "appleId": 1000723357225,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0SodZdzEpaANSHpRciAjiA",
        "apple": "https://podcasts.apple.com/podcast/8-24-25-when-faith-collapses-owning-your-beliefs-after/id1813883462?i=1000723357225"
      }
    },
    {
      "id": "5dbd2633-df70-4ae9-80ed-ca62c6b18c08",
      "title": "8/17/25: When Myths Collapse: Faith, Politics, and New Life",
      "description": "This episode explores the collapse of American and religious myths, drawing parallels between political crisis and spiritual deconstruction. Aaron reflects on Jesus\u0027 myth-shattering ministry, historical examples of renewal after failure, and the fragility of national narratives. The conversation turns to hope found in small, committed communities, practical resistance, and the possibility of reinventing faith and society after trauma. Listeners are invited to consider how collapse can lead to new life and solidarity.",
      "release": "2025-08-18T14:20:07Z",
      "duration": "00:27:35.2050000",
      "explicit": false,
      "spotifyId": "6iNi4AyiBgrwxHbnHK5txB",
      "appleId": 1000722514316,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6iNi4AyiBgrwxHbnHK5txB",
        "apple": "https://podcasts.apple.com/podcast/8-17-25-when-myths-collapse-faith-politics-and-new-life/id1813883462?i=1000722514316"
      }
    },
    {
      "id": "b0999d3d-3e7f-4651-b1ca-134227f50c16",
      "title": "8/3/25: Unveiling Mary Magdalene: Misunderstood and Silenced",
      "description": "In this episode, we delve into the life and legacy of Mary Magdalene, exploring the misconceptions that have long clouded her true role in biblical history. Our guest, Madison, shares insights on how Mary Magdalene’s identity was shaped by historical and biblical misunderstandings, and how she was ultimately a powerful witness to Jesus’ resurrection. We discuss the historical silencing of women in ministry and the impact of patriarchal narratives within the church. Through engaging discussions and personal anecdotes, listeners will gain a deeper understanding of how women like Mary Magdalene challenged societal norms and forged new paths in spiritual leadership. This episode also examines personal stories from the speakers, providing insight into how past teachings on women in church leadership have evolved over time and highlighting the ongoing journey toward religious and spiritual inclusivity. Join us for a thought-provoking exploration of history, faith, and empowerment.",
      "release": "2025-08-12T03:10:53Z",
      "duration": "00:22:37.6720000",
      "explicit": false,
      "spotifyId": "4aAq4oPUR8wZ1K1faTVFAe",
      "appleId": 1000721592176,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4aAq4oPUR8wZ1K1faTVFAe",
        "apple": "https://podcasts.apple.com/podcast/8-3-25-unveiling-mary-magdalene-misunderstood-and-silenced/id1813883462?i=1000721592176"
      }
    },
    {
      "id": "1b81d229-e382-4047-a8e6-4eb24851e52d",
      "title": "7/20/25: Embracing Mysticism: The Light Within",
      "description": "In this episode of the Central Cast Podcast, we delve into the profound teachings of St. John of the Cross and his emphasis on inner illumination. We explore the concept of the \u0027dark night of the soul\u0027 as a pathway to divine love and unity, transcending traditional religious constraints. The discussion flows into contemporary themes, comparing the classic mystical journey with modern deconstruction to exemplify personal transformation and societal change. Listeners are invited to reflect on love and connection as guiding forces in a world often divided by politics and societal norms. We introduce the leading-edge concept of quantum social theory, drawing parallels between quantum physics and the interdependency of social systems to illustrate our inherent oneness. This episode inspires a shift towards recognizing shared humanity through the light of love and connection, urging listeners to live with authenticity and empathy.",
      "release": "2025-07-20T20:37:35Z",
      "duration": "00:37:08.2400000",
      "explicit": false,
      "spotifyId": "0j2hNN3pKGSqLZ0PqeuHXi",
      "appleId": 1000718185323,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0j2hNN3pKGSqLZ0PqeuHXi",
        "apple": "https://podcasts.apple.com/podcast/7-20-25-embracing-mysticism-the-light-within/id1813883462?i=1000718185323"
      }
    },
    {
      "id": "0441816c-a72e-409f-9f16-76d136151506",
      "title": "7/13/25: VBS for Mystics Pt2: Mysticism as Rebellion: Exploring Christian Gnosticism",
      "description": "Join us in this intriguing episode of the Central Cast as we delve into the heart of Christian mysticism and its rebellious spirit. Discover the early Christian mystical movement of Gnosticism and how it contrasted with proto-Orthodox Christianity, redefining the human journey from repentance to enlightenment. Explore the provocative teachings of Jesus, who challenged established religious and social structures, advocating for a profound understanding of our oneness with God. This episode unveils the radical nature of mysticism as a form of resistance, emphasizing its political implications and its critique of societal hierarchies. Reflect on the enduring relevance of mysticism and how it calls for a deeper social responsibility and connection with one another. Perfect for those questioning traditional doctrines and seeking a more inclusive, liberating approach to faith. Tune in and be part of reclaiming the authentic, transformative essence of Christianity.",
      "release": "2025-07-13T18:56:00Z",
      "duration": "00:24:05.6480000",
      "explicit": false,
      "spotifyId": "6YBn1Fp8DzPjJFzTXoXDWE",
      "appleId": 1000717073286,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YBn1Fp8DzPjJFzTXoXDWE",
        "apple": "https://podcasts.apple.com/podcast/7-13-25-vbs-for-mystics-pt2-mysticism-as-rebellion/id1813883462?i=1000717073286"
      }
    },
    {
      "id": "3abf29fd-028f-42f5-af49-0b83b81ef512",
      "title": "7/6/25: VBS for Mystics: Unveiling the Infinite Within",
      "description": "Welcome to the first episode of our three-week series \u0022VBS for Mystics,\u0022 where we explore profound questions about our existence, consciousness, and our inherent connection to the universe. Drawing from the wisdom of philosopher Gabriel Marcel, we discuss the idea that we are not only a part of the infinite but are the infinite itself, manifesting as living beings. This episode invites you to contemplate our oneness with all things, suggesting this is the crucial story we need today. As the world feels more fragmented, we delve into the spiritual and social implications of seeing ourselves as interconnected with everything around us. Rejecting outdated religious notions, we propose a new myth—a life-defining story of unity and the cosmic consciousness that brings meaning and identity. Join us as we navigate the narratives that bind us and seek to understand how they help us cope and find hope amidst chaos.",
      "release": "2025-07-06T19:31:34Z",
      "duration": "00:37:37.1580000",
      "explicit": false,
      "spotifyId": "3JBFRnZwUlv55u2vIg5KFp",
      "appleId": 1000716004133,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3JBFRnZwUlv55u2vIg5KFp",
        "apple": "https://podcasts.apple.com/podcast/7-6-25-vbs-for-mystics-unveiling-the-infinite-within/id1813883462?i=1000716004133"
      }
    },
    {
      "id": "f4f134fc-20fd-4677-9efb-52c1628c3c49",
      "title": "6/29/25: Redefining Faith: Breaking Up with the Bible",
      "description": "Join us this week as Julie Davis, our community pastor, speaks about vulnerability and transparency as essential elements of community building. Julie shares an honest, personal story of a transformative moment in her spiritual journey, where she confronts her relationship with the Bible and embraces a new way of seeing faith. This pivotal experience leads her to question traditional scripture and explore how stories from our own communities can illuminate the sacred among us, fostering new connections and spiritual growth. Engage in the dialogue and explore how art, listening, and personal experiences contribute to understanding the divine. Julie invites listeners to contemplate profound questions about spirit, truth, and calling, encouraging a fresh perspective on what it means to live a life of faith.",
      "release": "2025-06-29T19:22:21Z",
      "duration": "00:25:00.9170000",
      "explicit": false,
      "spotifyId": "0pB7K9SXkvybuRtmqUpYE0",
      "appleId": 1000715035164,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0pB7K9SXkvybuRtmqUpYE0",
        "apple": "https://podcasts.apple.com/podcast/6-29-25-redefining-faith-breaking-up-with-the-bible/id1813883462?i=1000715035164"
      }
    },
    {
      "id": "19db5089-1cae-4994-b28b-c86a68e5e1ce",
      "title": "6/8/25: Understanding Gender Identity and How It Plays  Out In the Culture War",
      "description": "This thought-provoking episode examines the role of evangelical churches and conservative politics in shaping societal attitudes towards the trans, intersex, queer, and non-binary communities today. It highlights the historical and cultural patterns of scapegoating minority groups, emphasizing the complexities surrounding gender identity in our current socio-political climate. Join us as we engage in a candid dialogue exploring the intersections of history, religion, politics, and identity, and seek to understand the dynamics of empathy, privilege, and systemic change in fostering a more inclusive society.",
      "release": "2025-06-08T20:56:58Z",
      "duration": "00:54:30.8180000",
      "explicit": false,
      "spotifyId": "3CZrhjTovGDFtMRwKrp5AQ",
      "appleId": 1000712015804,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3CZrhjTovGDFtMRwKrp5AQ",
        "apple": "https://podcasts.apple.com/podcast/6-8-25-understanding-gender-identity-and-how-it-plays/id1813883462?i=1000712015804"
      }
    },
    {
      "id": "7fb9a6cb-e9e5-4435-befe-bf9409b046d0",
      "title": "6/1/25: Embracing the \u0027Other\u0027: Unveiling the Power of Queer Theology",
      "description": "Join us in this compelling episode of the Central Cast as we welcome Julie Davis, the new community pastor, who delves into the transformative power of queer theology and its potential to revitalize modern Christianity. Reflecting on her personal journey and struggles within the evangelical church as a queer Christian, Julie advocates for embracing non-binary perspectives and honoring the process of becoming within our faith communities. Through an insightful discourse enriched with references to prominent works like \u0022Queer Virtue\u0022 by Reverend Elizabeth Edmond, Julie highlights the importance of disrupting binaries and embracing transness as a path to deeper spiritual understanding. Discover how the essence of Christianity aligns with queerness, inviting followers to explore a spirituality rooted in process, mystery, and radical inclusion. Engage with thoughtful discussions and questions from the audience as Julie and the congregation ponder the challenges and promise of embracing non-traditional identities both within and outside the church. This episode is not just about theology, but about nurturing curiosity and compassion, prompting us all to redefine normalcy in our spiritual and societal engagements.",
      "release": "2025-06-01T20:43:49Z",
      "duration": "00:28:15.1160000",
      "explicit": false,
      "spotifyId": "6D0gQ30r3fRH0SeS76xKuO",
      "appleId": 1000710775585,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6D0gQ30r3fRH0SeS76xKuO",
        "apple": "https://podcasts.apple.com/podcast/6-1-25-embracing-the-other-unveiling-the-power/id1813883462?i=1000710775585"
      }
    },
    {
      "id": "50562a14-46ce-4375-ae0d-8a76af8e485d",
      "title": "5/25/25 Crisis and Faith: How Socio-Political Turmoil Shapes Beliefs",
      "description": "In this episode, we delve into the profound impact of crisis on faith formation, tracing back to how socio-political upheavals like the Babylonian conquest of Judah led to the creation of the Old Testament. The discussion explores how these challenges not only birthed the Hebrew Bible but also shaped its theological narratives. The episode further examines how similar themes of crisis re-emerge in the New Testament, particularly in the Gospels and the Book of Revelation, reflecting responses to subsequent social and political crises. A broader examination reveals how contemporary socio-political events continue to shape faith, particularly within American evangelicalism, and the culture wars impacting modern Christianity. Guest speakers share their insights, experiences, and the personal impacts of these crises on faith, sparking thoughtful dialogue on the intersection of politics, crisis, and religious belief.",
      "release": "2025-05-25T19:05:46Z",
      "duration": "00:31:34.6010000",
      "explicit": false,
      "spotifyId": "65Ctv1Gd4Knkz64l6foUjw",
      "appleId": 1000709809098,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65Ctv1Gd4Knkz64l6foUjw",
        "apple": "https://podcasts.apple.com/podcast/5-25-25-crisis-and-faith-how-socio-political-turmoil/id1813883462?i=1000709809098"
      }
    },
    {
      "id": "0318cdbe-f122-47e7-890e-4258bdce1f64",
      "title": "5/18/25: Embracing Impermanence: The Beauty of Letting Go",
      "description": "In this week\u0027s discussion, we delve into the inspirational words of philosopher Ayodeji Timi Williams, exploring the concept of life as a wave meant to pass through us rather than being held onto. Join us as we uncover the beauty of fleeting moments and the significance of living in the present. Our journey takes a personal turn as we hear insights from a hospice chaplain\u0027s perspective on embracing impermanence and the deep connection found in momentary encounters. Through heartfelt discussions, we are reminded of the importance of practicing presence and understanding that beauty and meaning lie not in permanence but in the act of being. Tune in for a thoughtful reflection on how our spiritual community finds momentous beauty in transient experiences, and how we can all cultivate the grace to let go and embrace the temporal nature of life. Intro music by Stevan Carter",
      "release": "2025-05-18T19:39:14Z",
      "duration": "00:24:41.2710000",
      "explicit": false,
      "spotifyId": "6uTwy4ICKFiFRuvSRcOIZQ",
      "appleId": 1000708915092,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6uTwy4ICKFiFRuvSRcOIZQ",
        "apple": "https://podcasts.apple.com/podcast/5-18-25-embracing-impermanence-the-beauty-of-letting-go/id1813883462?i=1000708915092"
      }
    },
    {
      "id": "6520a2e9-21c2-4ac8-8296-f4e705a23624",
      "title": "5/11/25: Honoring Rachel Held Evans: A Spiritual Legacy for Progressive Christianity",
      "description": "In this week\u0027s episode of the Central Cast, we honor the life and legacy of Rachel Held Evans, celebrating her contributions as a significant voice in progressive Christianity. Recorded live at our church in Glendale, California, we explore her influence on many, particularly Millennials and Gen Xers, as both a spiritual leader and a personal inspiration to our community. We reflect on Rachel\u0027s journey from an evangelical upbringing in Dayton, Tennessee, through her groundbreaking work as a blogger and author challenging traditional Christianity\u0027s norms. Highlighted by her impactful books, including \u0022Evolving in Monkey Town\u0022 and \u0022A Year of Biblical Womanhood,\u0022 Rachel\u0027s voice continues to inspire discussions on deconstruction, liberation theology, and the importance of embracing intellectual honesty in faith. Join us as we discuss Rachel\u0027s profound belief in love and liberation over fear and power, and her enduring message that the church can be a force for positive change if it opens up to inclusivity and justice. Listener reflections and conversations on Rachel\u0027s lasting influence on defining modern progressive Christianity bring this tribute to a thoughtful close. Intro music credit to Stevan Carter.",
      "release": "2025-05-11T23:32:35Z",
      "duration": "00:29:55.7720000",
      "explicit": false,
      "spotifyId": "4SCkUdNZkehgfU7Mhf4U4Z",
      "appleId": 1000708133052,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4SCkUdNZkehgfU7Mhf4U4Z",
        "apple": "https://podcasts.apple.com/podcast/5-11-25-honoring-rachel-held-evans-a-spiritual/id1813883462?i=1000708133052"
      }
    }
  ]
}