{
  "id": "1562fef3-2310-42d1-bd07-c4dd404e9acc",
  "name": "The Fourcast",
  "spotifyId": "2EhZ0sS3ysxrx0NmJ6ESKz",
  "appleId": 1542796249,
  "youTubeChannelId": "UCTrQ7HXWRRxr7OsOtodr2_w",
  "youTubePlaylistId": "PLXjqQf1xYLQ6jvo0ErJ2a-UVlnDrAon8G",
  "episodes": [
    {
      "id": "184fde6a-6a79-4fd0-8b75-d9e5beb395a7",
      "title": "‘Terminal crisis for royal family’ - analysing impact of Andrew\u0027s arrest",
      "description": "Andrew Mountbatten-Windsor, formerly Prince Andrew, has been arrested and his brother, King Charles, says the police have his “full and wholehearted support” and the “law must take its course”.\n\n[Subscribe to our Substack newsletter: https://channel4news.substack.com/subscribe]\n\nSo, what happens next for both Andrew and the Crown? Is this the biggest crisis the royal family has faced in modern history?\n\nThe King says it “would not be right” to comment further on the matter, but how long will he be able to hold that line?\n\nAndrew Mountbatten-Windsor has always denied any wrongdoing. \n\nOn this episode of The Fourcast, Krishnan Guru-Murthy is joined by historian Dan Snow and former Editor of The Sun newspaper David Yelland\n-------\n\nGet more news at our site - https://www.channel4.com/news/ \n\nSubscribe to our Substack newsletter: https://channel4news.substack.com/subscribe\n\nFollow us:\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\nTwitter - https://twitter.com/Channel4News\nFacebook - https://www.facebook.com/Channel4News/",
      "release": "2026-02-19T16:50:09Z",
      "duration": "00:29:13",
      "explicit": false,
      "spotifyId": "3PrIvK4XKE6jQYcZH5YCeN",
      "appleId": 1000750525922,
      "youTubeId": "sJrleiR3BZ8",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3PrIvK4XKE6jQYcZH5YCeN",
        "apple": "https://podcasts.apple.com/podcast/andrew-arrested-whats-next-for-the-crown/id1542796249?i=1000750525922",
        "youtube": "https://www.youtube.com/watch?v=sJrleiR3BZ8"
      }
    },
    {
      "id": "717324f0-4f37-4be9-96b9-12102d3164c9",
      "title": "Epstein files: Andrew\u0027s connection is ‘existential for the Crown’",
      "description": "Andrew Mountbatten-Windsor is once again at the centre of serious allegations connected to Jeffrey Epstein, with police now assessing whether a criminal case will follow over allegations he leaked documents to Epstein during his time as a trade envoy for the government. So could the former prince really face jail time?\n\n[Subscribe to our Substack newsletter: https://channel4news.substack.com/subscribe]\n\nBut beyond the legal questions lies a deeper one about power, privilege and accountability. Will this just be another royal scandal that fades with the news cycle, or a moment of reckoning for the Crown?\n\nOn this episode of The Fourcast, Matt Frei is joined by Dr Tessa Dunlop, royal historian and host of the podcast Where Politics Meets History, and Professor Jeremy Horder - professor of Criminal Law at LSE.\n\nAndrew Mountbatten Windsor has always denied any wrongdoing in relation to Epstein; in particular he has denied the allegation he had sex with Virginia Giuffre when she was 17 and was trafficked by the US financier.\n\n-------\n\nGet more news at our site - https://www.channel4.com/news/ \n\nSubscribe to our Substack newsletter: https://channel4news.substack.com/subscribe\n\nFollow us:\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\nTwitter - https://twitter.com/Channel4News\nFacebook - https://www.facebook.com/Channel4News/",
      "release": "2026-02-10T17:39:28Z",
      "duration": "00:32:21",
      "explicit": false,
      "spotifyId": "4ePeo9jZrXY0bE0ZjfHIys",
      "appleId": 1000749120177,
      "youTubeId": "r6C2UQz9exI",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ePeo9jZrXY0bE0ZjfHIys",
        "apple": "https://podcasts.apple.com/podcast/will-andrew-ever-go-to-prison-over-epstein-emails/id1542796249?i=1000749120177",
        "youtube": "https://www.youtube.com/watch?v=r6C2UQz9exI"
      }
    },
    {
      "id": "d70459f7-2448-4ad6-9c28-69e0ae96440a",
      "title": "Will Epstein Mandelson scandal bring down Starmer’s government?",
      "description": "The Peter Mandelson Epstein files emails is the biggest scandal of Keir Starmer\u0027s time as Prime Minister, but is it the one to finish him off?\n\nThe PM admits Peter Mandelson\u0027s ongoing relationship with paedophile financier Jeffrey Epstein came up as part of the vetting process to appoint the disgraced peer as the UK\u0027s man in Washington, but he says Mandelson \u0027lied and lied again’, adding, ‘he betrayed our country and our party’.\n\nThe government\u0027s invective shows their determination to distance themselves from the scandal but the stench of sleaze and corruption hangs heavy over the Labour government because of Mandelson - the man Keir Starmer was praising less than a year ago.\n\nCould it be the final straw for the Prime Minister\u0027s restless backbenchers?\n\nOn this episode of The Fourcast, Krishnan Guru-Murthy was joined by Starmer biographer Tom Baldwin, the political commentator Zoe Williams and pollster and strategist Scarlett Maguire.\n\n-------\n\nGet more news at our site - https://www.channel4.com/news/ \n\nSubscribe to our Substack newsletter: https://channel4news.substack.com/subscribe\n\nFollow us:\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\nTwitter - https://twitter.com/Channel4News\nFacebook - https://www.facebook.com/Channel4News/",
      "release": "2026-02-04T18:49:04Z",
      "duration": "00:35:06",
      "explicit": false,
      "spotifyId": "05SSlNoT7M0oggCHV7iO5g",
      "appleId": 1000748254314,
      "youTubeId": "Y5G0XjVo3go",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/05SSlNoT7M0oggCHV7iO5g",
        "apple": "https://podcasts.apple.com/podcast/will-epstein-mandelson-scandal-bring-down-starmers/id1542796249?i=1000748254314",
        "youtube": "https://www.youtube.com/watch?v=Y5G0XjVo3go"
      }
    },
    {
      "id": "813debed-cc00-406d-bf03-c8fa4b4e9a80",
      "title": "Epstein files: what they mean for Andrew and the Royal family",
      "description": "If you thought the Epstein Files would damage Donald Trump it is here in Britain where they have caused the most devastation. The most damning material yet about the former Prince Andrew include photographs that seem to show him on all fours over a woman on the floor, as well as humiliating emails from his ex-wife Sarah Ferguson to Epstein in which she appears to suggest he marries her. It all raises new questions about the conduct of certain Royals, the monarchy and the Palace’s handling of this over many years, and what this new low means for the whole institution. Andrew has said nothing new - but consistently denies any wrongdoing, despite his financial settlement with Virginia Giuffre. Sarah Ferguson has previously expressed sympathy with Epstein’s victims. In this episode of The Fourcast, Krishnan Guru-Murthy talks to biographer Andrew Lownie, whose work has explored the private world of the Windsors, and historian Kate Williams, who has charted the monarchy’s turbulent existence across generations. Sarah Ferguson has previously said she “deeply regret” the involvement with Jeffrey Epstein and that she “abhor paedophilia and any sexual abuse of children and know that this was a gigantic error of judgment on my behalf”.",
      "release": "2026-02-02T20:07:12Z",
      "duration": "00:26:50.0050000",
      "explicit": false,
      "spotifyId": "4rf6D1LAzo2yKxNVKFjfrk",
      "appleId": 1000747756395,
      "youTubeId": "ZobvHXT131s",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4rf6D1LAzo2yKxNVKFjfrk",
        "apple": "https://podcasts.apple.com/podcast/epstein-files-what-they-mean-for-andrew-and-the-royal-family/id1542796249?i=1000747756395",
        "youtube": "https://www.youtube.com/watch?v=ZobvHXT131s"
      }
    },
    {
      "id": "cd29dd6f-1a53-4fbe-85f9-6b902d767cf3",
      "title": "Virginia Roberts Giuffre was ‘gaslit’ by UK government, Met police and Prince Andrew say her family",
      "description": "In 2011, Virginia Roberts Giuffre became known as the most outspoken victim of Jeffrey Epstein and Ghislaine Maxwell. Her campaigning against their abuse and trafficking helped to get justice for many women, but she was perhaps best known for a now-infamous photograph, taken when she was aged just 17, meeting with Prince Andrew. She claimed it was taken prior to one of three times she was forced to have sex with the King\u0027s brother. Encounters he vehemently denies took place but which have led to his public downfall, with Prince Andrew reportedly paying around £12 million to Roberts Giuffre, formally ending a civil case brought against him in the US without admitting liability. Earlier this year, Virginia took her own life. Before she died, she wrote a memoir, determined for the world to finally hear her story in her own words. In this episode of The Fourcast, Jackie Long speaks to Virginia’s brother and sister-in-law, Sky and Amanda Roberts, about the woman behind the headlines, the legacy she leaves, and the campaigning she wanted to be remembered for. They also express their frustration with the Metropolitan Police response - but the Met reiterated to Channel 4 News today that they do not consider themselves the appropriate authority to investigate alleged crimes in the UK related to the Jeffrey Epstein case.This episode includes conversation around suicide and abuse.",
      "release": "2025-10-21T05:33:02Z",
      "duration": "00:35:10.5280000",
      "explicit": false,
      "spotifyId": "0jF5rRzGBntCavwLy0DF83",
      "appleId": 1000732768122,
      "youTubeId": "raob3aTxEJI",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0jF5rRzGBntCavwLy0DF83",
        "apple": "https://podcasts.apple.com/podcast/virginia-roberts-giuffre-was-gaslit-by-uk-government/id1542796249?i=1000732768122",
        "youtube": "https://www.youtube.com/watch?v=raob3aTxEJI"
      }
    }
  ]
}