{
  "id": "832a9b78-dd89-4929-89f8-2d968ec25281",
  "name": "The Mind School",
  "spotifyId": "3caoKrnrMIuHov2qsyXoya",
  "appleId": 1493689913,
  "episodes": [
    {
      "id": "bad7d2f4-fd93-418c-a441-55cdf5d0bee9",
      "title": "Sleazy or Soulful? Our Take on NLP, Persuasion and Coaching Ethics 🤔",
      "description": "Hey legend \u0026#x1f44b; This weeks episode is your official permission slip to build a business that doesn’t give you the ick. You know what I’m talking about: \u0026#x1f449; The weird sales call tactics that feel like a performance \u0026#x1f449; The cringey way to \u0022handle objections\u0022 \u0026#x1f449; The coaching scripts that promise “results” but miss the soul \u0026#x1f449; The mentors who seem more invested in their Stripe screenshots than your growth Yeah. That. This week, The Mind School School Consellor, Courney, \u0026 I sit down to chat about the stuff nobody talks about enough: \u0026#x1f4ad; Why some coaching feels off (and what to do about it) \u0026#x1f4ad; The darker side of NLP, and how to practice it ethically \u0026#x1f4ad; Red flags to watch for when choosing a mentor or program \u0026#x1f4ad; Why you don’t need to “fix” anyone to be a powerful coach \u0026#x1f4ad; The missing piece of the coaching puzzle that we teach inside The Mind School (that no one else does) If you’ve ever wondered what makes The Mind School Method different, this episode will show you. Spoiler: It’s not scripts. It’s not formulas. It’s not “do this, say that.” It’s real tools, taught with real heart. Whether you’re deep in the coaching game or just getting started, this episode is gonna shift something in you. \u0026#x1f3a7; [Listen now] \u0026#x1f525; And if it hits… come chat to Court about joining us this June in Perth. No pitch. Just a convo. Book your call now. Big love, Breanna x As always, please don\u0027t forget to hit Subscribe! xxx",
      "release": "2025-04-15T18:00:00Z",
      "duration": "00:42:40.4170000",
      "explicit": false,
      "spotifyId": "2F4lPCws4N5G4rCuAzV8UA",
      "appleId": 1000703633264,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2F4lPCws4N5G4rCuAzV8UA",
        "apple": "https://podcasts.apple.com/podcast/sleazy-or-soulful-our-take-on-nlp-persuasion-and/id1493689913?i=1000703633264"
      }
    }
  ]
}