{
  "id": "f9c419d1-13eb-4864-a83a-6fac843e6151",
  "name": "The Dark Side Uncovered",
  "youTubeChannelId": "UCehY6GDL3FxcZooxVz_wbyQ",
  "episodes": [
    {
      "id": "baf915b0-4292-4c8b-bb85-0ee51b1dacab",
      "title": "The Cult That Killed For God",
      "description": "The case of “God’s Misfits” and the tragic murders of Kansas women Veronica Butler and Jilian Kelley has shocked communities and true crime fans alike. This in-depth video uncovers the chilling details of their final road trip, the custody battle that led to a deadly ambush, and the disturbing role of the extremist group “God’s Misfits.” With gruesome crime scene discoveries, twisted motives, and a dark web of conspirators, this story exposes how far personal vendettas and radical beliefs can spiral into horror.\n\nJoin us as we explore the full timeline, key suspects, including Tifany Adams and Tad Bert Cullum, and the twisted ideologies of God’s Misfits. Dive into this haunting true crime story as we examine the disturbing impact of extremist groups in ordinary communities and the dangers that lurk beneath.\n\n🔍 Key Topics Covered:\n\nVeronica Butler and Jilian Kelley murder case\nGod’s Misfits extremist group\nTifany Adams custody battle\nCustody dispute turned deadly\nTrue crime stories of 2024\nChilling Kansas murder cases\nExtremist groups in America\nDark legacy of God’s Misfits group\nRoad trip horror stories\nIf you’re intrigued by the darkest true crime mysteries, don’t forget to like, subscribe, and turn on notifications for more deep dives into the eerie and unexplainable.\n#TrueCrime #VeronicaButler #JilianKelley #GodsMisfits #KansasMurders #2024TrueCrime #CustodyDisputeMurders #TrueCrimeDocumentary #ExtremistGroups",
      "release": "2024-11-08T21:00:06Z",
      "duration": "00:13:21",
      "explicit": false,
      "youTubeId": "Q6yYv3eTpzo",
      "subjects": [
        "God\u0027s Misfits"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q6yYv3eTpzo"
      }
    }
  ]
}