{
  "id": "679aad76-4754-4845-8866-16a4066e768f",
  "name": "The Interfaith Center at Miami University",
  "youTubeChannelId": "UC0pq08p9H2y0IrqtVyAUUWQ",
  "episodes": [
    {
      "id": "01a528ef-9e76-42aa-be51-3feefa1070ac",
      "title": "Recognizing Cults \u0026 Abuse of Power with Janja Lalich",
      "description": "Dr. Janja Lalich is an internationally renowned expert on cults. Join us as we learn about her own experience in a political cult earlier in her life and how it influenced her later research.  Why do people stay in cults? What are the parallels between cults and abusive relationships? How do we differentiate extremist religious and political factions from cults? Join us and find out!\n\nJanja Lalich, Ph.D., Professor Emerita of Sociology, is an international authority on cults and coercion. Researcher, author, and educator, she specializes in recruitment, indoctrination, and methods of influence and control. She has been studying the social psychology of controversial groups and exploitative and abusive relationships for 35 years. Dr. Lalich is the author and/or coauthor of six books, including the now classic, Take Back Your Life: Recovering from Cults and Abusive Relationships, and Escaping Utopia: Growing Up in a Cult, Getting Out and Starting Over. Her book Bounded Choice: True Believers and Charismatic Cults has been recognized as the first original contribution to the field of cultic studies in decades. In addition to working with survivors and their families, she leads workshops and educational sessions for government agencies, international intelligence agencies, private companies, educational institutions, nonprofit organizations. She has also served as expert witness in civil and criminal legal cases. A frequent keynoter or presenter at domestic and international conferences, her work has been translated into German, Italian, Spanish, Chinese, Japanese, Turkish, Russian, Serbo-Croatian, and Polish. \n\nDr. Lalich may be reached at drlalich@sbcglobal.net or on Twitter @Janja_Lalich. Her website is www.janjalalich.com.",
      "release": "2021-10-06T12:08:00Z",
      "duration": "00:55:46",
      "explicit": false,
      "youTubeId": "QaKHMvJheiY",
      "subjects": [],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QaKHMvJheiY"
      }
    }
  ]
}