{
  "id": "12887615-e905-45af-8586-c4e2e686193a",
  "name": "The Bitchuation Room (with Francesca Fiorentini)",
  "spotifyId": "7g3vnBu0C2BzutpJXLCVBe",
  "appleId": 1438285775,
  "youTubeChannelId": "UCkztf6gttP8D3vrusCrrp4g",
  "episodes": [
    {
      "id": "a3ce89ac-1369-4ed5-8207-45e5a29f93c4",
      "title": "Is Richard Branson Threatening Me Over Epstein Files?",
      "description": "Looks like someone is getting nervous about the Epstein Files. Richard Branson’s people sent us a threatening email because we accurately pointed out that he is in those files…\n\nOn last week’s show with Gareth Reynolds, we discussed the most recent dump of files that had come out. Wouldn’t you know it, Branson showed up in a number of Jeff’s emails. There is also a picture of the two men together that came out. Now, this doesn’t necessarily mean Richard is guilty of any crimes, and we never said he was. But then we got an email from Branson’s press department that told us there would be serious consequences for reporting inaccurate information.\n\nWe never accused Branson of grave wrongdoing in that episode, merely what his emails to Epstein suggest: that he was giving advice to Epstein on how to get out of his many assault allegations. Yet getting an email like this certainly makes him look scared. Why would you be scared if you haven’t done anything wrong, Rich? Anyway, here is Virgin Groups statement again:\n\n“Any contact Richard and Joan Branson had with Epstein took place on only a few occasions more than twelve years ago, and was limited to group or business settings, such as a charity tennis event. When Epstein offered a charity donation, the Bransons asked their team to carry out due diligence before accepting the donation, which uncovered serious allegations. As a result of what the due diligence uncovered, Virgin Unite did not take the donation and Richard and Joan decided not to meet or speak with Epstein again. Had they had the full picture and information, there would have been no contact whatsoever – Richard believes that Epstein’s actions were abhorrent and supports the right to justice for his many victims.”\n\nSee Francesca LIVE Saturday February 14th at 9:30pm Pasadena for New World Disorder:\nhttps://www.showclix.com/event/new-world-disorder-Valentines-Day-Edition-02-14-26-9-30-pm\n\nThe Bitchuation Room will be LIVE in Los Angeles with Emma Vigeland on Sunday March 22nd at Dynasty Typewriter. Tickets here: https://bit.ly/TBR322\n\n***\nSupport the show becoming a patron https://www.patreon.com/bitchuationroom and get exclusive perks. You can also be a member on YouTube, Twitch, or a paid subscriber on substack: franifio.substack.com.\n\n***\nTip the show:\nVenmo: @TBR-LIVE\nCash-App: @TBRLIVE\nGet your union-made TBR merch: www.bitchuationroom.com\n***\nThanks to Paige Oamek, Andy Vasoyan \u0026 Brent Godin\n***\nFollow The Bitchuation Room on Twitter @BitchuationPod\nBlueSky: https://bsky.app/profile/bitchuationroom.bsky.social\nIG: https://www.instagram.com/bitchuationroom/\nCheck Out The Bitchuation Room Podcast on:\niTunes: http://bit.ly/iTunesbitchuation\nGoogle Music: http://bit.ly/GoogleBitchuation\nStitcher: http://bit.ly/stitcherbitchuation\nSpotify: http://bit.ly/spotifybitchuation\n\nFind Francesca On:\nSubstack: franifio.substack.com\nTwitter: https://twitter.com/franifio\nYouTube: The Bitchuation Room’s channel: https://www.youtube.com/franifio\nTwitch: https://www.twitch.tv/franifio\nFacebook: https://www.facebook.com/Franifio\nIG: https://www.instagram.com/franifio/",
      "release": "2026-02-11T20:00:17Z",
      "duration": "00:10:04",
      "explicit": false,
      "youTubeId": "QMdnzXRAioQ",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QMdnzXRAioQ"
      }
    },
    {
      "id": "c2ea420d-cd9f-47b7-8496-4d80afc643a7",
      "title": "Is Tulsi Gabbard In A Cult?",
      "description": "Who is Tusli Gabbard really? \n\nShe\u0027s been a national figure for at least a decade, but the more we learn about her the weirder it gets. Gabbard first made national news when she bucked the rest of the Democratic party to endorse Bernie Sanders over Clinton in the 2016 primaries (good), but in the most recent election she supported Trump through and through (bad). To reward her loyalty, Trump selected her to be his Director of National Intelligence, a highly important job within the U.S. national security apparatus. \n\nTulsi is an enigmatic figure but one thing recently surfacing about the former Democrat is her family’s ties to the Science of Identity Foundation. This organization is based in Hawaii and “combines the teaching of yoga with aspects of Gaudiya Vaishnava theology.” Though it seems benign on the surface, we spoke to the guys from the Conspirituality Podcast about what they believe is a cult. \n\nNearly 100 national security officials have signed on to a letter asking senators to take a harder look at Gabbard’s appointment, in part, citing her relationship with the Science of Identity Foundation. At the same time, however, we should also be mindful of other powerful people in politics and their cult-like affiliations. For example, Justice Amy Coney Barret is part of the People of Praise—which has a similar story. \n\nWhat do you think? Is this worth investigating further? \n\nCome see Francesca at The Ice House in Pasadena on Wednesday January 22nd with Aida Rodriguez, Matt Lieb, James Fritz and Chloe Hilliard. https://www.showclix.com/event/the-ice-house-new-world-disorder-1-22-25-7-30-pm\n\nGet 20% off SUNSET LAKE CBD with code FRANTIFA at check out. Explore all their organic, vertically-integrated craft CBD products including tinctures, gummies, smokables, salves and more: www.sunsetlakecbd.com. \n***************************\nIndependent creators rely on your support to create the content you want! \nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCkztf6gttP8D3vrusCrrp4g/join\n\nBecome a Patron of The Bitchuation Room:\nhttps://www.patreon.com/bitchuationroom\n\nTip the show:\nVenmo: @TBR-LIVE\nCash-App: @TBRLIVE\n\nGet your TBR merch: www.bitchuationroom.com\n***************************\nThanks to Paige Omek \u0026 Max Inhoff \n***************************\nFollow The Bitchuation Room on Twitter @BitchuationPod\n\nCheck Out The Bitchuation Room Podcast\niTunes: http://bit.ly/iTunesbitchuation\nGoogle Music: http://bit.ly/GoogleBitchuation\nStitcher: http://bit.ly/stitcherbitchuation\nSpotify: http://bit.ly/spotifybitchuation\n\nFind Francesca On: \nTwitter: https://twitter.com/franifio \nYouTube: The Bitchuation Room’s channel: https://www.youtube.com/franifio \nTwitch: https://www.twitch.tv/franifio\nFacebook: https://www.facebook.com/Franifio\nInsta: https://www.instagram.com/franifio/",
      "release": "2024-12-16T20:00:16Z",
      "duration": "00:07:17",
      "explicit": false,
      "youTubeId": "RAIlNYVqhe8",
      "subjects": [
        "Science of Identity Foundation",
        "People Of Praise"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RAIlNYVqhe8"
      }
    },
    {
      "id": "3a655f06-7ff0-4289-b514-32f748ba1a3b",
      "title": "RFK Jr. And the MAHA Crazies *FRANTASTIC FRIDAYS* with Conspirituality Podcast",
      "description": "Bernie Sanders says RFK Jr. is \u0022right\u0022 about the food industry? Should we be giving this anti-science kook any credit as he takes over Health and Human Services? Hosts of the podcast Conspirituality, Matthew Remski and Derek Beres join Francesca to discuss RFK Jr.\u0027s lawyer suing to rescind the polio vaccine, the National Institute of Health nominee and COVID herd immunity guy Jay Bhattacharya, the continued fallout of the United Healthcare CEO\u0027s murder, and Tulsi Gabbard in a far-right Hindu cult! All the fun stuff!! Featuring: Matthew Remski, Conspirituality Podcast https://bsky.app/profile/matthewremski.bsky.social Derek Beres, Conspirituality Podcast https://bsky.app/profile/derekberes.bsky.social *** The Bitchuation Room Podcast is available everywhere you get your podcasts. It streams LIVE every TUESDAY, WEDNESDAY and FRIDAY at 1/4pmEST on YouTube: https://www.youtube.com/franifio and Twitch: https://www.twitch.tv/franifio. *** Support The Bitchuation Room by becoming a Patron: www.patreon.com/bitchuationroom to get special perks and listen/watchback privileges of the Wednesday *BONUS BISH* ** Give the Show your feedback, by answering a quick survey: http://survey.podtrac.com/start-survey.aspx?pubid=AafO2sMvE7gB\u0026ver=standard ** Tip the show via Venmo:@TBR-LIVE Cash-App:@TBRLIVE Music by Nick Stargu Follow The Bitchuation Room on Twitter @BitchuationPod, Instagram: @BitchuationRoom , TikTok: @BitchuationRoom Get your TBR merch: www.bitchuationroom.com *** Get 20% off SUNSET LAKE CBD with code FRANTIFA at check out. Explore all their organic, vertically-integrated craft CBD products including tinctures, gummies, smokeables, salves and more: www.sunsetlakecbd.com.",
      "release": "2024-12-14T05:14:00Z",
      "duration": "01:08:54.6340000",
      "explicit": false,
      "spotifyId": "4Xcc8czQhRaYSYotG7JqJm",
      "appleId": 1000680335127,
      "youTubeId": "ZSLhl_PqLPU",
      "subjects": [
        "Qanon",
        "Science of Identity Foundation",
        "People Of Praise"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Xcc8czQhRaYSYotG7JqJm",
        "apple": "https://podcasts.apple.com/podcast/rfk-jr-and-the-maha-crazies-frantastic/id1438285775?i=1000680335127",
        "youtube": "https://www.youtube.com/watch?v=ZSLhl_PqLPU"
      }
    }
  ]
}