{
  "id": "82229e11-8b8f-4f2f-abcf-a241a96e4de0",
  "name": "The James Altucher Show",
  "spotifyId": "0Tqw1AaZyrZ7kWnrNSgbNQ",
  "appleId": 794030859,
  "youTubeChannelId": "UCRQlx2klE_aNrPhz2OyKRdg",
  "episodes": [
    {
      "id": "5a872833-9715-483a-9dbf-3db72dd75de6",
      "title": "Dark Squares: Danny Rensch on Chess, Cults, and Finding Purpose",
      "description": "A Note from James This might be the most insane chess story I’ve ever heard—not even really a chess story, but a cult story. It’s wild, intense, and ultimately inspiring. Danny Rensch grew up in a cult in Arizona. At just 10 years old, the cult leader noticed his chess ability, took him away from his parents, and he wouldn’t see his mother again for a decade. I first heard Danny’s story when we met at Norway Chess a year and a half ago. Over dinner, he told me pieces of what would become his book Dark Squares: How Chess Saved My Life. I worried later that I’d pushed him into podcast mode before he was ready, but Danny said he was actually grateful for the chance to practice sharing his story out loud. Now, with his book out, he’s ready to open up fully. Episode Description Danny Rensch, Chief Chess Officer at Chess.com and author of Dark Squares: How Chess Saved My Life, shares the extraordinary story of how growing up in a cult shaped his childhood, his chess career, and his path to resilience. From being separated from his mother at age 10, to navigating indoctrination, hierarchy, and trauma, Danny explains how chess became both his prison and his salvation. This conversation is about more than chess—it’s about control, identity, purpose, and how to reclaim your life from the stories others force on you. What You’ll Learn How a cult leader used chess as propaganda—and how Danny reclaimed the game as his own. The three pillars of cult life Danny experienced: like vibration, the process, and purpose. Why vulnerability and storytelling can be healing—but also how they can be weaponized. The psychological toll of being told your “purpose” at age 12—and how to build a new one. What Danny learned about resilience, family, and community after leaving the cult. Timestamped Chapters [02:05] A Note from James: introducing Dark Squares [02:34] Danny’s childhood in a cult and separation from his mother [03:40] How Danny first shared his story with James in Norway [05:09] Learning to talk about trauma without fear of judgment [07:00] The challenge of context—why cult stories get misunderstood [08:20] Headline version: growing up in the Church of Immortal Consciousness [10:18] Cult hierarchy, trance teachings, and the Shelby School chess team [12:12] Was it spiritual belief—or a scam? [14:15] The role of Trina and Steven Camp, cult leaders and channelers [17:00] How hierarchy and “like vibration” destroyed marriages and families [23:00] The three pillars: like vibration, the process, and purpose [32:28] “The process”: group confession, alcohol, and weaponized vulnerability [41:54] “Purpose”: how chess became Danny’s imposed destiny [46:41] What it meant to be told at 12 that chess was his life’s purpose [50:18] Family secrets, hidden paternity, and the dangers of indoctrination [55:20] Processing trauma as an adult and writing Dark Squares [02:05] A Note from James: introducing Dark Squares [02:34] Danny’s childhood in a cult and separation from his mother [03:40] How Danny first shared his story with James in Norway [05:09] Learning to talk about trauma without fear of judgment [07:00] The challenge of context—why cult stories get misunderstood [08:20] Headline version: growing up in the Church of Immortal Consciousness [10:18] Cult hierarchy, trance teachings, and the Shelby School chess team [12:12] Was it spiritual belief—or a scam? [14:15] The role of Trina and Steven Camp, cult leaders and channelers [17:00] How hierarchy and “like vibration” destroyed marriages and families [23:00] The three pillars: like vibration, the process, and purpose [32:28] “The process”: group confession, alcohol, and weaponized vulnerability [41:54] “Purpose”: how chess became Danny’s imposed destiny [46:41] What it meant to be told at 12 that chess was his life’s purpose [50:18] Family secrets, hidden paternity, and the dangers of indoctrination [55:20] Processing trauma as an adult and writing Dark Squares [63:28] Early aptitude signs: multiplication tables and ADHD focus [65:22] Childhood acting dreams and practicing “the eyebrow lift” [72:24] The most painful mother–son conversation: loyalty to the cult vs. family [73:39] Giving away belongings before leaving home—grieving his mother alive [87:31] Medical breakdown, ears exploding, and a failed chess career [88:16] Bedridden but discovering the internet: early lessons in tech and online chess [89:16] Buying domains, teaching online, and meeting Eric and Jay [114:25] On Magnus Carlsen: confidence, health, and the “Great White Shark” mindset [116:20] Chess.com and the post-COVID boom: making a living beyond world championship Additional Resources \u0026#x1f4d6; Dark Squares: How Chess Saved My Life by Danny Rensch \u0026#x1f310; Danny Rensch on Chess.com \u0026#x1f3a5; Searching for Bobby Fischer (1993 film) See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-09-24T07:00:00Z",
      "duration": "02:04:32.4830000",
      "explicit": false,
      "spotifyId": "6Owf6xVZN5D2irSuwpwRgd",
      "appleId": 1000728181634,
      "youTubeId": "rZFg0UaxHVE",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Owf6xVZN5D2irSuwpwRgd",
        "apple": "https://podcasts.apple.com/podcast/dark-squares-danny-rensch-on-chess-cults-and-finding/id794030859?i=1000728181634",
        "youtube": "https://www.youtube.com/watch?v=rZFg0UaxHVE"
      }
    }
  ]
}