{
  "_ts": 0,
  "id": "47998f5b-1c5e-4cd4-9e1b-9dec5b277233",
  "name": "The Crime Seen",
  "youTubeChannelId": "UCspoJk-Gco-OA0onwQPxC0g",
  "episodes": [
    {
      "id": "813c0189-106f-4157-8cbc-6127243ffa95",
      "title": "Evil Grandmother Plays The Victim - Until Police Discover She\u0027s A Cult Leader And Serial Killer",
      "description": "This real life horror story and shocking true crime case unfolded across decades in several states across America, becoming headline news in 2017. \n\nWhen a woman came forward, insisting that police needed to look into her mother, investigators launched an investigation. Through full police interviews, they uncovered a twisted true crime story of a cult that had largely remained under the radar. \n\nAs they continued to dig into the cult, they found an even more disturbing true crime case where multiple children had disappeared or died under mysterious circumstances. \n\nPolice set a trap for the grandmother cult leader, bringing her in under the guise of seeing if she had been the victim of benefit fraud. In the room, investigators sprung their trap in the real life murder mystery, conducting a full police interrogation about the cult, disappearances, and unexplained deaths of children. \n\nIn the end, detectives uncovered an unbelievable true crime story and a real life thriller where a grandmother went from victim to killer in the room. They found a cult leader and child serial killer who many have claimed was a psychopath hiding in plain sight. While several of the homicide cases have been solved, there are unsolved cases and questions that remain in this horrifying true crime story. \n-------------------------------------------------------------------------------------------------------------------------------\nIn 2017, Joy Fluker came forward to police, reporting that her mother, Anna Young had been a cult leader and had been responsible for multiple children\u0027s deaths while they were in her care.\n\nThe Alachua County Sheriff’s Office opened an investigation - and quickly discovered that Young had run an organization called the House of Prayer For All People for many years.\n\n Dubbed a cult by many, the House of Prayer claimed to be a refuge for Christians who were \u0022down on their luck\u0022. It was supposed to be a place to find faith and to care for children.\n\nInstead, former members claimed it was a cult where Young reigned with absolute authority. She had been accused of abusive behaviour toward the members - and their children.\n\nPolice also learned that, in the early 1990s, Young had bathed 12-year-old Nikki Nickelson, in a tub with bleach, causing burns. Wanted for child abuse charges, Young had fled, leading to the collapse of the House of Prayer.\n\nYoung was eventually caught and convicted. She was sentenced to time served while awaiting trial - which was about 6 months.\n\nAs detectives interviewed former members about the House of Prayer, they heard that two other children had died in the community\u0027s care - Katonya Jackson and Emon Harper.\n\nNeeding to speak with Young about what occurred at the House of Prayer, investigators come up with a plan to lure her in to speak about her benefits and possible fraud...\n-------------------------------------------------------------------------------------------------------------------------------\nChannel Disclaimer: This real life murder documentary is for educational purposes to help understand police interrogation techniques and understand the mind of a murderer. \n\nThrough this series of full police interrogations, detectives use a number of techniques, such as the Reid technique. Using these techniques, investigators try to separate truth from lies in one of the most complex and most interesting true crime cases in American history. Ultimately, they uncover an unexpected killer. Is she someone who snapped? Or was her a twisted cult leader and serial killer who proves that evil lives here? People continue looking at the case as they attempt to answer these unsolved questions. \n\nWe drop new videos every Sunday at 11 AM ET and Thursday at 11 AM ET. Don\u0027t forget to subscribe for more true crime content like this.\n\n#truecrimesolved #interrogation #truecrimecommunity #truecrimestories #TheCrimeSeen",
      "release": "2025-04-21T15:01:00Z",
      "duration": "03:58:26",
      "explicit": false,
      "youTubeId": "fw43gQsbqC8",
      "subjects": [
        "House of Prayer for All"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fw43gQsbqC8"
      }
    }
  ]
}