{
  "id": "0fd46880-c77f-4c77-ae9b-f75a4ec35788",
  "name": "The Sarah Fraser Show",
  "spotifyId": "3J6pQAP70RgtLLgWwiXbJm",
  "appleId": 1064651383,
  "youTubeChannelId": "UCM8m3IwaQutr5tZnGGzSKog",
  "episodes": [
    {
      "id": "9ca5fe9b-7230-4757-bb95-ccb670254a79",
      "title": "INTERVIEW: Natalie Robehmed (‘Allison After NXIVM Podcast) Lands First Interview with Allison Mack From Smallville \u002B Her Involvement In The Nxivm Cult. Sunday, November 23rd, 2025",
      "description": "In this episode, I had the opportunity to speak with Natalie Robehmed, the host of \u0022Allison After NXIVM,\u0022 where we explored the complex and troubling journey of Allison Mack, best known for her role on \u0022Smallville.\u0022 We discussed how Allison, initially seeking personal growth, became deeply involved in the NXIVM cult led by Keith Raniere, ultimately leading to her participation in harmful practices. Natalie shared her unique experience of gaining access to Allison after her release from federal prison, revealing a remorseful and introspective side of her that contrasts sharply with the villainous image portrayed in the media. Timestamps: 00:00:00 - Introduction to Natalie Robehmed and NXIVM 00:05:30 - Allison Mack\u0027s Background 00:10:00 - Accessing Allison Mack 00:25:00 - Understanding the Women of NXIVM 00:45:00 - Allison\u0027s Relationship with her husband 00:55:00 - Allison\u0027s Prison Experience MY Go Big Podcasting Courses Are Here! Purchase Go Big Podcasting and learn to start, monetize, and grow your own podcast. Use code HOLIDAY20 for 20% OFF all courses **SHOP my Amazon Marketplace - especially if you\u0027re looking to get geared-up to start your own Podcast!!!** https://www.amazon.com/shop/thesarahfrasershow Show is sponsored by: Baked By Melissa right now is offering YOU 20% OFF your entire order of cupcakes. Perfect for a Holiday party or Birthday! Use this link for 20% OFF bakedbymelissa.com/tsfs Beducate.me/tsfs69 and use code tsfs69 for 65% off the annual pass! Beducated helps you find sexual freedom and intimacy with access to experts and over 150\u0026#43; sex courses. Sign up Cash App Download Cash App Today: https://capl.onelink.me/vFut/q6skmihp #CashAppPod. Cash App is a financial services platform, not a bank. Banking services provided by Cash App’s bank partner(s). Prepaid debit cards issued by Sutton Bank, Member FDIC. See terms and conditions at https://cash.app/legal/us/en-us/card-agreement . Direct Deposit, Overdraft Coverage and Discounts provided by Cash App, a Block, Inc. brand. Visit http://cash.app/legal/podcast for full disclosure. For a limited time!!! Customers can earn $10 if they use the code SECURE10 in their profile at signup and send $5 to a friend within 14 days. Terms apply. Cornbread Hemp is offering 30% off your first order! Just go to cornbreadhemp.com/TSFS and use code TSFS at checkout. Nutrafol.com use code TSFS for FREE shipping and $10 off your subscription Quince.com/tsfs for FREE shipping on your order and 365 day returns Follow me on Instagram/Tiktok: @thesarahfrasershow ***Visit our Sub-Reddit: reddit.com/r/thesarahfrasershow for ALL things The Sarah Fraser Show!!!*** Advertise on The Sarah Fraser Show: thesarahfrasershow@gmail.com Got a juicy gossip TIP from your favorite TLC or Bravo show? Email: thesarahfrasershow@gmail.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-11-23T09:00:00Z",
      "duration": "00:50:07.8690000",
      "explicit": true,
      "spotifyId": "3BtDrv21fMG5yhgjdvwmSe",
      "appleId": 1000737975457,
      "youTubeId": "BwJjq1wZhQo",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BtDrv21fMG5yhgjdvwmSe",
        "apple": "https://podcasts.apple.com/podcast/interview-natalie-robehmed-allison-after-nxivm-podcast/id1064651383?i=1000737975457",
        "youtube": "https://www.youtube.com/watch?v=BwJjq1wZhQo"
      }
    },
    {
      "id": "180e2e8a-cea4-49d5-a738-a4580705b430",
      "title": "INTERVIEW: Ben Brown (Kody Brown’s Nephew) Talks Being Raised In A Cult, Advice For The Sister Wives, And His Famous Brown Cousins. Sunday, October 26th, 2025 | Sarah Fraser",
      "description": "ICYMI, this was a HUGE interview for me in the fall of 2024 with a Sister Wives family member, Ben Brown. Ben gives his insights about Kody, Robyn, Christine, Meri, Janelle, and his cousins. For reference, Ben Brown is Kody Brown’s nephew and spent a fair amount of time with the family when he was younger. I had an engaging conversation with Ben Brown, a comedian and TikTok star known for his candid takes on his upbringing in a polygamous family.. Ben discussed the challenges of growing up poor in a polygamous household governed by strict beliefs, the complexities of family dynamics, and the misconceptions surrounding polygamy Virtual LIVE PODCAST …BRAVOCON Edition! Join podcaster David Yontef (Behind The Velvet Rope) and me on Monday, November 17th at 7pm NYC/EST time for an AMA about Bravocon. Tea will be spilled. MY Go Big Podcasting Courses Are Here! Purchase Go Big Podcasting and learn to start, monetize, and grow your own podcast. Use code HALLOWEEN15 for 15% OFF all courses **SHOP my Amazon Marketplace - especially if you\u0027re looking to get geared-up to start your own Podcast!!!** https://www.amazon.com/shop/thesarahfrasershow Show is sponsored by: Aidee! Find the new album from Aidee, “Nothing Rhymes With Orange”, on your favorite music app or click the link https://platoon.lnk.to/nothing-rhymes-with-orange - this project is perfect for neurodivergent children especially those with ADHD Baked By Melissa right now is offering YOU 20% OFF your entire order of cupcakes. Perfect for a Holiday party or Birthday! bakedbymelissa.com Cash App Download Cash App Today: https://capl.onelink.me/vFut/q6skmihp #CashAppPod. Cash App is a financial services platform, not a bank. Banking services provided by Cash App’s bank partner(s). Prepaid debit cards issued by Sutton Bank, Member FDIC. See terms and conditions at https://cash.app/legal/us/en-us/card-agreement . Direct Deposit, Overdraft Coverage and Discounts provided by Cash App, a Block, Inc. brand. Visit http://cash.app/legal/podcast for full disclosure. For a limited time!!! Customers can earn $10 if they use the code SECURE10 in their profile at signup and send $5 to a friend within 14 days. Terms apply. Cornbread Hemp is offering 30% off your first order! Just go to cornbreadhemp.com/TSFS and use code TSFS at checkout. CowboyColostrum.com get 20% off their entire order. Just use the code TSFS at checkout. That’s 20% off when you use code TSFS at CowboyColostrum.com. JonesRoadBeauty use code TSFS at jonesroadbeauty.com to get a Free Cool Gloss with your first purchase! Kiwico.com Tinker, create, and innovative. They have amazing art and STEM projects for kids of all ages, great gifts! Use code TSFS at checkout for 50% OFF Nutrafol.com use code TSFS for FREE shipping and $10 off your subscription Quince.com/tsfs for FREE shipping on your order and 365 day returns Follow me on Instagram/Tiktok: @thesarahfrasershow ***Visit our Sub-Reddit: reddit.com/r/thesarahfrasershow for ALL things The Sarah Fraser Show!!!*** Advertise on The Sarah Fraser Show: thesarahfrasershow@gmail.com Got a juicy gossip TIP from your favorite TLC or Bravo show? Email: thesarahfrasershow@gmail.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-10-26T08:00:00Z",
      "duration": "01:42:33.4040000",
      "explicit": true,
      "spotifyId": "010QkxKnwjk9x0OiSVoJon",
      "appleId": 1000733532743,
      "youTubeId": "rGMZQS66Rng",
      "subjects": [
        "Apostolic United Brethren"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/010QkxKnwjk9x0OiSVoJon",
        "apple": "https://podcasts.apple.com/podcast/interview-ben-brown-kody-browns-nephew-talks-being/id1064651383?i=1000733532743",
        "youtube": "https://www.youtube.com/watch?v=rGMZQS66Rng"
      }
    },
    {
      "id": "7ca9a164-f2c2-448a-8356-727303898cbc",
      "title": "INTERVIEW: Ben Brown (Kody Brown’s Nephew) Talks Being Raised In A Cult, Advice For The Sister Wives, And His Famous Brown Cousins. Wednesday, October 30th, 2024 | Sarah Fraser",
      "description": "I had an engaging conversation with Ben Brown, a comedian and TikTok star known for his candid takes on his upbringing in a polygamous family, being a nephew of Kody Brown from the Sister Wives franchise. Ben discussed the challenges of growing up poor in a polygamous household governed by strict beliefs, the complexities of family dynamics, and the misconceptions surrounding polygamy. Plus, does he stay in touch with Kody Brown and his cousins. Ben offers Janelle, Meri, and Christine advice now that they’re free, talks TLC and profiting off children, Garrison’s passing, and more. Timestamps: 00:00:00 - Introduction to Ben Brown 00:10:00 - History of Mormonism, Brown family history, when Kody and his dad became polygamists. 00:29:00 - Ben chats mormonism as a cult, Janelle’s mom marrying his grandmother, child abuse and more 00:35::00 - Does he stay in touch with Kody and his cousins, Ben slams TLC, and gives advice for Janelle, Meri, and Christine Live Virtual Podcast Halloween Edition! VIP ticket, Q\u0026A, Halloween costume contest! https://www.eventbrite.com/e/q-a-with-david-yontef-sarah-fraser-halloween-costume-party-edition-tickets-1006324021237?aff=oddtdtcreator Show is sponsored by: Amazfit.com/tsfs a wearable band to help you focus on health and wellness that looks sexy and cute! Get 15% OFF when you use code TSFS Article.com/tsfs for $50 OFF your purchase of $100 or more. Gorgeous furniture, garden, and home decor products that are built to last Field Of Greens use promo code TSFS get 15% OFF your order and FREE rush shipping Honey Play Box adult toys for everyone! Use code TSFS for 20% OFF your order Horizonfibroids.com get rid of those nasty fibroids Nutrafol.com use code TSFS for FREE shipping and $10 off your subscription Oneskin.co use code TSFS for 15% OFF your fabulous order Quince.com/tsfs for FREE shipping on your order and 365 day returns Taskrabbit.com use promo code TSFS at checkout for 15%. Book taskrabbit for trusted help or home tasks Timeline Nutrition is offering 10% off your first order of mitopure. Go to timeline.com/tsfs Follow me on Instagram/Tiktok: @thesarahfrasershow ***Visit our Sub-Reddit: reddit.com/r/thesarahfrasershow for ALL things The Sarah Fraser Show!!!*** **Check out some of my FAVORITE things on Amazon Marketplace - especially if you\u0027re looking to get geared-up to start your own Podcast!!!** https://www.amazon.com/shop/thesarahfrasershow Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-10-30T13:18:00Z",
      "duration": "01:43:02.5820000",
      "explicit": true,
      "spotifyId": "2JFH1ir0HhhZFgKzLppPAV",
      "appleId": 1000675011555,
      "youTubeId": "rGMZQS66Rng",
      "subjects": [
        "Apostolic United Brethren"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2JFH1ir0HhhZFgKzLppPAV",
        "apple": "https://podcasts.apple.com/podcast/interview-ben-brown-kody-browns-nephew-talks-being/id1064651383?i=1000675011555",
        "youtube": "https://www.youtube.com/watch?v=rGMZQS66Rng"
      }
    }
  ]
}