{
  "_ts": 0,
  "id": "f338959d-2fb2-4838-8a56-1e9ab331f4c2",
  "name": "The Afro Atheist",
  "youTubeChannelId": "UC-Vn8JbQ4sbMKYzz7HFMtFg",
  "episodes": [
    {
      "id": "8f458bf7-d911-43f3-99ff-111d5a518328",
      "title": "The Real Reason Pastor Tobi Adegboyega Is Being Deported: Exposing the Truth",
      "description": "Pastor Tobi Adegboyega has spun countless narratives to his followers about why he’s being deported, but the truth lies far from his fabricated stories. In this livestream, we’ll uncover the real reasons behind the UK tribunal’s decision, highlighting the evidence presented and the impact of his actions on victims and society.\r\n\r\nFor years, Tobi has used his platform to manipulate, exploit, and deceive, but the tribunal\u0027s findings shed light on the consequences of his behavior. Join us as we separate fact from fiction and reveal the truth that his followers deserve to hear.\r\n\r\nThis is not just about Tobi—it’s about exposing how figures like him manipulate systems, destroy lives, and evade accountability until justice finally catches up with them.\r\n\r\n👉 Sign the petition to deport Tobi Adegboyega and reopen fraud investigations: https://chng.it/j24pmpWLsZ\r\n\r\n#pastortobi #tobiadegboyega #spacnation #thenxtionfamily #scamnation #nigeria #naija #pastor #tobideportationtruth #ukimmigration #religiousscams #exposingpastors #truthoverlies #victimsjustice #religionandpower #fraudinfaith #accountabilitynow\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2025-01-11T02:10:24Z",
      "duration": "05:36:41",
      "explicit": false,
      "youTubeId": "waB2lpV3IMY",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=waB2lpV3IMY"
      }
    },
    {
      "id": "a357b845-bc44-46db-b2f4-7ce8f808286e",
      "title": "Pastor Tobi’s Influence on Other Preachers: Targeting Young People for Control",
      "description": "Pastor Tobi Adegboyega’s harmful influence extends far beyond SPAC Nation, inspiring other preachers to target vulnerable young people and bring them into their churches. This disturbing trend raises serious questions about the motives behind these so-called “leaders.”\r\n\r\nProminent figures like Dag Heward-Mills, David Antwi of First Love Church, Onyeka Powers and his wife of NGRM Church, and Pastor Austin E-Ben of RPF Church have been observed following this troubling model. These churches, led by grown men, have become centers for control and exploitation, focusing on recruiting impressionable youth.\r\n\r\nIn this livestream, we’ll discuss how Tobi’s toxic tactics are spreading, analyze the dangers posed by these cult-like churches, and expose their questionable practices. This behavior must be called out, and justice must be sought for the young lives impacted.\r\n\r\n👉 Sign the petition to deport Tobi Adegboyega and reopen fraud investigations: https://chng.it/zyBmtVSvrR\r\n\r\nJoin us as we shine a light on these preachers and their cult-like methods.\r\n\r\n#tobiadeyboga #spacnation #daghewardmills #rpfchurch #deporttobi #stopcults #Pastor Tobi Adegboyega’s harmful influence extends far beyond SPAC Nation, inspiring other preachers to target vulnerable young people and bring them into their churches. This disturbing trend raises serious questions about the motives behind these so-called “leaders.”\r\n\r\nProminent figures like Dag Heward-Mills, David Antwi of First Love Church, Onyeka Powers and his wife of NGRM Church, and Pastor Austin E-Ben of RPF Church have been observed following this troubling model. These churches, led by grown men, have become centers for control and exploitation, focusing on recruiting impressionable youth.\r\n\r\nIn this livestream, we’ll discuss how Tobi’s toxic tactics are spreading, analyse the dangers posed by these cult-like churches, and expose their questionable practices. This behavior must be called out, and justice must be sought for the young lives impacted.\r\n\r\n👉 Sign the petition to deport Tobi Adegboyega and reopen fraud investigations: https://chng.it/zyBmtVSvrR\r\n\r\nJoin us as we shine a light on these preachers and their cult-like methods.\r\n\r\n#tobiadeyboga #spacnation #bame #thenxtionfamily#daghewardmills #firstlovechurch #davidantwi #kharischurch #ngrm #onyekapower #deporttobi #stopcults #spacnationexposed #cultleaders #justiceforvictims #religiousabuse #churchcultsexposed #accountabilitynow #targetingyouth #exposingtobi #cultleaders #justiceforvictims #religiousabuse #churchcultsexposed #accountabilitynow #targetingyouth #exposingtobi",
      "release": "2025-01-09T00:07:16Z",
      "duration": "02:37:52",
      "explicit": false,
      "youTubeId": "6ktiP_T6PLA",
      "subjects": [
        "SPAC Nation",
        "Dag Heward-Mills"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6ktiP_T6PLA"
      }
    },
    {
      "id": "4b33e161-5e83-432f-a82f-1a50d2b28dfe",
      "title": "Pastor Tobi Dodges Accountability and Blames the Victims",
      "description": "Pastor Tobi Adegboyega recently sat down with Mide Oni for an interview on Off the Record, and true to form, Tobi spent the entire time dodging, deflecting, and waffling. Instead of answering straightforward questions or showing any accountability, Tobi made the shocking statement that his victims need to prove themselves to him.\r\n\r\nThis livestream will dissect the interview, exposing how Tobi consistently avoids taking responsibility for the harm caused by himself and his cult-like members. Why does Tobi demand proof from victims instead of addressing their suffering or offering an apology? This is yet another example of his manipulative tactics and complete lack of remorse.\r\n\r\nJoin us as we break down his words, analyze his evasive behavior, and continue to call for justice for his victims.\r\n\r\n👉 Sign the petition to deport Tobi Adegboyega and reopen fraud investigations: https://chng.it/Bk66JMwK47\r\n\r\n#tobiadeyboga #spacnation #deporttobi #mideoni #offtherecordinterview #spacnationexposed #cultleader #justiceforvictims #stopcults #religiousabuse #accountabilitynow #exposingtobi\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5719281357291520",
      "release": "2025-01-06T20:26:40Z",
      "duration": "03:39:33",
      "explicit": false,
      "youTubeId": "u1E6yhgj0XA",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u1E6yhgj0XA"
      }
    },
    {
      "id": "72a250ae-8678-4633-b7f3-de77be6b3b2a",
      "title": "Pastor Tobi’s Lawyer Exposed as a Predator: Dele Olawanle’s Alleged Abuse",
      "description": "The scandals surrounding Pastor Tobi Adegboyega just keep piling up, and now his lawyer, Dele Olawanle, is at the center of a shocking revelation. Not only has Dele given Tobi terrible legal advice during his deportation case, but he is now being exposed as a predator.\r\n\r\nIn this livestream, we’ll dive into the story of a courageous woman who has come forward to share her harrowing experience with Dele Olawanle—a lawyer and pastor of a church. This revelation only reinforces how corrupt and rotten this circle of so-called leaders truly is. From Tobi to his enablers, the manipulation, abuse, and exploitation are endless.\r\n\r\nAs we dissect this latest scandal, let’s not forget the bigger picture: Pastor Tobi must be deported, and justice must be served for all the victims harmed by his circle of deceit.\r\n\r\n👉 Sign the petition to deport Tobi Adegboyega and reopen fraud investigations: [Insert Petition Link]\r\n\r\nJoin us as we expose these predators and demand accountability for their actions.\r\n\r\n#tobiadeyboga #spacnation #nxtionfamily #deleolawanleexposed #deporttobi #nigeria #naija #religion #fakepastors #christianity #stopcults #spacnationexposed #religiousabuse #justiceforvictims #cultleaders #accountabilitynow #religiousfraud #exposingthetruth\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2025-01-05T23:56:29Z",
      "duration": "03:24:38",
      "explicit": false,
      "youTubeId": "dnK2sejWiQY",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dnK2sejWiQY"
      }
    },
    {
      "id": "0b0c5c9b-6e96-40a9-8dfe-f214ca3cfab9",
      "title": "TOBI ADEGBOYEGA: The UK’s Worst Cult Leader",
      "description": "Tobi Adegboyega has earned his reputation as one of the most dangerous cult leaders in the UK. From his disdain for women to his lavish lifestyle funded by coercion and manipulation, Tobi has left a trail of destruction in his wake. His so-called \u0022SPAC NATION\u0022 is nothing more than a thinly veiled cult, exploiting young people for his personal gain.\n\nThis video uncovers:\n\nTobi\u0027s blatant hate for women, shown in his speeches and actions.\nThe coercion and abuse young people face in his infamous \u0022trap houses.\u0022\nHis unrelenting demand for money under the guise of religious pledges.\nThe toxic culture of power, abuse, and manipulation he has created.\nReligious cults like Tobi\u0027s prey on the vulnerable, promising hope but delivering harm. It\u0027s time to shine a light on these exploitative practices and demand justice for the countless lives affected.\n\n👉 Sign the petition to have Tobi deported and for the police to reopen fraud investigations: [https://chng.it/zyBmtVSvrR]\n\nJoin the fight to hold cult leaders accountable and protect the next generation from religious exploitation.\n\n#tobiadegboyega #exposingtobi #spacnationexposed #nigeria #naija #daddyfreeze #fakepastor #scam #scammer #exreligious #exchristian #cultleader #religiousabuse #justiceforvictims #deporttobi #stopcults #accountabilitynow #religiousmanipulation #cultawareness",
      "release": "2025-01-04T16:00:06Z",
      "duration": "00:24:00",
      "explicit": false,
      "youTubeId": "heVCiD6blvM",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=heVCiD6blvM"
      }
    },
    {
      "id": "7d4a16cd-95ef-477b-9511-dbd7c5d001f0",
      "title": "WHO IS PASTOR TOBI’S WIFE?: 2 Wives, 2 Names—What Is He Hiding?",
      "description": "While reviewing Pastor Tobi Adegboyega’s tribunal decision, we uncovered a shocking twist: the official documents name his wife as Mary Olubukola Alade, yet the woman he parades publicly as his wife is named Lucy. These are two completely different people.\r\n\r\nThis revelation raises serious questions:\r\n\r\nIs Pastor Tobi married to two wives?\r\nWhy the secrecy and deception about his marital status?\r\nWhat else is Tobi hiding, and how deep do these lies go?\r\nThis latest discovery is yet another example of how problematic Tobi Adegboyega is to the United Kingdom. His web of lies, manipulation, and shady dealings continues to unravel, proving once again why he must be deported and held accountable.\r\n\r\nJoin us as we dig deeper into this new scandal, expose the inconsistencies, and demand justice for the countless young people he has harmed. Don’t forget to sign the petition to deport Tobi and urge the police to reopen investigations into his fraudulent activities.\r\n\r\n👉 Sign the petition here: https://chng.it/zyBmtVSvrR\r\n\r\n#tobiadeyboga #pastortobi #spacnation #bbc #huffpost #naija #nigeria #christianity #christian #deporttobi #spacnationexposed #cultleader #justiceforvictims #religiousfraud #accountabilitynow #stopcults #ukcultd#exposingthelies \r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2025-01-04T15:27:12Z",
      "duration": "01:05:26",
      "explicit": false,
      "youTubeId": "27R5GsU4vFQ",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=27R5GsU4vFQ"
      }
    },
    {
      "id": "43b229d9-78c0-48ca-9e3e-2d95d8a7562f",
      "title": "TRIBUNAL DECISION: Uncovering The Lies Tobi Adeboyega Told at Tribunal",
      "description": "What a thing of joy when the news broke that the tribunal had finally decided that Tobi Adegboyega should be deported from the UK! In this livestream, we’ll take a close look at the tribunal papers and expose the mountain of lies Tobi told during the proceedings. From his false claims to his blatant attempts to manipulate the system, this man stopped at nothing to evade justice.\r\nNot only Tobi but his wife, church leaders, and even his lawyer should be utterly ashamed of themselves for their roles in perpetuating this deception. How did this man get away with spinning so many lies for so long?\r\nJoin us as we dissect the tribunal’s decision, the lies that were uncovered, and the consequences of Tobi’s actions. This is a moment of justice for the countless young people he has exploited and harmed.\r\n\r\nLet’s celebrate this victory for accountability while continuing to demand justice for his victims.\r\n\r\n#tobiasadegboyega #spacnationexposed #naija #naijachristian #religion #spac #religious-fraud #financialabuse #deporttobi #justiceforvictims #cultleaders #tribunaldecision #stopreligiousabuse #ukjustice\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2025-01-04T02:35:09Z",
      "duration": "03:57:15",
      "explicit": false,
      "youTubeId": "T4dSxLcXhzo",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T4dSxLcXhzo"
      }
    },
    {
      "id": "130d5bd0-ff51-467e-be06-bdfdea8f0f69",
      "title": "Tobi Adegboyega Kicks Off the New Fleecing £500K: Exposing the Pressure on SPAC Members",
      "description": "The audacity of Tobi Adegboyega knows no bounds! To start the New Year, he gave his followers just five minutes to raise an eye-watering £500,000 in pledges—no clear reasons given, just pressure and manipulation. Some pledged amounts as staggering as £30K and £25K, with Mariam Mola, a known scammer, pledging £50K.\r\n\r\nWhat kind of leader demands such enormous sums from vulnerable young people, many of whom are already under immense pressure? And why is there no transparency about where this money will go?\r\n\r\nIn this livestream, we’ll delve into Tobi’s latest shameless money grab, explore the psychological and emotional toll this takes on his followers, and question the legitimacy of these demands. Are these pledges truly voluntary, or is coercion at play?\r\n\r\nThis isn’t just about the money—it’s about the exploitation of trust, the pressure to comply, and the cycle of manipulation that continues to harm young people in SPAC Nation.\r\n\r\nJoin us as we call out this predatory behavior and demand accountability for Tobi and his enablers. No one should start their year under this kind of stress.\r\n\r\n#tobiAdegboyega #SPACNationExposed #FinancialAbuse #bbc #nigeria #StopExploitation #ReligiousManipulation #JusticeForVictims #CultTactics #AccountabilityNow #naija \r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2025-01-03T01:22:31Z",
      "duration": "03:46:42",
      "explicit": false,
      "youTubeId": "QlEps9L3R38",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QlEps9L3R38"
      }
    },
    {
      "id": "d0a6d3be-0c93-4031-954d-6c8ed2f9b60f",
      "title": "End-of-Year Reflections: African Christianity \u0026 Its Leaders—What Have We Learned?",
      "description": "As the year comes to a close, let\u0027s take a deep dive into African Christianity and its leaders. Have these religious figures truly benefited their people, or have they only enriched themselves? What lessons can we take from their teachings and actions this year?\r\n\r\nJoin us for an open discussion on the impact of African Christian leaders, the need to challenge their doctrines, and how we can start the new year by asking tougher questions and seeking truth. Wishing everyone a joyful end of the year and a prosperous new beginning!\r\n\r\nRelevant Hashtags:\r\n#africanchristianity #naija #nigeria #nigerianpastor #nigeriachristianity #fakepastors #fakepreachers #religioninafrica #challengingbeliefs #questioningfaith #prosperitygospel #religiousleaders #newyearreflections #newyearresolutions\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2025-01-01T11:04:23Z",
      "duration": "01:58:53",
      "explicit": false,
      "youTubeId": "nFdtE1UhjsY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nFdtE1UhjsY"
      }
    },
    {
      "id": "e3d30c9f-50dd-4aab-aff2-afe0cc1405b9",
      "title": "TOBI ADEGBOYEGA AND HIS ARMY OF GOONS: A look into the Ex-Gang Members Enforcing His Cult Empire",
      "description": "Tobi Adegboyega didn’t build his empire alone—he had help. Behind the scenes, an army of loyal young men, many of them ex-gang members and so-called \u0022reformed criminals,\u0022 played a significant role in his rise to power. These individuals, who Tobi claims to have \u0022saved,\u0022 have been accused of doing his dirty work—coercing people, demanding money, and even abusing vulnerable youngsters.\r\n\r\nIn this livestream, we’ll take a deep dive into the shadowy network of individuals who surround Tobi Adegboyega. Who are these ex-gang members and cult enforcers? How did they transition from street life to becoming key players in SPAC Nation’s operations? And why are so many of them implicated in allegations of fraud, abuse, and exploitation?\r\n\r\nFrom obtaining money under false pretenses to intimidating those who speak out, Tobi’s goons have caused untold harm—and their actions continue to surface in shocking new videos and testimonies.\r\n\r\nJoin us as we expose the disturbing dynamics of this cult-like operation, the role these young men play, and how Tobi manipulates their loyalty to maintain his empire. This isn’t just about Tobi—it’s about the system of enablers who help him exploit and harm others.\r\n\r\nLet’s shine a light on the truth and demand accountability for everyone involved in this toxic web of deceit.\r\n\r\nSIGN THE PETITION TO DEPORT TOBI AND POLICE TO LOOK INTO THE ALLEGATIONS \r\n\r\nhttps://www.change.org/p/deport-pastor-tobi-adegboyega-justice-for-victims-of-spac-nation-s-fraud-and-abuse\r\n\r\n#pastortobi #SPACNation #bbc #huffpost #huffingtonpost #ReligiousScams #CultLeaderExposed #TobiAdegboyega #JusticeForVictims #ScamExposed #ReligionAndExploitation #Deportation #AccountabilityNow #ExposingScammers #CultWatch #StopReligiousAbuse #AtheistPerspective #CallOutTheScam #JusticeMatters\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-31T00:31:08Z",
      "duration": "03:06:18",
      "explicit": false,
      "youTubeId": "IbmnDR_wdMc",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IbmnDR_wdMc"
      }
    },
    {
      "id": "deb63645-677f-40d1-9ff0-1bf543ee14c2",
      "title": "Tobi Adegboyega\u0027s Meltdown: Attacks on UK Officials \u0026 the Preacher’s Inevitable Fall",
      "description": "Tobi Adegboyega, the controversial preacher and cult leader, appears to be crumbling under pressure. In his latest unhinged rant, he lashed out at UK government officials, calling Labour leader Keir Starmer a \u0022dullard\u0022 and suggesting government officials should be working in grocery stores instead of in office because, according to him, they “don’t know how to raise wealth.”\r\n\r\nHow does a self-proclaimed man of God justify such blatant disrespect and arrogance toward the very system that gave him a platform to thrive? And why is he so bold in attacking the country that’s now seeking to deport him for his alleged scams and abuses?\r\n\r\nIn this livestream, we’ll dissect Tobi’s latest meltdown, his outrageous claims, and what this means for his crumbling empire. How does someone claiming to represent God descend into such chaotic behavior? As an atheist, I’ll explore the irony of preachers like Tobi using religion as a shield for their actions while simultaneously attacking the structures they rely on.\r\n\r\nJoin me as we unpack the drama, expose the hypocrisy, and discuss why Tobi’s fall from grace is long overdue. Don’t miss this explosive conversation—justice is catching up, and the world is watching!\r\n\r\n#tobiadegboyega #spac #spacnation #JusticeForVictims #keirstarmer #naija #nigeria #DeportTobiAdegboyega #StopReligiousAbuse #AccountabilityNow #SPACNationExposed\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-29T19:38:17Z",
      "duration": "03:16:56",
      "explicit": false,
      "youTubeId": "dWOrQIKgDI8",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dWOrQIKgDI8"
      }
    },
    {
      "id": "c496b377-1d3c-4183-9199-2b68b8b6afb9",
      "title": "Pastor Tobi’s In Trouble? Fear, Desperation, and Cult-Like Control Exposed",
      "description": "Pastor Tobi Adegboyega’s recent sermons reveal a man under immense pressure. His fear is palpable, and the cracks in SPAC Nation are becoming more visible with every word he speaks. It’s clear that Tobi is petrified as his grip on his followers begins to weaken, and his disregard for the well-being of the young people in his church is more apparent than ever.\r\n\r\nIn this livestream, we’ll analyse his latest messages and expose the cult tactics he uses to maintain control. It’s time to encourage his members to think critically, see through the manipulation, and reclaim their independence from this toxic environment. Let’s break down the lies, highlight the truth, and push for accountability.\r\n\r\nSIGN THE PETITION TO HAVE TOBI DEPORTED HERE AND POLICE TO LOOK INTO THE ALLEGATIONS OF FRAUD AGAIN https://chng.it/6YDtDVVMzw\r\n\r\n\r\n#spacnation #tobiadegboyega #cultleaders #religiousabuse #justiceforvictims #nigeria #naija #stopchurchabuse #calloutmanipulation #exposetoxicleaders #freethinkers #atheistperspective\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-28T02:40:58Z",
      "duration": "04:11:39",
      "explicit": false,
      "youTubeId": "j-191zmDQPE",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j-191zmDQPE"
      }
    },
    {
      "id": "8623a61d-4392-473b-98a2-89f6e5abb124",
      "title": "SPAC Nation’s Inner Circle: Ex-Gang Members and Alleged Criminal Leaders",
      "description": "SPAC Nation is not just a church—it’s a network of individuals with deeply troubling pasts, raising questions about its operations and leadership. Many of the men and women in Tobi Adegboyega’s circle, like Sam Akokhia, have histories as ex-gang members or criminals, yet they hold key positions in this so-called ministry. Sam, who has a history that’s both alarming and revealing.\r\n\r\nThen there’s Pastor Enrique, accused of abusing a young boy in one of SPAC Nation’s infamous “trap houses.” Despite their controversial pasts, they remain loyal to Tobi, seemingly willing to fight for him without truly understanding why. Why do individuals with such checkered histories follow a man like Tobi Adegboyega?\r\n\r\nJoin me as we dissect the backgrounds of these SPAC Nation leaders and discuss how this alleged cult perpetuates a cycle of exploitation and harm.\r\n\r\nHashtags:\r\n#spacnation #tobiadegboyega #catchherifyoucan #nigeria #naija #thenxtionfamily #daddyfreeze #spiritualabuse #religiousabuse #cultleaders #justiceforvictims #stopchurchabuse #calloutcriminals #scamalert #atheistperspective\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-22T19:02:04Z",
      "duration": "03:02:18",
      "explicit": false,
      "youTubeId": "2Ff_WfoVEB4",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2Ff_WfoVEB4"
      }
    },
    {
      "id": "91b1f526-04b2-4108-90da-873fb2cbc868",
      "title": "Tobi Adegboyega’s Inner Circle: Who Are the Women Defending Him?",
      "description": "Let’s dive into the intriguing dynamics of Tobi Adegboyega’s church—or cult—and the women who passionately defend him. From Mariam Mola, a leader with a highly controversial past exposed in the documentary Catch Her If You Can, to Pastor Nicki, who once instructed followers to “borrow, beg, and steal” to fund Tobi’s birthday, the loyalty of these women raises serious questions.\r\n\r\nWhy do these women stand by Tobi despite his alleged exploitation and questionable leadership? What is the appeal of his authority, and how does it enable manipulative practices within SPAC Nation? Join us as we analyze their behavior, motivations, and the impact they’ve had on this cult-like organization.\r\n\r\n#tobiadegboyega #spacnation #catchherifyoucan #cultleadership #nxtionfamily #mariammola #pastornicki #religiousabuse #justiceforvictims #stopchurchabuse #cultdynamics #atheistperspective #scams #ukchurch #unitedkingdom\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-21T20:34:52Z",
      "duration": "04:05:20",
      "explicit": false,
      "youTubeId": "yd8hpn6wpMI",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yd8hpn6wpMI"
      }
    },
    {
      "id": "fe1ca378-fe61-4fd1-abc0-c344e8a05d01",
      "title": "THE CULT OF JERRY EZE #jerryeze #nsppd #pastorjerryeze",
      "description": "Let’s dig int this and discover what x is going on in NSPPD \r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-21T02:59:23Z",
      "duration": "05:19:41",
      "explicit": false,
      "youTubeId": "J3Rr0DVIMYM",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J3Rr0DVIMYM"
      }
    },
    {
      "id": "00e7868e-76ef-499e-92f6-9c9f6932ee7c",
      "title": "Tobi Adegboyega Grilled by Seun Okinbaloye: Evading Questions \u0026 Exposed Again",
      "description": "Tobi Adegboyega recently sat down with Seun Okinbaloye of Channels TV, and it was nothing short of riveting. Seun masterfully held Tobi accountable, asking sharp and valuable questions that demanded honest answers. Unfortunately, Tobi resorted to evasive tactics, further exposing his dishonesty and questionable leadership.\r\n\r\nIn this livestream, we’ll review the interview, analyse Tobi’s evasiveness, and discuss how his shenanigans continue to unravel under public scrutiny. Join us as we break down this revealing moment and push for accountability from self-proclaimed leaders like Tobi Adegboyega.\r\n\r\n#tobiadegboyega #channelsinterview #seunokinbaloye #spacnation #pastors #cultleader #exposetoxicleaders #justiceforvictims #religiousfraud #calloutpreachers #atheistperspective\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-20T02:07:22Z",
      "duration": "03:33:05",
      "explicit": false,
      "youTubeId": "cko8EyR4ULU",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cko8EyR4ULU"
      }
    },
    {
      "id": "a2404567-d1db-4192-9426-26ce90881222",
      "title": "SPAC IS A CULT: Tobi Adegboyega’s Cult Leadership Unveiled",
      "description": "SPAC Nation has long been accused of operating as a cult, and the evidence against Tobi Adegboyega is overwhelming. From manipulation tactics to financial exploitation and psychological control over his followers, the actions of this so-called church fit every definition of a cult.\r\n\r\nIn this livestream, we’ll break down the proof that SPAC Nation is not a church but a dangerous cult under the leadership of Tobi Adegboyega. Join me as we analyze testimonies from victims, highlight documented practices, and explore the lasting damage this organization has caused. It’s time to shine a light on the truth and demand justice.\r\n\r\nHashtags:\r\n#spacnation #tobiadegboyega #nigeria #naija #christianity #cultleader #religiousabuse #justiceforvictims #exposetoxicleaders #calloutcult #stopchurchabuse #scamalert #atheistperspective\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-19T01:09:55Z",
      "duration": "02:55:38",
      "explicit": false,
      "youTubeId": "2EBIIcFNs04",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2EBIIcFNs04"
      }
    },
    {
      "id": "f43697e4-0646-4d9e-a314-ad159e0acca1",
      "title": "TOBI ADEGBOYEGA EXPOSED: Caught Lying About the Charity Commission",
      "description": "Pastor Tobi Adegboyega has been caught in yet another lie—this time about his engagement with the Charity Commission. His web of deceit is unraveling as he struggles to keep up with his own falsehoods. How many more lies will it take before the world sees the truth about this so-called leader?\r\n\r\nJoin me as we dissect his latest claims, expose his inconsistencies, and highlight the ongoing issues with SPAC Nation’s dealings. This will be a must-watch stream as we connect the dots and hold him accountable for his actions.\r\n\r\nHashtags:\r\n#tobiadegboyega #spacnation #naija #nigeria #scam #cult #charitycommission #religiousfraud #justiceforvictims #exposetoxicleaders #scamalert #stopchurchabuse #liarsunmasked #atheistperspective\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-18T00:54:18Z",
      "duration": "03:58:22",
      "explicit": false,
      "youTubeId": "eVomARv8D-I",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eVomARv8D-I"
      }
    },
    {
      "id": "dd278db3-94d9-4638-84a9-eb81faaff54b",
      "title": "Tobi Adegboyega is Unraveling: Fear and Chaos After the BBC Exposé\u0022",
      "description": "Since the explosive BBC 5-minute interview aired, Tobi Adegboyega has been visibly shaken, acting irrationally and mobilizing his followers to engage in alarming behavior. These desperate moves reveal a cult leader losing control and scrambling to protect his crumbling empire.\r\n\r\nIn this livestream, we’ll analyze his erratic reactions, the dangerous mobilization of his inner circle, and the broader implications of this unraveling situation. Why is Tobi so scared? What does this mean for the victims of SPAC Nation and their fight for justice? Let’s unpack the truth behind the chaos and hold Tobi accountable.\r\n\r\n#tobiadegboyega #bbcinterview #spacnation #cultleaders #justiceforvictims #religiousabuse #scamalert #calloutpreachers #stopchurchabuse #atheistperspective\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-15T20:29:14Z",
      "duration": "03:43:05",
      "explicit": false,
      "youTubeId": "z1CWzu06bS0",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=z1CWzu06bS0"
      }
    },
    {
      "id": "df813f9a-9621-4869-81e0-e8072b10bac0",
      "title": "Pastor Tobi is in Serious Trouble: BBC and Daddy Freeze Interviews Expose His Crumbling Empire",
      "description": "Tobi Adegboyega recently faced tough scrutiny in a BBC interview that, in just five minutes, completely unraveled his composure and exposed his cult-like leadership tactics. The interviewer’s sharp questioning left Tobi defensive, further revealing cracks in the carefully curated image he tries to maintain.\r\n\r\nAdding to this, Tobi appeared on Daddy Freeze’s show, where his attempts to salvage his reputation only deepened the contradictions and showcased the crumbling foundation of his empire. From manipulative practices to alleged exploitation, these interviews reveal the undeniable truths about the man behind SPAC Nation.\r\n\r\nJoin us as we break down these explosive interviews, exposing the tactics, lies, and manipulation Tobi continues to rely on while his empire falls apart.\r\n#theafroatheist #tobiadegboyega #spacnation #bbcinterview #daddyfreeze #exposetoxicleaders #religiousabuse #cultleadership #justiceforvictims #calloutscammers #atheistperspective\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-15T01:26:15Z",
      "duration": "04:00:49",
      "explicit": false,
      "youTubeId": "7P1K7qsKVVw",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7P1K7qsKVVw"
      }
    },
    {
      "id": "66b86b27-6aba-4957-8239-b89fb84e8a50",
      "title": "Tobi Adegboyega \u0026 Daddy Freeze: Hypocrisy in Plain Sight?",
      "description": "Freeze recently sat down to discuss how Christianity has destroyed Nigeria—a bold claim from two men who still align themselves with the title of \u0022pastor\u0022 and use the name of Jesus to build their platforms. If they recognize the harm religion has caused, why do they continue to participate in it?\r\n\r\nIn this livestream, we’ll break down the hypocrisy of their positions and dissect their conversation. Are they truly questioning the system, or are they simply shifting the narrative for their gain? Join us as we expose the contradictions in their claims, examine their influence, and discuss the broader implications of their actions.\r\n\r\nHashtags:\r\n#tobiadegboyega #daddyfreeze #christianityinnigeria #hypocrisyexposed #religiousfrauds #deconstructingfaith #atheistperspective #calloutpreachers #stopreligiousabuse #accountabilitynow\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-10T01:13:30Z",
      "duration": "03:01:14",
      "explicit": false,
      "youTubeId": "Cy2w7m5ai2c",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Cy2w7m5ai2c"
      }
    },
    {
      "id": "85b26350-2867-4820-85c2-422394de867d",
      "title": "PASTOR TOBI ADEGBOYEGA: The Voices of SPAC Nation Victims",
      "description": "Join us as we react to, shed light and bring to the remembrance of people the powerful testimonies of those who were impacted by SPAC Nation, the controversial church led by Pastor Tobi Adegboyega. These brave individuals shared their heartbreaking experiences of financial exploitation, manipulation, and abuse at the hands of a man who has taken advantage of vulnerable people for too long.\r\n\r\nThis is more than just a reaction—it\u0027s a call to action. Pastor Tobi must not be allowed to continue this cycle of harm. It’s time we stand with the victims, amplify their voices, and demand justice. How has he managed to avoid accountability? Why is this man still allowed to operate freely?\r\n\r\nWe’ll explore these questions and discuss the urgent need for collective action to ensure no one else falls victim to this so-called \u0022man of God.\u0022 Together, we can push for change and justice for all those affected.\r\n\r\nSign the petition: https://www.change.org/p/deport-tobi-adegboyega-justice-for-the-victims-of-spac-nation?source_location=search\r\n\r\n\r\n#spacnation #pastortobi #justiceforvictims #stopreligiousabuse #exposingscammers #calloutreligiousfrauds #fightforjustice #endexploitation #victimsvoices #accountabilitynow\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-08T16:44:03Z",
      "duration": "04:20:54",
      "explicit": false,
      "youTubeId": "EKl9gCg5jH0",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EKl9gCg5jH0"
      }
    },
    {
      "id": "2c6b4e57-e360-464a-8ebb-88984da8b1c4",
      "title": "PASTOR TOBI: Justice for the Victims – Why He Must Be Deported Now!",
      "description": "Pastor Tobi Adegboyega has left a trail of pain and exploitation in the UK, targeting vulnerable young people while living a life of unimaginable luxury. Despite numerous testimonies and documented evidence of manipulation and financial abuse, he continues to evade justice.\r\n\r\nIn this livestream, we’ll discuss why Tobi Adegboyega must be deported immediately and hold accountable for the harm he’s caused. How has he managed to stay in the UK for so long? Why do people still support him despite overwhelming evidence of his wrongdoings?\r\n\r\nJoin the conversation as we call for justice for his victims, demand action from the UK government, and explore how religion is often used as a shield for exploitation. It\u0027s time to speak up and take a stand.\r\n\r\nLet’s talk about the real cost of his actions and how we can help make sure no one else suffers at his hands.\r\n\r\n#pastortobi #spacnation #deportpastortobi #justiceforvictims #religiousscams #calloutscammers #stopreligiousabuse #ukjustice #accountabilitynow #atheistperspective\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-12-08T01:56:12Z",
      "duration": "03:57:10",
      "explicit": false,
      "youTubeId": "AC3L2x7zLV0",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AC3L2x7zLV0"
      }
    },
    {
      "id": "d067e2fa-9aed-410a-b825-4dd112dd720a",
      "title": "TOBI ADEGBOYEGA: SIGN THE PETITION TO HAVE HIM DEPORTED",
      "description": "JOIN THE CONVERSATON \r\nhttps://chng.it/YsrngWqPkj",
      "release": "2024-12-07T00:20:23Z",
      "duration": "03:01:30",
      "explicit": false,
      "youTubeId": "x4EOnZlRieM",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x4EOnZlRieM"
      }
    },
    {
      "id": "34391eab-1e82-422b-8208-d53c0efb4347",
      "title": "CULT LEADER TOBI ADEGBOYEGA: Set to be deported  from the UK over being illegal and  £1.87m fraud",
      "description": "The flashy, self-styled pastor and cult leader Tobi Adegboyega is finally facing deportation after years of scamming vulnerable people under the guise of faith. Known for his extravagant lifestyle, designer suits, and luxury cars, Tobi’s SPAC Nation church was a front for manipulation and financial exploitation, targeting young people desperate for hope.\n\nThis video uncovers the shocking details of Tobi’s schemes, the heartbreaking stories of his victims, and the long-overdue justice being served. How did a man with so many allegations against him operate unchecked for so long? And why are authorities only acting now?\n\nAs an atheist, I’m here to break down how figures like Tobi use religion as a tool for personal gain, leaving devastation in their wake. Join me as I expose the truth behind Tobi the cult leader and discuss why his deportation is just the beginning of holding exploitative preachers accountable.\n\nJustice is finally catching up with him—let’s talk about it!\n#PastorTobi #SPACNation #ReligiousScams #CultLeaderExposed #TobiAdegboyega #JusticeForVictims #ScamExposed #ReligionAndExploitation #Deportation #AccountabilityNow #ExposingScammers #CultWatch #StopReligiousAbuse #AtheistPerspective #CallOutTheScam #justicematters",
      "release": "2024-12-05T15:00:28Z",
      "duration": "00:20:33",
      "explicit": false,
      "youTubeId": "VQkGVEC2Ji0",
      "subjects": [
        "SPAC Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VQkGVEC2Ji0"
      }
    },
    {
      "id": "4384ed49-dbfd-42b0-bad2-246a29989cf3",
      "title": "Exposing the Cult of Timilahujah Jibiramih: A Church Gone Wild?\u0022",
      "description": "What on earth is going on with Timilahujah Jibiramih and the so-called \u0022Baba Eri,\u0022 Timilehin, King of Wealth and Spiritual Guru? A bizarre branch of the Cherubim and Seraphim International has emerged, shrouded in cult-like practices and questionable claims. In this livestream, we’ll dig deep into their doctrines, their self-proclaimed king’s antics, and the disturbing ways they manipulate their followers. Is this faith or a full-blown scam? Let’s unravel the truth behind this modern-day cult. Don’t miss it! #nigeria #cult #delusions\r\n\r\n#ExposeTheTruth #CultWatch #AfroAtheist\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5719281357291520",
      "release": "2024-11-30T23:43:36Z",
      "duration": "01:09:18",
      "explicit": false,
      "youTubeId": "RealhuiAT8g",
      "subjects": [
        "Timilahujah Jibiramih"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RealhuiAT8g"
      }
    },
    {
      "id": "5af96235-a5ed-4db2-b464-fca670a04575",
      "title": "The Fake Miracles of Jerry Eze and Questioning the God Claims",
      "description": "Join the convo\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5719281357291520",
      "release": "2024-11-14T01:00:43Z",
      "duration": "03:19:33",
      "explicit": false,
      "youTubeId": "fIuIpWQ19Fo",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fIuIpWQ19Fo"
      }
    },
    {
      "id": "8ab60106-7611-4626-99e9-f2faf8b4a72f",
      "title": "IS JERRY EZE A FAKE MAN OF GOD STAGING MIRACLES?",
      "description": "Join us in this awesome convo\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5719281357291520",
      "release": "2024-11-13T02:39:16Z",
      "duration": "03:05:39",
      "explicit": false,
      "youTubeId": "LgTgnroh3lw",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LgTgnroh3lw"
      }
    },
    {
      "id": "54dbc5a1-6aa3-4862-8def-381d77024334",
      "title": "Is Jerry Eze staging Miracles? The Preacher and the Lame Woman",
      "description": "Join the conversation \r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5719281357291520",
      "release": "2024-11-12T06:50:13Z",
      "duration": "05:40:37",
      "explicit": false,
      "youTubeId": "7P7L9IeZXjY",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7P7L9IeZXjY"
      }
    },
    {
      "id": "9c62db92-0515-453e-bd3a-746b090a0bc8",
      "title": "Jerry Eze: How he is destroying lives",
      "description": "Join me in this conversation about Christianity in Africa and how the religion in the hands of people like Jerry Eze is destroying the lives of people. Christianity does not belong in Africa or two Africans and it is time to have this conversation.",
      "release": "2024-11-09T02:12:30Z",
      "duration": "04:30:16",
      "explicit": false,
      "youTubeId": "rksVQV6W3Es",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rksVQV6W3Es"
      }
    },
    {
      "id": "bc14a889-42e5-40a6-8a67-287ae52d1cba",
      "title": "KATHRYN KRICK: Dangerous Exorcisms on Children",
      "description": "Join us as we dive into the disturbing practices of Kathryn Krick, the lead pastor of Five-Fold Church in Los Angeles, who has built a platform by claiming to cast out demons—even from children. Kathryn Krick’s approach to \u0022deliverance\u0022 raises serious ethical concerns, with troubling methods that involve labeling young kids as demon-possessed and using intense rituals to \u0022lay hands\u0022 on them. This livestream will challenge her barbaric practices, questioning how this impacts children’s mental and emotional well-being. As atheists, we’re deeply concerned about these practices under the guise of faith. It’s time to call out Kathryn Krick and advocate for the safety and protection of these vulnerable children. \r\n#theafroatheist\r\n#kathrynkrick #childsafety\r\n#atheistperspective\r\n#exposingkathrynkrick\r\n#stopreligiousabuse\r\n#fivefoldchurch\r\n#protectthechildren\r\n#criticalthinking\r\n#endchildexorcisms\r\n#religiousaccountability\r\n#atheism\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-11-07T22:10:57Z",
      "duration": "02:12:20",
      "explicit": false,
      "youTubeId": "_cgOC01lLv0",
      "subjects": [
        "Five-Fold Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_cgOC01lLv0"
      }
    },
    {
      "id": "10331cf7-a64c-4de8-a31b-894b19be5158",
      "title": "The Madness of The Lord\u0027s Chosen Church: A Deep Dive into Cult-Like Practices",
      "description": "Join us for a no-holds-barred critique of The Lord\u0027s Chosen Church as we uncover the bizarre and disturbing practices that have gone viral. As atheists, we’ll dissect the wild sermons, fanatical behavior, and cult-like tactics of this movement, exposing the manipulation and madness that happens behind the scenes. With my friends, we’ll break down the most outrageous clips and explore why this church has gained such a following. Get ready for some serious skepticism, laughter, and eye-opening revelations! #thelordschosen #lazarusmuoka #religion #christianity\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5719281357291520",
      "release": "2024-09-23T20:09:27Z",
      "duration": "01:48:09",
      "explicit": false,
      "youTubeId": "XQfK9wrPJYA",
      "subjects": [
        "Lazarus Muoka"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XQfK9wrPJYA"
      }
    },
    {
      "id": "1351d5a9-52a0-4f8a-8c19-fdc8f85d1d61",
      "title": "Exposing Jerry Eze’s Controversial Teachings on Summoning People’s Spirits",
      "description": "In this live stream, we’ll dive into the controversial teachings of Jerry Eze, an online preacher/content creator who encourages his followers to summon the spirits of people they\u0027ve had conflicts with rather than addressing issues directly. As an atheist, I don\u0027t believe in spirits, but the practice raises serious ethical questions. Why avoid healthy conversations and conflict resolution? Isn’t this the definition of witchcraft and evil? \r\nJoin the discussion as we unpack the implications of this bizarre advice and explore its impact on those who follow it. Is this truly spiritual guidance, or just a way to avoid facing reality? Tune in and share your thoughts\r\n#jerryeze #nsppd #nsppdian\r\n\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-09-16T16:42:21Z",
      "duration": "01:53:23",
      "explicit": false,
      "youTubeId": "5noHUuI79JQ",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5noHUuI79JQ"
      }
    },
    {
      "id": "90e9ae4c-a86c-4898-b5ec-e0ca02986ea4",
      "title": "The Henry Family: How the Parents can negatively impact on the children",
      "description": "#thehenryfamily #beliefs #god \r\nIn this livestream, we explore the story of the Henry family, a family of 2 parents and 8 kids who decided to share their lives and family business on YouTube. The mother claims that God instructed her to homeschool their children, sparking questions about the impact of parental beliefs on children\u0027s upbringing. As an atheist, I delve into the potential consequences of raising kids under such convictions, asking whether this is truly what the children need. Is it possible that such beliefs could be harmful? And how can we be certain that divine guidance is at play? Let’s discuss the implications of faith-based decisions in parenting and their effects on children. \r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-09-13T10:46:38Z",
      "duration": "01:42:44",
      "explicit": false,
      "youTubeId": "bH_VOriAaKo",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bH_VOriAaKo"
      }
    },
    {
      "id": "c268676a-801e-44f3-bd60-c737b9ed9744",
      "title": "Is Jerry Eze the Highest Paid Youtuber/Pastor breeding a Cult?",
      "description": "Let\u0027s have a conversation \r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5719281357291520",
      "release": "2024-09-06T01:01:47Z",
      "duration": "03:56:07",
      "explicit": false,
      "youTubeId": "S85gfymHlZA",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S85gfymHlZA"
      }
    },
    {
      "id": "7e91a31a-aba5-4747-a4a5-ccebb89329c1",
      "title": "Jerry Eze and the cult of NSPPD - A conversation about God",
      "description": "Join in the conversation \r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5719281357291520",
      "release": "2024-08-24T03:14:52Z",
      "duration": "06:10:44",
      "explicit": false,
      "youTubeId": "yaQOvzZY2Hs",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yaQOvzZY2Hs"
      }
    },
    {
      "id": "c563e4d6-beea-4d39-89f6-cf959dc620c6",
      "title": "Jerry Eze and the Cult of NSPPD: A Critical Look at Blind Faith",
      "description": "#jerryeze #nsppd #nsppdian Join us for an in-depth analysis of the recent UK conference hosted by Pastor Jerry Eze, known for his online ministry and controversial \u0027miracle\u0027 claims. While his mumu followers are passionately defending these supposed miracles, the evidence tells a different story. They show a complete lack of rational reasoning defending their cult leader.!We\u0027ll dissect the claims, expose the critical thinking flaws in these defences, and explore why so many people are drawn to these easily debunked events. Prepare for a no-holds-barred discussion as we separate fact from fiction in the world of faith and miracles.",
      "release": "2024-08-23T17:55:33Z",
      "duration": "01:38:08",
      "explicit": false,
      "youTubeId": "aQXadc9PuRs",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aQXadc9PuRs"
      }
    },
    {
      "id": "63baaca6-df85-420a-8e98-287d3162f49b",
      "title": "Is Jerry Eze a Cult Leader?",
      "release": "2024-08-18T06:35:05Z",
      "duration": "01:51:35",
      "explicit": false,
      "youTubeId": "PcCyyMxLa2Q",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PcCyyMxLa2Q"
      }
    },
    {
      "id": "8245c022-bcd3-4612-b0f6-809c96e3f7be",
      "title": "Debunking Jerry Eze’s \u0027Miracle\u0027 at London Conference: The Truth Behind the Cerebral Palsy Claim",
      "description": "Welcome to today\u0027s livestream where we critically examine the recent claims made by Jerry Eze at his London conference. In an event that has captured significant attention, Eze has asserted that he healed a child with cerebral palsy, allowing her to walk. However, a closer look at this so-called \u0027miracle\u0027 reveals a disheartening and, frankly, disgusting reality. While the child may have been able to walk, she has not been cured of cerebral palsy.\r\n\r\nAs an atheist committed to truth and rationality, we find it essential to challenge these narratives that exploit vulnerable individuals and perpetuate false hope. We\u0027ll dissect the claims, scrutinise the evidence, and discuss the ethical implications of such assertions. Join us as we seek to uncover the truth behind Jerry Eze’s controversial statement and advocate for genuine, science-based understanding and support for those living with cerebral palsy.\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-08-16T09:44:09Z",
      "duration": "01:41:30",
      "explicit": false,
      "youTubeId": "76ChWP072Ds",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=76ChWP072Ds"
      }
    },
    {
      "id": "17d13cd7-2e91-426a-9177-ac95255188c7",
      "title": "Jerry Eze\u0027s London Crusade: Miracles or Scam? Exploring Claims and Controversies",
      "description": "Join us as we dive deep into the recent sensational crusade by Pastor Jerry Eze in London. Thousands flocked to witness purported miracles and powerful sermons, but is everything as it seems? In this live stream, we will: Examine Jerry Eze\u0027s claims of genuine miracles.\r\nInvestigate accusations and evidence of potential scams.\r\nDiscuss allegations of child abuse within the context of these events.\r\nEngage with us in the chat, share your thoughts, and let\u0027s uncover the truth behind the headlines\r\n\r\nJoin in this great opportunity Want to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/6145677904314368",
      "release": "2024-08-13T00:19:33Z",
      "duration": "02:20:56",
      "explicit": false,
      "youTubeId": "cxQDvLt5WUc",
      "subjects": [
        "Jerry Eze"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cxQDvLt5WUc"
      }
    },
    {
      "id": "65e10cd3-7b8f-4d9c-b865-cab8e9f6c94c",
      "title": "Exposing Abel Damina\u0027s Hypocrisy: The Grift of African Preachers",
      "description": "Join me for a revealing live stream as I delve into the controversial shift of Abel Damina. A African Preacher claiming to have the true gospel of Jesus and Christianity a religion brought to Africa by colonialism and missionaries. Once a staunch advocate for the collection of tithes, Damina has now reversed his stance, presenting himself as a champion of transparency and integrity. But is this change genuine, or is it just another facade to continue exploiting followers for profit?\r\nI will:\r\nUnpack Damina\u0027s contradictory sermons on tithing.\r\nExamine what he teaches under the guise of spirituality. Discuss the broader issue of religious exploitation and the role of pastors in modern-day scams. Don\u0027t miss this eye-opening discussion about the true motives behind Abel Damina\u0027s actions. Tune in, share your thoughts, and help uncover the truth about religious hypocrisy and financial manipulation and ultimately the scam of religion. \r\n\r\n👉 Subscribe and hit the notification bell to stay updated on all our latest exposés and discussions.",
      "release": "2024-07-21T07:55:00Z",
      "duration": "01:46:53",
      "explicit": false,
      "youTubeId": "dl_tBGyDOf8",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dl_tBGyDOf8"
      }
    },
    {
      "id": "4e54d8e5-bca1-4c6a-8232-f600ffc97950",
      "title": "Unmasking the Ohio Cult: Queen Belemzy\u0027s Reign of Power \u0026 Online Witch Hunts",
      "description": "Join us as we delve deep into the disturbing world of the School of Power Ministries, led by the enigmatic Queen Belemzy. In this eye-opening stream, we uncover how this Ohio-based cult operates online, targeting and demonising women who dare to disagree with their leader. Learn how loyal followers, eager to please Queen Belemzyof, produce videos speaking evil, branding dissenters as witches and much worse. Hear from the cult leader Belema and her followers and discover the shocking truth behind this dangerous and manipulative group. Don’t miss this critical exposé",
      "release": "2024-06-29T09:42:57Z",
      "duration": "01:25:09",
      "explicit": false,
      "youTubeId": "8EBxz1m1rwc",
      "subjects": [
        "Queen Belemzy"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8EBxz1m1rwc"
      }
    },
    {
      "id": "5f1f9fee-b1f4-4c65-9dc7-766bf4495909",
      "title": "Africa’s Deadliest Christian Cult- over 400 dead including kids. @Paul Mackenzie",
      "description": "Join me for this one, exposing the evil in the religion of Christianity. This is Kenya’s doomsday cult where victims have crossed the 400 mark as detectives exhumed 12 more bodies on believed to be followers of a pastor who ordered them to fast to death in order to meet Jesus. Apparently the number of those who died has risen to 403, with 95 people rescued.\r\nPaul Mackenzie has been charged with murder after the bodies were found buried in shallow graves in the remote forest of Shakahola in the east of the country.\r\nSurvivors and victims\u0027 families have said Paul Mackenzie urged followers to fast in order to \u0022go see Jesus\u0022.\r\nHe and 29 others pleaded not guilty in a court in the coastal town of Malindi.\r\nMackenzie has already been charged with committing acts of terror, child cruelty and torture, which he denied.",
      "release": "2024-03-24T23:04:48Z",
      "duration": "02:20:47",
      "explicit": false,
      "youTubeId": "fK5AwjB6A2k",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fK5AwjB6A2k"
      }
    }
  ]
}