{
  "_ts": 0,
  "id": "b14d3a5a-8dac-496d-b0b8-2ea74bb3ea0b",
  "name": "The Dark Side of Devotion",
  "spotifyId": "1CqYRMInsFI6KkEjHWxd3R",
  "appleId": 1790591854,
  "youTubeChannelId": "UCETwgzHNltc9t7bb5dE7lAA",
  "episodes": [
    {
      "id": "248add94-4006-4e04-8347-4811cf4a08b6",
      "title": "Growing Up in the Universal Church’s Youth Power Group | Our Experiences \u0026 Untold Realities",
      "description": "In this episode of The Dark Side of Devotion, we want to explore the cult-like tactics used in youth groups of high-demand religions. Our personal experiences are in the Youth Power Group (YPG)—the Universal Church’s youth ministry that, on the surface, appears to be a positive and empowering space. But behind the vibrant activities and promises of a better future, many young people are being manipulated, exploited, and groomed for lifelong servitude to the church. We expose how the church reels in vulnerable youth, convincing them to dedicate their time, money, and even their futures to the ministry. Many young men become auxiliary pastors, sacrificing their education and career opportunities to serve the church full-time—often without pay and under extreme pressure. Meanwhile, young women are groomed to become pastors’ wives, conditioned to submit to a life of rigid expectations and obedience. For many who go on to become auxiliaries, the reality is far from the spiritual fulfillment they were promised. They become the backbone of the church, taking on the bulk of the labor while senior pastors take a step back. The church demands everything from them—time, energy, and total devotion—while offering little in return. Many drop out of school, abandon scholarships, and give up promising futures, all in pursuit of what they are told is a divine calling. This is the harsh reality of many youth groups in high-demand environments and in this episode, we share our personal experiences. If you were part of the YPG or something similar, or know someone who has, we’d love to hear your story. Share your thoughts in the comments, tag someone who needs to hear this, and don’t forget to subscribe for more episodes exposing the hidden truths of high-control religious groups. #thedarksideofdevotion #podcast #religioustrauma #cults #religiouscults #healingreligioustrauma #deconstruction #spirituality #highdemandreligion #speakyourtruth #survivinguniversal #survivinguniversalusa #exiurd #exuckg #exvangelical",
      "release": "2025-03-05T13:00:00Z",
      "duration": "01:21:42.9260000",
      "explicit": false,
      "spotifyId": "3mmJ6ao4M2p7e1pXYfaw4Z",
      "appleId": 1000697869920,
      "youTubeId": "W3VXMLKkcvs",
      "subjects": [
        "Universal Church Of The Kingdom Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mmJ6ao4M2p7e1pXYfaw4Z",
        "apple": "https://podcasts.apple.com/podcast/growing-up-in-the-universal-churchs-youth-power-group/id1790591854?i=1000697869920",
        "youtube": "https://www.youtube.com/watch?v=W3VXMLKkcvs"
      }
    },
    {
      "id": "7b45a0f0-ff95-4dd8-b812-c0ec7e96eca7",
      "title": "The Truth About \u0022The Love Therapy\u0022 in the UCKG- Exposing the Harm Behind the Doctrine",
      "description": "In this episode of The Dark Side of Devotion, we take a deep dive into \u0022The Love Therapy\u0022, a widely promoted service within the Universal Church of the Kingdom of God (UCKG/IURD). Marketed as a way to help individuals and couples find love and strengthen relationships, \u0022The Love Therapy\u0022 presents itself as a path to emotional and spiritual fulfillment. But behind the polished messages and orchestrated testimonies lies a more troubling reality. Toxic religious leaders exploit vulnerabilities for control and financial gain.\n\nIf you\u0027ve ever attended \u0022The Love Therapy\u0022, know someone who has, or are just curious about the hidden tactics of high-control religious organizations, this episode is for you.\n\n▶️ Subscribe now and turn on notifications so you don’t miss future episodes uncovering the truth about religious abuse and healing from spiritual trauma.\n\n🎧 Available on YouTube, Spotify, and Apple Podcasts. Let’s keep exposing the truth and reclaiming our power!🔥",
      "release": "2025-02-26T13:00:00Z",
      "duration": "01:32:06.5210000",
      "explicit": false,
      "spotifyId": "3Fka3SmMdGgkE2buOglrfY",
      "appleId": 1000696241000,
      "youTubeId": "80p8Oy1GQgA",
      "subjects": [
        "Universal Church Of The Kingdom Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Fka3SmMdGgkE2buOglrfY",
        "apple": "https://podcasts.apple.com/podcast/the-truth-about-the-love-therapy-in-the-uckg/id1790591854?i=1000696241000",
        "youtube": "https://www.youtube.com/watch?v=80p8Oy1GQgA"
      }
    },
    {
      "id": "f01ed9f4-bd61-4c3d-91f8-0859694e9daa",
      "title": "Ex Pastor of The Universal Church- Tony’s Story (Part 2): In the Thick of High-Demand Religion",
      "description": "In Part 2 of Tony’s story, he takes us deeper into his experience within the church—where the abuse didn’t stop, it only evolved.\n\nAfter years of being conditioned to accept suffering as love, Tony stepped into the class where he was met with relentless control, emotional and psychological abuse, and the crushing weight of expectations designed to break him and those like him. The same system that once made him feel wanted now used him, manipulated him, and drained him of everything he had to give.\n\nFrom spiritual coercion to pressure and punishment for questioning authority, Tony’s journey exposes the dark reality behind the pulpit. His story is a powerful reminder of how these organizations trap not just followers, but also those who serve within them.\n\n🔔 Don’t forget to like, comment, and subscribe for more survivor stories and discussions on religious trauma, cult dynamics, and healing.",
      "release": "2025-02-19T13:00:00Z",
      "duration": "01:10:55.0430000",
      "explicit": false,
      "spotifyId": "0JInGtF2aFTWcfy6a2wsti",
      "appleId": 1000694004414,
      "youTubeId": "K9SGmiwk_xg",
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0JInGtF2aFTWcfy6a2wsti",
        "apple": "https://podcasts.apple.com/podcast/ex-pastor-of-the-universal-church-tonys-story-part-2/id1790591854?i=1000694004414",
        "youtube": "https://www.youtube.com/watch?v=K9SGmiwk_xg"
      }
    },
    {
      "id": "74a308f0-b1ff-437a-9a08-63ec37c6c842",
      "title": "Ex Pastor of The Universal Church/IURD/UCKG- Tony’s Story (Part 1): The Road to High-Demand Religion",
      "description": "In this powerful episode of The Dark Side of Devotion, we begin a two-part deep dive into Tony’s story—his childhood, the oppression he faced, and how his early experiences made him vulnerable to the conditioning of a high-control religious group, resulting in him eventually becoming a Pastor of the UCKG. \n\nTony opens up about his life before the church: the abuse, the shelter living, and the feeling of never truly belonging. From a young age, he was conditioned to endure hardship, to suppress his own needs, and to seek validation wherever he could find it. So when he finally found a community within the church, it felt like love—like acceptance. But was it real? Or was it just another form of control disguised as care?\n\nHis journey sheds light on how early-life experiences can make us susceptible to manipulation, especially by groups that prey on the vulnerable. This episode is an emotional, eye-opening exploration of the ways trauma and indoctrination intertwine.\n\nWatch now and let us know your thoughts in the comments. Have you ever experienced something similar?\n\n🔔 Don’t forget to like, comment, and subscribe for more episodes exposing the truth behind The Universal Church, religious trauma, and other high-control groups.",
      "release": "2025-02-12T13:00:00Z",
      "duration": "00:56:12.7780000",
      "explicit": false,
      "spotifyId": "0dMQ6QtEzhLn5He3kwlCeR",
      "appleId": 1000691423873,
      "youTubeId": "nsd-F2vYFrE",
      "subjects": [
        "Universal Church Of The Kingdom Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dMQ6QtEzhLn5He3kwlCeR",
        "apple": "https://podcasts.apple.com/podcast/ex-pastor-of-the-universal-church-iurd-uckg-tonys/id1790591854?i=1000691423873",
        "youtube": "https://www.youtube.com/watch?v=nsd-F2vYFrE"
      }
    },
    {
      "id": "47948666-d094-4caa-919f-863689b2082a",
      "title": "Ex-Pastor\u0027s Wife of the UCKG Stephanie’s Story, Pt. 2 – But Let’s Get into Everything Else Too",
      "description": "In this episode, we attempt to continue Stephanie’s story… but, true to form, we take a few detours along the way. While touching on Stephanie’s journey, we also dive into a range of unexpected but important conversations—some deep, some hilarious, all unfiltered. From the realities of deconstruction to the strange ways high-control religions shaped our lives, this is our truth and our experience. \n\nJoin us as we unpack our experiences, challenge harmful beliefs, and maybe (definitely) get sidetracked. Because healing isn’t linear, and neither is this episode.",
      "release": "2025-02-05T13:00:00Z",
      "duration": "01:01:41.1080000",
      "explicit": false,
      "spotifyId": "5Abia20WoLUZhiFHMSmSNs",
      "appleId": 1000689308713,
      "youTubeId": "3CgvdKiEeU0",
      "subjects": [
        "Universal Church Of The Kingdom Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Abia20WoLUZhiFHMSmSNs",
        "apple": "https://podcasts.apple.com/podcast/ex-pastors-wife-of-the-uckg-stephanies-story-pt-2/id1790591854?i=1000689308713",
        "youtube": "https://www.youtube.com/watch?v=3CgvdKiEeU0"
      }
    },
    {
      "id": "ccec92a8-6ce2-42f8-9160-6ec986e44464",
      "title": "Episode 3 Stephanie\u0027s Story (Part 1 of 2)",
      "description": "In this episode, we dive into Stephanie’s story—a journey that began in vulnerability and led her deep into the heart of a high-control religious group. She shares how she was drawn in, slowly immersing herself in church life, moving through the ranks to become an assistant, and dedicating nearly every moment to its various groups and activities.\n\nBut with that devotion came loss—loss of time, loss of connection with family, and, most painfully, a loss of identity. What happens when a place that once felt like a refuge becomes a prison? How does one begin to untangle themselves from a belief system that has consumed their entire life?\n\nThis is Part 1 of Stephanie’s powerful and deeply personal story.\n\nTune in, reflect, and join the conversation.",
      "release": "2025-01-29T13:00:00Z",
      "duration": "01:11:56.6460000",
      "explicit": false,
      "spotifyId": "0MSRX4J91wo5mxZqxWhHQq",
      "appleId": 1000686716707,
      "youTubeId": "IBy0IAIGKJk",
      "subjects": [
        "Universal Church Of The Kingdom Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0MSRX4J91wo5mxZqxWhHQq",
        "apple": "https://podcasts.apple.com/podcast/episode-3-stephanies-story-part-1-of-2/id1790591854?i=1000686716707",
        "youtube": "https://www.youtube.com/watch?v=IBy0IAIGKJk"
      }
    },
    {
      "id": "d9bd44fd-512b-4f35-8002-93a4a0f7721c",
      "title": "Episode 2-Sara\u0027s Story",
      "description": "🎙 The Dark Side of Devotion - Episode 2: Sara\u0027s Story\n\nIn this powerful episode of The Dark Side of Devotion, Sara shares her personal story as a bishop\u0027s daughter growing up in a high-demand religious environment. From the pressure of being the \u0022perfect example\u0022 to the congregation to navigating the contradictions and abuse behind the scenes, Sara reveals the emotional, psychological, and spiritual toll of her upbringing.\n\nJoin us as Sara opens up about her journey of healing from religious trauma, and finding her own voice outside the confines of this religious institution. This raw and inspiring episode sheds light on the challenges faced by those born into leadership families within controlling religious organizations.\n\n🔗 Listen Now:\n📌 Healing, deprogramming, and reclaiming autonomy\n📌 Navigating life after leaving a high-demand religion\n📌 Insights for survivors of religious abuse\n\n🌟 Don’t forget to like, subscribe, and share if you resonate with Sara’s story or know someone who might. Let’s build a community of healing and support together.\n\nCredits:\n\nSounds By:\nFreesound.org\n\nVisuals By:\nFreepik.com\n\nVoice By:\nVoicebooking.com",
      "release": "2025-01-22T13:00:00Z",
      "duration": "01:21:59.9770000",
      "explicit": false,
      "spotifyId": "7EGmzuvX17XbboRzWesNAw",
      "appleId": 1000685010910,
      "youTubeId": "eJaP3QXrqn8",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7EGmzuvX17XbboRzWesNAw",
        "apple": "https://podcasts.apple.com/podcast/episode-2-saras-story/id1790591854?i=1000685010910",
        "youtube": "https://www.youtube.com/watch?v=eJaP3QXrqn8"
      }
    },
    {
      "id": "4722bb37-fa4d-442f-b82e-1e2b05f55d66",
      "title": "Episode 1- Some UCKG/IURD History",
      "description": "In the debut episode of The Dark Side of Devotion, co-hosts Anthony, Stephanie, and Sara come together to share how their paths first crossed as teenagers in the Universal Church, a global religious institution with a controversial history. Sara, the daughter of a bishop and born into the church, joins Anthony and Stephanie, who entered the church as teenagers, to recount their shared experiences and how they reconnected years after leaving. This episode also provides an introduction to the church’s history and practices, offering essential context for listeners unfamiliar with its inner workings. Start here as the hosts lay the foundation for a podcast uncovering the realities of life inside—and beyond—the Universal Church.\n\n#cultsurvivor #cultsandextremebeliefs #iurd #uckg #survivinguniversal #survivinguniversalusa #survivinguniversaluk #fyp #podcast #exiurd #exuckg\n\n\nCredits:\n\nSounds By:\nFreesound.org\n\nVisuals By:\nFreepik.com\n\nVoice By:\nVoicebooking.com\n\nBook Mentioned:\nO Reino by Gilberto Nascimento\n\nBook Mentioned:\nO Reino by Gilberto Nascimento",
      "release": "2025-01-15T13:00:00Z",
      "duration": "01:00:17.4910000",
      "explicit": false,
      "spotifyId": "5n9hPVDr1eXTNND9kok8bC",
      "appleId": 1000684087642,
      "youTubeId": "yOR5w2ZDe5U",
      "subjects": [
        "Universal Church Of The Kingdom Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5n9hPVDr1eXTNND9kok8bC",
        "apple": "https://podcasts.apple.com/podcast/episode-1-some-uckg-iurd-history/id1790591854?i=1000684087642",
        "youtube": "https://www.youtube.com/watch?v=yOR5w2ZDe5U"
      }
    }
  ]
}