{
  "_ts": 0,
  "id": "588721cd-2ce1-41ec-9ba4-f2a8543fc04a",
  "name": "The Lo Life",
  "spotifyId": "376XmVCn2uVxbicg9g5844",
  "appleId": 1514680476,
  "episodes": [
    {
      "id": "d21f6d1f-ade8-4410-81c1-4392d0bd7eca",
      "title": "Robin Williams, Mother God and Alcohol As Medicine: Inside The Deadly Cult- Love Has Won",
      "description": "Lo is doing a deep dive into the wild world of cults. He is joined by fellow crime junkie kween- actress and singer Hayley Orrantia. The 2 friends get on the mic to discuss mental health, overpriced Christmas trees and the latest binge worthy documentary trending world wide. The new HBO doc \u0022Love Has Won: The Cult of Mother God\u0022 , is Amy Carlson\u0027s bizarre cult, which ultimately killed her. She created a palace of lies that she could not escape from and utilized social media to spread her message to thousands of people. Hayley and Lo examine the strange life and death of a modern- day spiritual leader. Buckle up putas...you\u0027re in for a wild ride on this one Stay Connected to The Lo Life! Facebook: Join the Cult: The Lo Life FB Group Instagram: Follow your host on IG: @stylelvr Follow The Lo Life on IG: @TheLoLifePodcast TikTok: @lolifepodcast This week\u0027s guest: Hayley Orrantia  Instagram: @HayleyOrrantia TikTok: @HayleyOrrantia Check out her music on Spotify HERE  We have deals and steals for you puta OSEA SKIN CARE: Glowy skin time! Get 10% off your first order, free samples, and free shipping use the code LOLIFE here OUAI HAIR: Use the code LOLIFE for 15% off your purchase. Get healthier hair one day at a time with shampoo and conditioner. OuaiHair.com INTEGRA: Keep your cannabis fresh with Integra boost packs. Fresh flower that stays perfectly preserved. Use code LOLIFE at checkout for 15% off your purchase here Please rate, follow and leave a review to keep this hot mess express going strong. Make sure to drink some water puta... we know you’re thirsty Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-14T09:08:28Z",
      "duration": "01:28:21.0540000",
      "explicit": false,
      "spotifyId": "7LjXri64EYTq3z7GoAH5XS",
      "appleId": 1000638535989,
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7LjXri64EYTq3z7GoAH5XS",
        "apple": "https://podcasts.apple.com/podcast/robin-williams-mother-god-and-alcohol-as-medicine/id1514680476?i=1000638535989"
      }
    }
  ]
}