{
  "_ts": 0,
  "id": "6629da0d-83b6-4c34-85c0-b1409b871836",
  "name": "The Redacted Apostate",
  "spotifyId": "3dcs0D4y1VQHI4B4Buo3CR",
  "appleId": 1734295364,
  "youTubeChannelId": "UCeO_7EoE7YEjNoZXUS0oyEw",
  "episodes": [
    {
      "id": "6571d876-0ff8-4a59-a441-3bce9258f03a",
      "title": "Ruby \u0026 Kevin Franke - New Evidence!",
      "description": "In this episode of The Redacted Apostate, we explore the latest developments surrounding the Hildebrant/Franke saga, incorporating insights from Kevin\u0027s testimony. We delve into Jodi\u0027s unconventional relationships, including her alleged involvement in a thruple with Satan and Jesus. we reflect on the spiritual aspects of the story, discussing Jodi\u0027s purported long walks on the beach with Jesus and her alleged role as a bride of Satan. Reviewing Kevin\u0027s testimony and Ruby\u0027s jailhouse calls of how they fell into Hildebrants circle and trap.\nMusic from #Uppbeat (free for Creators!):https://uppbeat.io/t/danijel-zambo/stardustLicense code: K1NTUCRT5RNDOMJT",
      "release": "2024-04-08T13:00:00Z",
      "duration": "00:51:14",
      "explicit": false,
      "spotifyId": "1bLAL300GmR0jQZ36jCvs0",
      "appleId": 1000651777027,
      "youTubeId": "WdU2kcvnffo",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1bLAL300GmR0jQZ36jCvs0",
        "apple": "https://podcasts.apple.com/us/podcast/ruby-kevin-franke-new-evidence/id1734295364?i=1000651777027",
        "youtube": "https://www.youtube.com/watch?v=WdU2kcvnffo"
      }
    },
    {
      "id": "873a2158-b5e9-4ae6-a489-3934772112c6",
      "title": "Discussing Netflix series; Raël: The Alien Prophet",
      "description": "In this episode of The Redacted Apostate podcast we talk about the Netflix series Raël: The Alien Prophet. This is pretty light hearted episode, but trigger warning about some sexual content and some accusations of CSA. The series was not the best cult documentary we have seen, but it was the funniest. Sex with aliens, 2035 is a big year and we need to get working on that UFO embassy!",
      "release": "2024-04-01T13:00:00Z",
      "duration": "00:36:09.2870000",
      "explicit": false,
      "spotifyId": "6pwX9Y7g5v5Kh3B62v0IB5",
      "appleId": 1000651070374,
      "youTubeId": "RjwlkeWuer8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6pwX9Y7g5v5Kh3B62v0IB5",
        "apple": "https://podcasts.apple.com/podcast/discussing-netflix-series-ra%C3%ABl-the-alien-prophet/id1734295364?i=1000651070374",
        "youtube": "https://www.youtube.com/watch?v=RjwlkeWuer8"
      }
    },
    {
      "id": "b8c5e6be-86f4-475e-ac14-bd6ed8b0f5a5",
      "title": "Discussing Netflix series, The Program; Cons, Cults \u0026 Kidnapping",
      "description": "In this episode of The Redacted Apostate, we delve into the captivating world of Netflix\u0027s latest series, \u0022The Program; Cons, Cults \u0026 Kidnapping .\u0022 This thought-provoking episode confronts the realities of cults, prompting us to reflect on their resonance in contemporary society. As we explore the series, we also draw parallels to the challenges of modern parenting. From the relentless struggles depicted in \u0022The Program\u0022 to the broader societal implications, including the recent Crubmly verdict and its potential impact on similar organizations, our conversation navigates through the complexities of parenthood and accountability. Moreover, we address the controversial influence of figures like Andrew Tate on children and the sense of powerlessness many parents feel when raising difficult kids. Ultimately, our discussion underscores the intertwined nature of media representation, parental struggles, and the quest for societal justice. Join us as we dissect these themes and invite you to share your own insights and experiences. Tune in to The Redacted Apostate for a stimulating dialogue on the issues that matter.",
      "release": "2024-03-25T13:00:00Z",
      "duration": "00:57:53.2130000",
      "explicit": false,
      "spotifyId": "6htBh8utJrFeC4iYOFdcY2",
      "appleId": 1000650366088,
      "youTubeId": "zcVBwUMtOxM",
      "subjects": [
        "Troubled Teen Industry",
        "Hustler\u0027s University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6htBh8utJrFeC4iYOFdcY2",
        "apple": "https://podcasts.apple.com/podcast/discussing-netflix-series-the-program-cons-cults/id1734295364?i=1000650366088",
        "youtube": "https://www.youtube.com/watch?v=zcVBwUMtOxM"
      }
    },
    {
      "id": "91dd8ed0-864f-4848-a570-ba96de40eb4e",
      "title": "Logic vs Emotions - After cult life Making decisions",
      "description": "We\u0027ll also tackle the tricky topic of decision-making. Ever wondered how your brain decides? We\u0027ll explore decision-making, how to make good decisions after leaving a high control group or cult.  And when it comes to making big life choices, like leaving a cult, it\u0027s not just about emotions; logic play a huge role too. So, get ready for an episode packed with stories, insights, and maybe even a few surprises. ",
      "release": "2024-03-21T18:24:00Z",
      "duration": "01:06:00",
      "explicit": false,
      "spotifyId": "2Rxq0IgGEqop01eiYMgf8z",
      "appleId": 1000649576395,
      "youTubeId": "BI03WsoEwGg",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Rxq0IgGEqop01eiYMgf8z",
        "apple": "https://podcasts.apple.com/podcast/logic-vs-emotions-after-cult-life-making-decisions/id1734295364?i=1000649576395",
        "youtube": "https://www.youtube.com/watch?v=BI03WsoEwGg"
      }
    },
    {
      "id": "9b010911-d0e3-4ee5-bcca-009adede1ddd",
      "title": "Break the chain \u0026amp; liberate your mind.",
      "description": "Welcome to our podcast episode on freeing yourself from indoctrination and learning to think independently. Indoctrination can happen in various environments, including high-control groups, cults, and manipulative relationships. We\u0027ll discuss strategies to recognize indoctrination and regain autonomy over your thoughts and beliefs from my own experiences.",
      "release": "2024-03-21T18:23:59Z",
      "duration": "00:49:54",
      "explicit": false,
      "spotifyId": "1BKrsZOqLC87Sc5V6wdYL4",
      "appleId": 1000648770408,
      "youTubeId": "0Eh7geRmGxw",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1BKrsZOqLC87Sc5V6wdYL4",
        "apple": "https://podcasts.apple.com/podcast/break-the-chain-liberate-your-mind/id1734295364?i=1000648770408",
        "youtube": "https://www.youtube.com/watch?v=0Eh7geRmGxw"
      }
    },
    {
      "id": "51268230-2dc6-440b-b3f1-0bcd1b0e4cc7",
      "title": "Discussion about Jodi Hildebrant and Ruby Franke",
      "description": "Discussion revolving around the Youtube Influencer and her suspected brain washing. Conversation about how I feel like I am the only one with a different opinion on the events. Listen to my controversial thoughts.",
      "release": "2024-03-21T18:23:59Z",
      "duration": "00:48:58",
      "explicit": false,
      "spotifyId": "3VLVv0APQivMCdAxJUjQoq",
      "appleId": 1000647988885,
      "youTubeId": "-ncLGaLKh7U",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3VLVv0APQivMCdAxJUjQoq",
        "apple": "https://podcasts.apple.com/podcast/discussion-about-jodi-hildebrant-and-ruby-franke/id1734295364?i=1000647988885",
        "youtube": "https://www.youtube.com/watch?v=-ncLGaLKh7U"
      }
    },
    {
      "id": "d7519b92-8fa4-4547-8869-c60abae854e4",
      "title": "Rebuilding Life After Leaving a Cult",
      "release": "2024-03-18T18:42:28Z",
      "duration": "00:09:39",
      "explicit": false,
      "youTubeId": "1z7gr-QNL5g",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1z7gr-QNL5g"
      }
    },
    {
      "id": "8fd57af2-3841-40ee-bfdd-18e552dbc35b",
      "title": "Navigating Life After Leaving a Cult - When Feeling All Alone",
      "description": "In a world where cults preach exclusion, our YouTube channel stands as a beacon of connection. \u0022Embrace Belonging\u0022 invites everyone, especially those who\u0027ve been told they don\u0027t belong, to find a supportive community that celebrates individuality and unity. Together, let\u0027s defy the isolation imposed by cults and cultivate a sense of belonging in a world that welcomes all.",
      "release": "2024-01-31T15:57:11Z",
      "duration": "00:09:03",
      "explicit": false,
      "youTubeId": "yyQXHoN0eFU",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yyQXHoN0eFU"
      }
    },
    {
      "id": "05948291-c518-42e3-b6f1-e1dec1e5e425",
      "title": "The Unseen Web  Rise of Online Cults",
      "description": "\u0022Why are online cults growing at an alarming rate? Ever pondered this question?\u0022 These digital communities, shrouded in secrecy and often surrounded by controversy, have seen a significant rise in recent years. But what fuels their growth? What makes them so appealing to the digital denizens of the twenty-first century? Let\u0027s start with the basics. An online cult is a group that pursues a particular belief system, ideology, or personality, often to an extreme and exclusionary degree. They thrive on the internet, specifically on social media platforms, where they can easily spread their ideologies and recruit new members.",
      "release": "2024-01-31T00:20:45Z",
      "duration": "00:16:01",
      "explicit": false,
      "youTubeId": "ociNRhYfHGo",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ociNRhYfHGo"
      }
    },
    {
      "id": "d791a328-7b1a-48de-9505-c2ba0f40ecfc",
      "title": "Breaking Free  The Journey from Cult to independent thought",
      "description": "Have you ever paused to ponder how much of your beliefs are truly yours, and how much are influenced by others? This is a question that holds more weight than we often grant it. Our beliefs, these invisible forces that drive our actions and shape our world, are largely shaped by our experiences, the people we meet, and the society we live in.",
      "release": "2024-01-15T13:47:57Z",
      "duration": "00:10:11",
      "explicit": false,
      "youTubeId": "jsDP-5lr-ZE",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jsDP-5lr-ZE"
      }
    },
    {
      "id": "6aa31eef-2798-43f2-bc36-c505295a8e92",
      "title": "Overcoming Cult Induced Fears",
      "description": "Many times a high control group or cult uses leaving as a weapon, used to keep you from questioning, from doubting. It\u0027s a leash that keeps you tied to the group, a chain that binds you. And the worst part is, this fear doesn\u0027t just disappear when you decide to break free. It lingers, like a shadow, following your every step. This video will give you some tools to aid you in your quest for freedom from this control. You are a valuable person, and you should be in control of your own life. Sending you so much love in your journey.",
      "release": "2024-01-13T15:30:29Z",
      "duration": "00:09:35",
      "explicit": false,
      "youTubeId": "CtLS_gDYnVQ",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CtLS_gDYnVQ"
      }
    }
  ]
}