{
  "id": "98ff7b65-bcf6-40e6-8cd2-a4aa91a007f5",
  "name": "The Things You Can\u0027t Touch",
  "appleId": 1763685662,
  "youTubeChannelId": "UC0JvGhVEWzjtNdYztHLjxmA",
  "episodes": [
    {
      "id": "dd3832ac-caf3-4ad7-98a9-e74b6675ce6e",
      "title": "E27 - Is There A Difference Between A Community And A Cult ?",
      "description": "Trigger Warning: sexual assault, rape, trauma, and cult-related discourse.\n\nPlease take care of yourself while watching. This is a heavy and emotionally charged conversation.\n\nWelcome back to another episode of The Things You Can\u0027t Touch !\n\nIn this video, I sit down with Leah Lauder, a megachurch cult survivor and mental health advocate you might know from TikTok. Leah brings invaluable insight from her lived experience and knowledge of cult dynamics as we discuss some very difficult, yet necessary, topics.\n\nWe talk about the recent allegations against Stepz, the disturbing way some are defending him through the lens of Christianity, and how this ties into wider patterns of abuse and control within high-control religious groups. Leah also helps unpack how cult leaders place themselves equal to, or even above, God, creating environments where manipulation and harm can thrive unchecked.\n\nThis is not an easy conversation, but it is an important one. If you have experienced any form of abuse, please consider whether now is the right time to watch. Your wellbeing comes first. \n\nWe should keep shining a light on these issues and hold space for survivors. Follow our conversation here:\n\n00:00 - Introduction\n03:24 - Is There A Difference Between A Community And A Cult ?\n05:12 - Characteristics Of A Cult\n06:29 - Guilt Makes You Vulnerable\n08:35 - Reminder That This Is A Heavy Topic\n12:38 - Stepz\n16:00 - Paul Tillich And Deification\n17:10 - The Cross Road ... Be Careful In These Streets\n21:13 - Self Sealing System\n23:55 - The People Who Are Oppressed Are Oppressing Themselves\n29:50 - Theological Awareness \n32:19 - Cloning, Offline, Psychological Terminology\n32:49 - SPAC Nation And Cult Intimidation\n34:57 - How I Got Into Podcasting\n36:07 - Sadism, The Transcendent Belief System, And More Psychological Terminology\n39:25 - The Pastors Themselves\n42:19 - Is Leah Christian ?\n47:30 - Sexual Assault In Cults\n51:10 - Erving Goffman ... People Are Performing And Triangulation ???\n55:35 - Stepz (Again) And Shout Out To UKThanos\n59:00 - Prove Yourself\n1:02:27 - What Did You Do ?\n1:03:50 - Recruitment\n1:08:50 - Christians Are So Dumb\n1:11:20 - What Makes You Susceptible To Cults (And Many A Detour)\n1:18:40 - The Structure Of A Cult\n1:22:35 - What If Cults Are A Community ?\n1:23:57 - Cults To Stay Away From\n1:27:11 - Outro\n\nThank you for following our chat up until this point ! Make sure to share this video with anyone you think needs to hear this. \n\nFinally, and most importantly, make sure to keep up with Leah Lauder on her socials:\n\nTikTok:\nLeahLauder7\n\nInstagram:\nLeahLauder_777\n\nYou Tube: \n@leahlauder777",
      "release": "2025-08-08T17:00:06Z",
      "duration": "01:27:28",
      "explicit": false,
      "appleId": 1000721299011,
      "youTubeId": "fByPHeXz8Ak",
      "subjects": [
        "Dag Heward-Mills",
        "SPAC Nation",
        "_London"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/e27-is-there-a-difference-between-a-community-and-a-cult/id1763685662?i=1000721299011",
        "youtube": "https://www.youtube.com/watch?v=fByPHeXz8Ak"
      }
    }
  ]
}