{
  "_ts": 0,
  "id": "83fccd6d-bb29-48d7-a4a3-c0dc06e560ac",
  "name": "The Today Counts Show",
  "spotifyId": "4zpIjBXvi2oQ6fEDPaRuSY",
  "appleId": 1606257485,
  "episodes": [
    {
      "id": "f571080c-5e31-4375-9880-a74418f6e68f",
      "title": "Ep. 102 - Stop The Tall Man, Save The Tiger: Peter Young",
      "description": "This episode of the Today Counts Show is really fascinating and sad at the same time. Jim welcomes Peter Young to the podcast. Peter played college basketball at George Washington University and briefly coached basketball before embarking on a career as a sports broadcaster. He is the author of two books, \u0022 The Blue Team \u0022 and \u0022 Stop The Tall Man, Save The Tiger \u0022. That \u0022micro\u0022 bio sounds normal and to most of Peter\u0027s friends and co-workers, his life with his wife and five children was normal. However, it was anything but normal. Jim and Peter discuss Peter\u0027s book, \u0022Stop The Tall Man, Save The Tiger\u0022. The book is not fiction it is a memoir. It is the story of his journey in and out of a cult. Even more bizarre is the cult itself. A small family cult led by the strange and ultimately manipulative Uncle Robert (of no actual family relation) that Peter\u0027s wife had know her entire life. When Jim asks Peter how he let himself get involved Peter says that, like all cult leaders, Uncle Robert didn\u0027t seem radical at first. Cult leaders lure you in with normal, reasonable ideas at first and then slowly twist scripture and teachings and manipulate you over time. As Peter says, \u0022You never know you are in a cult; you only know you were in a one.\u0022 You have to listen and hear this story straight from the man who lived it. It will seem like an unbelievable movie plot but unfortunately for Peter and his now broken family, it is true. You can reach Peter Young through his website: authorpeteryoung.com You can buy his books \u0022 The Blue Team \u0022 and \u0022 Stop The Tall Man, Save The Tiger \u0022 on Amazon. Join the Lead Today Community and get our Monday Moments email! Support the show",
      "release": "2024-02-25T21:00:00Z",
      "duration": "00:51:11.9210000",
      "explicit": false,
      "spotifyId": "4k6DdC5WNWn7MspDd1LUsj",
      "appleId": 1000646796404,
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4k6DdC5WNWn7MspDd1LUsj",
        "apple": "https://podcasts.apple.com/podcast/ep-102-stop-the-tall-man-save-the-tiger-peter-young/id1606257485?i=1000646796404"
      }
    }
  ]
}