{
  "_ts": 0,
  "id": "edba6469-0294-4656-a292-775fa0654b80",
  "name": "The Hare Krishna Project Podcast with Narada das",
  "youTubeChannelId": "UC630W_WcWEnDA7aXJHRxBCw",
  "episodes": [
    {
      "id": "a7b76fda-3003-49ac-80a5-44cc96cbb149",
      "title": "🎥 “The Cost of Silence” - Investigating ISKCON\u0027s large-scale child abuse cover up",
      "description": "🎥 “The Cost of Silence” - Investigating ISKCON\u0027s large-scale child abuse cover up \n\nIn case you haven\u0027t seen it, this documentary produced in 2014, is a must watch!\n\n📝 Produced by Sanaka Rsi Prabhu, it highlight\u0027s ISKCON\u0027s institutional cover up of child abuse over many decades.\n\nThe organisation\u0027s failure to protect and look after children is thought to be on a large scale, possibly as big as the Catholic Church.\n\n#TheCostOfSilence #ChildAbuse #ISKCON",
      "release": "2025-02-09T12:32:30Z",
      "duration": "00:59:49",
      "explicit": false,
      "youTubeId": "oMLuio6EqT0",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oMLuio6EqT0"
      }
    },
    {
      "id": "85f675ed-044c-42ad-8966-c66928705752",
      "title": "🎥 Have you experienced trauma and abuse in ISKCON (and other Gaudiya groups)?",
      "description": "🎥 Have you experienced trauma and abuse in ISKCON (and other Gaudiya groups)? \n\nDon’t suffer in silence 🤐 Speak out! 📣 \n\nNeed someone to talk to? MIND - the Mental Health Charity - is there to help 🙏 🩵 \n\nVisit their website for further details: www.mind.org.uk\n\n#Trauma #Abuse #ReligiousInstitutions #ISKCON #DontSuffer #SpeakOut",
      "release": "2025-02-07T13:05:40Z",
      "duration": "00:03:12",
      "explicit": false,
      "youTubeId": "j0q9SdzcZiM",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j0q9SdzcZiM"
      }
    },
    {
      "id": "d56a8b4a-174c-4ad1-a479-730f6e627ab1",
      "title": "🎥 An Inspiration to Whistleblowers - The Importance of Speaking Out : Mike Rinder",
      "description": "🎥 An Inspiration to Whistleblowers - The Importance of Speaking Out \n\n📝 The whole team here at The Hare Krishna Project is saddened to learn of the passing of Mike Rinder, the former member - turned critic - of the Church of Scientology ✝️ \n\nA lot of our own investigative work over the years was very much influenced by Mike’s example. We appreciated and admired his strong stance and determination to expose corruption and abuse in the church ⛪️ \n\nOur own investigations over the years into child abuse, black magic and satanic ritual abuse in ISKCON were inspired by Mike Rinder’s approach.\n\nHe will be missed 🙇‍♂️ \n\nThank you, Mike 🙏\n\nNEWS: https://www.dailymail.co.uk/tvshowbiz/article-14260693/leah-remini-tribute-scientology-whistleblower-mike-rinder-death.html \n\n#MikeRinder #Scientology #ChurchOfScientology #RIP #Whistleblower #ThankYou",
      "release": "2025-01-09T10:43:58Z",
      "duration": "00:03:59",
      "explicit": false,
      "youTubeId": "J97v_sOshLQ",
      "subjects": [
        "Hare Krishnas",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J97v_sOshLQ"
      }
    },
    {
      "id": "a2b3de88-c4d8-43d6-bf3e-b9b6206b3b83",
      "title": "PODCAST: Episode 135 – “Trafficked around ISKCON as a child for sex\u0022 - 20/08/24🎙",
      "description": "“Trafficked around ISKCON as a child for sex – Speaking out against those in authority\u0022\n\nPODCAST: Episode 135 – Tuesday 20th August 2024🎙\n\nWe’re pleased to welcome back Palika as our guest on this week’s podcast.\nPalika first appeared on ‘The Hare Krishna Project Podcast’ in June 2023 where she shared her horrific story of child abuse in ISKCON – and now, 14 months later has returned for a special ‘Part 2’ edition.\n\n(Viewers can watch Part 1 here: ‘Trafficked around ISKCON as a child for sex’ - https://www.youtube.com/watch?v=GA4MMSnQqBc\u0026t=4389s) \n\nIn this second sit-down interview she shares her story – a childhood full of abuse at the hands of those who were meant to protect and look after her.\nPalika talks openly about her experiences being gang-raped and trafficked around ISKCON as a child for sex. \n\nFrom the age of 3, until the age of 14, she was sexually abused multiple times by some of ISKCON’s most senior leaders.\n\nThis is ‘Part 2’ episode Palika discusses:\n\n- What’s changed for her in her life since we recorded Part 1\n- What’s happening now with her legal fight with ISKCON\n- Whether the authorities in ISKCON have taken her case seriously\n- Her thoughts on whether ISKCON will ever recover from its disastrous record on ‘child protection’ \n\nThis week’s podcast is not to be missed!\n\nYou can watch it:\n\n- On Facebook at www.facebook.com/TheHareKrishnaProject \n- and on YouTube at www.youtube.com/@NaradaDasUK\n\nFor more details about The Hare Krishna Project check out our website www.theharekrishnaproject.org.uk \n\n#Podcast #TheHareKrishnaProject #ISKCON #ChildAbuse #ChildProtection #Investigation #SpeakingOut #Peopophiles",
      "release": "2024-08-20T18:00:07Z",
      "duration": "01:52:41",
      "explicit": false,
      "youTubeId": "kmjGIYjSM2c",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kmjGIYjSM2c"
      }
    },
    {
      "id": "7fbdd384-eba1-4f3d-bd6b-1a997556f744",
      "title": "PODCAST: Episode 100 – “The whistleblower speaks out” - 23/12/23🎙",
      "description": "“The whistleblower speaks out” \n\nPODCAST: Episode 100 – Saturday 23rd December 2023🎙\n\n*With special guest host: Amala Prema devi dasi*\n\nWe’re delighted to welcome The Hare Krishna Project’s own Narada das as our guest on this week’s podcast.\n\nBorn and bred in beautiful Somerset, England, he was raised by his mother and grandmother and at the age of 15 joined the Methodist Church – a group of non-conformist Christians with a special focus on social action and social justice. \n\nHe met Hare Krishna devotees whilst at university as part of a degree in the Study of Religion… but he was never ever meant to join!\n\nAfter graduating Narada worked in local government for 10 years, running community engagement projects, press and media campaigns. At the age of just 26 he was managing a council’s education budget of £72million, with over 50 staff under his direction.\n\nBy the age of 30 though he realised he wasn’t happy and wanted something ‘deeper’ in life, so gave it all up to join ISKCON’s Festival Programme in the UK (little did he know what this would eventually lead to!).\n\nAfter 10 years serving with the programme Narada finally left and became the whistleblower that led to the Police and Charity Commission’s investigation into ISKCON UK’s misuse of public funds in 2021.\n\nNow, Narada runs The Hare Krishna Project and is a campaigner for a more inclusive, open and ‘accepting’ Hare Krishna movement where all people feel included.\n\nHe works as a journalist and communications consultant. He’s also an author with his second book ‘Black Magic, Booze and Bhakti’ is due to be published in 2024! \n\nThis week’s podcast is not to be missed!\n\nYou can watch it:\n\n- On Facebook at www.facebook.com/TheHareKrishnaProject \n- and on YouTube at www.youtube.com/@NaradaDasUK\n\nFor more details about The Hare Krishna Project check out our website www.theharekrishnaproject.org.uk\n\n#Podcast #TheHareKrishnaProject #HareKrishna #Podcast #Whistleblower #Author #Journalist",
      "release": "2023-12-23T19:00:11Z",
      "duration": "01:30:42",
      "explicit": false,
      "youTubeId": "7hNQh2h4dBM",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7hNQh2h4dBM"
      }
    },
    {
      "id": "c8f083bd-58a8-43a7-a7fd-18533ba805f3",
      "title": "PODCAST: The Hare Krishnas In Britain - E60 – “Trafficked around ISKCON as a child for sex\u0022 - 2/6/23",
      "description": "PODCAST: The Hare Krishnas In Britain - Episode 60 – “I was trafficked around ISKCON as a child for sex!\u0022 - Friday 2nd June 2023🎙\n\n(THIS PODCAST IS ALSO AVAILABLE TO WATCH ON FACEBOOK: https://fb.watch/kWWioycPDu/)\n\nWe\u0027re hugely grateful to Palika devi dasi for sharing her story with us on this week’s podcast.\n\nIn this exclusive sit-down interview, she shares her story – a childhood full of abuse at the hands of those who were meant to protect and look after her.\n\nIn this, her first podcast, Palika talks openly about her experiences being gang-raped and trafficked around ISKCON as a child for sex. \n\nFrom the age of 3, until the age of 14, she was sexually abused multiple times by some of ISKCON’s most senior leaders.\n\nThis week’s EXCLUSIVE podcast is not to be missed! You can watch it: \n\n- On Facebook at www.facebook.com/TheHareKrishnaProject \n- and on YouTube at www.youtube.com/@NaradaDasUK\n\n#Podcast #HareKrishnaMovement #HareKrishna #ChildAbuse #ChildProtection #ISKCON",
      "release": "2023-06-02T18:00:08Z",
      "duration": "01:46:48",
      "explicit": false,
      "youTubeId": "GA4MMSnQqBc",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GA4MMSnQqBc"
      }
    }
  ]
}