{
  "_ts": 0,
  "id": "d475c034-ad6c-4ef8-a551-cd5f53169e5f",
  "name": "The Liz Moody Podcast",
  "spotifyId": "6dBAMh1qc4ML7xxbYwYwNj",
  "appleId": 1398442165,
  "youTubeChannelId": "UCwQVy16LQhZbgO4losH8W_Q",
  "episodes": [
    {
      "id": "cfe5f1ee-c097-4617-ad6d-d05f93bf557c",
      "title": "TV Star Bethany Joy Lenz On Lessons Learned Escaping A Cult \u0026 Narcissistic Abuse: “I Had To Forgive Myself”",
      "description": "One Tree Hill star Bethany Joy Lenz knows a lot about cults – from personal and professional experience. While she stared in a show about cults, Bethany found herself in the Big House Family church covenant, a bible study group-turned-cult that isolated her from her family and peers. Joining a cult is much easier than you might think, and incredibly smart people join cults often. According to Bethany, cults like the one she joined prey on your desire for community, approval, and deep conversation. They use these desires as tools to isolate. But any narcissist will use the same tools, so it’s important to recognize them at work, in family, and in relationships. Hear Bethany’s journey to recovery in her faith and relationships, and learn how she redefined her life. 05:06 Craving Approval From Others 07:24 When Community Becomes A Cult 12:57 Isolation and Rebuilding Relationships 18:31 How Narcissists Gain Your Respect 22:13 Us vs. Them Mentality 26:35 Learning How To Apologize 29:33 Relearning Relationships 33:08 Brutal Honesty For more from Joy, follow her at @msbethanyjoylenz or her podcast, Drama Queens, at @dramaqueensoth . Find her new memoir, Dinner for Vampires: Life on a Cult TV Show (While also in an Actual Cult!) where books are sold. Ready to uplevel every part of your life? Order Liz’s new book 100 Ways to Change Your Life: The Science of Leveling Up Health, Happiness, Relationships \u0026 Success now! To join The Liz Moody Podcast Club Facebook group, go to www.facebook.com/groups/thelizmoodypodcast . Connect with Liz on Instagram @lizmoody , or subscribe to her newsletter by visiting www.lizmoody.com. If you like this episode, check out How To Identify \u0026 Deal with Narcissistic Parents, Romantic Partners, Coworkers/Bosses \u0026 More with Dr. Ramani Durvasula . This episode is sponsored by: Seed: go to seed.com/lizmoody and use code LIZMOODY for 25% off your first month. Molly’s Suds: go to mollyssuds.com/LIZMOODY and use code LIZMOODY for 20% off. MasterClass: go to masterclass.com/LIZMOODY for up to 50% off. The Liz Moody Podcast cover art by Zack. The Liz Moody Podcast music by Alex Ruimy. Formerly the Healthier Together Podcast. This podcast and website represents the opinions of Liz Moody and her guests to the show. The content here should not be taken as medical advice. The content here is for information purposes only, and because each person is so unique, please consult your healthcare professional for any medical questions. The Liz Moody Podcast Episode 283. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-18T09:21:00Z",
      "duration": "00:51:04.2150000",
      "explicit": false,
      "spotifyId": "4rDjZTEN9mW6STlIf8Fud5",
      "appleId": 1000677300303,
      "youTubeId": "cxOlTCyw2jM",
      "subjects": [
        "The Big House Family",
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4rDjZTEN9mW6STlIf8Fud5",
        "apple": "https://podcasts.apple.com/podcast/tv-star-bethany-joy-lenz-on-lessons-learned-escaping/id1398442165?i=1000677300303",
        "youtube": "https://www.youtube.com/watch?v=cxOlTCyw2jM"
      }
    }
  ]
}