{
  "id": "f1719872-7d18-474e-9e55-0ed76bb3e1be",
  "name": "The Daily Stoic",
  "spotifyId": "7fY99FB3bNyn7nEdXCoBeB",
  "appleId": 1430315931,
  "youTubeChannelId": "UCkUaT0T03TJvafYkfATM2Ag",
  "youTubePlaylistId": "PL830tyaBUx1r4kk-W0KY106Pxylwup4lm",
  "episodes": [
    {
      "id": "494fea13-bd45-476b-b883-c06e7188d8af",
      "title": "Why You’re Not as Hard to Manipulate as You Think | Rebecca Lemov",
      "description": "Most people think manipulation only works on other people. That belief is exactly what makes it dangerous. In this episode, Ryan sits down with historian and human behavior expert Rebecca Lemov to talk about what actually happens when people are pushed, pressured, or slowly pulled into systems of control. From prison camps and cults to propaganda and social pressure, they discuss how people break in ways that still feel rational, why belonging can override reason, and why almost everyone believes they are immune right up until they are not. Rebecca Lemov is a historian of science at Harvard University. Her research explores data, technology, and the history of human and behavioral sciences. \u0026#x1f4da; Grab signed copies of The Instability of Truth by Rebecca Lemov at The Painted Porch: https://www.thepaintedporch.com/ \u0026#x1f449; Support the podcast and go deeper into Stoicism by subscribing to The Daily Stoic Premium - unlock ad-free listening, early access, and bonus content: https://dailystoic.supercast.com/ \u0026#x1f3a5; Watch the video episodes on The Daily Stoic YouTube channel : https://www.youtube.com/@DailyStoic/videos \u0026#x1f399;️ Follow The Daily Stoic Podcast on Instagram : https://www.instagram.com/dailystoicpodcast ✉️ Want Stoic wisdom delivered to your inbox daily? Sign up for the FREE Daily Stoic email at https://dailystoic.com/dailyemail \u0026#x1f3db; Get Stoic inspired books, medallions, and prints to remember these lessons at the Daily Stoic Store: https://store.dailystoic.com/ \u0026#x1f4f1; Follow us: Instagram , Twitter , YouTube , TikTok , and Facebook See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2026-01-10T08:00:00Z",
      "duration": "01:14:18.5530000",
      "explicit": false,
      "spotifyId": "6BrbjDGIZCNfShiylvCi9H",
      "appleId": 1000744573476,
      "subjects": [
        "Cult-Expert",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6BrbjDGIZCNfShiylvCi9H",
        "apple": "https://podcasts.apple.com/podcast/why-youre-not-as-hard-to-manipulate-as-you-think-rebecca/id1430315931?i=1000744573476"
      }
    }
  ]
}