{
  "id": "7fac111e-063d-4cd6-8337-d23449f1dd1a",
  "name": "The Opperman Report",
  "spotifyId": "6jULai3JCSiCzoQWfuZk4F",
  "appleId": 975926302,
  "episodes": [
    {
      "id": "8b04b3c9-202d-4e25-97f7-f43e4b8b4bc8",
      "title": "Dan Flynn Cult City  Jim Jones, Harvey Milk",
      "description": "Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2026-01-09T14:00:08Z",
      "duration": "01:00:10.9840000",
      "explicit": false,
      "spotifyId": "4cpBgfPuVVgGNLAuH5ILPi",
      "appleId": 1000744447898,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cpBgfPuVVgGNLAuH5ILPi",
        "apple": "https://podcasts.apple.com/podcast/dan-flynn-cult-city-jim-jones-harvey-milk/id975926302?i=1000744447898"
      }
    },
    {
      "id": "0736f286-c256-4739-9111-30d26c1f3f2f",
      "title": "Charles Manson: Coming Down Fast",
      "description": "*The definitive and bestselling account of Charles Manson* \u0027A sprawling, fast-paced account of Manson\u0027s life\u0027 The Times \u0027 Fascinating\u0027 Daily Mail __________ Los Angeles, California. 1969. Seven people are found shot, stabbed and beaten to death in Beverley Hills. Among them is actress Sharon Tate, the beautiful young wife of Roman Polanski. It soon became apparent that a happyish cult known as \u0027The Family\u0027 was responsible. Their charismatic and manipulative leader, Charles Manson, took the public\u0027s imagination. As the world watched in morbid fascination, the sensational and horrifying details of the case slowly emerged. Coming Down Fast is the definitive and most revealing account of one of the most notorious criminals in history, charting Manson\u0027s terrifying rise from petty-criminal to one of the most recognisable icons in criminal history. Including never-before-published photographs, this is the definitive book about Charles Manson.\n\nhttps://amzn.to/3VFdd3q\n\n\nBecome a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support.",
      "release": "2025-09-08T19:00:08Z",
      "duration": "01:04:09",
      "explicit": false,
      "spotifyId": "5wHdIt8IJwEDIxh6mi9I2L",
      "appleId": 1000725584545,
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wHdIt8IJwEDIxh6mi9I2L",
        "apple": "https://podcasts.apple.com/podcast/charles-manson-coming-down-fast/id1465935902?i=1000725584545"
      }
    },
    {
      "id": "2d04d2db-2f95-4884-8cbb-125d97438e82",
      "title": "Mike Codella NYPD Investigated Son of Sam Process Church Cult",
      "description": "Mike Codella NYPD Investigated Son of Sam Process Church Cult Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-07-21T23:00:07Z",
      "duration": "02:00:07.4440000",
      "explicit": false,
      "spotifyId": "5WmJSKNk3X341NaY11SQMn",
      "appleId": 1000718379604,
      "subjects": [
        "Process Church of the Final Judgement",
        "David Berkowitz"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WmJSKNk3X341NaY11SQMn",
        "apple": "https://podcasts.apple.com/podcast/mike-codella-nypd-investigated-son-of-sam-process/id975926302?i=1000718379604"
      }
    },
    {
      "id": "a1034b93-e2ce-48af-a934-abbeb5e04ab9",
      "title": "The Cult of Trump - A Leading Cult Expert Explains How the President Uses Mind Control",
      "description": "One of America’s leading experts in cults and mind-control provides an eye-opening analysis of Trump and the indoctrination tactics he uses to build a fanatical devotion in his supporters. Over the past two years, Trump’s behaviour has become both more disturbing and yet increasingly familiar. He relies on phrases like, “fake news,” “build the wall,” and continues to spread the divisive mentality of us-vs.-them. He lies constantly, has no conscience, never admits when he is wrong, and projects all of his shortcomings on to others. He has become more authoritarian, more outrageous, and yet many of his followers remain blindly devoted. Scott Adams, the creator of Dilbert and a major Trump supporter, calls him one of the most persuasive people living. His need to squash alternate information and his insistence of constant ego stroking are all characteristics of other famous leaders—cult leaders. In The Cult of Trump, mind-control and licensed mental health expert Steven Hassan draws parallels between our current president and people like Jim Jones, David Koresh, Ron Hubbard and Sun Myung Moon, arguing that this presidency is in many ways like a destructive cult. He specifically details the ways in which people are influenced through an array of social psychology methods and how they become fiercely loyal and obedient. Hassan was a former “Moonie” himself, and he draws on his forty years of personal and professional experience studying hypnosis and destructive cults, working as a deprogrammer, and a strategic communications interventionist. He emphasizes why it’s crucial that we recognize ways to identify and protect ourselves and our loved ones. The Cult of Trump is an accessible and in-depth analysis of the president, showing that under the right circumstances, even sane, rational, well-adjusted people can be persuaded to believe the most outrageous ideas. Hassan’s book is essential reading for anyone wanting to understand the Trump phenomenon and looking for a way forward. https://amzn.to/4lGjEic Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-07-19T01:00:07Z",
      "duration": "00:57:49.8850000",
      "explicit": false,
      "spotifyId": "1lnVArEGcudEj4NaPWa00S",
      "appleId": 1000718023852,
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1lnVArEGcudEj4NaPWa00S",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-trump-a-leading-cult-expert/id975926302?i=1000718023852"
      }
    },
    {
      "id": "aa698245-288a-4df2-baa7-7f10eb8cf8ad",
      "title": "Escape: My Life Long War Against Cults",
      "description": "From the back cover: The snake stuffed in attorney Paul Morantz s mailbox by acolytes of Synanon, a once-hailed drug rehabilitation center that had devolved into a paranoid, militaristic cult, was an early strike in what would become a 35-year war with nearly every major cult movement this country has ever known. Mr. Morantz has been involved under frequently bizarre circumstances--with such infamous sects as the Charles Manson family, Patty Hearst and the SLA, Jim Jones and the People s Temple, the Moonies and the strange world of Scientology. His efforts have helped many escape from lives of torment and contributed to a sea change in how courts deal with the little-understood issues of brainwashing and cults. Now, in this important and compelling book, Mr. Morantz offers a comprehensive account of the origins and activities of cults and how they prey on society s most vulnerable elements. It also recounts the very intimate tale of how these confrontations with threatening and often, violent forces cost him the woman he loved and nearly, life itself. https://amzn.to/4m04DYj Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-07-18T12:55:07Z",
      "duration": "01:01:46.2530000",
      "explicit": false,
      "spotifyId": "451n4ci9t4eS2XfqkADw2Z",
      "appleId": 1000717960327,
      "subjects": [
        "Synanon",
        "Manson Family",
        "Peoples Temple",
        "Scientology",
        "Symbionese Liberation Army",
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/451n4ci9t4eS2XfqkADw2Z",
        "apple": "https://podcasts.apple.com/podcast/escape-my-life-long-war-against-cults/id975926302?i=1000717960327"
      }
    },
    {
      "id": "a1b827bd-d17c-4ff9-94fb-79f27e852f62",
      "title": "Davida Kelley : Children of God Apocalyptic Sex Cult",
      "description": "Davida Kelley : Children of God Apocalyptic Sex Cult Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support.",
      "release": "2025-07-09T15:00:08Z",
      "duration": "01:59:05.5080000",
      "explicit": false,
      "spotifyId": "6XcVwvMSV4uUcgTHOHSjBy",
      "appleId": 1000716501582,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6XcVwvMSV4uUcgTHOHSjBy",
        "apple": "https://podcasts.apple.com/podcast/davida-kelley-children-of-god-apocalyptic-sex-cult/id975926302?i=1000716501582"
      }
    },
    {
      "id": "e5e98e98-4231-485a-af5c-75ecaec51097",
      "title": "Aftershow The Ultimate Evil roundtable with Authors Joe Ditoma \u0026 Michael Marinacci.2014 11 07",
      "description": "On August 10, 1977, the NYPD arrested David Berkowitz for the Son of Sam murders that had terrorized New York City for over a year. Berkowitz confessed to shooting sixteen people and killing six with a .44 caliber Bulldog revolver, and the case was officially closed. Journalist Maury Terry was suspicious of Berkowitz’s confession. Spurred by conflicting witness descriptions of the killer and clues overlooked in the investigation, Terry was convinced Berkowitz didn’t act alone. Meticulously gathering evidence for a decade, he released his findings in the first edition of The Ultimate Evil. Based upon the evidence he had uncovered, Terry theorized that the Son of Sam attacks were masterminded by a Yonkers-based cult that was responsible for other ritual murders across the country. After Terry’s death in 2015, documentary filmmaker Josh Zeman (Cropsey, The Killing Season, Murder Mountain) was given access to Terry’s files, which form the basis of his docuseries with Netflix and a companion podcast. Taken together with The Ultimate Evil, which includes a new introduction by Zeman, these works reveal the stunning intersections of power, wealth, privilege, and evil in America—from the Summer of Sam until today. Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-05-10T21:45:08Z",
      "duration": "02:08:16.2220000",
      "explicit": false,
      "spotifyId": "3BHsl5GoZi6KF2MmWmXdsx",
      "appleId": 1000707891859,
      "subjects": [
        "David Berkowitz"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BHsl5GoZi6KF2MmWmXdsx",
        "apple": "https://podcasts.apple.com/podcast/aftershow-the-ultimate-evil-roundtable-with-authors/id1465935902?i=1000707891859"
      }
    },
    {
      "id": "948c8d6d-278e-4e1c-ab0d-c6b6dc72e594",
      "title": "Maury Terry\u0027s book The Ultimate Evil",
      "description": "On August 10, 1977, the NYPD arrested David Berkowitz for the Son of Sam murders that had terrorized New York City for over a year. Berkowitz confessed to shooting sixteen people and killing six with a .44 caliber Bulldog revolver, and the case was officially closed. Journalist Maury Terry was suspicious of Berkowitz’s confession. Spurred by conflicting witness descriptions of the killer and clues overlooked in the investigation, Terry was convinced Berkowitz didn’t act alone. Meticulously gathering evidence for a decade, he released his findings in the first edition of The Ultimate Evil. Based upon the evidence he had uncovered, Terry theorized that the Son of Sam attacks were masterminded by a Yonkers-based cult that was responsible for other ritual murders across the country. After Terry’s death in 2015, documentary filmmaker Josh Zeman (Cropsey, The Killing Season, Murder Mountain) was given access to Terry’s files, which form the basis of his docuseries with Netflix and a companion podcast. Taken together with The Ultimate Evil, which includes a new introduction by Zeman, these works reveal the stunning intersections of power, wealth, privilege, and evil in America—from the Summer of Sam until today. Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-05-10T19:35:07Z",
      "duration": "01:33:46.0440000",
      "explicit": false,
      "spotifyId": "2DgrnWhweDCZkJVPvwbMtc",
      "appleId": 1000707887550,
      "subjects": [
        "David Berkowitz"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2DgrnWhweDCZkJVPvwbMtc",
        "apple": "https://podcasts.apple.com/podcast/maury-terrys-book-the-ultimate-evil/id975926302?i=1000707887550"
      }
    },
    {
      "id": "e6c5a2df-a22e-4511-95d4-06ab5f85b1b5",
      "title": "Tony Ortega : Scientology Use of Private Investigators",
      "release": "2025-04-20T20:00:07Z",
      "duration": "00:45:41.5810000",
      "explicit": false,
      "spotifyId": "4EonVFKfcwybPTDEVVm65a",
      "appleId": 1000704220746,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EonVFKfcwybPTDEVVm65a",
        "apple": "https://podcasts.apple.com/podcast/tony-ortega-scientology-use-of-private-investigators/id975926302?i=1000704220746"
      }
    },
    {
      "id": "2e869556-4370-424f-8dda-57e4b902b39b",
      "title": "Tony Ortega - School of Scientology",
      "description": "Tony Ortega - School of Scientology Tony Ortega is a journalist who was formerly the editor of The Village Voice. He\u0027s written about Scientology since 1995, and in May 2015 released a book about Scientology\u0027s harassment of Paulette Cooper titled \u0027The Unbreakable Miss Lovely.\u0027 He continues to monitor breaking developments in Scientology and other controversial subjects from an undisclosed location in an underground bunker he shares with four cats and one of them wrinkly Shar Pei dogs. Despite his super-secret security protections, you can still reach him pretty easily by sending him a message at tonyo94 AT gmail.com The Underground Bunker Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-04-20T18:00:07Z",
      "duration": "01:49:04.4220000",
      "explicit": false,
      "spotifyId": "2XCPIMvif2pIF69ONHcFts",
      "appleId": 1000704211389,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2XCPIMvif2pIF69ONHcFts",
        "apple": "https://podcasts.apple.com/podcast/tony-ortega-school-of-scientology/id975926302?i=1000704211389"
      }
    },
    {
      "id": "13935827-e088-4af0-9ed1-68ac7c961645",
      "title": "Arnaldo Lerma - Scientology Cult",
      "description": "Arnaldo Lerma - Scientology Cult The late Arnaldo Lerma joined the Opperman Report to discuss Scientology. How it works, how it threatens and how it\u0027s influence is more and more a subtext for our times.Ever heard the story of Xenu, the genocidal alien dictator who, when faced with overpopulation troubles 75 million years ago, brought billions of his subjects to Earth to execute with a lethal combination of volcanoes and hydrogen bombs? Their disembodied spirits to cling to humans and their removal can only be achieved through the teachings of the Church of Scientology? If so, you can thank Arnie Lerma.Arnaldo Pagliarini Lerma was born in Washington, D.C., in 1950, to a mother who was an executive secretary to the Sudanese ambassador and a father who was a Mexican agriculture official — and who divorced months after his birth, according to Lerma\u0027s autobiography. His mother was a Scientology official in the D.C. church around 1968, about three decades after American science fiction writer L. Ron Hubbard published the first texts that would form the basis of his new religion, Scientology. By the time Lerma joined Scientology at 16 at the urging of his mother, the church had been banned in several Australian states and stripped of its tax-exempt status by the IRS, which deemed it a commercial operation for Hubbard\u0027s benefit — though a U.S. appeals court later recognized it as a religion in 1969. Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-04-20T16:00:08Z",
      "duration": "02:36:15.0900000",
      "explicit": false,
      "spotifyId": "2JJG56eGwkQ50qbP0I7qtd",
      "appleId": 1000704200694,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2JJG56eGwkQ50qbP0I7qtd",
        "apple": "https://podcasts.apple.com/podcast/arnaldo-lerma-scientology-cult/id975926302?i=1000704200694"
      }
    },
    {
      "id": "44c69dc1-51d5-477c-a711-aee3385afb80",
      "title": "Charles Manson Behind Bars - The Crazy Antics and Amazing Revelations of America\u0027s Icon of Evil",
      "description": "Dr Mark G. Hewitt : Charles Manson Behind Bars - The Crazy Antics and Amazing Revelations of America\u0027s Icon of Evil Jun 1, 2022 Dr. Mark G. Hewitt, DBA is a true crime author and award-winning public speaker who travels the world in his quest for intriguing, unanswered questions and enduring mysteries. Charles Manson holds a special place in history, notorious for his crimes and cult , yet fascinating for his seemingly endless ability to dominate and control all who came into his orbit.In this interview Dr Hewitttells Ed about Manson, who was never a quiet inmate. Mood swings from outbursts of rage to acts of generosity, he made his presence felt to everyone around him. He inspired awe in other inmates, he cozied up to prison guards who were eager to do him favours, and he was responsible for numerous staff transfers in the institution and externally.Mark is also the author of the acclaimed Zodiac Serial Killer Series, three books dedicated to telling the complete story of California’s most notorious unidentified serial killer: HUNTED: the Zodiac murders PROFILED: the Zodiac examined EXPOSED: the Zodiac revealed With inmate Guillermo Mendez, he is the co-author of Charles Manson Behind Bars , the first Manson book from the inside. Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-04-05T19:00:07Z",
      "duration": "00:47:10.7790000",
      "explicit": false,
      "spotifyId": "2mEceBwHL6cwCNTN6G7FTN",
      "appleId": 1000702331570,
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2mEceBwHL6cwCNTN6G7FTN",
        "apple": "https://podcasts.apple.com/podcast/charles-manson-behind-bars-the-crazy-antics-and/id975926302?i=1000702331570"
      }
    },
    {
      "id": "7e115fc2-4287-4926-8e86-923e3e9d1c2b",
      "title": "Cults on Trial - A Cross-Examination of Jim Jones, Charles Manson, Hitler… and Donald Trump",
      "description": "Larry Moore - Cults on Trial - A Cross-Examination of Jim Jones, Charles Manson, Hitler… and Donald Trump\n\nMay 6, 2024\n\nDr. Moore is a Pre-Sentence Investigator for Alabama Circuit Courts, with previous careers as an ordained pastor, college educator, and author. He holds a doctoral degree from Emory University, and has been a repeat guest on various TV and radio programs. His previous eight books have garnered widespread positive reviews.The Culture of Cults\nOur current malaise raises questions:\n• Are we all soul-stained with selfishness... or is it just a\nhealthy survival instinct?\n• Where is the line between normal self-interest and full-\nblown Narcissism?\n• How do we distinguish strong leadership from\nmanipulation? Community from Cult?\nDrawing upon court cases and real world experiences, this book shows how cult gurus and “cult cultures” fit a predictable pattern, a common template of destructive traits and tactics. By studying Cult Culture, the author argues, we gain insight into current politics and Fascist demagogues.\nFirst relating his own encounter with disillusioned cult members, author Lance Moore dissects the phenomena, exposing the methods of manipulation found in cult leaders —and on a smaller scale, in our own relationships.\n\nThis book is well-researched: it includes over 500 endnotes citing 500 Sources.\n\n\n\n\n\n\n\n\nBecome a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support.",
      "release": "2025-04-05T18:00:07Z",
      "duration": "00:53:56",
      "explicit": false,
      "spotifyId": "41lTQFqtZTz2duf9MI1lpV",
      "appleId": 1000702329337,
      "subjects": [
        "Peoples Temple",
        "Manson Family",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/41lTQFqtZTz2duf9MI1lpV",
        "apple": "https://podcasts.apple.com/podcast/cults-on-trial-a-cross-examination-of-jim/id1465935902?i=1000702329337"
      }
    },
    {
      "id": "829a9822-b6ee-4288-b44c-e2a8413c722c",
      "title": "When Men Become Gods: Mormon Polygamist Warren Jeffs, His Cult of Fear, and the Women Who Fought Back",
      "description": "New York Times bestselling author Stephen Singular provides an inside look at the Mormon polygamist sect that made headlines in 2008 for coercing young girls into marriage, and the story of their ruthless leader, Warren Jeffs. As the self-proclaimed prophet of the Fundamentalist Latter Day Saints, Warren Jeffs held sway over thousands of followers for nearly a decade. His rule was utterly tyrannical. In addition to coercing young girls into marriages with older men, Jeffs reputedly took scores of wives, many of whom were his father\u0027s widows. But in 2007, after landing on the FBI\u0027s Ten Most Wanted List, Jeffs\u0027s reign was forcefully ended. He would be imprisoned for committing rape as an accomplice. In When Men Become Gods, Edgar Award–nominee Stephen Singular traces Jeffs\u0027s rise to power and the concerted effort that led to his downfall. Newly updated, it describes the controversial 2008 raid on Jeffs\u0027s Texas compound and the fate of the 439 children taken from the sect. It offers readers a rare glimpse into a tradition that\u0027s almost a century old, but has only now been exposed. Buy the book here https://amzn.to/44I7CeX Oppermnan Report seriously needs your support during this seasonal low in radio broadcasting. You can join Pareon at https://www.patreon.com/oppermanreport Or Paypal a dobnation to Oppermareport@gmail.com Donate button with other options at oppermanreport.com Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2024-12-18T16:43:47Z",
      "duration": "01:00:41.3380000",
      "explicit": false,
      "spotifyId": "23nqvMfa3XaembBqz5oVuY",
      "appleId": 1000680859812,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23nqvMfa3XaembBqz5oVuY",
        "apple": "https://podcasts.apple.com/podcast/when-men-become-gods-mormon-polygamist-warren-jeffs/id975926302?i=1000680859812"
      }
    }
  ]
}