{
  "id": "1459bf28-41a9-47c8-8c10-e32c88f258ab",
  "name": "The People Who Read People psychology podcast",
  "spotifyId": "0MXNhbb3bR4qG05bpY4r9p",
  "appleId": 1432369172,
  "youTubeChannelId": "UC9CABb419r7z3yN_YTfu3tQ",
  "episodes": [
    {
      "id": "e93ba03f-abc8-4031-9b33-3f0517947d7b",
      "title": "Chase Hughes, Hypnosis, \u0026 Behavior Analysis: Putting a secret-agent spin on old NLP seminar ideas",
      "description": "My third episode about Chase Hughes, who promotes himself as the “#1 expert in behavior and influence” and who\u0027s known for being on The Behavior Panel show. My first episode about Chase examined his early deceptions and his involvement in pick-up artistry and vitamin supplement sales (that episode: https://www.youtube.com/watch?v=4t1DMxmqJOk). In this episode, I focus on how Chase\u0027s content and training relates to Neuro-Linguistic Programming (NLP), and related things like hypnosis/influence courses and transformational seminars. Time-stamped chapters are below.\n\nSummary of points in this episode: Chase has used the NLP trainer template but repackaged it with a military/secret-agent/MK-Ultra-type spin. I examine the connections between NLP and Chase’s behavior analysis and influence/hypnosis content. I also attempt to explain why Chase (and people like him) can acquire good reviews and fans, despite so much of it being low-quality and also very expensive. I examine Chase’s promotion of supplements sold by a chiropractor named John Lieurance. And I talk about the various people who\u0027ve promoted Chase, from influential podcasters to Dr. Phil to his fellow Behavior Panel members, and why there\u0027s such a lack of interest in examining Chase\u0027s deceptive claims.\n\nFor a transcript and more details about this episode, see https://behavior-podcast.com/chase-hughes-and-how-he-put-a-military-top-secret-spin-on-nlp-hypnosis-seminar-ideas. \n\nA later episode will focus on behavior analysis and the Behavior Panel. This episode is focused squarely on NLP/hypnosis. \n\n0:00 Intro\n2:20: People pay Chase large amounts of money\n3:58: This is focused on NLP/hypnosis, not behavior analysis\n5:10 Some have asked, “Isn\u0027t this normal marketing exaggeration?”\n6:56 Chase’s absurd claims about controlling people \n9:22 What do experts say about hypnosis?\n10:58 Thoughts from hypnosis expert Martin Taylor\n13:44 Bullshit in Chase’s book, The Ellipsis Manual \n15:45 How can Chase’s books (and other work) get good reviews? \n18:34 What is NLP? \n24:13 How NLP relates to hypnosis \n26:14 NLP involves influence using language and behavior patterns\n26:52 What does research say about NLP?\n27:50 Eye direction tells\n34:09 NLP and gaining rapport\n35:25 Repackaging NLP ideas in a military/secret-agent theme\n36:38 NLP, strange “transformational” experiences, and love bombing\n38:24 Some good and okay things about NLP \n42:58 Chase’s foreword in an NLP/hypnosis book \n46:00 Why do so many people believe this stuff?\n50:01 A note about behavior analysis and separating bullshit from reality\n51:22 The placebo effect plays a role\n52:44 Harms in NLP/hypnosis areas\n54:10 Chase promoting Dr. John\u0027s Mitozen supplements\n59:18 A closer look at Chase’s sales/manipulation funnel \n1:00:34 Cult-like dynamics that arise due to customers\u0027 emotional vulnerability \n1:01:33 Responses from other NLP/hypnosis gurus\n1:08:17 Various podcasters and personalities who\u0027ve promoted Chase\n1:12:14 Concluding thoughts\n\nTopics discussed in this video include: \n• How Chase’s concepts relate to NLP\n• What NLP is and why people attend those seminars\n• My own personal experiences working for an NLP trainer\n• NLP seminars relate to other experiential/transformational multi-day seminars\n• Good and okay aspects of NLP/hypnosis/influence type content and training\n• The many influential people who’ve promoted Chase and the factors in that\n• Why these things can impress people despite being so obviously silly and strange\n• What a hypnosis expert had to say about Chase\u0027s stuff\n• How cult-like dynamics can come about due to the emotional vulnerability of some NLP/self-help customers\n• Why behavior-analysis and influence/hypnosis-type offerings lend themselves to exaggerated claims",
      "release": "2024-09-26T18:39:26Z",
      "duration": "01:14:13",
      "explicit": false,
      "spotifyId": "61V5UoVI8UgBUc9mFHljE4",
      "appleId": 1000670760893,
      "youTubeId": "flI6NWcshq8",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61V5UoVI8UgBUc9mFHljE4",
        "apple": "https://podcasts.apple.com/podcast/chase-hughes-nlp-hypnosis-putting-a-top-secret/id1432369172?i=1000670760893",
        "youtube": "https://www.youtube.com/watch?v=flI6NWcshq8"
      }
    }
  ]
}