{
  "id": "ff76ad69-d716-46b5-a2d4-0c1d981cbb72",
  "name": "The Sacred",
  "spotifyId": "1S7LekilnvLY2SPatq4Ybg",
  "appleId": 1326888108,
  "youTubeChannelId": "UClAOHO_-S00oI_aDp4yWBMA",
  "youTubePlaylistId": "PL-Z1CdT5UyvJhrv1BaGDV7LGljHlpdp92",
  "episodes": [
    {
      "id": "7456daec-fab1-4469-924d-d366e2381d48",
      "title": "Documenting Cults, Killers \u0026 White Supremacists: Mobeen Azhar on Finding Empathy",
      "description": "Award-winning journalist and filmmaker Mobeen Azhar and Elizabeth Oldfield to talk about his extraordinary career telling hidden and untold stories - from interviewing white supremacists, extremists, drug dealers, and killers; exposing police corruption, cults, and cover-ups; and told raw stories from inside prisons, mosques, and nightclubs. In an age of outrage and dehumanisation, Mobeen\u0027s journalism combats hate and demonisation with empathy and understanding to reveal the human story beyond the headlines. --- \u0026#x1f399;️ Follow The Sacred: linktr.ee/sacredpodcast \u0026#x1f4d6; Follow Elizabeth Oldfield: www.elizabetholdfield.com/ \u0026#x1f4a1; Produced by the ‪@thinktanktheos‬ www.theosthinktank.co.uk/ \u0026#x1f449; Follow Mobeen: https://www.instagram.com/mobeen_azhar/?hl=en-gb Keywords: His award-winning documentaries include Small Town, Big Riot (BBC), uncovering how racism and misinformation fuelled a violent protest in Merseyside; The Battle for Britney, going inside the global #FreeBritney movement; The Satanic Verses: 30 Years On, exploring faith, art, and offence; Hometown: A Killing, investigating a murder in his own community; The Men Who Sell Sex; The Mosque Next Door; The Black and White Killing; The Soldiers That Saved Britain; and The Kandahar Killings. In this episode of The Sacred, journalist and documentary filmmaker Mobeen Azhar talks about racism, faith, and moral courage. Known for BBC documentaries like Small Town, Big Riot, Hometown: A Killing, and The Battle for Britney, Mobeen shares what it’s like to be a Muslim journalist in Britain interviewing racists, extremists, and people on the margins of society. He discusses empathy over outrage, understanding hate, and finding transcendence on the techno rave dance floor. This powerful conversation explores race, religion, identity, decency, and compassion in a divided world — and asks how we can stay human in the face of injustice and polarisation.",
      "release": "2025-11-05T05:00:00Z",
      "duration": "01:08:33.6640000",
      "explicit": false,
      "spotifyId": "7xHEC9fA7rmC1QzPZ61AhG",
      "appleId": 1000735335224,
      "youTubeId": "h0UjE8aoZpE",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7xHEC9fA7rmC1QzPZ61AhG",
        "apple": "https://podcasts.apple.com/podcast/documenting-cults-killers-white-supremacists-mobeen/id1326888108?i=1000735335224",
        "youtube": "https://www.youtube.com/watch?v=h0UjE8aoZpE"
      }
    }
  ]
}