{
  "_ts": 0,
  "id": "7fac111e-063d-4cd6-8337-d23449f1dd1a",
  "name": "The Opperman Report",
  "spotifyId": "6jULai3JCSiCzoQWfuZk4F",
  "appleId": 975926302,
  "episodes": [
    {
      "id": "829a9822-b6ee-4288-b44c-e2a8413c722c",
      "title": "When Men Become Gods: Mormon Polygamist Warren Jeffs, His Cult of Fear, and the Women Who Fought Back",
      "description": "New York Times bestselling author Stephen Singular provides an inside look at the Mormon polygamist sect that made headlines in 2008 for coercing young girls into marriage, and the story of their ruthless leader, Warren Jeffs. As the self-proclaimed prophet of the Fundamentalist Latter Day Saints, Warren Jeffs held sway over thousands of followers for nearly a decade. His rule was utterly tyrannical. In addition to coercing young girls into marriages with older men, Jeffs reputedly took scores of wives, many of whom were his father\u0027s widows. But in 2007, after landing on the FBI\u0027s Ten Most Wanted List, Jeffs\u0027s reign was forcefully ended. He would be imprisoned for committing rape as an accomplice. In When Men Become Gods, Edgar Award–nominee Stephen Singular traces Jeffs\u0027s rise to power and the concerted effort that led to his downfall. Newly updated, it describes the controversial 2008 raid on Jeffs\u0027s Texas compound and the fate of the 439 children taken from the sect. It offers readers a rare glimpse into a tradition that\u0027s almost a century old, but has only now been exposed. Buy the book here https://amzn.to/44I7CeX Oppermnan Report seriously needs your support during this seasonal low in radio broadcasting. You can join Pareon at https://www.patreon.com/oppermanreport Or Paypal a dobnation to Oppermareport@gmail.com Donate button with other options at oppermanreport.com Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2024-12-18T16:43:47Z",
      "duration": "01:00:41.3380000",
      "explicit": false,
      "spotifyId": "23nqvMfa3XaembBqz5oVuY",
      "appleId": 1000680859812,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23nqvMfa3XaembBqz5oVuY",
        "apple": "https://podcasts.apple.com/podcast/when-men-become-gods-mormon-polygamist-warren-jeffs/id975926302?i=1000680859812"
      }
    }
  ]
}