{
  "_ts": 0,
  "id": "c5632712-89be-4a18-a08b-05a29cdf443f",
  "name": "The Gaslight Effect Podcast",
  "spotifyId": "1XdjMoLzr9s0T8QIvXThn0",
  "appleId": 1645322193,
  "episodes": [
    {
      "id": "4c599c5d-d0bc-4d26-8922-ce362505011d",
      "title": "055 - Gaslighting in the Twin Flames Universe: Jessi Hersey\u0027s Story of Escape, Resilience and Truth",
      "description": "On this episode of The Gaslight Effect podcast, Dr. Robin Stern explores the shadows of manipulation and the journey toward reclaiming our truth with a guest who knows this struggle all too well: Jessi Hersey . Jessi is a queer neurodivergent author and a Pencraft Award winner, featured in Netflix\u0027s Escaping Twin Flames docu-series, where she shares her harrowing experience of escaping the Twin Flames Universe cult, a journey marked by intense gaslighting that threatened her identity and sense of self. Jessi\u0027s collection of poetry, Lit Soul: My Journey Back to Faith , takes readers on an honest exploration of love, loss, and the search for belonging. Written in four heartfelt sections, this book reflects on her life from age six to the present, highlighting the journey of rediscovering faith and the strength that comes with it. Beyond her own story, Jessi is the host of Jessistories , a dynamic interview-style channel that provides a platform for cult survivors to speak out about their experiences with manipulation and emotional abuse. This inclusive space embraces queer authors, influencers, and creators, emphasizing that every story matters in the fight against gaslighting. Robin and Jessi delve into Jessi’s incredible journey of resilience, the tactics of gaslighting she faced, and the importance of sharing our truths. Whether you’re navigating your own challenges or seeking to understand this complex issue better, you won’t want to miss this conversation. To read the full transcript of this episode, head over to robinstern.com . Don\u0027t forget to subscribe to The Gaslight Effect Podcast on your favorite podcast platform, and be sure to leave us a review to let us know what you think. Until next time, remember: healing is a journey, and you don\u0027t have to walk it alone. Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Dr. Robin Stern\u0027s Books: The Gaslight Effect The Gaslight Effect Recovery Guide Emotional Intelligence for School Leaders Disclaimer: The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2024-10-08T03:00:00Z",
      "duration": "00:55:30.4850000",
      "explicit": false,
      "spotifyId": "3LRjxjPc5HO9bvpA2aYes2",
      "appleId": 1000672166689,
      "subjects": [
        "Twin Flames Universe",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3LRjxjPc5HO9bvpA2aYes2",
        "apple": "https://podcasts.apple.com/podcast/055-gaslighting-in-the-twin-flames-universe-jessi/id1645322193?i=1000672166689"
      }
    },
    {
      "id": "25e7bfbc-83d1-4bce-9592-67b36c932547",
      "title": "53 - Are We All Being Gaslighted? Steven Hassan on Mind Control And The Cult of Trump",
      "description": "On this episode, Dr. Robin Stern is joined by returning guest Dr. Steven Hassan , one of the world\u0027s leading experts on cults and undue influence. Steven is a mental health professional, former member of the Unification Church (familiarly known as \u0022The Moonies\u0022) led by Sun Myung Moon , and the author of several bestselling books, including Combatting Cult Mind Control , Freedom of Mind , and The Cult of Trump . In The Cult of Trump, Steven delves into how gaslighting and mind control techniques are used not only in cults but in political movements to distort reality and create confusion. Drawing on his personal experience as a former member of a high-control group, he developed the BITE Model, which explains how behavior, information, thought, and emotional control are used to manipulate individuals. On today\u0027s episode, Robin and Steven explore the role of gaslighting in authoritarian movements, cults, and abusive relationships. Steven will share his insights on how these tactics manipulate our thoughts and beliefs, and how we can arm ourselves with the tools to resist, recover, and regain our sense of reality. You won\u0027t want to miss this eye-opening conversation with Steven Hassan, as we uncover the psychology behind gaslighting and how to protect yourself from its damaging effects. To read the full transcript of this episode, head over to robinstern.com . Don\u0027t forget to subscribe to The Gaslight Effect Podcast on your favorite podcast platform, and be sure to leave us a review to let us know what you think. Until next time, remember: healing is a journey, and you don\u0027t have to walk it alone. Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Dr. Robin Stern\u0027s Books: The Gaslight Effect The Gaslight Effect Recovery Guide Emotional Intelligence for School Leaders Disclaimer: The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2024-09-10T03:00:00Z",
      "duration": "00:46:37.3430000",
      "explicit": false,
      "spotifyId": "0H9kMilwJjSffaGBw5BlQs",
      "appleId": 1000668963425,
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0H9kMilwJjSffaGBw5BlQs",
        "apple": "https://podcasts.apple.com/podcast/53-are-we-all-being-gaslighted-steven-hassan-on-mind/id1645322193?i=1000668963425"
      }
    },
    {
      "id": "16010869-74a6-4474-95cc-8589f04d9c4e",
      "title": "050 - Outsmarting Gaslighters: Proven Techniques To Navigate Gaslighting",
      "description": "On this episode, Dr. Robin Stern delves into the intricacies of mental health, personal growth, and relationships, with her guest, Dr. Judith Logue . With over 50 years of experience in the field, Dr. Logue is a renowned psychotherapist and psychoanalyst who has dedicated her career to helping individuals and couples navigate the complexities of their emotional and mental well-being. Dr. Logue\u0027s extensive background includes a Bachelor\u0027s Degree in Government from Wheaton College, a Master\u0027s Degree in Social Work from Rutgers University, and a Ph.D. in Social Work with a focus on psychology from Rutgers Graduate School of Arts and Sciences. She is also certified in psychoanalysis by the New York Center for Psychoanalytic Training and holds multiple board certifications in forensic medicine and psychological specialties. Throughout her illustrious career, Dr. Logue has practiced in various locations, including California, New York City, Princeton, NJ, and currently in Port Saint Lucie, Florida. Her professional roles have spanned clinical social work, psychotherapy, clinical faculty positions at Rutgers Medical School, and teaching roles at several prestigious psychoanalytic institutes. Dr. Logue joins Robin to shed light on a particularly insidious form of psychological manipulation: gaslighting - a type of emotional abuse where the abuser manipulates the victim into doubting their own perceptions, memories, and sanity. With her vast experience and expertise, Dr. Logue will help us understand the mechanics of gaslighting, its impact on mental health, and strategies for recognizing and combating this form of abuse. So, whether you\u0027re seeking to better understand this phenomenon or looking for ways to support someone who might be experiencing it, stay tuned for an insightful and empowering discussion with Dr. Judith Logue. To read the full transcript of this episode, head over to robinstern.com . Don\u0027t forget to subscribe to The Gaslight Effect Podcast on your favorite podcast platform, and be sure to leave us a review to let us know what you think. Until next time, remember: healing is a journey, and you don\u0027t have to walk it alone. Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer: The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2024-07-30T03:00:00Z",
      "duration": "00:46:42.2260000",
      "explicit": false,
      "spotifyId": "5dB67T3V0WDXp2EUfDVEg9",
      "appleId": 1000663748599,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5dB67T3V0WDXp2EUfDVEg9",
        "apple": "https://podcasts.apple.com/podcast/050-outsmarting-gaslighters-proven-techniques-to-navigate/id1645322193?i=1000663748599"
      }
    },
    {
      "id": "fed780e0-45ab-483d-9f52-6be5faa5d128",
      "title": "047 - Dr. Ramani Durvasula\u0027s \u0027It\u0027s Not You\u0027: Healing from Narcissism and Gaslighting",
      "description": "On this episode, Dr. Robin Stern welcomes Dr. Ramani Durvasula . Dr. Ramani is a renowned clinical psychologist, best-selling author, and a leading expert in the field of narcissism and narcissistic personality disorder. With her extensive research and deep insights into the dynamics of toxic relationships, she has become a beacon of hope for many navigating the treacherous waters of narcissistic abuse. Dr. Ramani is a licensed clinical psychologist in private practice and a distinguished professor of psychology at California State University, Los Angeles. With a Ph.D. in clinical psychology from UCLA, she brings a wealth of academic rigor and practical experience to her work. Her contributions to the field extend beyond the classroom and therapy room; she is a prolific author of several best-selling books, including \u0022 Should I Stay or Should I Go: Surviving a Relationship with a Narcissist\u0022 and \u0022Don\u0027t You Know Who I Am?: How to Stay Sane in an Era of Narcissism, Entitlement, and Incivility .\u0022 Dr. Ramani\u0027s work has shed light on the pervasive and often insidious nature of gaslighting, helping countless individuals recognize and break free from the manipulative tactics that erode their self-esteem and well-being. Her extensive media presence, including television appearances, podcasts, and her highly informative YouTube channel , has made her insights accessible to a global audience. Robin and Dr. Ramani delve into the intricate patterns of gaslighting, explaining how narcissists use this tool to control and confuse their victims. They offer practical advice on identifying gaslighting in your own life and discuss strategies to reclaim your power and rebuild your sense of self. Whether you\u0027re dealing with a narcissistic partner, family member, or colleague, this episode is packed with invaluable insights and actionable tips to help you navigate and overcome the effects of gaslighting. To read the full transcript of this episode, head over to robinstern.com . Don\u0027t forget to subscribe to The Gaslight Effect Podcast on your favorite podcast platform, and be sure to leave us a review to let us know what you think. Until next time, remember: healing is a journey, and you don\u0027t have to walk it alone. Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer: The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2024-06-18T03:00:00Z",
      "duration": "00:49:33.2170000",
      "explicit": false,
      "spotifyId": "7ArSE91UO8fWWzXXcPBUt7",
      "appleId": 1000659344351,
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7ArSE91UO8fWWzXXcPBUt7",
        "apple": "https://podcasts.apple.com/podcast/047-dr-ramani-durvasulas-its-not-you-healing-from-narcissism/id1645322193?i=1000659344351"
      }
    },
    {
      "id": "42b696ae-b22c-4fa2-a8b8-9c42a3321991",
      "title": "046 - Healing from Gaslighting and Betrayal Trauma with Anne Blythe",
      "description": "Welcome to another episode of The Gaslight Effect Podcast, with Dr. Robin Stern. Today, Robin has a very special guest, Anne Blythe , the Producer and Host of the acclaimed BTR.ORG Podcast and author of the powerful book \u0022Trauma Mama Husband Drama.\u0022 Anne is not just a voice of experience; she\u0027s a beacon of hope and guidance for countless women navigating the turbulent waters of emotional and psychological abuse. Anne has dedicated her life to helping women find safety and peace after betrayal. Through her transformative workshops— The BTR.ORG Meditation, Living Free, and Message Workshops —Anne provides practical tools and heartfelt support to those seeking to reclaim their lives from the shadows of gaslighting, abuse and coercion. In today\u0027s episode, Anne will share her personal journey of overcoming her husband\u0027s gaslighting, pornography use and anger issues, and how she turned her focus to establishing emotional and psychological safety for herself and her three children. Her real-time learning and insights have empowered many women to safely separate from abusive relationships and create harmonious homes. Join Robin and Anne as they delve into her story, offering invaluable advice and inspiration to help you recognize, confront, and heal from gaslighting and betrayal trauma. This is an episode you won\u0027t want to miss! To read the full transcript of this episode, head over to robinstern.com . Don\u0027t forget to subscribe to The Gaslight Effect Podcast on your favorite podcast platform, and be sure to leave us a review to let us know what you think. Until next time, remember: healing is a journey, and you don\u0027t have to walk it alone. Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer: The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2024-06-04T03:00:00Z",
      "duration": "00:56:35.3680000",
      "explicit": false,
      "spotifyId": "7v6Rx66k2ZBwA8rWAJGMlJ",
      "appleId": 1000657744881,
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7v6Rx66k2ZBwA8rWAJGMlJ",
        "apple": "https://podcasts.apple.com/podcast/046-healing-from-gaslighting-and-betrayal-trauma-with/id1645322193?i=1000657744881"
      }
    },
    {
      "id": "9ee30d6d-a9a6-43af-85fa-79417bafd2c1",
      "title": "045 - From Cult Survivor to Cult Expert: Dr. Janja Lalich on Cult Deconstruction and Building a Legacy at the Lalich Center",
      "description": "On this episode, Dr. Robin Stern talks with Dr. Janja Lalich . Janja is a distinguished sociologist, a leading expert on cults and coercive control, and a guiding light for those navigating the dark waters of psychological manipulation. Drawing from her own years as a cult member of the Democratic Workers Party in California, she brings a deeply personal perspective to her research. Her groundbreaking work has helped countless individuals understand and recover from the effects of toxic relationships and environments. She is the author of pivotal books such as \u0022Take Back Your Life: Recovering from Cults and Abusive Relationships,\u0022 \u0022Bounded Choice: True Believers and Charismatic Cults,\u0022 and \u0022Cults in Our Midst.\u0022 She is also the founder and director of the Lalich Center for the Study of Groups and Coercion , where she continues to support and educate those affected by manipulative groups and relationships. On today’s episode, we’re diving into the intricacies of gaslighting—what it is, how it operates, and the profound impact it can have on our lives. Dr. Stern and Dr. Lalich explore how this form of psychological abuse unfolds in both personal relationships and within larger groups, and most importantly, how to recognize and break free from it. To read the full transcript of this episode, head over to robinstern.com . Don\u0027t forget to subscribe to The Gaslight Effect Podcast on your favorite podcast platform, and be sure to leave us a review to let us know what you think. Until next time, remember: healing is a journey, and you don\u0027t have to walk it alone. Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer: The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2024-05-21T03:00:00Z",
      "duration": "00:54:12.9020000",
      "explicit": false,
      "spotifyId": "7GXQS2QQWUDUhgmr1bLFKQ",
      "appleId": 1000656218041,
      "subjects": [
        "Cult-Expert",
        "Democratic Workers Party"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7GXQS2QQWUDUhgmr1bLFKQ",
        "apple": "https://podcasts.apple.com/podcast/045-from-cult-survivor-to-cult-expert-dr-janja-lalich/id1645322193?i=1000656218041"
      }
    },
    {
      "id": "9f00fe02-0a6b-4448-b9f2-863d5b0e3aa6",
      "title": "044 - Sarah McCammon\u0027s Exvangelical Journey: Is Gaslighting Influencing Faith, Politics, and Society?",
      "description": "On this episode of The Gaslight Effect Podcast, Dr. Robin Stern unravels the complexities of belief, identity, and society with political correspondent and author Sarah McCammon . Sarah McCammon is not just a seasoned journalist; she\u0027s also a voice of insight and understanding in the midst of today\u0027s tumultuous political landscape. But what sets her apart is her personal journey—a journey that intersects faith, culture, and the very fabric of American society. Growing up in the heartland of Kansas City, Missouri, Sarah was immersed in an evangelical Christian community that taught her to fear God and never question her faith. But her worldview shifted when she ventured beyond the confines of her upbringing. It was during her time in the Senate Page Program, living in Washington, D.C., that she began to confront the complexities of belief and identity head-on. Now, as a national political correspondent for NPR, Sarah brings a unique perspective to her reporting, drawing from her own experiences to shed light on the intersections of religion and politics in America. Her latest endeavor, the groundbreaking book \u0022The Exvangelicals: Loving, Living, and Leaving the White Evangelical Church,\u0022 delves into the stories of those who, like herself, have grappled with their faith and ultimately forged a new path forward. Join us as we explore Sarah McCammon\u0027s journey from evangelicalism to advocacy, uncovering the gaslighting tactics that have shaped our political discourse and the resilience of those who dare to challenge the status quo. To read the full transcript of this episode, head over to robinstern.com . Don\u0027t forget to subscribe to The Gaslight Effect Podcast on your favorite podcast platform, and be sure to leave us a review to let us know what you think. Until next time, remember: healing is a journey, and you don\u0027t have to walk it alone. Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer: The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2024-05-07T03:00:00Z",
      "duration": "00:46:29.9290000",
      "explicit": false,
      "spotifyId": "6J7vASp6iOiz9ZLuww4RGt",
      "appleId": 1000654754427,
      "subjects": [
        "Evangelicalism",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6J7vASp6iOiz9ZLuww4RGt",
        "apple": "https://podcasts.apple.com/podcast/044-sarah-mccammons-exvangelical-journey-is-gaslighting/id1645322193?i=1000654754427"
      }
    },
    {
      "id": "eca8eea9-efff-4caa-987d-22d7b2e7c5cb",
      "title": "043 - Surviving The Cult of NXIVM: Sarah Edmondson and Anthony Ames\u0027 Resilience in the Face of Manipulation",
      "description": "On this episode, Dr. Robin Stern is honored to be joined by two extraordinary individuals whose resilience and courage have transformed their experiences into beacons of hope. Sarah Edmondson , a Canadian actress known for her roles in CBS\u0027s \u0022Salvation\u0022 and numerous Hallmark Channel and Lifetime films, embarked on a journey of self-discovery when she encountered NXIVM , a personal development company led by Keith Raniere , promising the keys to unlocking human potential. Alongside her husband and former college athlete, Anthony \u0022Nippy\u0022 Ames , Sarah delved deep into NXIVM\u0027s teachings. Rising through the ranks, they both became integral figures within the organization, with Anthony drawn to its goals program and Sarah operating her own center in Vancouver. However, their seemingly idyllic journey took a dark turn when they uncovered the truth behind NXIVM\u0027s facade. With courage and determination, Sarah blew the whistle on the organization\u0027s gaslighting and abusive practices, while Anthony wasted no time in helping burn its carefully constructed public image to the ground. In 2019, Sarah published Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life, with Kristine Gasbarre. In this tell-all memoir, she shares her story from the moment she takes her first seminar to her harrowing fight to get out. Sarah and Anthony\u0027s full story as whistleblowers is featured in The Vow , the critically acclaimed HBO documentary series on NXIVM. Also be sure to check out Sarah\u0027s powerful TED Talk about How To Spot A Cult . Now, as hosts of the enlightening podcast \u0022A Little Bit Culty,\u0022 Sarah and Anthony continue to shine a light on the healing process, engaging with experts and fellow survivors to navigate the complexities of recovery and resilience. Join Robin as she delves into the depths of gaslighting and coercion with Sarah Edmondson and Anthony \u0022Nippy\u0022 Ames, and explores how they emerged with newfound understanding and empowerment. To read the full transcript of this episode, head over to robinstern.com . Don\u0027t forget to subscribe to The Gaslight Effect Podcast on your favorite podcast platform, and be sure to leave us a review to let us know what you think. Until next time, remember: healing is a journey, and you don\u0027t have to walk it alone. Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer: The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2024-04-23T03:00:00Z",
      "duration": "01:03:01.2620000",
      "explicit": true,
      "spotifyId": "0jB6Ifr4clY8qPR9M1aMKB",
      "appleId": 1000653280024,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0jB6Ifr4clY8qPR9M1aMKB",
        "apple": "https://podcasts.apple.com/podcast/043-surviving-the-cult-of-nxivm-sarah-edmondson/id1645322193?i=1000653280024"
      }
    },
    {
      "id": "dcef097e-0bc3-4cab-804b-5bf24d3f9d1d",
      "title": "039 - Sobriety, Sisterhood, and Self-Discovery after Multilevel Marketing: A Conversation with Emily Paulson",
      "description": "On this episode, Dr. Robin Stern dives into the transformative journey of Emily Paulson - a beacon of courage, resilience, and authenticity in the realm of wellness and empowerment. Emily Paulson\u0027s remarkable journey, chronicled in her books \u0022Highlight Real: Finding Honesty \u0026 Recovery Beyond the Filtered Life\u0022 and \u0022Hey, Hun: Sales, Sisterhood, Supremacy, and the Other Lies Behind Multilevel Marketing,\u0022 offers profound insights into the complexities of addiction recovery, motherhood, and the insidious nature of gaslighting. In discussing her book \u0022Highlight Real\u0022 with Robin, Emily talks about fearlessly confronting the shadows of addiction and gaslighting, sharing her personal odyssey of overcoming alcohol addiction and embracing sobriety. Through raw honesty and vulnerability, she shines a light on the manipulative tactics that seek to distort our reality and erode our sense of self-worth. But Emily\u0027s exploration extends beyond addiction recovery. She also discusses with Robin her reason for writing her book \u0022Hey, Hun,\u0022 in which she exposes the hidden truths behind the glossy facade of multilevel marketing schemes, unraveling the gaslighting tactics that prey on vulnerability and perpetuate harmful ideologies. Her incisive analysis challenges conventional narratives, prompting readers and listeners to question the pervasive \u0027Hey, Hun\u0027 messages flooding our inboxes. Moreover, Emily is the driving force behind the \u0022Sober Mom Squad\u0022 - a sanctuary where motherhood intersects with sobriety, and connections flourish. This Squad, comprised of moms navigating the delicate balance of motherhood and sobriety, provides a lifeline of understanding and support. Through shared stories and unwavering solidarity, the Sober Mom Squad creates pockets of community in the midst of solitude. Join Robin and Emily as they explore the transformative power of vulnerability, resilience, and connection. Through her courageous journey, Emily invites us to reclaim our truth, embrace our imperfections, and walk boldly along the path to self-discovery and empowerment. You can read the full transcript of this episode and listen to other episodes, at robinstern.com , and please leave a rating and review wherever you listen to this podcast! Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer: The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2024-02-27T03:00:00Z",
      "duration": "00:45:51.4840000",
      "explicit": false,
      "spotifyId": "2n3DegWzmTYbkDYirycQIq",
      "appleId": 1000647174237,
      "subjects": [
        "Multi-Level Marketing",
        "Cult Psychology",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2n3DegWzmTYbkDYirycQIq",
        "apple": "https://podcasts.apple.com/podcast/039-sobriety-sisterhood-and-self-discovery-after/id1645322193?i=1000647174237"
      }
    },
    {
      "id": "4a764dce-1183-45ea-83c4-9f9c736527db",
      "title": "036 - Unlocking Emotional Intelligence: A Conversation with Daniel Goleman on Gaslighting",
      "description": "On this episode, Dr. Robin Stern dives into the world of emotional intelligence and gaslighting with psychologist and acclaimed author, Daniel Goleman. Daniel Goleman has left an indelible mark in psychology with his groundbreaking work on emotional intelligence. As an accomplished author, his insights have not only enriched our understanding of the human psyche. Daniel\u0027s work has also paved the way for transformative conversations that are foundational for transforming lives - from personal to professional.  Many may know Daniel as the Father of Emotional Intelligence, as his 1995 book  Emotional Intelligence served to launch the field.    Daniel\u0027s new book, Optimal reveals practical methods for using our inner resources to more readily enter an optimal state of high performance and satisfaction while avoiding burnout. During their conversation, Robin and Daniel focus on the pressing topic of gaslighting, a subtle  form of psychological manipulation. They unravel the layers of gaslighting, delving into its tactics, consequences, and the pivotal role emotional intelligence plays in recognizing and countering this destructive behavior. As an author who has explored the depths of human emotions, Daniel Goleman brings a unique perspective to the discussion that goes beyond the surface, exploring the nuances of gaslighting and its impact on our well-being.  You can read the full transcript of this episode and listen to other episodes, at robinstern.com, and please leave a rating and review wherever you listen to this podcast!  Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer:  The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.    ",
      "release": "2024-01-16T03:00:00Z",
      "duration": "00:47:50.9140000",
      "explicit": false,
      "spotifyId": "5yZJTf2UTwnfCz4jLkoXTJ",
      "appleId": 1000641785593,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5yZJTf2UTwnfCz4jLkoXTJ",
        "apple": "https://podcasts.apple.com/podcast/036-unlocking-emotional-intelligence-a-conversation/id1645322193?i=1000641785593"
      }
    },
    {
      "id": "d338158e-89ff-4a9a-8f77-55acb06f8f99",
      "title": "033 - Gaslighting Inside the Oath Keepers\u0027 Founder\u0027s Family with Dakota Adams",
      "description": "On this episode, Dr. Robin Stern talks with  Dakota Adams, son of Stewart Rhodes, the founder and leader of the Oath Keepers organization. Dakota opens up about a life that was not only entangled with the controversial Oath Keepers but also shadowed by the dark clouds of gaslighting and abuse. Gaslighting, a form of psychological manipulation that seeks to make victims doubt their reality, is a theme woven into the fabric of Dakota\u0027s narrative. He recounts the harrowing escape from an environment marked by violence and chaos, where he and his siblings\u0027 perceptions were constantly manipulated. Dakota reveals the intricate layers of his father\u0027s personality, from the early days of criticism against political figures to a surprising evolution that ultimately led to Stewart Rhodes\u0027 involvement in the infamous events at the U.S. Capitol on  January 6, 2021. But it\u0027s not just a story of political activism; it\u0027s a story of survival. Dakota shares the devastating effects of gaslighting on a family, detailing the struggles of breaking free from a cycle of manipulation, fear, and isolation. Join Robin and Dakota as they unravel the complexities of Dakota\u0027s life, a life shaped by an organization founded on principles that devolved into chaos. This episode will take you beyond the headlines, providing a closer look at the impact of gaslighting on individuals, families, and communities. You can read the full transcript of this episode and listen to other episodes over at robinstern.com, and please leave a rating and review wherever you listen to this podcast!  Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer:  The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.",
      "release": "2023-12-19T03:00:00Z",
      "duration": "01:00:45.8300000",
      "explicit": false,
      "spotifyId": "5y3VzBfxNqEnkw8DZTn3zp",
      "appleId": 1000638102959,
      "subjects": [
        "Qanon",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5y3VzBfxNqEnkw8DZTn3zp",
        "apple": "https://podcasts.apple.com/podcast/033-gaslighting-inside-the-oath-keepers-founders/id1645322193?i=1000638102959"
      }
    },
    {
      "id": "6eb4fe58-909d-4bb5-9d20-4a4d7df538b2",
      "title": "031 - Understanding Gaslighting Through the Lens of Emotional Intelligence: A Conversation with Dr. Marc Brackett",
      "description": "On this episode, the intricate realms of gaslighting, human behavior and emotional intelligence intersect, as Dr. Robin Stern talks with her colleague and good friend, Dr. Marc Brackett.  Dr. Brackett is the Director of the  Yale Center for Emotional Intelligence, and author of \u0022Permission to Feel.\u0022  On this episode, Dr. Stern and Dr. Brackett unravel the subtle dynamics of gaslighting, a pervasive issue affecting relationships, workplaces, and self-perception. Dr. Brackett, with a wealth of expertise, illuminates the profound connection between emotional intelligence and gaslighting. Gaslighting, fundamentally rooted in the manipulation of emotions, finds itself at the intersection of emotional intelligence. Dr. Brackett\u0027s insights go beyond defining gaslighting; they explore the pivotal role emotional intelligence plays in both perpetuating and countering this intricate form of manipulation. Robin and Marc discuss insights into the significance of recognizing and validating emotions, which is one of the foundational aspects of emotional intelligence. Dr. Brackett shares strategic approaches for harnessing emotional intelligence to fortify against gaslighting tactics and nurture resilient, healthier relationships. This episode promises to be an invaluable compass for navigating the nuanced waters of emotions and relationships. To read the full transcript of this episode and to listen to other episodes, head over to robinstern.com, and please be sure to leave a rating and review wherever you listen to this podcast!  Dr. Robin Stern\u0027s Social Media Links: Facebook - https://www.facebook.com/drrobinstern/ Instagram - https://www.instagram.com/dr.robinstern/ Twitter (X) - https://twitter.com/RobinSStern LinkedIn - https://www.linkedin.com/in/robin-stern-220b403a Disclaimer:  The views and opinions expressed on The Gaslight Effect Podcast do not necessarily reflect the official policy or position of the podcast. Any content provided by our guests, bloggers, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, business individual, anyone or anything.  ",
      "release": "2023-11-21T00:00:00",
      "duration": "00:52:25.2290000",
      "explicit": false,
      "spotifyId": "5iY4Xy4KFSaJ72hjigaBqn",
      "appleId": 1000635496533,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5iY4Xy4KFSaJ72hjigaBqn",
        "apple": "https://podcasts.apple.com/podcast/031-understanding-gaslighting-through-the-lens/id1645322193?i=1000635496533"
      }
    },
    {
      "id": "c7798e6d-1e0a-4fe2-b018-2013a20ea2f0",
      "title": "020 - Surviving and Thriving Beyond The Sarah Lawrence Cult",
      "description": "On this episode, Dr. Robin Stern interviews writer and producer, Daniel Levin.  Daniel Levin holds an MFA in poetry from the University of California, Irvine, where he taught creative writing and rhetoric, and a bachelor’s degree from Sarah Lawrence College. He is the winner of the Stanley and Evelyn Lipkin Prize for Poetry, the Lynn Garnier Memorial Award and is the recipient of fellowships from The Frost Place, Tent, The Sarah Lawrence Summer Seminar for Writers, and The Community of Writers at Squaw Valley. His writing has appeared in Provincetown Arts, Bat City Review, The Sarah Lawrence Review, The Westchester Review, The Offbeat, The Fourth River, and The Bennington Review. He lives in Los Angeles. Daniel is the author of  Slonim Woods 9: A Memoir, which recounts Daniel\u0027s involvement, and subsequent escape from the college cult that rocked the nation in 2019.  Daniel is also an Executive Producer of  Stolen Youth: Inside the Cult at Sarah Lawrence, a three-part series airing on Hulu, that documents \u0022A group of bright Sarah Lawrence College students\u0022 that \u0022fall under the dark influence of a friend’s father, Larry Ray. With unprecedented access to the survivors who lived with Ray, the film follows the cult from its origins through its still-unfolding aftermath.\u0022 Daniel and Robin discuss the path that led Daniel into this cult, the bizarre and often terrifying experiences he had, and ultimately his escape from the grip of Larry Ray.  Daniel not only survived the ordeal, but is now thriving as an author and teacher.  To read the full transcript of this episode and to hear other episodes, head over to robinstern.com, and please leave a rating and review wherever you listen to this podcast! ",
      "release": "2023-06-20T00:00:00",
      "duration": "00:56:36.2000000",
      "explicit": false,
      "spotifyId": "5PVcntrmHc96yXHMFG1q1G",
      "subjects": [
        "Larry Ray"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5PVcntrmHc96yXHMFG1q1G"
      }
    },
    {
      "id": "57a5f32f-75eb-49d0-a21e-2e7b46947c95",
      "title": "018 - Cults, Mind Control, and How it Can Happen to You",
      "description": "On this episode Dr. Robin Stern interviews her friend and colleague Dr. Steven Hassan.  Dr. Hassan is a leading expert on cults and has dedicated his life to preventative education and helping people recover from their own experiences.  Dr. Hassan is the author of four books: Combating Cult Mind Control;  Releasing The Bonds; Freedom Of Mind; and his most recent book,  The Cult Of Trump.  Dr. Hassan  describes in great detail how he became part of a cult in college, the techniques that were used on him (and ultimately by him) to exert mind control, and the steps he took to get out.  Dr. Hassan describes mind control as a three step process:  Unfreezing the person\u0027s identity Indoctrination Refreezing the person\u0027s new identity  Robin and Steven discuss the influence of cell phones on the masses and the flood of information from sometimes radical sources. Dr. Stern and Dr. Hassan also explain that human beings are emotionally driven, rationalize a lot, and are incredibly adaptive to people in their environment as well as to leaders that they think are legitimate.  Dr. Hassan identifies the signs to look for if you think someone you know may be in a cult, and the importance of showing love toward that person to help them break free.  As Dr. Hassan says, \u0022Love is stronger than mind control.\u0022 To see the full transcript of this episode and to listen to other episodes, head over to robinstern.com, and pelase be sure to leave a rating and review wherever you listen to this podcast!         ",
      "release": "2023-05-23T00:00:00",
      "duration": "00:48:10",
      "explicit": false,
      "spotifyId": "6WUGV22b8IqU09Lofiwj9Z",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6WUGV22b8IqU09Lofiwj9Z"
      }
    },
    {
      "id": "9abd7b6a-26e8-40bd-a020-310b30fb2ef0",
      "title": "015 - Am I Crazy? Or Am I Being Gaslighted?",
      "description": "On this episode, Dr. Robin Stern talked with her close friend and colleague, Alice Forrester, the CEO of Clifford Beers Community Health Partners. Alice discussed how growing up as a teenager in the 1970s, she was aware of the culture shift that was occuring at that time in our country, and how her father struggled with this changing dynamic.  Alice recalled often being told she was wrong by her father, about certain opinions she was formulating at that time, and how that did not leave her unscathed.  Alice and Robin unpacked Alice\u0027s feelings of being \u0022wrong\u0022 and how that has impacted her adult life. Alice shared a deeply personal account of when her nephew recently passed away at a young age from COVID and how she felt she couldn\u0027t say the right words to comfort her sister in her grief, and how this stirred up deeply emotional feelings of not being good enough.  Alice also shared that at the same time, her marriage was going through a difficult time, and how she was being gaslighted by her partner regarding their relationship.  Robin and Alice worked through the the idea that these multiple experiences of gaslighting can cause you to think that maybe you are wrong, and to second guess your own reasoning. Often, giving yourself space allows you to gain a better understanding of what is happening and spurs you to change or get out of the gaslighting situation.  Alice shared how understanding what gaslighting means and what to look for, has helped her in raising her daughters in these unsettled times during the pandemic and post pandemic, when we  often are told to believe things that are constantly changing and things that we know are not accurate.  To read the full transcript of this episode and to listen to other episodes, please head over to robinstern.com.  And don\u0027t forget to leave a rating and review wherever you listen to this podcast!         ",
      "release": "2023-04-11T00:00:00",
      "duration": "00:40:46.8370000",
      "explicit": false,
      "spotifyId": "6PbQwk5i92sHnGgChRjXW5",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6PbQwk5i92sHnGgChRjXW5"
      }
    },
    {
      "id": "7fb874c0-9859-4387-8472-4f44b54ef519",
      "title": "014 - The Horror of Gaslighting",
      "description": "On this episode, Dr. Robin Stern talks with Ian Nichols, co-host of  It\u0027s Only A Podcast - a horror movie review show.  Robin has been a guest on several of Ian\u0027s podcast episodes that explore gaslighting in horror movies.  Ian shares his personal experience with gaslighting, both within a romantic relationship as well as with his parents.  Ian describes himself as an empath and a very emotional person who often cries during emotional moments in his life.  As a child, Ian\u0027s parents instilled the thought in himself that he \u0022cried too much.\u0022  His childhood was marred by abuse, an alcoholic mother, an often distant father, and parents who continually told him he was too sensitive.  Growing up, Ian felt he had to hide the emotional side of himself in friendships and relationships, and he often used humor to deflect away from getting \u0022too emotional.\u0022 This ultimately led to Ian falling into a deep depression.  Ian also shares about a relationship in which his partner was from a different culture that didn\u0027t value feminity and vulnerablity.  This again made Ian feel that something was wrong with him.  Thankfully, Ian was able to work through these issues with a therapist and discovered that he was involved in gaslighting situations with both his parents and in his relationship.  Robin and Ian discuss the importance of having a strong support network to help you process painful interactions with gaslighters...and the value of \u0022healthy emotion snacks!\u0022 To read the full transcript of this episode and to hear other episodes, head over to robinstern.com.  And please leave a rating and review wherever you listen to this podcast!",
      "release": "2023-03-28T00:00:00",
      "duration": "00:48:12.6090000",
      "explicit": false,
      "spotifyId": "6d8lSCkyin6xRIaZalT7lN",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6d8lSCkyin6xRIaZalT7lN"
      }
    },
    {
      "id": "4e27155b-2095-441f-906a-9a2ea2998569",
      "title": "008 - Exploring The Trauma of Gaslighting",
      "description": "On this episode, Dr. Robin Stern talks with Dr. George Bonanno, Professor of Clinical Psychology at Columbia University. Dr. Bonanno is the author of two amazing books - The End of Trauma and  The Other Side of Sadness.  From Dr. Bonanno\u0027s website :  \u0022He is recognized by the Web of Science as among the top one percent most cited scientists in the world, and has been honored with lifetime achievement awards by both the Association for Psychological Science and the International Positive Psychology Association. In addition to the books, The End of Trauma and  The Other Side of Sadness, George has published hundreds of peer-reviewed scientific articles, many appearing in leading journals such as Nature, JAMA, American Psychologist, and the Annual Review of Psychology. He is also an avid painter (when he has time), reads widely, and loves music.\u0022   Robin and Dr. Bonanno explore how human trauma plays a role in gaslighting and some tools of resilience that can help in dealing with and healingl the trauma of gaslighting.    Robin points out that gaslighters are not born.  Gaslighting is the result of social learning.  A gaslighter tries something and it works, and they need to be in control of a moment, so they continue to use this tactic.    Dr. Bonanno talks about the flexibility mindset and using this to determine ways to not allow the gaslighter to control you.     Robin and Dr. Bonanno also look into the grief and sadness that can accompany the ending of a gaslighting relationship.  Even though the gaslightee can be happy and relieved, they are also susceptible to being sad at the loss of a relationship that they may have had for a very long time.    To read the complete transcript of this episode and to hear other episodes of The Gaslight Effect Podcast, head over to robinstern.com.  And please leave a rating and review if you enjoyed this episode!            ",
      "release": "2023-01-03T00:00:00",
      "duration": "00:38:52.5830000",
      "explicit": false,
      "spotifyId": "0a3rhnGngH2gwG5zAJ3Aju",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0a3rhnGngH2gwG5zAJ3Aju"
      }
    }
  ]
}