{
  "_ts": 0,
  "id": "b175c634-74d0-4f54-8b10-8574321b9324",
  "name": "The Life Shift - Pivotal Life-Changing Moments",
  "spotifyId": "03woj28wP9kaXsczwxmXKo",
  "appleId": 1613618660,
  "episodes": [
    {
      "id": "462c1f72-a709-40e0-b467-f1c3b8fb4da9",
      "title": "Breaking Free: Lewis Crompton\u0027s Journey from Strict Faith to Personal Freedom",
      "description": "In this compelling episode of \u0022The Life Shift Podcast,\u0022 Lewis Crompton explores his transformative journey from a strict religious upbringing to discovering personal freedom and identity. The discussion dives deep into the psychological impacts of childhood trauma, the allure of religious certainty, and the empowering role of supportive communities. Lewis candidly shares his struggles and triumphs, offering invaluable lessons on resilience, self-discovery, and the creation of inclusive environments. The Complex Relationship Between Trauma and Religious Commitment: Lewis Crompton shares how suppressed childhood trauma often leads people to seek the psychological safety found in the black-and-white belief systems of a strict religious environment. This insight sheds light on the intricate connection between personal trauma and the desire for certainty that such religious structures offer, providing listeners with a deeper understanding of the psychological underpinnings of religious commitment and an enlightened perspective on their own experiences. Reclaiming Personal Freedom and Redefining Identity: Throughout the episode, Lewis reflects on his journey of breaking away from the confines of his religious upbringing. Through therapy and self-reflection, he uncovered suppressed memories and gained a clearer understanding of his behaviors. This journey towards self-awareness enabled him to redefine his identity outside of the religious context, emphasizing the importance of personal freedom in achieving authentic self-expression. The Role of Community in Facilitating Personal Growth: Lewis emphasizes the crucial role of community in his ongoing journey of personal growth and healing. By fostering a supportive financial trading community, he has created a space where individuals feel psychologically safe and empowered. This aspect of his story highlights the transformative power of building inclusive and understanding environments where people can thrive and support each other. Guest Bio: Lewis Crompton is dedicated to helping 1 million families live with less stress and more fun through financial education and empowerment. He achieved financial freedom by trading financial markets over a decade ago, having been taught by Robert Kiyosaki’s Rich Dad Poor Dad and later headhunted to teach for them. As a leading voice in the industry, Lewis champions safe, systematic, and profitable trading techniques. He developed the STARTrading Method, empowering individuals to trade efficiently in under 30 minutes daily, generating exceptional monthly returns. Connect with Lewis Crompton: Access a free masterclass from Lewis on trading and wealth creation: https://startradingnow.com/the-startrading-masterclass-podcast/ STARTrading Facebook Group YouTube Channel Resources: To listen in on more conversations about pivotal moments that changed lives forever, subscribe to \u0022The Life Shift\u0022 on Apple Podcasts or wherever you listen to podcasts. If you enjoyed this episode, please take a moment to rate the show 5 stars and leave a review! ⭐️⭐️⭐️⭐️⭐️ Access ad-free episodes released two days early and bonus episodes with past guests through Patreon. ht tps://patreon.com/thelifeshiftpodcast Connect with me: Instagram: www.instagram.com/thelifeshiftpodcast Facebook: www.facebook.com/thelifeshiftpodcast YouTube: https://bit.ly/thelifeshift_youtube Twitter: www.twitter.com/thelifeshiftpod LinkedIn: https://www.linkedin.com/company/thelifeshiftpodcast Website: www.thelifeshiftpodcast.com Mentioned in this episode: Thank you to Ear Worthy - Ear Worthy Independent Podcast Awards https://podnews.net/press-release/ear-worthy-awards-2024 This podcast uses the following third-party services for analysis: Podcorn - https://podcorn.com/privacy",
      "release": "2024-10-08T08:00:00Z",
      "duration": "00:59:52.5300000",
      "explicit": false,
      "spotifyId": "6mezCNsYBTMj1NmFQV0Sov",
      "appleId": 1000672190182,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6mezCNsYBTMj1NmFQV0Sov",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-lewis-cromptons-journey-from-strict-faith/id1613618660?i=1000672190182"
      }
    }
  ]
}