{
  "id": "660e1e29-2847-4fec-b240-5896e527ea3c",
  "name": "The Flo Show, no filter",
  "spotifyId": "1i2SwF7ZykPG57kiQiLHP0",
  "appleId": 1777113518,
  "episodes": [
    {
      "id": "061c3871-f69c-41af-b0ac-b3a41eb96050",
      "title": "Secret Tunnels and Legal Power Moves: Inside Diddy\u0027s Defense Strategy",
      "description": "Send us a text A game-changing revelation has emerged in the Diddy case as secret tunnels connected to his pool have finally been discovered by a property investor touring the former party mansion. For months, rumors swirled about these mysterious passageways, but now we have confirmation—along with the disturbing discovery of hidden baby oil bottles that prompted immediate legal threats when posted online. The timing couldn\u0027t be more significant as we stand just one week away from the trial that could determine Diddy\u0027s fate. The embattled music mogul appears to be making his first truly strategic move since his arrest by pursuing celebrity attorney Joe Takapina, the legal powerhouse who recently secured an acquittal for A$AP Rocky despite video evidence. Known for his \u0022devastating\u0022 cross-examinations and meticulous preparation (25 hours of prep for each hour in court), Takapina represents the best chance Diddy has at mounting a credible defense. There\u0027s just one problem—his $2,400 hourly rate is non-negotiable, and Diddy\u0027s once-billion-dollar fortune has reportedly dwindled to $300 million as he offloads properties to cover mounting legal expenses. The courtroom drama intensifies as we await crucial decisions about jury sequestration and anonymity. Defense attorneys have pushed for jurors to be isolated in hotel rooms throughout the trial to prevent outside influence, while also submitting an extensive questionnaire probing potential jurors\u0027 attitudes toward parties involving multiple sexual partners. Tomorrow brings another pivotal moment as we expect to learn details of the plea agreement Diddy immediately rejected—terms that will reveal exactly how confident prosecutors feel about their case against him. As both sides prepare for battle, the confirmation of these hidden tunnels adds weight to some of the most troubling allegations. With jury selection beginning May 5th and five serious federal charges hanging in the balance, we\u0027re witnessing what could be Diddy\u0027s last stand. Subscribe to the Flow Show as we continue providing unfiltered coverage of this case through verdict day, bringing you the facts without corporate influence or agenda. Support the show Go to this link to subscribe to my podcast to get all the exclusive podcasts uncovering the celebrity scandals! Diddy/Clive connection! What really happened to Whitney Houston, Aaliyah and more! https://www.buzzsprout.com/2419432/subscribe for merch (hoodies, tees etc) go to my shopify linked below! www.andidontlikeit.com FOR ANY ISSUES with your subscription please reach out to support@buzzsprout.com and they will be happy to assist you! FOR ALL VIDEO VERSIONS OF \u0022THE FLO SHOW NO FILTER\u0022 LIVE SUBSCRIBE TO MY PATREON! FloDaddyFlo | \u0022Uncover the Stories Behind the Headlines: Exclusive Celebrity \u0026 | Patreon TAP THE LINK!",
      "release": "2025-04-30T13:00:00Z",
      "duration": "01:13:57.4200000",
      "explicit": true,
      "spotifyId": "7EfLs6FjfVr9HHDC6XA4Hj",
      "appleId": 1000705551404,
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7EfLs6FjfVr9HHDC6XA4Hj",
        "apple": "https://podcasts.apple.com/podcast/secret-tunnels-and-legal-power-moves-inside-diddys/id1777113518?i=1000705551404"
      }
    },
    {
      "id": "250c49cb-8fab-4b82-b14e-7881978a966a",
      "title": "Hollywood\u0027s Dark Underbelly Exposed: Misha\u0027s Chilling Story and Diddy\u0027s High-Stakes Legal Battle...Will Diddy Get Bail Monday???",
      "description": "Send us a text Brace yourself for an eye-opening exploration into the dark secrets of Hollywood as we reveal the harrowing experiences of Misha, a courageous survivor who lifts the veil on the sinister underbelly of the entertainment industry. Misha\u0027s shocking revelations about the abuse and manipulation she endured at the hands of powerful figures, including Mohawk Diddy, bring to light the systemic failures that allowed such horrors to persist. Her story is a chilling testament to the courage it takes to confront such evils and demand accountability from those who wield power in the shadows. This episode is a call to action, challenging us to acknowledge and address the dark side of fame and fortune. As we navigate the high-stakes courtroom drama surrounding Sean \u0022Diddy\u0022 Combs, we dive into the legal intricacies of his bail hearing, where he faces serious charges like sex trafficking and racketeering. With tension mounting, we scrutinize the proposals from Diddy\u0027s legal team for a stringent bail package amidst widespread skepticism about the ability of his private security to enforce the restrictions. The lenient stance of the judge raises eyebrows and concerns about the potential risks involved if bail is granted. Join us for an intense and compelling discussion on the fight for justice, the courage of survivors like Misha, and the broader implications for the entertainment industry. Support the show follow me on all social media platforms @flodaddyflo please subscribe to support my channel!",
      "release": "2024-11-23T13:00:00Z",
      "duration": "00:33:52.6920000",
      "explicit": true,
      "spotifyId": "5EwnVkqSKngokurYC65jMg",
      "appleId": 1000678007617,
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5EwnVkqSKngokurYC65jMg",
        "apple": "https://podcasts.apple.com/podcast/hollywoods-dark-underbelly-exposed-mishas-chilling/id1777113518?i=1000678007617"
      }
    }
  ]
}