{
  "id": "baf27675-ccd6-4e70-8126-02b7f22bebe9",
  "name": "The Long Distance Love Bombs Podcast",
  "spotifyId": "5IjrJH7Aq24B8oyy81z6ME",
  "appleId": 1438349939,
  "youTubeChannelId": "UCpgsBdbKN85J8IgeTSMCrFw",
  "episodes": [
    {
      "id": "00d7c1fa-30db-49b1-a744-767718742ea5",
      "title": "139: Sarah Edmondson - What do you learn from whistleblowing a sex cult?",
      "description": "Sarah Edmondson is an actress who appeared on the popular CBC teen soap series, \u0022Edgemont,\u0022 SyFy’s \u0022Andromeda,\u0022 \u0022Continuum,\u0022 and \u0022Stargate SG-1\u0022, USA Network’s \u0022Dead Zone\u0022 and Lifetime Television’s \u0022Killer Hair\u0022 and \u0022Hostile Makeover.\u0022 As a voice-over artist, Sarah has created original voices for Cartoon Network’s \u0022Max Steel,\u0022 and \u0022Transformers Cybertron,\u0022 Discovery Kids \u0022Class of the Titans,\u0022 Hasbro’s \u0022My Little Pony: Friendship is Magic,\u0022 and Netflix’s \u0022Dinotrux.\u0022 Sarah has also voiced characters for popular international children’s series, including The Rose in France Télévisions \u0022Le Petit Prince\u0022 and Thea Stilton for Italy’s Rai 2’s \u0022Geronimo Stilton.\u0022 Sarah was seen in various Hallmark movies, including AT HOME IN MITFORD, alongside award-winning actress Andie MacDowell. She played supporting roles in Hallmark’s WEDDING OF DREAMS, starring Debbie Gibson, and Season Two of CBS\u0027s \u0022Salvation.\u0022 Just before the birth of her second child, she appeared in Hallmark’s WELCOME TO CHRISTMAS. In 2005, Sarah joined NXIVM, a personal and professional development company. Over her 12-year tenure, she went from student to coach and eventually operated her own NXIVM center in Vancouver. In 2019, Sarah published Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life, with Kristine Gasbarre. In this tell-all memoir, she shares her story from the moment she takes her first seminar to her harrowing fight to get out of NXIVM, collaborate with the FBI, help others, and heal. Sarah’s full story is featured in“The Vow,” the critically acclaimed HBO documentary series on NXIVM. Now with the launch of her own podcast, “A Little Bit Culty,” co-hosted by her husband and fellow NXIVM whistleblower Anthony “Nippy” Ames, she aims to help people understand, heal from, and avoid abusive situations, one little red flag at a time. Her podcast: https://www.alittlebitculty.com Her organization, #iGotOut, inspires survivors of cultic abuse to tell and share their stories, creating an online community dedicated to unflinching honesty: www.igotout.org. Her book: https://www.sarahedmondson.com/book The Vow: https://www.hbo.com/the-vow Instagram: https://www.instagram.com/sarahedmondson Twitter: https://twitter.com/sarahjedmondson Facebook: https://www.facebook.com/SarahJEdmondson Website: https://www.sarahedmondson.com Cameo: https://www.cameo.com/sarahandnippy ______________________________ Follow me on Instagram @LongDistanceLoveBombs: https://www.instagram.com/longdistancelovebombs Looking for a heartfelt gift? Visit my print shop here: https://www.longdistancelovebombs.com/theshop Sign up for my weekly newsletter! Each week, I share a personal story and my favorite books, tunes, articles, and ideas. Click here: http://eepurl.com/T0l91. It\u0027s easy and takes five seconds. Check out a list of 120 of my favorite books here, including many my guests have written and recommend reading: https://www.amazon.com/shop/longdistancelovebombs",
      "release": "2021-09-14T19:16:05Z",
      "duration": "01:21:57.8000000",
      "explicit": true,
      "spotifyId": "5td0VjFsrucMuKbRe20WKf",
      "appleId": 1000535329784,
      "youTubeId": "6V5G9T14IfA",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5td0VjFsrucMuKbRe20WKf",
        "apple": "https://podcasts.apple.com/podcast/139-sarah-edmondson-what-do-you-learn-from-whistleblowing/id1438349939?i=1000535329784",
        "youtube": "https://www.youtube.com/watch?v=6V5G9T14IfA"
      }
    }
  ]
}