{
  "id": "33a8283c-6654-4d5a-9e20-0d6d8f6337f2",
  "name": "The Harlot\u0027s of Spook Talk",
  "spotifyId": "3dut09zNdDjvOGWm9taAat",
  "youTubeChannelId": "UC5WEh_z41diHOPYCak555kw",
  "episodes": [
    {
      "id": "69ac84e1-c678-4cae-b60e-e33e75dbb1cb",
      "title": "Children of God CULT Interview with Phil Seibel",
      "description": "Welcome to Today’s Podcast! Featuring Special Guest Phil Seibel! \n\nJoin your hosts La Monyeka and LD Pteloma for an unforgettable episode as we dive deep into the mind of author Phil Seibel! Today, we’re thrilled to have Phil with us to discuss his captivating literary works, starting with his second book, The Monsters That Walk With Me. This gripping tale explores the shadows of our psyche and the monsters that lurk within, offering readers a unique perspective on fear and resilience.\n\nBut that’s just the beginning! We’ll also delve into his first book, The Monsters That Kiss You Goodnight, where Phil continues to unravel the complexities of love, fear, and the supernatural. With a background that includes growing up in a cult and navigating a world that many would deem unconventional, Phil\u0027s experiences shape his writing in profound ways.\n\nAnd there’s more! Phil has exciting new projects on the horizon, including his upcoming book titled Safe, which promises to be another thrilling addition to his repertoire.\n\nIn addition to his writing career, Phil is also making waves on YouTube with his own channel where he shares insights into his creative process and personal journey. Plus, he has a music channel that you won’t want to miss! Be sure to follow him on social media for updates on all his latest projects.\n\nThis episode is packed with intriguing discussions about confident characters, sexy narratives, murder mysteries, true crime elements, paranormal encounters, hauntings, love stories, lustful escapades, and even BDSM themes. Whether you’re a fan of horror or romance or both Phil’s work has something for everyone!\n\n Don’t forget to subscribe to our channel for more engaging content and hit that notification bell so you never miss an episode!\n\n Follow Phil Seibel on social media: - Singer Songwriter | Philip Seibel\n\nWebsite: ⁠⁠www.philipseibel.com⁠⁠\n\nYoutube:⁠⁠www.bylivinggallery.com⁠⁠\n\nYT is @philip-seibel\n\n⁠⁠https://music.youtube.com/channel/UC5b0akFVnQueMYFLnxvL6zw?si=pZtc16Ha5exF6ody⁠⁠\n\n\nBook 1: The monsters that kiss you goodnight \n⁠https://www.amazon.com/dp/B0CRY7VVVK?ref=ppx_yo2ov_dt_b_fed_asin_title⁠\n\nBook 2: The monsters that walk with me\n ⁠https://www.amazon.com/dp/B0DKBHMDTT?ref=ppx_yo2ov_dt_b_fed_asin_title⁠\nJoin us for this thrilling conversation as we explore the monsters that walk with us all. Tune in now!\n\n\n#PhilSeibel #Podcast #AuthorInterview #TrueCrime #Paranormal #MurderMystery #BDSM #Hauntings #LoveAndLust #LaMonyeka #LDPteloma #harlotsofspooktalk #harlots #cult #conspiracytheories #paranormal #live \n#spooktalk  #cultsurvivor, #againstcsa, #childabuse, #statuteoflimitations, #cults, #cog, #childrenofgod #childrenofgod, #truecrime, #homelessness  #youngadultbooks, #horrorfiction, #sexcult, #philipseibel #fyp #foryourpage #spooky\n\n#spooktalk #spooky #witchy #cult #truecrime ##truecrimecommunity #relationship #lust #bff #spookystory #ghoststory #paranormal #podcast #guest #harlots",
      "release": "2025-03-08T22:42:06Z",
      "duration": "01:00:39",
      "explicit": false,
      "spotifyId": "3J481eSqZqnetathnpdf1o",
      "youTubeId": "xufkv_U0Ir0",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3J481eSqZqnetathnpdf1o",
        "youtube": "https://www.youtube.com/watch?v=xufkv_U0Ir0"
      }
    }
  ]
}