{
  "_ts": 0,
  "id": "c0e28364-5b59-464b-8c88-9f76484744fd",
  "name": "The MultiPod",
  "spotifyId": "4305NLQekGdQ3FUiJJMaJd",
  "appleId": 1770531224,
  "youTubeChannelId": "UCj1ZcPk0aNuNGqXMPcBCnzw",
  "episodes": [
    {
      "id": "96571658-ca5c-4af1-afe1-bf238cb529e8",
      "title": "What It\u0027s Like to Emerge From a Cult, with Gerette Buglion",
      "description": "This podcast is a proud member of the Bold Departure Network, a collection of podcasts for those craving an authentic and unconventional life, on their own terms. Discover more of our shows at bolddeparturenetwork.com The MultiPod is now also on video! You can watch today\u0027s episode on YouTube here. --- Our guest today shares her experience of being 18 years in a cult, and finally getting out of it, which has led her to helping others escape and recover as well. Gerette Buglion is the founder of \u0022Living Cult-Free,\u0022 a non-profit organization that helps survivors and those close to them emerge from the experience of being in a cult. She also hosts a podcast of the same name, and the producer of that podcast happens to be our own Vanessa Hennessey! Vanessa joins us as well to talk about her perspective putting stories together for the podcast, and making sure they are told in an honest, authentic and delicate way. Cults are something far more common than you might think, and they take on all shapes and sizes. It\u0027s not just your stereotypical \u0027retreat from society, eat and dress the same way, follow the leader\u0027 stuff. Most cults in fact don\u0027t realize they are one. As you can imagine, it\u0027s very subversive. But Gerette has a very succinct and profound way of describing it: \u0022A cult, or any authoritarian system, is based around the concept that they know and understand you better than you know yourself.\u0022 They, or typically the leader, think you should trust them more than you trust yourself. And that marks the difference between a cult and a genuinely positive, healthy and empathetic group or individual: in a cult, the leader is looking out for their own interests and gain, typically money and power. In a healthy and supportive system, if there even is a leader, they are helping you on your journey of personal growth and understanding, with no personal gain to themselves beyond being happy for you. It\u0027s a fascinating topic that we just start to scratch the surface of, but of course there is the podcast where you can learn much more, and hear some profound personal stories. So check out Living Cult Free, the podcast, and if this is a topic that particularly speaks to you, be sure to reach out to Gerette, she would love to have that conversation. How to Contact Gerette gerettebuglion.com - Gerette\u0027s website. Book a free 20 min. call to share your story Living Cult Free, the podcast Living Cult Free, the organization - a non-profit organization in support of cult survivors Send an email: (gerette at gerettebuglion.com) Gerette and Living Cult Free on: Instagram (@living_cult_free) Facebook (@livingcultfree1) --- Find The MultiPod around the internet! Visit our new website, www.themultipod.com , for more show info, and our entire archive of 111 full episodes, plus bonus episodes and the Everything Conference miniseries. We also have a new guest application form, where you can send in your ideas for topics and who you would like to meet, and we\u0027ll set a recording date! Meanwhile, I\u0027ll be posting clips and updated on Instagram, @tedcraggpodcasting And, The MultiPod now has a sponsor! Quick Edit Podcasts Yes, this is my own podcast production business. But I owe everything to The MultiPod for giving me that foundation in skills and experience in podcasting. Quick Edit Podcasts provides on-demand audio and video production, ideal for one-off episodes, when you don\u0027t have time (or feel like) doing the editing yourself. And we love to produce short-form podcasts, miniseries, seasonal podcasts and other projects that are ideally suited for busy, multitasking multipotentialites! Visit the website to learn more: www.quickeditpodcasts.com or book a free 15-minute Quick Call and let\u0027s chat about your podcasting idea!",
      "release": "2025-07-01T08:00:00Z",
      "duration": "00:55:21.4970000",
      "explicit": false,
      "spotifyId": "3AHc1EwdHYmlEHnksM9JkV",
      "appleId": 1000715260654,
      "youTubeId": "fsPLaq_l8HE",
      "subjects": [
        "Center For Transformational Learning",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3AHc1EwdHYmlEHnksM9JkV",
        "apple": "https://podcasts.apple.com/podcast/what-its-like-to-emerge-from-a-cult-with-gerette-buglion/id1770531224?i=1000715260654",
        "youtube": "https://www.youtube.com/watch?v=fsPLaq_l8HE"
      }
    }
  ]
}