{
  "_ts": 0,
  "id": "e0cec653-0339-4812-95cc-54016fa5009e",
  "name": "The Power of Places",
  "spotifyId": "7iFe6nOBze1ETTzRcgD4S7",
  "appleId": 1732959317,
  "episodes": [
    {
      "id": "1f2d6ffa-c65d-4b21-93ff-ba30c44b2ff7",
      "title": "Persuasive Places - Former Cult Member, Christopher Johnston",
      "description": "Dive into the world of cults and the power of persuasive places. Hollywood, with its glitz, glamour, and allure, serves as the backdrop for former cult member Chris Johnston\u0027s journey. Join us as we uncover the chilling realities of cult psychology, delving into the heart of the Buddhafield—a cult led by the enigmatic Jaime Gomez. Founded on principles of spirituality and enlightenment, the Buddhafield seemed like an oasis of truth in a city built on illusions. However, as Chris discovered during his sixteen-year entanglement, the truth behind the Buddhafield was far from divine. Manipulation and psychological control were pervasive, highlighting the hidden influence of environment on individuals\u0027 actions and beliefs. Through Chris\u0027s firsthand account, we explore how environments, whether the glittering allure of Hollywood or the nostalgia of childhood homes, can shape our choices and behaviors. With insights from documentaries like “Holy Hell” and “How to Become a Cult Leader,” Chris sheds light on what it\u0027s like being part of a cult and the deeper implications of cult psychology. Please note, this episode contains darker content. Listen with caution as we navigate the complexities of persuasive places with Chris Johnston. Thanks to \u0027The Power of Places\u0027 Affiliates: • Your home might be worth more than you think. Find out how much with our Airbnb referral link: https://www.airbnb.ca/r/frankiem101?s=70\u0026t=1y1n0g • Visit https://expedia.com/affiliates/expedia-home.KYbg8RE to get deals on your next trip! Join our Community: The Power of Places Instagram: https://www.instagram.com/thepowerofplaces/",
      "release": "2024-05-14T05:00:00Z",
      "duration": "00:32:07.4710000",
      "explicit": true,
      "spotifyId": "0FpLxGbiGoN6VDdczzyQzn",
      "appleId": 1000655511206,
      "subjects": [
        "Buddhafield",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0FpLxGbiGoN6VDdczzyQzn",
        "apple": "https://podcasts.apple.com/podcast/persuasive-places-former-cult-member-christopher-johnston/id1732959317?i=1000655511206"
      }
    }
  ]
}