{
  "_ts": 0,
  "id": "edba6469-0294-4656-a292-775fa0654b80",
  "name": "The Hare Krishna Project Podcast with Narada das",
  "youTubeChannelId": "UC630W_WcWEnDA7aXJHRxBCw",
  "episodes": [
    {
      "id": "a2b3de88-c4d8-43d6-bf3e-b9b6206b3b83",
      "title": "PODCAST: Episode 135 – “Trafficked around ISKCON as a child for sex\u0022 - 20/08/24🎙",
      "description": "“Trafficked around ISKCON as a child for sex – Speaking out against those in authority\u0022\n\nPODCAST: Episode 135 – Tuesday 20th August 2024🎙\n\nWe’re pleased to welcome back Palika as our guest on this week’s podcast.\nPalika first appeared on ‘The Hare Krishna Project Podcast’ in June 2023 where she shared her horrific story of child abuse in ISKCON – and now, 14 months later has returned for a special ‘Part 2’ edition.\n\n(Viewers can watch Part 1 here: ‘Trafficked around ISKCON as a child for sex’ - https://www.youtube.com/watch?v=GA4MMSnQqBc\u0026t=4389s) \n\nIn this second sit-down interview she shares her story – a childhood full of abuse at the hands of those who were meant to protect and look after her.\nPalika talks openly about her experiences being gang-raped and trafficked around ISKCON as a child for sex. \n\nFrom the age of 3, until the age of 14, she was sexually abused multiple times by some of ISKCON’s most senior leaders.\n\nThis is ‘Part 2’ episode Palika discusses:\n\n- What’s changed for her in her life since we recorded Part 1\n- What’s happening now with her legal fight with ISKCON\n- Whether the authorities in ISKCON have taken her case seriously\n- Her thoughts on whether ISKCON will ever recover from its disastrous record on ‘child protection’ \n\nThis week’s podcast is not to be missed!\n\nYou can watch it:\n\n- On Facebook at www.facebook.com/TheHareKrishnaProject \n- and on YouTube at www.youtube.com/@NaradaDasUK\n\nFor more details about The Hare Krishna Project check out our website www.theharekrishnaproject.org.uk \n\n#Podcast #TheHareKrishnaProject #ISKCON #ChildAbuse #ChildProtection #Investigation #SpeakingOut #Peopophiles",
      "release": "2024-08-20T18:00:07Z",
      "duration": "01:52:41",
      "explicit": false,
      "youTubeId": "kmjGIYjSM2c",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kmjGIYjSM2c"
      }
    },
    {
      "id": "c8f083bd-58a8-43a7-a7fd-18533ba805f3",
      "title": "PODCAST: The Hare Krishnas In Britain - E60 – “Trafficked around ISKCON as a child for sex\u0022 - 2/6/23",
      "description": "PODCAST: The Hare Krishnas In Britain - Episode 60 – “I was trafficked around ISKCON as a child for sex!\u0022 - Friday 2nd June 2023🎙\n\n(THIS PODCAST IS ALSO AVAILABLE TO WATCH ON FACEBOOK: https://fb.watch/kWWioycPDu/)\n\nWe\u0027re hugely grateful to Palika devi dasi for sharing her story with us on this week’s podcast.\n\nIn this exclusive sit-down interview, she shares her story – a childhood full of abuse at the hands of those who were meant to protect and look after her.\n\nIn this, her first podcast, Palika talks openly about her experiences being gang-raped and trafficked around ISKCON as a child for sex. \n\nFrom the age of 3, until the age of 14, she was sexually abused multiple times by some of ISKCON’s most senior leaders.\n\nThis week’s EXCLUSIVE podcast is not to be missed! You can watch it: \n\n- On Facebook at www.facebook.com/TheHareKrishnaProject \n- and on YouTube at www.youtube.com/@NaradaDasUK\n\n#Podcast #HareKrishnaMovement #HareKrishna #ChildAbuse #ChildProtection #ISKCON",
      "release": "2023-06-02T18:00:08Z",
      "duration": "01:46:48",
      "explicit": false,
      "youTubeId": "GA4MMSnQqBc",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GA4MMSnQqBc"
      }
    }
  ]
}