{
  "id": "da32872e-8210-4874-a1fc-137bd666ff3c",
  "name": "The Wild Chaos Podcast",
  "spotifyId": "5KFGZ6uABb1sQlfkE2TIoc",
  "appleId": 1732761860,
  "youTubeChannelId": "UCXT4SIBHUddzBhs4P1I2oGg",
  "episodes": [
    {
      "id": "2359a96d-da59-4392-b064-5aaaf24ca938",
      "title": "#83 - Stolen Youth: Cons, Cults, and Kidnapping w/Jacine Jadresko",
      "description": "A van door slides open at midnight and two strangers say she isn’t going home. That moment—engineered by her parents—sent Jacine into a notorious WWASP “behavioral program” in Mexico where abuse and brainwashing replaced help. We go where most stories don’t. Jacine Jadresko breaks down how she hacked punitive level systems as a teen, the toll it took, and why high-functioning addiction hid in plain sight for years. She shares two fentanyl overdoses, the mindset shift that ended heroin, and the unglamorous habits that keep her steady. Then we step into the Amazon: earning hunters’ respect, learning to mix plant poisons, blow-darting a monkey on the first try, and tasting the difference between survival and spectacle. This is a story of pure survival, never heard before. Buckle up for this one, you will have your jaw open the entire time. To learn more and follow Jacine on her world travels and adventure, give her a follow: https://www.instagram.com/jacineunseen/ If you’re drawn to stories of survival that become maps, this one’s for you: how to build a simple business that buys your time, how to trust your instincts without worshiping fear, and how to choose a life wide enough to hold the past without letting it steer. If it moved you, share it with a friend, subscribe for more conversations that don’t flinch, and leave a review with the moment you can’t stop thinking about. Send us a text Support the show Follow Wild Chaos on Social Media: Apple iTunes: https://podcasts.apple.com/us/podcast/the-wild-chaos-podcast/id1732761860 Spotify: https://open.spotify.com/show/5KFGZ6uABb1sQlfkE2TIoc?si=8ff748aa4fc64331 ⁠⁠⁠Instagram: https://www.instagram.com/wildchaospodcast Bam\u0027s Instagram: https://www.instagram.com/bambam0069 Youtube: https://youtube.com/@wildchaospod TikTok: ⁠⁠⁠ https://www.tiktok.com/@thewildchaospodcast Meta (Facebook): ⁠⁠⁠ https://www.facebook.com/TheWildChaosPodcast",
      "release": "2025-10-27T07:00:00Z",
      "duration": "02:55:29.9760000",
      "explicit": true,
      "spotifyId": "3mjcK3v68fHrMr7ZN2o4Jn",
      "appleId": 1000733657511,
      "youTubeId": "YYarovSE9y8",
      "subjects": [
        "Troubled Teen Industry",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mjcK3v68fHrMr7ZN2o4Jn",
        "apple": "https://podcasts.apple.com/podcast/83-stolen-youth-cons-cults-and-kidnapping-w-jacine-jadresko/id1732761860?i=1000733657511",
        "youtube": "https://www.youtube.com/watch?v=YYarovSE9y8"
      }
    }
  ]
}