{
  "id": "a21bd963-eebc-41f9-8d55-a3fd809bac7a",
  "name": "The Thinking Mind Podcast: Psychiatry \u0026 Psychotherapy",
  "spotifyId": "6h2FCOoWZnUr88SQG0ytHn",
  "appleId": 1466932169,
  "youTubeChannelId": "UCXICdf_UQ8EtteDVOem0LUw",
  "episodes": [
    {
      "id": "6dc060e5-eedd-4ec5-b897-bad7d2d4dc62",
      "title": "E145 - Surviving a Cult (part 2 of 2 w/ Gillie Jenkinson)",
      "description": "Gillie is a qualified psychotherapist and counsellor with more than 30 years’ experience. She specialises in working with survivors of coercive, cultic or spiritual abuse, trauma including rape and sexual abuse, thought-reform (brainwashing) and undue influence. She works with former cult members, including those brought up in a cult (second and multi-generation) and those who joined or were recruited (first generation).\n\n\nGillie set up Hope Valley Counselling in 2006 after achieving her Masters in Gestalt Psychotherapy. Here she further developed her model for counselling former cult members and survivors of spiritual abuse and undue influence. \n\n\nFurther resources:\n\n\nhttps://www.cambridge.org/core/books/abs/spirituality-and-psychiatry/pathological-spirituality/0F993FFB842601BF7492EFB708EBA769\n\n\n https://www.hopevalleycounselling.com/walking-free-workbook\n\n\nInterviewed by Dr. Alex Curmi. Dr. Alex is a consultant psychiatrist and a UKCP registered psychotherapist in-training.\n\n\nIf you would like to invite Alex to speak at your organisation please email alexcurmitherapy@gmail.com with \u0022Speaking Enquiry\u0022 in the subject line.\n\nAlex is not currently taking on new psychotherapy clients, if you are interested in working with Alex for focused behaviour change coaching , you can email - alexcurmitherapy@gmail.com with \u0022Coaching\u0022 in the subject line.\n\n\nCheck out The Thinking Mind Blog on Substack: https://thinkingmindblog.substack.com/p/psychedelics-technology-and-love\n\n\n\n\n\n\nGive feedback here - thinkingmindpodcast@gmail.com Follow us here: Twitter @thinkingmindpod Instagram @thinkingmindpodcast",
      "release": "2025-10-16T23:54:31Z",
      "duration": "00:53:53",
      "explicit": false,
      "spotifyId": "1QTvGd0uUOXQMpCp60Y2EJ",
      "appleId": 1000732217970,
      "youTubeId": "DXlIdUxSkh8",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery",
        "Cult Psychology",
        "Psychology",
        "Jesus Army",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1QTvGd0uUOXQMpCp60Y2EJ",
        "apple": "https://podcasts.apple.com/podcast/e145-surviving-a-cult-part-2-of-2-w-gillie-jenkinson/id1466932169?i=1000732217970",
        "youtube": "https://www.youtube.com/watch?v=DXlIdUxSkh8"
      }
    },
    {
      "id": "b610c39a-6455-44fb-9f27-4358be2cd6c1",
      "title": "E140 - Surviving a Cult (part 1 of 2 w/ Gillie Jenkinson)",
      "description": "Gillie is a qualified psychotherapist and counsellor with more than 30 years’ experience. She specialises in working with survivors of coercive, cultic or spiritual abuse, trauma including rape and sexual abuse, thought-reform (brainwashing) and undue influence. She works with former cult members, including those brought up in a cult (second and multi-generation) and those who joined or were recruited (first generation). Gillie set up Hope Valley Counselling in 2006 after achieving her Masters in Gestalt Psychotherapy. Here she further developed her model for counselling former cult members and survivors of spiritual abuse and undue influence. Today Gillie discusses her experiences being part of an abusive cult in Britain in the 1970s, the impact this had on her psychologically, and how she eventually recovered. Interviewed by Dr. Alex Curmi. Dr. Alex is a consultant psychiatrist and a UKCP registered psychotherapist in-training. If you would like to invite Alex to speak at your organisation please email alexcurmitherapy@gmail.com with \u0022Speaking Enquiry\u0022 in the subject line. Alex is not currently taking on new psychotherapy clients, if you are interested in working with Alex for focused behaviour change coaching , you can email - alexcurmitherapy@gmail.com with \u0022Coaching\u0022 in the subject line. Check out The Thinking Mind Blog on Substack: https://open.substack.com/pub/thinkingmindblog/p/thinking-mind-blog-big-thoughts-edition?r=1cn09u\u0026utm_medium=ios Give feedback here - thinkingmindpodcast@gmail.com Follow us here: Twitter @thinkingmindpod Instagram @thinkingmindpodcast",
      "release": "2025-09-11T23:00:00Z",
      "duration": "00:43:48.7800000",
      "explicit": false,
      "spotifyId": "0whzuQRA7SOUJBdGQYwUIw",
      "appleId": 1000726415508,
      "youTubeId": "vUO6Y3N59_E",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery",
        "Cult Psychology",
        "Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0whzuQRA7SOUJBdGQYwUIw",
        "apple": "https://podcasts.apple.com/podcast/e140-surviving-a-cult-part-1-of-2-w-gillie-jenkinson/id1466932169?i=1000726415508",
        "youtube": "https://www.youtube.com/watch?v=vUO6Y3N59_E"
      }
    }
  ]
}