{
  "id": "df36e085-d9ad-4965-b80a-f19ea141c234",
  "name": "The Motovation Podcast",
  "spotifyId": "2g4l5XlO2boRObdXUlRLHC",
  "appleId": 1565354665,
  "youTubeChannelId": "UCuWYYINcLxsDeyzJXZFURCg",
  "episodes": [
    {
      "id": "f72d49a8-82c7-4ff7-8f57-32f9352f0b12",
      "title": "Full Throttle to Freedom: Christina Lambert’s Escape from the ATI Cult and Arranged Marriage",
      "description": "What happens when the road you\u0027re told to follow no longer feels like your own? Christina Lambert grew up in the ATI (Advanced Training Institute) cult, where strict fundamentalist teachings controlled every aspect of her life—including an arranged marriage she never chose. But Christina found the courage to break free, reclaim her identity, and forge a new path on her own terms.\n\n\nIn this episode of The Motovation Podcast, we take a deep dive into Christina’s powerful journey:\n\n  •  Growing Up in ATI – What life was like under the extreme rules of Bill Gothard’s fundamentalist teachings.\n  •  The Pressure of Arranged Marriage – How she was expected to submit to a future she never agreed to.\n  •  The Moment of Realization – What sparked her decision to leave and the struggles she faced in the process.\n  •  The Ride That Changed Everything – How getting on a motorcycle became a symbol of her defiance, independence, and the ultimate catalyst for her escape.\n  •  The Cost of Freedom – Breaking free came with deep personal loss, as she faced rejection from those she once trusted and had to rebuild life from the ground up.\n\nLessons We Learn from Christina’s Story\n\n  •  Trust Your Inner Voice – Even when everything around you tells you to conform, your instincts matter.\n  •  Escaping Control Takes Grit – Leaving a high-control group or relationship isn’t easy, but the other side is worth it.\n  •  Deconstruction is a Process – Breaking free is just the beginning; learning who you are afterward is a journey of its own.\n  •  Freedom Comes with Unexpected Turns – Like any road trip, the route to self-discovery is rarely a straight path.\n\nChristina’s resilience reminds us that sometimes, you have to take the handlebars of your own life and ride toward the unknown—because that’s where true freedom is found.\n\n\nWatch now and subscribe for more stories of resilience, reinvention, and breaking free from the past.",
      "release": "2025-03-31T03:37:49Z",
      "duration": "01:39:52",
      "explicit": false,
      "spotifyId": "3cMLruqE7npCh7gDuzAHk8",
      "appleId": 1000697405895,
      "youTubeId": "hd4LwIT0aK4",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3cMLruqE7npCh7gDuzAHk8",
        "apple": "https://podcasts.apple.com/podcast/full-throttle-to-freedom-christina-lamberts-escape/id1565354665?i=1000697405895",
        "youtube": "https://www.youtube.com/watch?v=hd4LwIT0aK4"
      }
    }
  ]
}