{
  "id": "dd151ea8-acd6-45ee-a118-91d4b852987c",
  "name": "The Narcissism Decoder",
  "spotifyId": "34SLBTJxxJzVPna0r3fy7c",
  "appleId": 1713596503,
  "youTubeChannelId": "UCfkKMzSC5rzrhgu6DWdKYgA",
  "episodes": [
    {
      "id": "598803b2-5da2-4c18-840f-026e14e68baa",
      "title": "Why Leaving a Narcissistic Relationship Feels Like Leaving a Cult",
      "description": "What makes it so hard to walk away from someone who’s clearly hurting you?\n\nIn this episode, Dr. Mazzella explains how narcissistic relationships mirror cult dynamics and scams—offering an illusion of salvation, bliss, and togetherness. Leaving means giving up not only the fantasy, but also confronting painful realities and internalized propaganda.\n\nThe grief isn\u0027t just about the partner—it’s about the loss of the promise that things would finally get better.\n\n✅ Subscribe To My Channel For More Videos: https://www.youtube.com/@thenarcissismdecoder/?sub_confirmation=1\n\n✅ Important Links: \n\n👉 Website: https://www.drmazzella.com/\n👉 For consultation or seeking virtual therapy services please visit: https://www.drmazzella.com/contact/\n👉 To listen to Dr. Mazzella’s podcast please click here: https://www.drmazzella.com/the-narcissism-decoder-podcast/\n\n✅  Stay Connected With Me: \n\n👉 Linkedin: https://www.linkedin.com/in/anthony-mazzella-ph-d-53289431/\n👉 Instagram: https://www.instagram.com/thenarcissism.decoder/\n👉 TikTok: https://www.tiktok.com/@thenarcissismdecoder\n👉 Facebook: https://www.facebook.com/thenarcissismdecoder\n\n==============================\n\n✅ Other Videos You Might Be Interested In Watching: \n\n👉 Facing Hidden Truths: The Journey to Understand Her Family\u0027s Imperfections | Drmazzella.com\nhttps://www.youtube.com/watch?v=iHaD1SaSwkk\n\n👉 A Daughter\u0027s Search for Support: Unraveling Hidden Maternal Critique | Drmazzella.com\nhttps://www.youtube.com/watch?v=l5CQxuLRYc4\n\n👉 Exposing Covert Narcissism: Dr. Mazzella\u0027s Insights - The Hidden Truths - Part 1 | Drmazzella.com\nhttps://www.youtube.com/watch?v=Bk25z9Y5Jv0\n\n👉 Dr. Mazzella\u0027s Deep Dive into Covert Narcissism: The Hidden Truths Revealed: Part 2 | Drmazzella.com\nhttps://www.youtube.com/watch?v=AhOBoAnbr3A \n\n=============================\n\n✅  About The Narcissism Decoder: \n\nWelcome to the Narcissism Decoder, where we dive into the intriguing world of narcissism! While my podcast provides an in-depth exploration of various aspects of narcissistic dynamics, I have something extra special for you on YouTube.\n\nUnlike my podcast, these videos are short, snappy, and designed for the fast-paced world. I may not go as deep as my podcast episodes, but I make up for it with a more dynamic and visually appealing approach. It\u0027s the perfect solution for those who want to grasp the essence of narcissistic dynamics without committing to a longer podcast episode.\n\nJoin me on this journey as we decode narcissism together. Subscribe now, and let\u0027s unravel the fascinating world of narcissism in a way that suits your preference - concise, captivating, and always insightful.\n\nFor Collaboration and Business inquiries, please use the contact information below:\n\n📩  Email: thenarcissismdecoder@gmail.com\n\n🔔 Subscribe to my channel for more videos: https://www.youtube.com/@thenarcissismdecoder/?sub_confirmation=1\n \n=====================\n\nDISCLAIMER ALERT: The Narcissism Decoder podcast is provided for general information purposes only. The content presented in this Podcast is not intended to diagnose, treat, or cure any psychological condition related to narcissism. The content on this Podcast should not be considered a substitute for professional medical advice, diagnosis, or treatment.  Always seek the advice of your physician or qualified mental health provider with any questions you may have regarding a mental health concern. Never disregard professional medical advice or delay in seeking it because of something you have seen or heard in this video. If you think you may have a medical emergency, call your doctor or emergency services immediately. Reliance on any information provided in this video is solely at your own risk. The creators and producers of this video do not assume any responsibility or liability for any injury, damage, or adverse effects caused by the use of the information contained herein.\nCopyright Disclaimer: Under Section 107 of the Copyright Act 1976, allowance is made for \u0022fair use\u0022 for purposes such as criticism, comment, news reporting, teaching, scholarship and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use\n\n© The Narcissism Decoder",
      "release": "2025-07-20T12:01:15Z",
      "duration": "00:05:22",
      "explicit": false,
      "youTubeId": "fX0-thrSCNA",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fX0-thrSCNA"
      }
    }
  ]
}