{
  "id": "5813b397-d5f8-4b37-a8fc-93fa376c0461",
  "name": "The Compendium Podcast",
  "spotifyId": "30Hh0xbotgbIyCL5tJE4zJ",
  "appleId": 1676817109,
  "youTubeChannelId": "UCQR5hWsxuu9wh7QvR60qmIw",
  "episodes": [
    {
      "id": "af112cbd-5854-460b-9d36-29d23f06b55d",
      "title": "Helter Skelter: How a Beatles Song Led to the Manson Murders",
      "description": "We dive into one of the most disturbing true crime stories in history—how Helter Skelter, a Beatles song, became the twisted manifesto for Charles Manson and his cult of devoted followers. With his delusional vision of an apocalyptic race war, Manson manipulated the young and lost into committing some of the most infamous murders of the 20th century. From the counterculture movement of the 1960s to the tragic deaths of Sharon Tate and the LaBianca family, we unravel the disturbing intersection of music, crime, and cult psychology. How did a song about a slide become a call to violence? Let’s find out. We give you just the Compendium, but if you want more, here are our resources: Helter Skelter: The True Story of the Manson Murders – by Vincent Bugliosi and Curt Gentry. Chaos: Charles Manson, the CIA, and the Secret History of the Sixties – by Tom O\u0027Neill with Dan Piepenbring. The Manson Family – Wikipedia Chaos the Manson Murders Netflix Documentry – Errol Morris Host \u0026 Show Info Hosts: Kyle Risi \u0026 Adam Cox About: Kyle and Adam are more than just your hosts, they’re your close friends sharing intriguing stories from tales from the darker corners of true crime, the annals of your forgotten history books, and the who\u0027s who of incredible people. Intro Music: Alice in dark Wonderland by Aleksey Chistilin Community \u0026 Calls to Action ⭐ Review \u0026 follow on: Spotify \u0026 Apple Podcasts \u0026#x1f4f8; Follow us on Instagram: @theCompendiumPodcast \u0026#x1f310; Visit us at: TheCompendiumPodcast.com ❤️ Early access episodes: Patreon \u0026#x1f4e4; Share this episode with a friend! If you enjoyed it, tag us on social media and let us know your favorite takeaway.",
      "release": "2025-03-04T05:00:00Z",
      "duration": "01:19:10.9150000",
      "explicit": false,
      "spotifyId": "7cC6Y8bsmnLg1QODkE4dn7",
      "appleId": 1000697562231,
      "youTubeId": "m1C76fEm39c",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7cC6Y8bsmnLg1QODkE4dn7",
        "apple": "https://podcasts.apple.com/podcast/helter-skelter-how-a-beatles-song-led-to-the-manson-murders/id1676817109?i=1000697562231",
        "youtube": "https://www.youtube.com/watch?v=m1C76fEm39c"
      }
    },
    {
      "id": "711ea172-dd35-4a5b-a373-1b22039aa870",
      "title": "Sex Cult: The Story of Bhagwan Rajneesh and His Sex Cult’s Bioterror Plot to Take Over Oregon",
      "description": "In this episode of the Compendium, we uncover how the Sex Cult led by Bhagwan Shree Rajneesh, also known as the Osho movement, nearly took over Antelope, Oregon. We explore the rise of Rajneeshpuram, the Rajneeshee cult\u0027s transformation, and Ma Anand Sheela\u0027s pivotal role in the Rajneeshee plot that led to the biggest bioterror attack in U.S. history. We give you the Compendium, but if you want more, then check out these great resources: “Wild Wild Country” (2018) - Documentary series on Netflix: “Searching for Sheela” (2021) - Follow-up documentary on Netflix: “Building Utopia” - Podcast by Russell King: “What it was like to be a child in the commune” - Article in The Guardian “A journalist\u0027s recent experience at an Osho retreat” - Article in The Guardian Message Kyle and Adam Connect with Us: \u0026#x1f310; Our Website: TheCompendiumPodcast.com \u0026#x1f4ac; Connect: Send us a voice note \u0026#x1f4f8; Our Instagram: @theCompendiumPodcast Support the show: \u0026#x1f34e; Review us on Apple Podcasts \u0026#x1f7e2; Review us on Spotify ❤️ Get Early Access to Episodes on Patreon Credits: Hosts: Kyle Risi \u0026 Adam Cox Intro and Outro Music: Alice in dark Wonderland by Aleksey Chistilin All the Latest Things Intro: Clowns by Giulio Fazio",
      "release": "2024-11-19T05:00:00Z",
      "duration": "01:18:47.3530000",
      "explicit": true,
      "spotifyId": "4qGhispezOfxhEcJDYjkty",
      "appleId": 1000677422861,
      "youTubeId": "klCtGR384WQ",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4qGhispezOfxhEcJDYjkty",
        "apple": "https://podcasts.apple.com/podcast/sex-cult-the-story-of-bhagwan-rajneesh-and-his/id1676817109?i=1000677422861",
        "youtube": "https://www.youtube.com/watch?v=klCtGR384WQ"
      }
    },
    {
      "id": "dd312847-b32f-4702-a50d-5859a04c9a79",
      "title": "Inside Scientology: David Miscavige and The Vanishing of Shelly Miscavige",
      "description": "In this episode of the Compendium, we go Inside Scientology to explore the mysterious vanishing of Shelly Miscavige, wife of David Miscavige, and the ongoing speculation surrounding her disappearance. We discuss the power dynamics at play in the Church of Scientology, the shocking claims of Scientology abuse, and the bizarre world of Scientology missing persons. With key questions like Where is Shelly Miscavige now? and What happened to Shelly Miscavige?, this episode uncovers one of Scientology\u0027s most unsettling mysteries. Tune in as we examine the real story behind the headlines.\n\n\nWe give you the Compendium, but if you want more, then check out these great resources:\n\n  1. Going Clear: Scientology, Hollywood, and the Prison of Belief (https://www.amazon.co.uk/Going-Clear-Scientology-Hollywood-Prison/dp/0307745309)  by Lawrence Wright\n  2. Inside Scientology: The Story of America\u0027s Most Secretive Religion (https://www.amazon.co.uk/Inside-Scientology-Americas-Secretive-Religion/dp/0547750358)  by Janet Reitman\n  3. Leah Remini\u0027s Scientology and the Aftermath (https://www.imdb.com/title/tt6244192/)  (TV Series)\n  4. Bare-Faced Messiah: The True Story of L. Ron Hubbard (https://www.amazon.co.uk/Bare-Faced-Messiah-True-Story-Hubbard/dp/1909269360)  by Russell Miller\n  5. The Unbreakable Miss Lovely: How the Church of Scientology Tried to Destroy Paulette Cooper (https://www.amazon.co.uk/Unbreakable-Miss-Lovely-Scientology-Paulette-ebook/dp/B07GZXCZF1)  by Tony Ortega\n\nMessage Kyle and Adam (https://www.buzzsprout.com/twilio/text_messages/2123669/open_sms) \n\n\nConnect with Us:\n \n      \n  •  🌐 Our Website: TheCompendiumPodcast.com (http://thecompendiumpodcast.com/)  \n      \n  •  💬 Connect: Send us a voice note (https://thecompendiumpodcast.com/voice-message)  \n      \n  •  📸 Our Instagram: @theCompendiumPodcast (http://bit.ly/43SrImA)  \n       \n\nSupport the show:\n \n      \n  •   🍎 Review us on Apple Podcasts (https://podcasts.apple.com/us/podcast/the-compendium-podcast-an-assembly/id1676817109)  \n      \n  •  🟢 Review us on Spotify (https://open.spotify.com/show/30Hh0xbotgbIyCL5tJE4zJ?si=OZdR3QfHSaae_HuBdFlPQA)  \n      \n  •  ❤️ Get Early Access to Episodes on Patreon (https://www.patreon.com/thecompendiumpodcast)  \n       \n\nCredits:\n \n      \n  •   Hosts: Kyle Risi (https://www.instagram.com/kyle_risi/)  \u0026 Adam Cox (https://www.instagram.com/aswcox/)  \n      \n  •   Intro and Outro Music: Alice in dark Wonderland (https://pixabay.com/music/main-title-alice-in-dark-wonderland-123894/)  by Aleksey Chistilin (https://pixabay.com/users/lexin_music-28841948/)  \n      \n  •   All the Latest Things Intro: Clowns (https://uppbeat.io/t/giulio-fazio/clowns)  by Giulio Fazio (https://uppbeat.io/browse/artist/giulio-fazio)",
      "release": "2024-11-12T05:31:06Z",
      "duration": "01:24:10",
      "explicit": false,
      "spotifyId": "1df39D0iNapf2MdjojgNJR",
      "appleId": 1000676590991,
      "youTubeId": "Jz4ahygm4jM",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1df39D0iNapf2MdjojgNJR",
        "apple": "https://podcasts.apple.com/podcast/inside-scientology-david-miscavige-and-the/id1676817109?i=1000676590991",
        "youtube": "https://www.youtube.com/watch?v=Jz4ahygm4jM"
      }
    }
  ]
}