{
  "id": "49fe0fbf-e60b-45e1-85d5-74947c49b8a1",
  "name": "The Fierce Voice",
  "spotifyId": "2AohnMnOfiWJBLNE5GDWTc",
  "youTubeChannelId": "UCQyVDtNxDNwWMCFfLeJWFUg",
  "episodes": [
    {
      "id": "70663c74-ab91-4073-a752-0d5900bd2ed7",
      "title": "Instead, She Got Out: Pamela’s Escape from a Polygamous Cult",
      "description": "What happens when a woman stops obeying - and start listening to her truth? In this powerful episode of The Fierce Voice, Pamela shares her raw and riveting story of growing up in a polygamous cult in Mexico, breaking free from its control, and reclaiming her voice, power, and sovereignty. Her journey is not just one of escape—it’s a revolution of self. If you’ve ever questioned your conditioning, your worth, or your right to choose a different path—this conversation is your permission slip. Pre-Order Her Book: \u003E The Dirt Beneath Our Door Website: www.pamelaspeaks.live Instagram: @pamela_speaks Podcast: Sisters Gone Platinum https://podcasts.apple.com/us/podcast/sisters-gone-platinum/id1724826145 Podcast: Wicked Confessions Uncensored (launching friday) www.wickedconfessionsuncensored.com Pamela Jones Bio:Pamela Jones was born in Los Molinos, Mexico to members of the Church of the Firstborn of the Fullness of Times – a fundamentalist, misogynistic cult. She was the 11th of her father’s 57 biological children and 2nd of her mother’s thirteen children and it was from that moment on that Pamela held one single belief: She existed for one reason and one reason only – to be her eventual husband’s handmaid and to bear him as many children aspossible. Fast forward to age 10, Pamela was forced out of school to help her mom care for her children – giving her nothing more than a fifth-grade education. At age 15, Pamela married David Lebaron, and was pregnant 17 times in 19 years. After 9 childbirths and 8 miscarriages, Pamela felt she had enough children to make it to heaven - a fundamentalist belief. One day, she awoke her nine children and escaped the neglect andabuse from her husband. Since arriving in the United States, Pamela founded a multimillion-dollar business, MyGirls House Cleaning (Exclusive Services By MyGirls) and has chosen to share her story across the country to showcase how someone who came from nothing can have everything. Her family has expanded to include 36 grandchildren, keeping Pamela busier than ever. And she now is a podcaster and author of her memoir that is due to release September2025. Pamela takes her audience on a journey - sharing the smallest details of her life under fundamentalism to becoming the CEO of a multimillion-dollar company with her own two hands - all with the backing of a fifth grade education. A motivational story for any age,Pamela reinforces that everything you need to succeed is already inside of you.",
      "release": "2025-05-08T10:45:11Z",
      "duration": "01:01:40.5860000",
      "explicit": false,
      "spotifyId": "2XxrfV6gWhN9nNyj0v4PLD",
      "youTubeId": "o-R_JbM7vQg",
      "subjects": [
        "Church of the Firstborn (Morrisite)",
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2XxrfV6gWhN9nNyj0v4PLD",
        "youtube": "https://www.youtube.com/watch?v=o-R_JbM7vQg"
      }
    }
  ]
}