{
  "_ts": 0,
  "id": "0a663918-023b-4ea5-9f03-83d233c3c3a7",
  "name": "The Live Out Loud Family",
  "youTubeChannelId": "UCoq2XLgseauOWI6DM5F7aLA",
  "episodes": [
    {
      "id": "8dd38e3b-798e-418e-ac44-ca4269e61af6",
      "title": "1 Week in America\u0027s \u0022CULT CITY\u0022",
      "description": "1 Week in America\u0027s \u0022CULT CITY!\u0022 What happens when you spend 1 week in America’s “CULT CITY”? We visited Maharishi Vedic City, Iowa, a place shrouded in mystery and known for its unique way of life. Often referred to as a “cult city,” this tiny town in Iowa is famous for its connection to Transcendental Meditation (TM) and Maharishi Mahesh Yogi, the spiritual guru who inspired millions worldwide. But what’s it really like to live here? Is it truly a cult, or is it just misunderstood?\n\nIn this video, we take you inside Maharishi Vedic City for an entire week to uncover the truth. From exploring their Vedic architecture, experiencing TM meditation practices, and learning about their organic, sustainable living philosophies, to talking with locals about their lifestyle, we dive deep into this intriguing town.\n\nWe also investigate the rumors and controversies surrounding Maharishi Vedic City, including its reputation as a “cult-like” community. What draws people here? What keeps the world curious about this unusual city in Iowa? And most importantly, what did we discover during our stay?\n\nIf you’ve ever been curious about Maharishi Vedic City, its mysterious vibe, and the unique practices that make it stand out, this video is for you. Watch until the end to see if it’s truly as mysterious as people say!\n\n📍 Key Moments in the Video:\n 0:00 Intro: Why are we exploring Maharishi Vedic City. What do locals think about “cult city”?\n01:22 What is it like living in Maharishi Vedic City?\n04:35 What happens inside the golden domes in Fairfield Iowa? \n07:51 Why astrology is important in the Transcendental Meditation movement \n09:29  Exploring the architecture: What is Vedic living?\n11:06  Inside Maharishi International University farming and Ayurvedic principles\n16:50 How does Transcendental Meditation work?\n26:04 Inside Maharishi K-12 school \n27:25 Final thoughts: Is Maharishi Vedic City misunderstood?\n \nThanks for watching. We are super grateful you are here! \n\nKeep us traveling: https://theliveoutloudfamily.com/keep-us-traveling/\nShop our store: https://teespring.com/stores/theliveoutloudfamily\nWe appreciate your support SOOO much!\n\nMusic Codes:\n2PJ30JGXOKIATAAJ L41CSFOUHFREOJMN HKHDO20MASVQXJN9 5IA74VP9E9TFEVRA 3TLW4OCI2OO2UIQ5 QGIB2R64RRBPPVHZ CYIFQRWZYREADP1P\nSXDJNGS9A72AN0SI 7ESLP8UBR0VGDQOB VFMJUOE1HML4X4YL\nR6RB5WM2ZJJAFKO5\n1AMUVJXEDI0IH3XS 8NQ54TGU0XKGKLCA GKYZT6H2TVCUKTWW \n70RN57YVFDLGAFPA 6KNBSXT7YRBFKEML BMMGQDSTNYT4XPBA HNWVSE4YHY7DOQDE DO5JMQZYLAZKNKXR EBESCYO9T7VL7ADC L88VDT2KSH3FBE3P KS5JIVF4AKVCDJ4H 1OD45Q8KQ2JXHAH6 ZSJONW2A03IP80WQ LSVNQHC13N1LCVZL 3ZYIB3VFEYOO08DZ",
      "release": "2025-01-26T19:45:37Z",
      "duration": "00:29:33",
      "explicit": false,
      "youTubeId": "Rlul8wnMrZc",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Rlul8wnMrZc"
      }
    }
  ]
}