{
  "id": "37c8a3e2-6635-4c47-917b-a96d7456be52",
  "name": "The Imagination Podcast",
  "spotifyId": "2645EemW8tLhffTnaxyqu4",
  "appleId": 1526743863,
  "youTubeChannelId": "UCUI2O6cTTbstaVMUCtvGkxA",
  "episodes": [
    {
      "id": "ff62c1ce-4f44-4bf4-b1b0-4a5b772473c3",
      "title": "S5E96 | Kadaya - Secret Codes Hidden in Plain Sight, Trafficked by the Cult, \u0026 the Nephilim Agenda",
      "description": "Today I’m honored to have back on the show for a third time: Satanic ritual abuse, mind control, Stargate, Freemason, Jesuit, and organized abuse survivor, overcomer and whistleblower, loving mother, founder, content creator, and host of ‘The Quickening Project’, faithful servant to the most high, gardener, floral design extraordinaire, singer and songwriter, poetry reader and creative writer: Kadaya\n\nIn case you missed either of Kadaya’s incredible episodes she did here on this show, here is a brief synopsis of her testimony as well as some things we will be talking about today: \n\nFrom infancy, Kadaya endured Illuminati and MONARCH trauma-based mind control programming involving electroshock, drowning, and ritualistic abuse to create dissociative identities. Taken to Masonic lodges, churches, the Vatican, and even a movie theater basement for Stargate programming, her intelligence and spiritual gifts were exploited by Freemasons, Jesuits, and royal bloodlines for dark agendas. Despite a “happy childhood” facade, her hidden alters suffered heinous abuse disguised as legitimate operations.\n\nHer health bore many scars: dissociative seizures, amnesia, psoriasis, and wounds from adrenochrome extractions. Through prayer, her faith, fasting, and 444 Hz music, Kadaya experienced miraculous healing, including restored skin. Her faith in Yahweh empowered her to confront her main perpetrators and handlers, breaking free from psychological chains.\n\nHer escape cost her dearly - betrayal by family, friends, and her husband, who secured a protection order, taking her children, home, and livelihood. Gang-stalked and targeted, she found refuge with a righteous family and Restoration in Christ Ministries, working to deprogram and integrate memories. Despite losing her children to a corrupt system, Kadaya fights for their freedom and exposes systemic abuse.\n\nThrough The Quickening Project on Spotify, YouTube, and Instagram, Kadaya shares 444 Hz worship music, offering survivors healing. A gardener, floral designer, singer, songwriter, and poet, she transforms pain into anthems, exposing trafficking networks in churches, pizza chains, and amusement parks. Her upcoming book and affidavit aim to reveal the cult’s secrets, seeking justice and salvation.\n\nOn the past couple episodes, we dove deep into Kadaya’s testimony - outlining everything from programming and rituals to family life to breaking free to healing and everything in between. If you missed either of those two episodes, I encourage you to go back and listen before or after this episode. And before we start this episode, I wanted to offer a gentle warning to survivors that we will be talking about specifics pertaining to programming including graphic art, books, games, symbols, and other people, characters, places and things that were used specifically in Kadaya’s programming. This episode has been requested a lot in the comments and Kadaya will be using her own story to help expose and reveal some of the nefarious ways that MK ULTRA hides within our children’s entertainment and lives. She has put together an incredible presentation and you will absolutely want to stick around for this one if you are in the right head and heart space emotionally to watch and listen. If you are on Spotify or iTunes, feel free to head over to YouTube or Rumble if you’d like to see the actual presentation visuals that Kadaya will be sharing. I promise this episode is going to break ground and blow your mind!\n\nKadaya’s courage is a clarion call: you are not alone, and your pain is not your identity. An absolute warrioress and passionate purveyor of truth, she invites all to join her crusade for a world where no child is enslaved, and love triumphs over evil. Kadaya’s journey is a radiant melody of healing, redemption, and restoration, an unyielding flame of hope that pierces through the darkest shadows, inspiring all to rise and reclaim the light.\n\nDONATE TO KADAYA’S GOFUNDME: https://gofund.me/cb63137d\n\nCONNECT WITH KADAYA: \n-YouTube: @thequickeningproject - https://www.youtube.com/@thequickeningproject\n-Spotify: https://open.spotify.com/show/6OmNqqtVj3GC91wUqdHAgo?si=KEgkSw9sSUGUtIHheuY3Hg\u0026nd=1\u0026dlsi=0fc9bed697ac4cef\n-IG: https://www.instagram.com/thequickeningproject/\n\nCONNECT WITH EMMA / THE IMAGINATION: \nYouTube: https://www.youtube.com/@imaginationpodcastofficial\nRumble: https://rumble.com/c/TheImaginationPodcast\nEMAIL: imagineabetterworld2020@gmail.com OR standbysurvivors@protonmail.com\nMy Substack: https://emmakatherine.substack.com/\nBUY ME A COFFEE: https://www.buymeacoffee.com/theimagination\nAll links: https://direct.me/theimaginationpodcast\n\nRIFE TECHNOLOGIES: \nhttps://realrifetechnology.com/\n15% Code: 420\n\nCZTL METHELENE BLUE:\nhttps://cztl.bz?ref=2BzG1\nFree Shipping Code: IMAGINATION",
      "release": "2025-08-17T23:00:06Z",
      "duration": "03:17:37",
      "explicit": false,
      "spotifyId": "3NVK3E9doGHphLUjDrGQOu",
      "appleId": 1000722368698,
      "youTubeId": "pKEmG_MoAvo",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3NVK3E9doGHphLUjDrGQOu",
        "apple": "https://podcasts.apple.com/podcast/s5e96-kadaya-secret-codes-hidden-in-plain-sight-trafficked/id1526743863?i=1000722368698",
        "youtube": "https://www.youtube.com/watch?v=pKEmG_MoAvo"
      }
    },
    {
      "id": "c363c7b7-8075-445a-8a49-34d05aae5034",
      "title": "S5E91 | Sharri Burggraaf - GATE, MK ULTRA Medical Experimentation \u0026 Catholic Criminal Cult Overcomer",
      "description": "Today, I’m honored to introduce you all to: Satanic ritual abuse, mind control, and organized abuse survivor and overcomer, loving mother and devoted wife, artist, podcaster and host of her own podcast ‘Arise and Shine’, founder of SHOUT for Help non-profit, facilitator for Relentless Hope, singer and songwriter, writer and blogger, videographer, advocate for future overcomers, author, speaker, videographer, written and spoken word poet, and advocate for current and future overcomers: Sharri Burggraaf\n\nSharri’s life is a testament to the transformative power of faith, resilience, and purpose. Born on Friday the 13th, 1957, in Dubuque, Iowa, to a Catholic family, Sharri’s early years were marred by unimaginable trauma. Subjected to ritual abuse, mind control, child pornography, and sex trafficking, her childhood was stolen by multiple perpetrators, including her parents, a priest, a nun, and an elite network of businessmen. Under the guise of a \u0022talented and gifted program,\u0022 she was bussed from school to a free medical clinic where she endured torture-based mind control, electric shocks, medical experimentation, and psychological programming - deceptively framed as cancer research conducted by German scientists. Her father, a World War II veteran, was also ensnared in these sinister programs, and Sharri believes he was murdered to silence his attempts to escape, with threats used to keep her enslaved.\n\nThese experiences were designed to fracture and control, yet within her, a spark of resilience refused to be extinguished. Diagnosed in the early 1990s with Dissociative Identity Disorder she embarked on a courageous journey of recovery. Her path was not linear nor easy, but was a winding road marked by pauses to raise her children and moments of profound dedication to healing.\n\nFrom victim to survivor, Sharri has set her sights on thriving, embracing a life lived wholeheartedly despite the weight of her past. In the 1990s, she put her strength into action, founding S.H.O.U.T. for Help (Survivors Helping Others Unite Together), a nonprofit dedicated to supporting fellow survivors. Sharri has also become a voice for the voiceless, speaking at the Healing Together Conference in Orlando, Florida, for three consecutive years, where she shared her expertise on ritual abuse and mind control. Through her YouTube channel, TikTok account, and the Arise and Shine podcast, she offers hope and experiential wisdom, demystifying the power of perpetrator groups and dismantling the fear that binds survivors. Her message is clear: recovery is possible, no matter how insurmountable the obstacles may seem.\n\nAs a founding member of Dissociative Writers, and a facilitator for Relentless Hope, Sharri also runs support groups and writing workshops, including her upcoming Project J.U.S.T.I.C.E. training initiative for survivor-clinicians, law enforcement, and advocates. Her work with Relentless Hope aligns with her heart for survivors, emphasizing their value, collective power, and right to be believed. \n\nAs a beacon of light for survivors, Sharri challenges the stigma and disbelief surrounding ritual abuse and mind control. She confronts the societal denial that often compounds survivors’ pain, advocating for awareness of human trafficking and the interconnectedness of ritual abuse and mind control with multigenerational abuse. Her mission is not to rescue single-handedly but to collaborate with others, amplifying voices and fostering hope for those still trapped in darkness.\n\nSharri stands as living proof that one can emerge from the depths of trauma to shine brightly, guiding others toward their own liberation. Her journey reminds us that even in the face of unimaginable evil, the human spirit can reclaim its power, rewrite its story, and inspire a world in need of hope. To every survivor, Sharri’s voice echoes: You are not alone. If I can escape, so can you.\n\nCONNECT WITH SHARRI: \nWebsite: https://ariseandshineafterabuse.com/\nSpotify: https://open.spotify.com/artist/36X5N0DuOl4xTabqDhKZII\nTikTok: https://www.tiktok.com/@sharriburg\n\nCONNECT WITH EMMA / THE IMAGINATION: \nYouTube: https://www.youtube.com/@imaginationpodcastofficial\nRumble: https://rumble.com/c/TheImaginationPodcast\nEMAIL: imagineabetterworld2020@gmail.com OR standbysurvivors@protonmail.com\nMy Substack: https://emmakatherine.substack.com/\nBUY ME A COFFEE: https://www.buymeacoffee.com/theimagination\nAll links: https://direct.me/theimaginationpodcast\n\nRIFE TECHNOLOGIES: \nhttps://realrifetechnology.com/\n15% Code: 420\n\nCZTL METHELENE BLUE:\nhttps://cztl.bz?ref=2BzG1\nFree Shipping Code: IMAGINATION",
      "release": "2025-07-27T23:00:06Z",
      "duration": "03:04:28",
      "explicit": false,
      "youTubeId": "VngZLePoNME",
      "subjects": [
        "Catholicism",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VngZLePoNME"
      }
    },
    {
      "id": "ecea0a25-3e17-46b4-9b6f-1f05bed26c36",
      "title": "S5E55 | Dalila Sadok - Mother Whistleblows Cult Kidnapping \u0026 Satanic Ritual Abuse of Her Children",
      "description": "Today I’m honored to have on the show and introduce you all to: French whistleblower, survivor advocate, and fierce mother and mama bear who is in the fight of her life to save her two children who were kidnapped and abducted by their father, authorities, and the satanic cult he belongs to: Dalila Sadock\n\nIn a world shrouded by shadows, one courageous mother emerges as a beacon of hope, shattering the silence with her unwavering resolve. Dalila, a lioness of love, steps onto the stage of this transformative podcast, her voice echoing from the heart of France to unveil a chilling tale of betrayal and resilience. She fearlessly exposes a sinister reality: her beloved children, Camile and Milo, were torn from her arms, abducted by their own father with the complicity of a corrupt system - police and authorities entwined in a web of deceit.\n\nOnce a devoted girlfriend, Dalila’s life seemed a fairy tale when she met her ex-boyfriend online, a man she believed was her soulmate. Their romance blossomed swiftly, leading them to build a life together and welcome their first child within a year. Yet, beneath the surface of this dream, a nightmare brewed. It was only after the birth of their second child that Dalila’s intuition screamed louder than the reassurances of doctors who dismissed her daughter’s haunting signs of sexual abuse as mere imagination. Undeterred by their denials, she fought for the truth, eventually escaping her husband’s grip and securing full custody of her children through the courts - a victory for a mother’s fierce love.\n\nBut the battle was far from over. Even with limited visitation rights, her ex’s shadow loomed darkly. Unable to contact her children during his time with them, Dalila’s heart broke as she witnessed their return - shaken, screaming, and scarred by unspeakable trauma. What unfolded next was a mother’s relentless quest for justice. Her children whispered of horrors unimaginable: caged children, graphic accounts of abuse, sketches depicting human sacrifice amid famous French landmarks, presided over by prominent politicians. These were not mere childish tales but cries for rescue, painted in the innocence of their terror.\n\nWith no agenda but to shield her little ones - already in her care full-time by law - Dalila turned to the authorities, armed with her children’s drawings and testimonies. Yet, in a cruel twist of fate, her pleas were met with betrayal. One fateful day, as her children sat in school, the very system meant to protect them facilitated their abduction. Stripped of her rights, accused of fabricating their suffering, Dalila watched helplessly as custody was handed to their abuser. Since that devastating moment, she has not laid eyes on Camile and Milo, her every attempt to reclaim them met with indifference - even surviving assassination attempts dismissed by those sworn to uphold justice.\n\nBut Dalila is no ordinary soul; she is a warrior forged in the fires of adversity. Refusing to be silenced, she has taken her story to the global stage, gracing international podcasts with a mission to ignite a movement. The voice of a fierce mama bear, a desperate hope that the world’s ears will turn toward her children’s plight, exposing the corrupt underbelly of France’s justice system. Camile and Milo are blessed beyond measure to have a mother whose love defies oppression, a mother who transforms pain into power.\n\nToday, you will bear witness to a testimony that pierces the heart - a parent’s darkest nightmare laid bare. Yet, Dalila’s story is not hers alone. This podcast has unveiled a chilling pattern, parents from across borders bound by a shared saga of state-sanctioned theft, their children delivered into the hands of tormentors. It is heroes like Dalila who will dismantle this fractured system, brick by brick, until every child is liberated from the chains of abuse and restored to the embrace of love.\n\nTo call Dalila a fighter is an understatement - she is a force of nature, a living testament to the unbreakable bond between a mother and her children. It is a profound privilege to amplify her story, a miracle that demands your undivided attention. Listen closely, share boldly, and join the chorus of voices rising to reunite Camile and Milo with the fearless woman who will stop at nothing to save them. Together, we can turn her courage into a tidal wave of change.\n\nCONNECT WITH THE IMAGINATION:\nEMAIL: imagineabetterworld2020@gmail.com OR standbysurvivors@protonmail.com\nMy Substack: https://emmakatherine.substack.com/\nBUY ME A COFFEE: https://www.buymeacoffee.com/theimagination\nAll links: https://direct.me/theimaginationpodcast",
      "release": "2025-05-29T18:20:04Z",
      "duration": "02:21:25",
      "explicit": false,
      "youTubeId": "cp6EMjhXzzg",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cp6EMjhXzzg"
      }
    },
    {
      "id": "e6639780-6c3a-4df0-a5f4-722648f13c94",
      "title": "S5E49 | Svali - Breaking Free of Cult Programming: Faith, Forgiveness, Self-Love, \u0026 Inner Cohesion",
      "description": "Today I’m honored to have back on the show once again for another incredible episode: Human trafficking, satanic ritual abuse and Jesuit mind control survivor and whistleblower, published writer and author, mother, educator, blogger, and one of our most beloved and requested guests, Svali!\n\nA short overview about Svali in case you’re new here or have missed any of Svali’s episodes on this podcast - Svali has been a voice for survivors for years now through her blogs ‘Svali Speaks’ and ‘Svali Speaks Again’, and the books she has authored including, “Breaking Free of Cult Programming” - which has help lay the foundations for what we know today about cults, trauma-based mind control, deprogramming, secret societies including the Jesuit order, the history of the Illuminati and so much more, as well her brand new 3-part testimony series, “Never Give Up”, which gives a first time deep dive into Svali’s own testimony and life. Born and raised in a cult and having experienced horrors beyond comprehension, Svali broke free of her cult group several years ago and has been on a quest to share the knowledge that she has learned from personal experience to help set others free. There are years of eye-opening information on her blogs, and her books give a very concise and no-nonsense look at the underworld of mind control and the underlying mechanisms to which it is orchestrated, used generationally, and hidden from society.\n\nSvali has graced our show multiple times, each appearance more enlightening than the last, from her powerful two-part testimony series to deep explorations of cult programming, deprogramming, and healing. Today, we celebrate an extraordinary milestone - the release of the third and final installment of her testimony memoir on Amazon, “Never Give Up Part 3: Getting Free”. This book series not only unveils untold stories from her life but also offers profound lessons in resilience, hope, and the miraculous journey of healing.\n\nIn today’s episode, we\u0027ll delve into some critical topics like Immortals and Delta programming, specifically how these are used in the Jesuit Order for memory and skills storage. We\u0027ll also explore the pathways to healing and recovery, offering support to survivors and those who assist them. A reminder that Svali\u0027s insights are drawn from her own personal experiences within the Jesuit Order and they highlight one aspect of mind control but are not universal to all cult groups and practices.\n\nAnd also a quick Trigger Warning to survivors as we will be discussing sensitive subjects related to mind control programming, parts, and systems. Please proceed with care.\n\nSvali brings to us decades of dedicated work in understanding and recovering from the control mechanisms she once endured. This conversation promises to be a beacon of hope and knowledge for anyone seeking truth and freedom from the shadows of manipulation and mind control. I encourage you all to put away any distractions and give your full attention to Svali as this episode is not just an interview, but a life-changing lesson from someone who has courageously fought to bring light to the darkest corners of human experience.\n\nSvali stands before us today as a testament to what the human spirit can overcome. Her journey from the depths of cult control to liberation is nothing short of miraculous, and we are truly honored and blessed to have her share her wisdom with us today once again. Let’s dive in!\n\nSVALI\u0027S RECOMMENDED READING:\n\u0022Finding Freedom\u0022 Book: https://www.amazon.com/dp/B08LNN5DTB?ref_=cm_sw_r_cp_ud_dp_9ME4YZ9Z1KZXN4QNFJJG\u0026peakEvent=5\u0026dealEvent=1\n\u0027Prayer Warrior 1\u0022 Book: https://a.co/d/ie8YAsm\n\u0022Prayer Warrior 2\u0022 Book: https://a.co/d/iyeRMXm\n\nCONNECT WITH SVALI:\n\u0022Breaking Free of Cult Programming\u0022 Book: https://a.co/d/3ELuR8a\n\u0022It\u0027s Not Impossible\u0022 Book: https://a.co/d/3rP7AKv\n\u0022Svali Speaks Again\u0022 Blog\u0022: https://svalispeaksagain.wordpress.com/blog/\n\u0022Svali Speaks\u0022 Blog: https://svalispeaks.wordpress.com/\nDeprogram Wiki: https://deprogramwiki.com/tag/svali/\n\nCONNECT WITH THE IMAGINATION:\nEMAIL: imagineabetterworld2020@gmail.com\nMy Substack: https://emmakatherine.substack.com/\nBUY ME A COFFEE: https://www.buymeacoffee.com/theimagination\nAll links: https://direct.me/theimaginationpodcast\nWebsite: https://standbysurvivors.com/\n\nRIFE TECHNOLOGIES:\nhttps://realrifetechnology.com/\n15% Code: 420\n\nCZTL METHELENE BLUE:\nhttps://cztl.bz?ref=2BzG1\nFree Shipping Code: IMAGINATION",
      "release": "2025-05-29T14:00:06Z",
      "duration": "01:12:15",
      "explicit": false,
      "youTubeId": "NuBNsQZw0tw",
      "subjects": [
        "Human Trafficking",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NuBNsQZw0tw"
      }
    },
    {
      "id": "9c02db22-1921-4c52-9cf0-99b869ef75fa",
      "title": "NXIVM Cult \u0026 Trafficking Survivor India Oxenberg: \u0027Still Learning\u0027 After Being \u0027Seduced\u0027",
      "description": "What an incredible honor to get to have NXIVM and human trafficking survivor, author, executive producer and an all around inspirational sweetheart, India Oxenberg, join us on this week\u0027s podcast episode! India was a personal inspiration for the creation of our ongoing \u0027Survivor Series\u0027 as her story is one of just a few to break national and international headlines. It\u0027s not often a survivor has their voice or story heard by the public and this episode was very timely with India\u0027s new book release for \u0027Still Learning\u0027 (on Audible) and with recent news breaking regarding the sentencing of NXIVM\u0027s Allison Mack (3 years) and Keith Raniere (120 years).\n\nYou can hear India\u0027s incredible survivor story in full on the incredible docuseries she executive produced on STARZ called \u0027Seduced\u0027, and we used our time together to dive into some aspects of being a survivor that aren\u0027t as commonly talked about such as grooming, cults, mind control, healing, relationships, her inspiration for going public with her story, and the importance of self care. The reality is that a survivor is never \u0027free\u0027 from what they go through and no one is better at humanizing a survivor\u0027s experiences of abuse than India.\n\nThis conversation brings light to asking the important question: \u0022What does human trafficking really look like?\u0022 and (as you\u0027ll see), the answer to that question isn\u0027t as linear as one would think.\n\nPlease support India\u0027s new book and check out her series on STARZ - these are valuable tools to learn more on human trafficking and they pave the way for conversations to be had regarding the psychology of both the abuser and the survivor. India is an absolute delight and I know this episode will impact you as much as it did me!\n\nConnect with India:\nInstagram: @IndiaOxenberg\nLinkTree: https://linktr.ee/Indiaox\n\nCONNECT WITH THE IMAGINATION:\nAll links here:\nhttps://direct.me/theimaginationpodcast",
      "release": "2021-07-12T19:30:06Z",
      "duration": "00:50:02",
      "explicit": false,
      "spotifyId": "355X9QCa6tOx7IraozZyCr",
      "appleId": 1000528584061,
      "youTubeId": "-yJ9dJdwebg",
      "subjects": [
        "NXIVM",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/355X9QCa6tOx7IraozZyCr",
        "apple": "https://podcasts.apple.com/podcast/ep-36-nxivm-cult-and-human-trafficking-survivor-india/id1526743863?i=1000528584061",
        "youtube": "https://www.youtube.com/watch?v=-yJ9dJdwebg"
      }
    }
  ]
}