{
  "_ts": 0,
  "id": "7db12de3-dd33-4cfa-a4c8-60e4f6374f1f",
  "name": "The Majority Report w/ Sam Seder",
  "youTubeChannelId": "UC-3jIAlnQmbbVMV6gR7K8aQ",
  "episodes": [
    {
      "id": "8cc23b96-f390-4f55-8a67-f81babb935fb",
      "title": "Fundamentalist Sect That May Shape Our Government Under Trump | Gareth Gore | TMR",
      "description": "Live-streamed on October 29, 2024\n\nGareth Gore joins to talk about his new book Opus: The Cult of Dark Money, Human Trafficking, and Right-Wing Conspiracy inside the Catholic Church.\n\nhttps://x.com/gareth_gore\n\nhttps://www.simonandschuster.com/books/Opus/Gareth-Gore/9781668016145\n\nGareth Gore then joins, diving right into the story of his research into the collapse of a Spanish bank that led him to uncover the outrageous and extensive financial connections between Opus Dei, said bank, and myriad “hospitality” schools across the globe that routinely trafficked women, before stepping back to unpack what Opus Dei is and its process of radicalization under Spanish Priest (and founder) Josemaría Escrivá in early 20th Century Spain to become the reactionary, militant, elite-connected, and Papal-doubting organization that we see today. After briefly expanding on the expansive state of Opus Dei’s connection to the contemporary US conservative movement, particularly in the Courts and Media, Gore steps back to analyze the rise of Opus Dei in the US, walking through its first few decades of struggle before its lingering presence around elite institutions finally took off, and exploring its central motive (from its roots in Spain) of pervading elite networks to grow its political power, with the ultimate goal of imposing their theocratic rule. Gareth also walks Sam through the story of Opus Dei’s “Hospitality Schools,” as a central example of their emphasis on abusive and exploitative hierarchy, and the overwhelming backlash to his reporting from Opus Dei-affiliated groups and individuals, before wrapping up by assessing the role the organization is playing in the ongoing US elections, with tight ties to both GOP Mega-Donor Leonard Leo and Vice Presidential candidate JD Vance.\n\nWatch the Majority Report live Monday–Friday at 12 p.m. EST on YouTube OR listen via daily podcast at http://www.Majority.FM \n\nhttps://www.house.gov/representatives/find-your-representative\nhttps://www.senate.gov/senators/senators-contact.htm\n\n#SamSeder #EmmaVigeland #MajorityReport #politics #news\n\nSupport the show by becoming a member: https://www.fans.fm/majority/join  \n\nGet all your MR merch at our store: https://www.shop.majorityreportradio.com/ \n\nGift a Majority Report subscription here: https://www.fans.fm/majority/gift \n\nSubscribe to the AMQuickie newsletter here: https://www.am-quickie.ghost.io/ \n\nJoin the Majority Report Discord! http://www.majoritydiscord.com/ \n\nGet the free Majority Report App!: http://www.majority.fm/app \n\nCHECK OUT MORE from the MR crew: \nMatt Binder DOOMED https://www.youtube.com/MattBinder \nBrandon Sutton DISCOURSE https://www.patreon.com/ExpandTheDiscourse \nEmma Vigeland ESVN https://www.youtube.com/ESVNShow \nMatt Lech LEFT RECKONING https://www.youtube.com/LeftReckoning \n\nOTHER LINKS: \nTwitch: https://www.twitch.tv/themajorityreport \nTikTok: https://www.tiktok.com/@majorityreportfm \nFacebook: http://facebook.com/MajorityReport \nTwitter: http://twitter.com/MajorityFM \nInstagram: https://www.instagram.com/majorityreport.fm/",
      "release": "2024-11-03T18:15:01Z",
      "duration": "00:33:34",
      "explicit": false,
      "youTubeId": "PMgMmNohM6Q",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PMgMmNohM6Q"
      }
    }
  ]
}