{
  "id": "321218be-4073-4e62-b970-81d131a20dd0",
  "name": "The Higher Standard",
  "spotifyId": "4GWJoCTk8jQRwKyutOERtP",
  "appleId": 1596999039,
  "episodes": [
    {
      "id": "f658c4a7-2960-4ba6-87b4-7292c3f16231",
      "title": "Curtis Lorincz | Exposing the Guru Grift: One Man vs. The Cult of Bro Culture",
      "description": "What happens when a straight-shooting car guy with zero patience for bullshit takes on the loudest, most insecure bros on the internet? You get Curtis Lorincz — the viral voice calling out fake gurus, bro culture, and “number one car salesman” fantasies with nothing but a phone and the truth. In this episode, Curtis joins Chris and Rajeil to unpack how obedience gets monetized, why yelling at men isn’t motivation, and what really goes on behind those cringey sales events with VIP dinner upgrades and God-tier grifting. ➡️ From $6,000 podcast invites to baptism-by-course-selling, this one pulls no punches. We talk Andy Elliott, Grant Cardone, Ryan Pineda, and the shady playbook behind monetized masculinity. If you’ve ever side-eyed a rented Lambo or rolled your eyes at “faith-based business coaching,” buckle up. Curtis is here to torch the cult — and he\u0027s bringing receipts. \u0026#x1f4a5; Have you left your \u0022honest ⭐️⭐️⭐️⭐️⭐️\u0022 review? \u0026#x1f455; THS MERCH: http://www.thspod.com \u0026#x1f517; Curtis Lorincz\u0027s Links: Personal Instagram H\u0026S Motocars Website ⚠️ Disclaimer: Please note that the content shared on this show is solely for entertainment purposes and should not be considered legal or investment advice or attributed to any company. The views and opinions expressed are personal and not reflective of any entity. We do not guarantee the accuracy or completeness of the information provided, and listeners are urged to seek professional advice before making any legal or financial decisions. By listening to The Higher Standard podcast you agree to these terms, and the show, its hosts and employees are not liable for any consequences arising from your use of the content.",
      "release": "2025-08-05T09:00:00Z",
      "duration": "01:11:58.4840000",
      "explicit": true,
      "spotifyId": "4maXDkQjlXb7lvoaP4X4pI",
      "appleId": 1000720697401,
      "subjects": [
        "Grant Cardone"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4maXDkQjlXb7lvoaP4X4pI",
        "apple": "https://podcasts.apple.com/podcast/curtis-lorincz-exposing-the-guru-grift-one-man-vs/id1596999039?i=1000720697401"
      }
    }
  ]
}