{
  "_ts": 0,
  "id": "925f94e7-ff0a-4d4b-9074-e585c6a515dc",
  "name": "The Most Haunted City On Earth Podcast",
  "spotifyId": "2bf71wFfd2uvzvfRuZKsV2",
  "appleId": 1633765510,
  "youTubeChannelId": "UC81uEYLYSXbGgwPfP2aXHhw",
  "episodes": [
    {
      "id": "187f4706-77d6-4daf-9fe3-1dde6621440f",
      "title": "NXIVM Cult | The Sex Cult That\u0027s Still Active Today",
      "description": "Madison and JT unravel the shocking rise and fall of NXIVM, the notorious \u0022self-help\u0022 organization that unraveled into a web of manipulation, branding rituals, and sex trafficking. From its beginnings as a pyramid scheme to the disturbing practices of DOS, we dissect the cult’s charismatic leader Keith Raniere, his bizarre claims of genius, and the women who helped enforce his sinister vision. Dive deep into the allegations, the high-profile members involved, and the criminal convictions that rocked the world. Join us as we rate this chilling true crime story on our wickedness scale. Don\u0027t forget to subscribe and share your thoughts in the comments!",
      "release": "2025-01-13T21:00:23Z",
      "duration": "01:16:16",
      "explicit": false,
      "youTubeId": "S59pZ5uKO50",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S59pZ5uKO50"
      }
    },
    {
      "id": "2b786bac-e4b3-4ea2-a71c-1e6bbfca35ba",
      "title": "The Twelve Tribes Cult | The Dangerous Cult In Your Neighborhood",
      "description": "Become a Parajunkie Today! www.patreon.com/savannahunderground\n\nCheck out more episodes of From One To Wicked here! https://open.spotify.com/show/06QAIRzlD07PLxLLm3tHfA\n\nWelcome to From One To Wicked, the podcast where true crime meets chilling analysis. Hosted by Madison K. Drayton and JT, we take an in-depth look at the darkest corners of humanity, investigating criminals and cults before placing them on our custom wickedness scale. Each episode is a deep dive into motive, brutality, and more, scored live by our devoted fanbase, the Parajunkies, via interactive YouTube polls. No crime is too taboo, and no perpetrator escapes judgment in our pursuit of dissecting wickedness.\nIn today’s episode, we unravel the twisted history of the Twelve Tribes cult, a sinister Christian fundamentalist group cloaked in hippie charm and communal living. Beneath their seemingly idyllic façade lies a disturbing doctrine that justifies racism, homophobia, and extreme child abuse. Led by founder Gene Spriggs, the Twelve Tribes controlled every aspect of their members’ lives while spreading their oppressive beliefs across continents. We examine the horrifying tales of ex-members, accounts of systemic abuse, and the lasting scars left by one of the most troubling cults in modern history. Buckle up as we rate the Twelve Tribes from One to Wicked — spoiler alert, they’re pretty wicked.\n\nInside the Twelve Tribes\nhttps://youtu.be/CSnMHQInc1w?si=g_wqtDtWwbfAib4u\nThe Yellow Deli Doc\nhttps://youtu.be/pWbXkkywGWE?si=H_zzlSojygAKqBHC\nWhat drove religious elders to leave a controversial cult?\nhttps://youtu.be/918Su4VgiY4?si=yoH-GekxQMb3XU_D\n Grateful Dead Show hartford 4-26-09\nhttps://youtu.be/m4AKlJlqyMU?si=C0Xvf53Mo1L6tQqE\nThe Common Farm\nhttps://youtu.be/zSsyDjIQV9w?si=OMj11mEie9ACjmCF\n12 Tribes Savannah, Ga\nhttps://youtu.be/i19yM5GJse8?si=Q6-TM8EhWPR9Tp3c\nI spent 7 years in a cult\nhttps://youtu.be/_85cT-4W2Bg?si=Gdhn_piAIQ0bFgcX\nI team: Former member of Twelve Tribes Religgious Group Alleges..\nhttps://youtu.be/wKF2Cmngxfs?si=ymwWkjbnOgBi_Fw1",
      "release": "2024-12-30T21:00:19Z",
      "duration": "01:42:19",
      "explicit": false,
      "youTubeId": "GLnd4qLsWUE",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GLnd4qLsWUE"
      }
    },
    {
      "id": "c606615b-072f-4229-818b-e850badd1655",
      "title": "Ghosts, Cults, and MUCH More with \u0022And That\u0027s Why We Drink!\u0022",
      "description": "Listen to our BRAND NEW podcast From One To Wicked here: https://open.spotify.com/show/06QAIRzlD07PLxLLm3tHfA Check out their Em \u0026 Christine\u0027s new book here! bit.ly/HRANextStop Become a Parajunkie today for ALL the livestreams:) www.patreon.com/savannahunderground Get ready, Parajunkies! We\u0027ve got a spine-chilling episode for you as we welcome Christine from the hit podcast \u0022And That\u0027s Why We Drink\u0022! \u0026#x1f377;\u0026#x1f47b; We\u0027re diving into their brand new book, \u0022A Haunted Road Atlas: Next Stop\u0022, exploring some of Christine\u0027s favorite haunted spots that are featured in the book. We also share the eerie tale of The Andrew Lowe House in Savannah—known for its ghostly residents and unsettling vibes—and dive into the strange and mysterious world of The Twelve Tribes Cult. If you love haunted history, ghost stories, and a touch of true crime, you won\u0027t want to miss this one! Join us for laughs, frights, and the inside scoop on Christine\u0027s paranormal experiences! --- Support this podcast: https://podcasters.spotify.com/pod/show/john-taylor-timmons/support",
      "release": "2024-10-08T04:00:00Z",
      "duration": "00:55:37.8960000",
      "explicit": false,
      "spotifyId": "1SCXb1yA3SWFxBrsVO8gPV",
      "appleId": 1000672170466,
      "youTubeId": "VYVkl6DyAZ8",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1SCXb1yA3SWFxBrsVO8gPV",
        "apple": "https://podcasts.apple.com/podcast/ghosts-cults-and-much-more-with-and-thats-why-we-drink/id1633765510?i=1000672170466",
        "youtube": "https://www.youtube.com/watch?v=VYVkl6DyAZ8"
      }
    },
    {
      "id": "6f246c57-157a-4857-840f-985f4c198b43",
      "title": "\u0022The Heaven\u0027s Gate Cult\u0022 With Former Members (Still Believers) Sawyer \u0026 Cathy!!!",
      "description": "#heavensgate #cult #truecrime \nFor exclusive content, ZERO ads, and so much more become a Parajunkie here: www.patreon.com/savannahunderground\n\nOn this VERY special episode of The Most Haunted City on Earth, Madison talks to current believers of what the public knows as \u0022The Heaven\u0027s Gate Cult\u0022. We get two different perspectives: Sawyer joined and studied under Marshall Applewhite while Cathy, his partner, is a new believer.\n\nSend in your Ghostmail! ghostmail@hauntedcitypodcast.com",
      "release": "2023-01-31T05:00:22Z",
      "duration": "01:11:38",
      "explicit": false,
      "spotifyId": "4IerlEcxuU3aFICL6beWYN",
      "appleId": 1000597359823,
      "youTubeId": "twrDVHpzZrU",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4IerlEcxuU3aFICL6beWYN",
        "apple": "https://podcasts.apple.com/podcast/the-heavens-gate-cult-with-former-members-still/id1633765510?i=1000597359823",
        "youtube": "https://www.youtube.com/watch?v=twrDVHpzZrU"
      }
    }
  ]
}