{
  "_ts": 0,
  "id": "b6128ede-e575-4450-9fd7-31f007c4c2a2",
  "name": "The Trauma Therapist",
  "spotifyId": "0FgLwflezXYy3lHL2y4V7v",
  "appleId": 899009517,
  "youTubeChannelId": "UCqTAb0yb7fO3ep0pgPVL8Ig",
  "episodes": [
    {
      "id": "a777eaba-24e1-437d-8a58-03d333124970",
      "title": "Guest Host: Jamie Marich, PhD interviews Janja Lalich, PhD. Cults and Complex Trauma",
      "description": "Jamie Marich, PhD (she/they) speaks internationally on EMDR therapy, trauma, addiction, dissociation, expressive arts, yoga, and mindfulness, and runs a private practice and online training network in her home base of Akron, OH. Janja Lalich, Ph.D. is a researcher, author, and educator specializing in cults and extremist groups, with a particular focus on charismatic relationships, political and other social movements, ideology and social control, and issues of gender and sexuality. She has been a consultant to educational, mental health, business, media, and legal professionals, as well as having worked with current members, former members, and families of members of controversial groups. In This Episode Dr. Jamie’s website The Institute for Creative Mindfulness Dr. Lalich\u0027s website The Lalich Center on Cults and Coercion Dr. Lalich\u0027s course at the Institute for Creative Mindfulness --- If you’d like to support The Trauma Therapist Podcast and the work I do you can do that here with a monthly donation of $5, $7, or $10: Donate to The Trauma Therapist Podcast. Click here to join my email list and receive podcast updates and other news. Become a supporter of this podcast: https://www.spreaker.com/podcast/the-trauma-therapist--5739761/support .",
      "release": "2025-02-11T13:00:07Z",
      "duration": "00:21:55.7350000",
      "explicit": false,
      "spotifyId": "7qvRBqjlUp5ENXCyZoYkH6",
      "appleId": 1000691100320,
      "subjects": [
        "Cult-Expert",
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qvRBqjlUp5ENXCyZoYkH6",
        "apple": "https://podcasts.apple.com/podcast/guest-host-jamie-marich-phd-interviews-janja-lalich/id899009517?i=1000691100320"
      }
    }
  ]
}