{
  "id": "7abda06d-5b24-418c-9079-8962246dcbf0",
  "name": "The African Crime Files",
  "youTubeChannelId": "UCRlpYtT6gMGObcUBa09hQTg",
  "episodes": [
    {
      "id": "c6019b5e-c7ae-4da5-958b-1039eeab4d38",
      "title": "Inside One of the World\u0027s Worst Cults Led by Paul Mackenzie: Shakahola Massacre",
      "description": "In this video, we delve into the harrowing events of the Shakahola massacre in Kenya, orchestrated by self-proclaimed pastor Paul Mackenzie. This tragic incident, which came to light in early 2023, saw over 400 followers of Mackenzie’s Good News International Ministries lose their lives in a remote forest in Kilifi County.\n\nInstagram \nhttps://www.instagram.com/theafricancrimefiles/\n\nTimestamps:\n0:00 Introduction\n03:01 Kilifi\n04:17 Beginning of Paul Mackenzie\u0027s Life\n08:58 Paul Mackenzie\u0027s Ministry\n14:43 Prior to the Shakahola Massacre\n19:06 The Unimaginable Discovery at Shakahola\n22:15 Paul Mackenzie\u0027s Teachings\n29:48 Conclusion\n\nDisclaimer: The perspectives shared in this video are personal and do not necessarily represent the official stance of any agency, organisation, employer, or company. The assumptions made in the analysis solely reflect the views of the creator and may evolve, be revised, or reconsidered at any given time, without being permanently held.\n\nWe do not guarantee the accuracy, completeness or validity of the information presented in this video and disclaim any responsibility for errors, omissions, or delays in the information. We will not be held liable for any losses, injuries, or damages arising from the display or use of this information, as it is provided on an as-is basis. It is the viewer\u0027s responsibility to verify the accuracy of the facts presented.\n\nWe strive to adhere to fair use guidelines in all content within the channel, with no intention to infringe on copyright. If you are the owner or a representative and believe there is a copyright issue, please contact us promptly, and we will address the matter. The perspectives shared in this video are personal and do not necessarily represent the official stance of any agency, organisation, employer, or company. The assumptions made in the analysis solely reflect the views of the creator and may evolve, be revised, or reconsidered at any given time, without being permanently held.\n\nWe do not guarantee the accuracy, completeness or validity of the information presented in this video and disclaim any responsibility for errors, omissions, or delays in the information. We will not be held liable for any losses, injuries, or damages arising from the display or use of this information, as it is provided on an as-is basis. It is the viewer\u0027s responsibility to verify the accuracy of the facts presented.\n\nWe strive to adhere to fair use guidelines in all content within the channel, with no intention to infringe on copyright. If you are the owner or a representative and believe there is a copyright issue, please contact us promptly, and we will address the matter.",
      "release": "2024-07-31T06:00:17Z",
      "duration": "00:31:19",
      "explicit": false,
      "youTubeId": "bEupINBVhNw",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bEupINBVhNw"
      }
    }
  ]
}