{
  "_ts": 0,
  "id": "d82f0645-451f-400e-b852-e8c651e2ff9d",
  "name": "The Georgia Gazette",
  "youTubeChannelId": "UC8CXwuGOSPN10KrpXZ_ZOig",
  "episodes": [
    {
      "id": "f6eea4d2-7a28-4eb4-9fb5-2ce338b820f5",
      "title": "Georgia\u0027s Egyptian-Themed Cult: The United Nuwaubian Nation of Moors",
      "description": "Join me in this eye-opening episode of Behind the Headlines as we unravel the disturbing tale of the United Nuwaubian Nation of Moors. What seemed like an innocent roadside attraction in Putnam County, Georgia—a bizarre replica of Egyptian pyramids, sphinxes, and statues—was actually a front for a sinister cult led by Dwight York.\n\nYork’s so-called religious community, with its grandiose claims of ancient Egyptian heritage and alien origins, masked a horrifying reality of abuse, polygamy, and exploitation. Discover how York\u0027s manipulation turned this seemingly quaint attraction into a nightmarish compound where heinous crimes against women and children occurred.\n\nWe delve into the origins of the United Nuwaubian Nation of Moors, exploring York’s dubious rise from a troubled background to a self-proclaimed divine leader. Learn about the disturbing practices he imposed on his followers and the shocking lengths to which he went to control and exploit them.\nFrom the group\u0027s questionable claims to its Egyptian-themed aesthetic, we uncover how York’s manipulation led to his eventual downfall and the brave efforts of law enforcement and victims to expose the truth. Witness the dramatic investigation and legal battles that led to York\u0027s conviction and the dismantling of the cult\u0027s compound.\n\nThis episode is a compelling and unsettling exploration of one of Georgia’s darkest chapters. Subscribe to Behind the Headlines for more in-depth investigations into shocking true crime stories and cults. Don’t miss this crucial look into the hidden horrors behind a seemingly harmless attraction.\n\n#CultExposé #UnitedNuwaubianNation #TrueCrime #JoshuaJohn #BehindTheHeadlines #GeorgiaCult #CultInvestigation #DarkHistory\n\nBrought to you by The Georgia Gazette\nhttps://thegeorgiagazette.com/\n\nWritten by Chelsea M.\nmunroechelsea@gmail.com\n\nHosted and Edited by Joshua John of Adventure Explore Discover\nwww.youtube.com/@AdventureExploreDiscover",
      "release": "2024-08-09T22:00:06Z",
      "duration": "00:24:49",
      "explicit": false,
      "youTubeId": "8tRroPwRkC0",
      "subjects": [
        "Nuwaubian Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8tRroPwRkC0"
      }
    }
  ]
}