{
  "id": "0ec1bdd3-c367-453e-81d4-a938298faad8",
  "name": "The Daily",
  "spotifyId": "3IM0lmZxpFAY7CwMuv9H4g",
  "appleId": 1200361736,
  "youTubeChannelId": "UCkdnY2hNC0sdlVXPtWuNQ8g",
  "youTubePlaylistId": "PLdMrbgYfVl-s16D_iT2BJCJ90pWtTO1A4",
  "episodes": [
    {
      "id": "e17ce1a1-8d14-4a5b-a6d5-b1f4ddd6b858",
      "title": "Inside Jeffrey Epstein’s 50th Birthday Book",
      "description": "For months, President Trump has tried to dismiss questions about his relationship with Jeffrey Epstein, notably denying that he had been the author of a lewd birthday message to the financier and sex offender.\nOn Monday, Congress released the message — and many more like it.\nDavid Enrich, a deputy investigations editor at The Times, explains how the book, and an investigation into Mr. Epstein’s finances, reveal how Mr. Epstein leveraged his rich and powerful friends to fund a yearslong criminal conspiracy.\nGuest: David Enrich, a deputy investigations editor for The New York Times.\nBackground reading: \nA House panel released the drawing for Mr. Epstein apparently signed by Mr. Trump.A Times investigation found that JPMorgan spent years supporting — and profiting from — the notorious sex offender, ignoring red flags, suspicious activity and concerned executives.For more information on today’s episode, visit nytimes.com/thedaily. Transcripts of each episode will be made available by the next workday. \nPhoto: Uma Sanghvi/Palm Beach Post, via Associated Press\n\nUnlock full access to New York Times podcasts and explore everything from politics to pop culture. Subscribe today at nytimes.com/podcasts or on Apple Podcasts and Spotify.",
      "release": "2025-09-10T09:45:00Z",
      "duration": "00:24:53",
      "explicit": false,
      "spotifyId": "5CSqH9hcHGwxLtG4adJU9j",
      "appleId": 1000725867544,
      "youTubeId": "6ZtMyUNwC1g",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5CSqH9hcHGwxLtG4adJU9j",
        "apple": "https://podcasts.apple.com/podcast/inside-jeffrey-epsteins-50th-birthday-book/id1200361736?i=1000725867544",
        "youtube": "https://www.youtube.com/watch?v=6ZtMyUNwC1g"
      }
    }
  ]
}