{
  "_ts": 0,
  "id": "5170f0cb-4871-4703-b751-aca5472a9018",
  "name": "The Private Record",
  "spotifyId": "64vTrkBLqTCGY10SwAjkkO",
  "appleId": 1726136077,
  "youTubeChannelId": "UC-BoXTT0jVpt6Dew_T7Mcgw",
  "episodes": [
    {
      "id": "32edccfd-fac0-4c47-b65f-ca0b6b0dfd9f",
      "title": "When You Escape a Cult (Part Two!) — EP030 — The Private Record",
      "description": "The Private Record — Episode 30 — When You Escape a Cult (Part Two!)\n\nSeveral weeks ago we dropped what is by now (by far) our most beloved episode (EP06), featuring Ben, a brave young man who escaped a strange and little-known Christian \u0027cult\u0027 (his words, not ours!) that goes by the name of \u0027Gospel Outreach\u0027. Needless to say, the episode dropped on Gospel Outreach like a bomb, instantly turning Ben into their Public Enemy Number One. Since then, the leaders of GO have tried to silence him, defame him, harm his business, and outright intimidate him. But Ben ain\u0027t stoppin! In fact, he\u0027s SO not-stoppin\u0027 that he agreed to come back on the show and do it all over again... this time, with an even bigger chip on his shoulder, and even more brain-popping details about Gospel Outreach.\n\nIf his first episode was explosive, this one is downright nuclear. Ben names names and pulls no punches. We highly recommend checking out Episode Six before hitting play on this one, as Ben and Matt pick up where they left off in that conversation.\n\nIf Ben\u0027s first episode is any indication, this one is sure to spark a great deal of controversy. So make sure to get in the mix and share your thoughts in the comments!\n\nWelcome to \u0027The Private Record\u0027, where ordinary people tell their most extraordinary stories.\n\nNew episodes every Wednesday!\nWatch Unreleased Episodes and more at\nhttps://www.patreon.com/ThePrivateRecord\n\nIf you liked this episode, please hit that \u0027like\u0027 button and subscribe to this channel for ALL NEW episodes, clips, announcements and more!\n\nAnd if YOU have a crazy story of your own and want to be on the show, go to theprivaterecord.com to submit yourself as a potential guest! We look forward to hearing from you!\n\nFollow us  @ThePrivateRecord  on all socials! And find Matt on IG  @mattdelia  for additional content related to the show and more!\n\nGet your Shoutout and support the show using HOLLER:\nhttps://holler.baby/theprivaterecord\n\n\nSubmit your story at https://www.theprivaterecord.com\nSend us an email @ theprivaterecord@gmail.com\nFollow for more on socials @theprivaterecord\ntiktok - https://www.tiktok.com/theprivaterecord\ninstagram - https://www.instagram.com/theprivaterecord",
      "release": "2024-08-14T14:30:00Z",
      "duration": "02:02:52",
      "explicit": false,
      "spotifyId": "17zzQ86pCtvIB9iAfPe2iU",
      "appleId": 1000665232150,
      "youTubeId": "101vJlHpG3Y",
      "subjects": [
        "Gospel Outreach"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/17zzQ86pCtvIB9iAfPe2iU",
        "apple": "https://podcasts.apple.com/podcast/when-you-escape-a-cult-part-two/id1726136077?i=1000665232150",
        "youtube": "https://www.youtube.com/watch?v=101vJlHpG3Y"
      }
    },
    {
      "id": "28c7ec72-de3c-4261-9a3a-8a76190ffa2b",
      "title": "\u0022LEAKED CULT FOOTAGE\u0022 - CLIP",
      "description": "Excerpt from Episode 006 of \u0027The Private Record\u0027 - \u0022When You Are Born Into An Unhinged Modern-Day Cult— and Then You Escape\u0022\n\nWelcome to \u0027The Private Record\u0027, where ordinary people tell their most extraordinary stories.\n\nNew episodes every Wednesday!\n\nIf you liked this episode, please hit that \u0027like\u0027 button and subscribe to this channel AND Matt\u0027s personal channel,  @mattdelia  for ALL NEW episodes, clips, announcements and more!\n\nAnd if YOU have a crazy story of your own and want to be on the show, go to theprivaterecord.com to submit yourself as a potential guest! We look forward to hearing from you!\n\nFollow us  @ThePrivateRecord  on all socials! And find Matt on IG  @mattdelia  for additional content related to the show and more!\n\n\n\nSubmit your story at https://www.theprivaterecord.com\nSend us an email @ theprivaterecord@gmail.com\nFollow for more on socials @theprivaterecord\ntiktok - https://www.tiktok.com/theprivaterecord\ninstagram - https://www.instagram.com/theprivaterecord",
      "release": "2024-02-28T17:15:00Z",
      "duration": "00:08:10",
      "explicit": false,
      "youTubeId": "2hsTlXxN_Lw",
      "subjects": [
        "Gospel Outreach"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2hsTlXxN_Lw"
      }
    },
    {
      "id": "52160d51-527f-4b37-b0cc-060c780c160b",
      "title": "When You Are Born Into An Unhinged Modern-Day Cult-- and Then You Escape",
      "description": "\u0027The Private Record\u0027 - Episode 006 - \u0022When You Are Born Into An Unhinged Modern-Day Cult— and Then You Escape\u0022 Well. This is a wild one! Our guest (a kind, extremely tatted-up gentleman named Ben) was born and raised into a very strange, very scary, very secretive, and VERY little-known Christian sect called Gospel Outreach. By the time Ben turned 18, he knew he had to get out— so that’s exactly what he did. But it wasn’t easy! In fact, it was probably the hardest part of all. And now, for the first time ever, Ben tells Matt everything — the whole story — and it is ABSOLUTELY INSANE. Matt, for his part, is blown away, not just by Gospel Outreach’s wicked (and plain old weird!) ways, but also by Ben’s rare ability to tell his story with such clear-eyed perspective, and in incredible detail. Call us crazy but something tells us the powers that be over at Gospel Outreach won’t be very happy with Ben for airing out their business like this! So let us know in the comments if you would like to see Ben in a follow-up episode, to discuss the fallout that is sure to come— as well as any other dark and dirty details he may have left out the first time around! Welcome to \u0027The Private Record\u0027, where ordinary people tell their most extraordinary stories. New episodes every Wednesday! If you liked this episode, please hit that \u0027like\u0027 button and subscribe for all new episodes, clips, announcements and more! And if YOU have a crazy story of your own and want to be on the show, go to theprivaterecord.com to submit yourself as a potential guest! We look forward to hearing from you! Follow us @ThePrivateRecord on all socials! And find Matt on IG @mattdelia for additional content related to the show and more! Submit your story at https://www.theprivaterecord.com Send us an email @ theprivaterecord@gmail.com Follow for more on socials @theprivaterecord tiktok - https://www.tiktok.com/theprivaterecord instagram - https://www.instagram.com/theprivaterecord",
      "release": "2024-02-28T08:01:00Z",
      "duration": "01:22:57.4080000",
      "explicit": true,
      "spotifyId": "3DCufB8n7acKmPYwqmKftN",
      "appleId": 1000647359501,
      "youTubeId": "bVoZuOvvNaM",
      "subjects": [
        "Gospel Outreach"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3DCufB8n7acKmPYwqmKftN",
        "apple": "https://podcasts.apple.com/podcast/when-you-are-born-into-an-unhinged-modern-day-cult/id1726136077?i=1000647359501",
        "youtube": "https://www.youtube.com/watch?v=bVoZuOvvNaM"
      }
    }
  ]
}