{
  "_ts": 0,
  "id": "08801ad0-39a8-40d1-a47f-42a18187dbf0",
  "name": "The Conscious Resistance",
  "spotifyId": "5Yfo7NsU6rD0oVubhmdKUh",
  "appleId": 1802486658,
  "youTubeChannelId": "UCb6idwGLVZlT4rCks7gz6KA",
  "episodes": [
    {
      "id": "3232cb6c-a19a-4b01-8bf3-193436a6130e",
      "title": "E93 Exposing Opus Dei\u0027s Web of Influence, Corruption and Trafficking",
      "description": "Derrick Broze talks with Gareth Gore, author of Opus: The Cult of Dark Money, Human Trafficking, and Right-Wing Conspiracy inside the Catholic Church. Mr. Gore breaks down the history of abuse within the little known Catholic organization, Opus Dei. He explains the role Opus Dei plays on American politics, and the connections between the group and US Vice President JD Vance and Peter Thiel. Don\u0027t miss this informative interview! Show Notes: https://theconsciousresistance.com/exposing-opus-dei The Conscious Resistance Network is an independent media organization focused on empowering individuals through education, philosophy, health, and community organizing. We work to create a world where corporate and state power does not rule over the lives of free human beings. The Conscious Resistance Network can be found here: https://www.theconsciousresistance.com Enjoy our work? Sign up for monthly support: https://www.buymeacoffee.com/derrickbroze https://www.derrickbroze.substack.com Support our work by purchasing a privacy phone from Above Phone by visiting https://abovephone.com/?above=tcrn Use Code DBROZE50 Get Your Organic Mushroom Extracts from Cultivated-Mind: https://cultivated-mind.com/cm/Broze/ Don\u0027t forget to use code \u0022Broze\u0022 at checkout to get a 10% discount!\u0026#xfeff;\u0026#xfeff; Follow TCRN on social media and invest in our efforts to advance truth, healing, community building, and empowering the people to wake up and build a better world: Odysee - https://odysee.com/@theconsciousresistance:7 Telegram - https://t.me/theconsciousresistance YouTube - https://www.YouTube.com/@consciousresistance.com Twitter - https://www.Twitter.com/Dbrozelivefree Find out more at https://the-conscious-resistance.pinecast.co This podcast is powered by Pinecast .",
      "release": "2025-07-04T23:19:55Z",
      "duration": "00:50:13.2000000",
      "explicit": false,
      "spotifyId": "6EqwFyOtfw5TOskLNT5XrA",
      "appleId": 1000715772406,
      "youTubeId": "BcLjqu5-U2c",
      "subjects": [
        "Opus Dei",
        "Catholicism",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6EqwFyOtfw5TOskLNT5XrA",
        "apple": "https://podcasts.apple.com/podcast/exposing-opus-deis-web-of-influence-corruption/id1802486658?i=1000715772406",
        "youtube": "https://www.youtube.com/watch?v=BcLjqu5-U2c"
      }
    }
  ]
}