{
  "id": "690bf1c8-29bb-41ac-8992-e16e97cfa213",
  "name": "The Late Show with Stephen Colbert",
  "youTubeChannelId": "UCMtFAi84ehTSYSE9XoHefig",
  "episodes": [
    {
      "id": "5ad61e6a-8352-4501-84fd-ff89e81157d8",
      "title": "\u0022I Was Fearful We Were Going To Lose Our Lives\u0022 - Rep. Speier On Surviving The Insurrection",
      "description": "Congresswoman Jackie Speier describes her experience in the U.S. Capitol during the domestic terror attack and draws a parallel between cult leader Jim Jones and the previous president. #Colbert #ALateShow #RepSpeier\n\nSubscribe To \u0022The Late Show\u0022 Channel HERE: http://bit.ly/ColbertYouTube\nFor more content from \u0022The Late Show with Stephen Colbert\u0022, click HERE: http://bit.ly/1AKISnR\nWatch full episodes of \u0022The Late Show\u0022 HERE: http://bit.ly/1Puei40\nLike \u0022The Late Show\u0022 on Facebook HERE: http://on.fb.me/1df139Y\nFollow \u0022The Late Show\u0022 on Twitter HERE: http://bit.ly/1dMzZzG\nFollow \u0022The Late Show\u0022 on Google\u002B HERE: http://bit.ly/1JlGgzw\nFollow \u0022The Late Show\u0022 on Instagram HERE: http://bit.ly/29wfREj\nFollow \u0022The Late Show\u0022 on Tumblr HERE: http://bit.ly/29DVvtR\n\nWatch The Late Show with Stephen Colbert weeknights at 11:35 PM ET/10:35 PM CT. Only on CBS.\n\nGet the CBS app for iPhone \u0026 iPad! Click HERE: http://bit.ly/12rLxge\n\nGet new episodes of shows you love across devices the next day, stream live TV, and watch full seasons of CBS fan favorites anytime, anywhere with CBS All Access. Try it free! http://bit.ly/1OQA29B\n\n---\nThe Late Show with Stephen Colbert is the premier late night talk show on CBS, airing at 11:35pm EST, streaming online via CBS All Access, and delivered to the International Space Station on a USB drive taped to a weather balloon. Every night, viewers can expect: Comedy, humor, funny moments, witty interviews, celebrities, famous people, movie stars, bits, humorous celebrities doing bits, funny celebs, big group photos of every star from Hollywood, even the reclusive ones, plus also jokes.",
      "release": "2021-01-28T08:35:01Z",
      "duration": "00:04:09",
      "explicit": false,
      "youTubeId": "aDKLKYecj3A",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aDKLKYecj3A"
      }
    }
  ]
}