{
  "id": "dc033446-fbf5-453c-96de-90eb1011d142",
  "name": "The New Gurus",
  "spotifyId": "0eDu81O38RkngrKT9J6I1d",
  "appleId": 1659385785,
  "episodes": [
    {
      "id": "4aa4523a-2044-4bb4-9f74-8c882aa3332b",
      "title": "Bonus Episode: Gigachads and Sigma Wolves",
      "description": "After The New Gurus was released, there was one question Helen Lewis was asked far more than any other: why are so many gurus men? Stuck for an answer, she journeys into the world of the Manosphere - home to \u0027Gigachads\u0027 and \u0027Sigma Wolves\u0027.   Joining Helen on her journey is a reporter who once got (consensually) punched by the world\u0027s most Googled man, Andrew Tate, plus the former Love Island contestant and now successful podcaster, Chris Williamson. Helen also takes to the mat to find out why three of her original subjects - Sam Harris, Joe Rogan and Russell Brand - all studied the same hardcore martial art.   What do men want? The answer, it seems, is very long podcasts.  Producer: Tom Pooley Sound design and mix: Rob Speight Editor: Craig Templeton Smith Original music composed by Paper Tiger  A Tempo \u0026 Talker production for BBC Radio 4",
      "release": "2023-04-18T06:00:00Z",
      "duration": "00:29:50.2490000",
      "explicit": false,
      "spotifyId": "4Ew1DqPkf4emsGMdOkzHdj",
      "appleId": 1000609437754,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Ew1DqPkf4emsGMdOkzHdj",
        "apple": "https://podcasts.apple.com/podcast/bonus-episode-gigachads-and-sigma-wolves/id1659385785?i=1000609437754"
      }
    },
    {
      "id": "e4f033ed-9974-4364-bbe7-315ccedaf55a",
      "title": "5. Gazing into the Abyss",
      "description": "In 2018, a New York Times article anointed a group of taboo-breaking intellectual provocateurs as the \u0027Intellectual Dark Web\u0027. David Fuller was one of those who found this loose grouping of dissident gurus like Jordan Peterson, Joe Rogan and Sam Harris intoxicating – enough to leave the mainstream media and start his own YouTube channel.   But, four years on, he is left wondering - where did it all go wrong?  The New Gurus is a series about looking for enlightenment in the digital world.  Written and presented by Helen Lewis  Series Producers: Morgan Childs and Tom Pooley Story consultant: Geoff Bird  Original music composed by Paper Tiger Sound design and mix: Rob Speight Editor: Craig Templeton Smith  A Tempo \u0026 Talker production for BBC Radio 4 and BBC Sounds",
      "release": "2022-12-26T06:30:00Z",
      "duration": "00:28:43.5640000",
      "explicit": false,
      "spotifyId": "1D51saLWdhi6QX6bF3WwG2",
      "appleId": 1000591286007,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1D51saLWdhi6QX6bF3WwG2",
        "apple": "https://podcasts.apple.com/podcast/5-gazing-into-the-abyss/id1659385785?i=1000591286007"
      }
    },
    {
      "id": "176325a3-84f2-43ae-9a0a-9524122477a3",
      "title": "6. Daygamers and Daydreamers",
      "description": "At Oxford University, fellow students remember Tom Ralis as a quiet, nerdy biology student who played percussion in the college orchestra. But even then, he had one ambition - to become a guru.   He reinvented himself as Tom Torero, a pick-up artist who approached women in the street for dates - a practice known as “daygame”. His transformation led to tragedy.  The New Gurus is a series about looking for enlightenment in the digital world.  Written and presented by Helen Lewis  Series Producers: Morgan Childs and Tom Pooley Story consultant: Geoff Bird  Original music composed by Paper Tiger Sound design and mix: Rob Speight Editor: Craig Templeton Smith  A Tempo \u0026 Talker production for BBC Radio 4 and BBC Sounds",
      "release": "2022-12-26T06:35:00Z",
      "duration": "00:28:34.5330000",
      "explicit": false,
      "spotifyId": "3tYEVWwEKU8V1S1qGCbHTA",
      "appleId": 1000591285958,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3tYEVWwEKU8V1S1qGCbHTA",
        "apple": "https://podcasts.apple.com/podcast/6-daygamers-and-daydreamers/id1659385785?i=1000591285958"
      }
    },
    {
      "id": "50d09f15-ce46-4bd8-903e-887cfe3b3a26",
      "title": "7. Bitcoin FC",
      "description": "When Peter McCormack made a fortune investing in Bitcoin, he knew exactly how to spend it - buying his local football team. Helen Lewis travels to the ground of Real Bedford FC, where you can buy a half-time bacon butty in Bitcoin, to hear whether McCormack’s faith has been shaken by the \u0022crypto winter\u0022.   How are McCormack and other crypto gurus like Layah Heilpern keeping the faith as the price of Bitcoin tumbles?  The New Gurus is a series about looking for enlightenment in the digital world.  Written and presented by Helen Lewis  Series Producers: Morgan Childs and Tom Pooley Story consultant: Geoff Bird  Original music composed by Paper Tiger Sound design and mix: Rob Speight Editor: Craig Templeton Smith  A Tempo \u0026 Talker production for BBC Radio 4 and BBC Sounds",
      "release": "2022-12-26T06:40:00Z",
      "duration": "00:28:32.1950000",
      "explicit": false,
      "spotifyId": "31pWfx6JHNOVxwZsDKuJy4",
      "appleId": 1000591286008,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/31pWfx6JHNOVxwZsDKuJy4",
        "apple": "https://podcasts.apple.com/podcast/7-bitcoin-fc/id1659385785?i=1000591286008"
      }
    },
    {
      "id": "20ef2abc-a368-4631-8103-f16906a5a880",
      "title": "8. Prophets of Doom",
      "description": "Jessica Lanyadoo thinks civil war is coming — she has seen it in the stars. But it isn’t just astrologers who think we’re living through an age of upheaval. Peter Turchin, a Soviet-born professor who studies historical cycles, has already seen one political system collapse in his lifetime. He calls this decade  the Turbulent Twenties.   Could our collective anxiety explain the rise of the new gurus?  The New Gurus is a series about looking for enlightenment in the digital world.  Written and presented by Helen Lewis  Series Producers: Morgan Childs and Tom Pooley Story consultant: Geoff Bird  Original music composed by Paper Tiger Sound design and mix: Rob Speight Editor: Craig Templeton Smith  A Tempo \u0026 Talker production for BBC Radio 4 and BBC Sounds",
      "release": "2022-12-26T06:45:00Z",
      "duration": "00:29:16.3160000",
      "explicit": false,
      "spotifyId": "0DBkJc2uIyNNsIXSFejN5f",
      "appleId": 1000591286268,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0DBkJc2uIyNNsIXSFejN5f",
        "apple": "https://podcasts.apple.com/podcast/8-prophets-of-doom/id1659385785?i=1000591286268"
      }
    },
    {
      "id": "2bc0fb00-3093-4604-ac19-8c33f4f64295",
      "title": "1. The Birth of the New Guru",
      "description": "In 2011, some mourners at Steve Jobs’ memorial service were confused by his final gift to them – a book called Autobiography of A Yogi. Others understood his message perfectly - the Apple founder had spent his entire life searching for his own guru. Instead, by creating the iPhone, he became one. But did Jobs’ personal quest for enlightenment also help create the modern guru?  The New Gurus is a series about looking for enlightenment in the digital world.  Written and presented by Helen Lewis  Series Producers: Morgan Childs and Tom Pooley Story consultant: Geoff Bird  Original music composed by Paper Tiger Sound design and mix: Rob Speight Editor: Craig Templeton Smith  A Tempo \u0026 Talker production for BBC Radio 4 and BBC Sounds",
      "release": "2022-12-19T06:30:00Z",
      "duration": "00:28:27.1080000",
      "explicit": false,
      "spotifyId": "67aBWlj5UweqLfHw2Kt5D8",
      "appleId": 1000590588037,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/67aBWlj5UweqLfHw2Kt5D8",
        "apple": "https://podcasts.apple.com/podcast/1-the-birth-of-the-new-guru/id1659385785?i=1000590588037"
      }
    },
    {
      "id": "5fea051c-4e59-4d38-a91c-fc4c1af3f798",
      "title": "2. Taking the Urine",
      "description": "Will Blunderfield grew up, he says, an unhappy, unhealthy kid. Now he feels great — as a “wild naked man” who drinks his own urine.   Across the world, wellness is a multi-billion pound industry, even though some of its practices are unproven, extreme or even harmful. So why are so many people unimpressed with what 21st century medicine can offer them, and turning to internet gurus instead?  The New Gurus is a series about looking for enlightenment in the digital world.  Written and presented by Helen Lewis  Series Producers: Morgan Childs and Tom Pooley Story consultant: Geoff Bird  Original music composed by Paper Tiger Sound design and mix: Rob Speight Editor: Craig Templeton Smith  A Tempo \u0026 Talker production for BBC Radio 4 and BBC Sounds",
      "release": "2022-12-19T06:35:00Z",
      "duration": "00:28:32.3670000",
      "explicit": false,
      "spotifyId": "0ZiXQYrQsHYZbHha6pEOTK",
      "appleId": 1000590587958,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ZiXQYrQsHYZbHha6pEOTK",
        "apple": "https://podcasts.apple.com/podcast/2-taking-the-urine/id1659385785?i=1000590587958"
      }
    },
    {
      "id": "822ac85e-7e79-4aed-82e3-5198c3a132c5",
      "title": "3. Fitter, Happier, More Productive",
      "description": "As an author, broadcaster and journalist, Helen Lewis is drowning in deadlines. Join her race against the clock to see if productivity gurus can help her optimise her workflow, change her habits, and consume entire books in 15 minutes.   That is, if she can stop checking her phone long enough to pay attention.  The New Gurus is a series about looking for enlightenment in the digital world.  Written and presented by Helen Lewis  Series Producers: Morgan Childs and Tom Pooley Story consultant: Geoff Bird  Original music composed by Paper Tiger Sound design and mix: Rob Speight Editor: Craig Templeton Smith  A Tempo \u0026 Talker production for BBC Radio 4 and BBC Sounds",
      "release": "2022-12-19T06:40:00Z",
      "duration": "00:29:03.2950000",
      "explicit": false,
      "spotifyId": "3DM8pcijliyCdznpzwuG9J",
      "appleId": 1000590588998,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3DM8pcijliyCdznpzwuG9J",
        "apple": "https://podcasts.apple.com/podcast/3-fitter-happier-more-productive/id1659385785?i=1000590588998"
      }
    },
    {
      "id": "6ef9c075-04e9-4f52-9894-0d80df3df664",
      "title": "4. White Women\u0027s Tears",
      "description": "The rise of the Black Lives Matter movement brought renewed interest in corporate diversity gurus. But Regina Jackson and Saira Rao were ahead of the curve, pursuing their own unique anti-racist education programme.   Tired of talking to individual white women about their racism, they decided to invite a group of them for dinner, and confront them with their bias and bigotry. There was one rule - no crying.  The New Gurus is a series about looking for enlightenment in the digital world.  Written and presented by Helen Lewis  Series Producers: Morgan Childs and Tom Pooley Story consultant: Geoff Bird  Original music composed by Paper Tiger Sound design and mix: Rob Speight Editor: Craig Templeton Smith  A Tempo \u0026 Talker production for BBC Radio 4 and BBC Sounds",
      "release": "2022-12-19T06:45:00Z",
      "duration": "00:28:46.0630000",
      "explicit": false,
      "spotifyId": "586NRDQ7WzCHtWRpZqM6n4",
      "appleId": 1000590588980,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/586NRDQ7WzCHtWRpZqM6n4",
        "apple": "https://podcasts.apple.com/podcast/4-white-womens-tears/id1659385785?i=1000590588980"
      }
    },
    {
      "id": "42ecf777-efb6-4306-81e1-229a2cdd3c13",
      "title": "Welcome to The New Gurus",
      "description": "Everywhere you look on the internet, people are giving — and receiving — advice. Advice that promises to transform our lives. How to eat. How to think. How to get rich. How to manage our time.   Across 8 episodes, Helen Lewis travels through the strange, powerful and sometimes hidden digital spaces created by these new gurus. Where did they come from? How much power do these charismatic individuals wield? And why are so many of us turning away from the mainstream — mainstream medicine, mainstream politics and the mainstream media - and embracing the power of charismatic individuals instead?   Along the way, she considers the dubious benefits of ‘butthole sunning’, seeks help from some productivity gurus, meets a crypto millionaire who bought a football team, and wonders if the architecture of the internet will always drive us to extremes.   This is The New Gurus, a series about looking for enlightenment in the digital world.",
      "release": "2022-12-12T09:53:00Z",
      "duration": "00:03:36.0100000",
      "explicit": false,
      "spotifyId": "4oxZ4I0F1K3xwhyw1FlJfV",
      "appleId": 1000589851391,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4oxZ4I0F1K3xwhyw1FlJfV",
        "apple": "https://podcasts.apple.com/podcast/welcome-to-the-new-gurus/id1659385785?i=1000589851391"
      }
    }
  ]
}