{
  "_ts": 0,
  "id": "c43447b5-ffb4-47d9-a778-f1247e1d1da8",
  "name": "The Epstein Chronicles",
  "spotifyId": "6gQDvlvEa89IH90jHfuIRM",
  "appleId": 1575753383,
  "episodes": [
    {
      "id": "ff87f4b5-f7ad-49b0-a801-dc99c09182cb",
      "title": "A Look Back:  The CentrePoint Community And The Abuse That Occurred Within It",
      "description": "The Centrepoint Community was a controversial commune in New Zealand that operated from 1977 to 2000. It was founded by Bert Potter and his wife, Mary, and was based on principles of communal living, personal growth, and spiritual exploration. However, over the years, the community became mired in controversy due to allegations of sexual abuse, drug use, and other forms of misconduct.In 1991, Bert Potter was convicted of indecent assault and sentenced to two and a half years in prison for sexually abusing children within the community. After his release, he continued to be associated with the community, which eventually led to its downfall.In 2000, the Centrepoint Community was raided by police, and a number of people associated with the community were arrested and charged with various offenses, including sexual abuse, drug offenses, and firearms offenses. The community was shut down, and many of its former members have spoken out about the abuse and trauma they experienced while living there.The Centrepoint Community scandal remains a dark chapter in New Zealand\u0027s history, and it has had a profound impact on those who were affected by it. In this episode, we hear from one of the women who was abused while living in the commune as a child and how that abuse was pervasive. (commercial at 8:27) to contact me: bobbycapucci@protonmail.com source: Inside sickening \u0027orgasm cult\u0027 where kids as young as 10 were forced into vile sex games and fed LSD by warped leader | The US Sun (the-sun.com) Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-03-17T00:00:02Z",
      "duration": "00:13:56.7140000",
      "explicit": true,
      "spotifyId": "1gqGL3uJSrdIyZajtqPoBy",
      "appleId": 1000649440961,
      "subjects": [
        "Centrepoint"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gqGL3uJSrdIyZajtqPoBy",
        "apple": "https://podcasts.apple.com/podcast/a-look-back-the-centrepoint-community-and/id1575753383?i=1000649440961"
      }
    }
  ]
}