{
  "id": "f353a40d-7d23-4709-80de-74979cab18ea",
  "name": "The God Cast with Fr Alex Frost and Guests.",
  "spotifyId": "0fpcIIdzyAfr22sW5cuSNC",
  "appleId": 1537957799,
  "youTubeChannelId": "UCrzqIRWTbAlSWiCQEzAmJYg",
  "episodes": [
    {
      "id": "09e8b464-4a54-478a-9893-e4de0680142f",
      "title": "Bleeding For Jesus: John Smyth and the cult of the Iwerne Camps - Andrew Graystone - The God Cast",
      "description": "Bleeding for Jesus by Andrew Graystone Fully revised and updated Published 30 November 2025 Darton, Longman and Todd https://tinyurl.com/Bleeding4Jesus Images and author interviews: andrew.graystone1@btinternet.com I can’t recommend this book highly enough. It’s painful, but really important to read. An incredibly forensic work where no stone is left unturned. Jeremy Vine, BBC Radio 2 Andrew has exposed an abuse scandal of such horrifying scale that it has shaken the Church of England to its very foundations. His painstaking research and the trust accorded to him by victims and survivors means there is no greater authority on what went wrong at the heart of the Christian establishment, and the reckoning that now needs to follow. A must-read for anyone with a conscience and a desire for justice. Cathy Newman, Channel 4 News By day the dashing barrister and moral crusader John Smyth battled for Christian values at the Old Bailey. In the evenings he retreated to his home in Winchester, where he groomed young men from the highest echelons of British society, and flogged them for his own sexual pleasure until they bled. Smyth met many of his victims through the elite Christian cult of Iwerne camps. When his grotesque practices became known to leaders in the Church, he was spirited out of the UK to Zimbabwe, where for decades he continued to abuse much younger children. So began a conspiracy of cover up that lasted for thirty years. Then in 2017 the revelations about John Smyth and the Iwerne camps network pitched the Church of England into chaos. The wealthiest and most powerful grouping in the Church of England was at the heart of its biggest abuse crisis. Eventually, in an unprecedented step, Archbishop Justin Welby, who had known John Smyth for decades, was forced to resign over the affair. In this revised and expanded edition of Bleeding for Jesus, Andrew Graystone tells the story of how he and others brought the story of John Smyth into the light, and the toxic legacy of the Church of England\u0027s failure to face the truth. He reveals: • The wealthy Christians who sustained Smyth\u0027s abuse for decades. • The powerful men who led the evangelical movement, whilst hiding their own abuse. • The chaotic Church of England review that was held up for almost five years. • The police failures that allowed Smyth to go on abusing children until his death. • The struggle for justice and healing for victims in a Church that didn\u0027t want to know. • How the scandal led to the unprecedented fall of the Archbishop of Canterbury. Andrew Graystone is a campaigning journalist who broke the story of John Smyth\u0027s abuse and cover up. He continues to advocate for victims of abuse in the Church of England. The publication coincides with the broadcast by Channel 4 of a documentary series on the events in the book by BAFTA-winning director Benedict Sanderson for Passion Pictures.",
      "release": "2025-11-03T11:02:25Z",
      "duration": "00:39:03.7220000",
      "explicit": false,
      "spotifyId": "2azpyzsdG47iET5rhtaHn6",
      "appleId": 1000735025349,
      "youTubeId": "a09japf_0yE",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2azpyzsdG47iET5rhtaHn6",
        "apple": "https://podcasts.apple.com/podcast/bleeding-for-jesus-john-smyth-and-the-cult-of/id1537957799?i=1000735025349",
        "youtube": "https://www.youtube.com/watch?v=a09japf_0yE"
      }
    }
  ]
}