{
  "_ts": 0,
  "id": "6569f131-cfef-433c-8871-8fdcc1493170",
  "name": "The Suffering Podcast",
  "spotifyId": "6FzHF0l4VYXkxKkwhCuN0M",
  "appleId": 1546018463,
  "youTubeChannelId": "UCOGDxHh-YMFhKQ17L0_8PWA",
  "episodes": [
    {
      "id": "00be20c0-c512-4fb1-908c-e58aa6304042",
      "title": "Episode 198: The Suffering of Cults with Chasya",
      "description": "Send us a text Chasya was born the 4th out of 8 children. It would have been 13 children had her mother not have 5 miscarriages that spared an additional 5 innocent children being born to a cult-like life. Growing up Chasya right away didn’t fit in. There are no exceptions when born into the ultra religious sect. She was expected to follow her traditions, and the 613 commandments that come with the religion she was told she was so lucky and privileged to be a part of. Chasya didn’t buy into all the restrictions and no you can’t do that to 98% of the things that Chasya desired. Chasya wanted so badly to be an American and do what Americans do. Chasya wanted to be seen as a human being not another bar code stamped on her forehead saying she was something she didn’t ask for nor did she desire. Her youth was unbearable - she already started to live a double life -seeing how much beatings I endured for reasons that would blow a normal persons mind-she- secretly bringing a change of clothing into her friends car and began to dabble in escaping any way that she could. Soon she wouldn’t have to escape because it became clear she wasn’t going to be accepted anymore in her family’s circle anyways - and she was to be sent away at 14. After school years were over Chasya returned back to the cult but she already tasted freedom \u0026 tasted escapism and there was no going back. She barely left her bedroom. Chasya is battling in court pro se- and is in desperate need of help LINK: https://www.gofundme.com/f/desperately-looking-for-home Chasya needs the public’s help- we are alone ex-communicated from our family and friends. We are BEGGING - for help and mercy from the public so Chasya can have better living conditions suited for her daughter and herself. Find Chasya Instagram YouTube Find The Suffering Podcast The Suffering Podcast Instagram Kevin Donaldson Instagram Mike Failace Instagram Apple Podcast Spotify YouTube The Suffering Podcast Family Sherri Allsup Toyota of Hackensack PoPl Discount code TSP20 Cubita Cafe Support the show The Suffering Podcast Instagram Kevin Donaldson Instagram TikTok YouTube",
      "release": "2024-09-29T08:00:00Z",
      "duration": "01:19:55.9240000",
      "explicit": true,
      "spotifyId": "031RSF9lT9gJm3rutsaUM3",
      "appleId": 1000671158934,
      "youTubeId": "dpVJxvSwNV4",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/031RSF9lT9gJm3rutsaUM3",
        "apple": "https://podcasts.apple.com/podcast/episode-198-the-suffering-of-cults-with-chasya/id1546018463?i=1000671158934",
        "youtube": "https://www.youtube.com/watch?v=dpVJxvSwNV4"
      }
    }
  ]
}