{
  "id": "dd60613f-4aa7-45b9-9b8f-b711fb00fe0c",
  "name": "The Red Rabbit Hole",
  "spotifyId": "5qGYZijDYw7LaIdubysgRn",
  "appleId": 1748405643,
  "youTubeChannelId": "UCyq1BcBwsgewElTiK7PCj6g",
  "episodes": [
    {
      "id": "55b4c81a-7afd-409c-8ad2-344056673ea7",
      "title": "Episode 37 -  Weird Warrens - Jesus Army and cults",
      "description": "Here we go with another cult episode! It can’t be helped, it’s Lisa’s favourite subject. If she ever got onto to Jeopardy, it would be her expert subject! But, as we are a Northants based podcast, this on is close to home. The Jesus Army. As always, joining Lisa, is best-selling thriller author N V Peacock, otherwise known as Nicky. She’s not shy of a bit of cult knowledge either. After all, she worked is sales and marketing for 25 years! We even have a special guest, Matt who is an actor and director from the area, with some personal stories to tell about the now exposed cult. So, let’s get culty and dive head first down this Red Rabbit Hole, there’s tea and toast down here…. Don\u0027t get left behind! Follow The Red Rabbit! Patreon Facebook TikTok Instagram YouTube Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-09-27T07:00:00Z",
      "duration": "00:47:47.0170000",
      "explicit": false,
      "spotifyId": "7xi6HqxTbUCLiYMUo17JYu",
      "appleId": 1000728676935,
      "youTubeId": "WyDsltqdb0w",
      "subjects": [
        "Jesus Army"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7xi6HqxTbUCLiYMUo17JYu",
        "apple": "https://podcasts.apple.com/podcast/episode-37-weird-warrens-jesus-army-and-cults/id1748405643?i=1000728676935",
        "youtube": "https://www.youtube.com/watch?v=WyDsltqdb0w"
      }
    },
    {
      "id": "f1b4ed0c-3dbd-4165-97b0-0928760ea7c9",
      "title": "Episode 29 -  Netflix\u0027s Apple Cider Vinegar and Belle Gibson",
      "description": "It’s another lazy day down the red rabbit hole. Hosts thriller author N V Peacock, otherwise known as Nicky, and comedian and therapist Lisa Shepherd, are watching Netflix again. This time they grabbed some organic popcorn and fruity water and dug into the Apple Cider Vinegar series based on the Belle Gibson case in Australia. Touching on Munchausen Syndrome factitious disorder along with the perils of social media, there’s a lot to unpack with this app creating influencer. Let’s dive down and see what they have to say about it! Don\u0027t get left behind! Follow The Red Rabbit! Patreon Facebook TikTok Instagram YouTube Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-08-02T07:00:00Z",
      "duration": "00:43:25.5880000",
      "explicit": false,
      "spotifyId": "4izOMstkx1klyNCJOxT2jX",
      "appleId": 1000720303932,
      "youTubeId": "T1Ry_-3KIbE",
      "subjects": [
        "Belle Gibson"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4izOMstkx1klyNCJOxT2jX",
        "apple": "https://podcasts.apple.com/podcast/episode-29-netflixs-apple-cider-vinegar-and-belle-gibson/id1748405643?i=1000720303932",
        "youtube": "https://www.youtube.com/watch?v=T1Ry_-3KIbE"
      }
    },
    {
      "id": "d9c9d005-84f3-4fb8-92f9-faf72fbeed64",
      "title": "Episode 17-  Weird Warren - Olivia Isaac Henry\u0027s Sorrow Spring and cult crimes - part 2",
      "description": "Ah, it’s the 2nd part of Olivia Isaac Henry’s journey down the Red Rabbit Hole. Your hosts thriller author N V Peacock, otherwise known as Nicky, and comedian and therapist and, as we have discovered – cult expert, Lisa Shepherd talk about germs, and old world healing practices and of course descend once again into discussing various cults. Olivia does manage to escape The Cult of the Red Rabbit – but will you? Find Olivia here: Instagram oliviaisaachenryauthor Facebook olivia isaac-henry - author Books https://smarturl.it/SorrowSpring Don\u0027t get left behind! Follow The Red Rabbit! Patreon Facebook TikTok Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-05-10T07:00:00Z",
      "duration": "00:24:56.9780000",
      "explicit": false,
      "spotifyId": "70CnXqhCCaE9sldEdBXlRx",
      "appleId": 1000707836593,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/70CnXqhCCaE9sldEdBXlRx",
        "apple": "https://podcasts.apple.com/podcast/episode-17-weird-warren-olivia-isaac-henrys-sorrow/id1748405643?i=1000707836593"
      }
    },
    {
      "id": "11d87e8e-05f4-4c1c-b4c6-44db88200372",
      "title": "Episode 16-  Weird Warren - Olivia Isaac Henry\u0027s Folk Horror Sorrow Spring - part 1",
      "description": "It’s all gone a bit folk horror down the Red Rabbit Hole! Lovely author Olivia Isaac Henry joins your hosts Nicky and Lisa for a chat about the research for her book Sorrow Spring. They discuss healing wells, the dangers of drinking stagnant water and of course Lisa’s favourite subject, cults. Nicky even starts to plan her own cult of the Red Rabbit! Let’s burrow down and listen, but whatever you do, listeners, don’t drink the water! Find Olivia here: Instagram oliviaisaachenryauthor Facebook olivia isaac-henry - author Books https://smarturl.it/SorrowSpring Don\u0027t get left behind! Follow The Red Rabbit! Patreon Facebook TikTok Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-05-03T07:00:00Z",
      "duration": "00:30:31.0260000",
      "explicit": false,
      "spotifyId": "1tSSb1mH9C07XDH6yNmelg",
      "appleId": 1000705938368,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1tSSb1mH9C07XDH6yNmelg",
        "apple": "https://podcasts.apple.com/podcast/episode-16-weird-warren-olivia-isaac-henrys-folk-horror/id1748405643?i=1000705938368"
      }
    }
  ]
}