{
  "id": "580730a5-f444-4c77-a233-fff8daf4fb93",
  "name": "The AUXORO Podcast",
  "spotifyId": "2Xa3GbllxlSnTXarA2HsyK",
  "appleId": 1390263048,
  "youTubeChannelId": "UC_ZiUv9V72nv_IjeGgbbg6g",
  "episodes": [
    {
      "id": "74988055-58b1-4be3-8bab-474a1eaa2b3a",
      "title": "#286 - The Epstein Files \u0027Christmas Dump\u0027: Clinton, Trump, Prince Andrew, \u0026 The 10 Co-Conspirators",
      "description": "For years, the Epstein story sat half-exposed and half-buried—until the DOJ quietly released over 40,000 files. In this episode, investigative biographer Andrew Lownie breaks down what actually matters: missing evidence, sanitized redactions, and an investigation that admits to 10 co-conspirators yet charged only one person. From Clinton and Trump to Prince Andrew, the files suggest not incompetence, but protection. Guest bio: Andrew Lownie is an award-winning investigative biographer, journalist, and publisher, widely regarded as one of Britain’s most relentless royal historians. He is the author of Traitor King, The Mountbattens, and his latest book Entitled, which examines Prince Andrew and Sarah Ferguson. Known for deep archival research and award-winning writing, Lownie has built a reputation for exposing power, corruption, and institutional cover-ups at the highest levels of the British establishment. Subscribe to The Zach Show 2.0 to gain early access to all future episodes, exclusive AMAs, the ability to suggest guest questions, bonus content, and more: https://thezachshow.supercast.com/ ANDREW LOWNIE LINKS Entitled: https://bit.ly/3YpacFT Website: https://andrewlownie.me/ Substack: https://andrewlownie.substack.com/ All Books: https://andrewlownie.me/books THE ZACH SHOW LINKS: The Zach Show 2.0: https://thezachshow.supercast.com/ Spotify: https://spoti.fi/3zaS6sP YouTube: https://bit.ly/3lTpJdj Website: https://www.auxoro.com/ Instagram: https://www.instagram.com/auxoro TikTok: https://www.tiktok.com/@thezachshowpod If you’re not ready to subscribe to The Zach Show 2.0, rating the show on Spotify or Apple Podcasts is free and massively helpful. It boosts visibility, helps new listeners discover the show, and keeps this chaos alive. Thank you: Rate The Zach Show on Spotify: https://bit.ly/43ZLrAt Rate The Zach Show on Apple Podcasts: https://bit.ly/458nbha",
      "release": "2026-01-04T18:00:00Z",
      "duration": "01:02:02.3280000",
      "explicit": true,
      "spotifyId": "3zL9GzczeGTYdvBrglAHWd",
      "appleId": 1000743715300,
      "youTubeId": "3XM-88ID4EY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zL9GzczeGTYdvBrglAHWd",
        "apple": "https://podcasts.apple.com/podcast/286-the-epstein-files-christmas-dump-clinton-trump/id1390263048?i=1000743715300",
        "youtube": "https://www.youtube.com/watch?v=3XM-88ID4EY"
      }
    },
    {
      "id": "42bc90b9-9ed9-44bc-a08e-0a275b314e87",
      "title": "#285 - S*x, Power, Epstein, and the Crown: The Prince Andrew COVERUP | Andrew Lownie",
      "description": "Investigative biographer Andrew Lownie joins the show to unpack the rise and fall of Prince Andrew, from his troubled childhood and war-hero image to financial corruption, Epstein, and royal protection at the highest levels. We explore Andrew’s marriage to Sarah Ferguson, the Trade Envoy scandals, intelligence entanglements, the Virginia Giuffre case, the infamous Newsnight interview, Andrew\u0027s and Fergie\u0027s relationship to Epstein, and why Lownie believes the monarchy enabled Andrew for decades. Guest bio: Andrew Lownie is an award-winning investigative biographer, journalist, and publisher, widely regarded as one of Britain’s most relentless royal historians. He is the author of Traitor King, The Mountbattens, and his latest book Entitled, which examines Prince Andrew and Sarah Ferguson. Known for deep archival research and award-winning writing, Lownie has built a reputation for exposing power, corruption, and institutional cover-ups at the highest levels of the British establishment. Subscribe to The Zach Show 2.0 to gain early access to all future episodes, exclusive AMAs, the ability to suggest guest questions, bonus content, and more: https://thezachshow.supercast.com/ ANDREW LOWNIE LINKS Entitled: https://bit.ly/3YpacFT Website: https://andrewlownie.me/ Substack: https://andrewlownie.substack.com/ All Books: https://andrewlownie.me/books THE ZACH SHOW LINKS: The Zach Show 2.0: https://thezachshow.supercast.com/ Spotify: https://spoti.fi/3zaS6sP YouTube: https://bit.ly/3lTpJdj Website: https://www.auxoro.com/ Instagram: https://www.instagram.com/auxoro TikTok: https://www.tiktok.com/@thezachshowpod If you’re not ready to subscribe to The Zach Show 2.0, rating the show on Spotify or Apple Podcasts is free and massively helpful. It boosts visibility, helps new listeners discover the show, and keeps this chaos alive. Thank you: Rate The Zach Show on Spotify: https://bit.ly/43ZLrAt Rate The Zach Show on Apple Podcasts: https://bit.ly/458nbha",
      "release": "2025-12-14T18:00:00Z",
      "duration": "02:01:00.2640000",
      "explicit": true,
      "spotifyId": "4aYzbad0SAb7WNzfskXzu1",
      "appleId": 1000741241589,
      "youTubeId": "6qoYPpURfOw",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4aYzbad0SAb7WNzfskXzu1",
        "apple": "https://podcasts.apple.com/podcast/285-s-x-power-epstein-and-the-crown-the-prince/id1390263048?i=1000741241589",
        "youtube": "https://www.youtube.com/watch?v=6qoYPpURfOw"
      }
    },
    {
      "id": "8ec4f31f-b52d-46bb-9939-108edef6763b",
      "title": "#198 - Rick Alan Ross: EXPOSING DESTRUCTIVE CULTS, Tom Cruise And Scientology, Deprogramming Followers, Jim Jones, NXIVM, \u0026 Is Andrew Tate A Cult Leader?",
      "description": "On this episode of The AUXORO Podcast, Rick Alan Ross and Zach discuss how destructive cults control, manipulate, and sometimes kill their followers, how someone like Tom Cruise could be hooked into Scientology, some of the most effective methods he and other experts have used to reverse cult programming, the rise of Jim Jones and the Jonestown Massacre, coming face to face with Keith Raniere the founder of NXIVM, whether Andrew Tate qualifies as a cult leader, and more. Guest Bio:  Rick Alan Ross is a cult expert and the founder of The Cult Education Institute. He is an internationally known expert regarding destructive cults, controversial groups and movements and author of the book \u0022Cults Inside Out: How People Get In and Can Get Out.\u0022 Since 1982 he has been studying, researching and responding to the problems often posed by controversial authoritarian groups and movements. BONUS EPISODES \u0026 PREMIUM ACCESS: https://auxoro.supercast.com/ RICK ALAN ROSS LINKS:Cults Inside Out: How People Get In and Can Get Out: https://amzn.to/3WXoEluCult Education Institute: https://www.culteducation.com/Twitter: https://bit.ly/3HxF6mCTHE AUXORO PODCAST LINKS:Apple: https://apple.co/3B4fYju Spotify: https://spoti.fi/3zaS6sPOvercast: https://bit.ly/3rgw70DYoutube: https://bit.ly/3lTpJdjWebsite: https://www.auxoro.com/ AUXORO SOCIAL LINKS:Instagram: https://www.instagram.com/auxoroYouTube: https://bit.ly/3CLjEqFFacebook: https://www.facebook.com/auxoromagNewsletter: https://www.auxoro.com/thesourceYouTube: https://bit.ly/3CLjEqF If you enjoy the show, please consider leaving a short review on Apple Podcasts. It takes less than 60 seconds, helps us appear higher in searches so more people discover the show, and it boosts my ego;) Past Guests On The Auxoro Podcast Include: Aubrey de Grey, Andy Weir, Eben Britton, Eric Jorgenson, Isabelle Boemeke, Houston Arriaga, Jerzy Gregorek, Chris Cooper, Gryffin, Elsa Diaz, Dave Robinson, Meghan Daum, FINNEAS, Chloé Valdary, Coleman Hughes, Maziar Ghaderi, YONAS, Ryan Michler, Ryan Meyer, Gavin Chops, Bren Orton, Zuby, Jason Khalipa, Ed Latimore, Jess Glynne, Noah Kahan, Kid Super, Deryck Whibley, and many more.  ",
      "release": "2023-02-02T00:00:00",
      "duration": "02:43:20.9520000",
      "explicit": true,
      "spotifyId": "4orIbsG4AvdF6AUKll1FMr",
      "appleId": 1000597754651,
      "youTubeId": "V61YUBhvh3M",
      "subjects": [
        "Scientology",
        "NXIVM",
        "Cult-Expert",
        "Hustler\u0027s University",
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4orIbsG4AvdF6AUKll1FMr",
        "apple": "https://podcasts.apple.com/podcast/198-rick-alan-ross-exposing-destructive-cults-tom-cruise/id1390263048?i=1000597754651",
        "youtube": "https://www.youtube.com/watch?v=V61YUBhvh3M"
      }
    }
  ]
}