{
  "id": "93875341-5008-4041-9a8f-9d1117335930",
  "name": "The Deeper Pulse with Candice Schutter",
  "spotifyId": "0uN3cZweD2hyfoUxFvcDPF",
  "appleId": 1556669396,
  "episodes": [
    {
      "id": "23df9a52-5ee5-41fb-b049-8888c45923a7",
      "title": "#77 | Spiritual \u0026 Religious Abuse: Raising Awareness \u0026 Supporting Black Survivors | Nikki G",
      "description": "January is Spiritual Abuse Awareness Month, and this week Candice welcomes a very special guest. Nikki G is a Certified Trauma Recovery Coach, co-host of the Surviving The Black Church podcast, and a vocal advocate for spiritual and religious abuse survivors. Nikki shares briefly about her personal history growing up in a narcissistic family system, time spent in five different cults, and her personal path of healing. She speaks about the subtle yet sometimes critical difference between spiritual and religious trauma, then offers guidance around how best to seek support and healing. Nikki generously walks us through a brief history of The Black Church, speaking to how intergenerational trauma must be a consideration when supporting Black folks who are recovering from spiritual and religious abuse. The term ‘church hurt’ is discussed; specifically how in Black Communities, when applied too broadly, it leads to the glorification of suffering and implicitly encourages abuse survivors to stay-put and endure. Candice shares suffer-in-silence parallels in the wellness world, and the two discuss how even though the gaslighting shows up differently, it ultimately results in a similar outcome - spiritual bypassing and a disconnection from self. Nikki speaks to the many invisible wounds folks grapple with upon exiting a high-demand religion or spiritual community and then describes what post-cult ‘rehab’ might look like. She shares how coming home to her body has been so pivotal in her healing process; and Candice asks for Nikki’s input on the unique challenge of healing from trauma that occurs within the space of an embodiment practice. The episode wraps with a teaser into another upcoming convo with Nikki that will be recorded later this month, focusing on how religious ideologies have been systematically shaping American politics for decades. This is a rich conversation; be sure to listen to the end!Nikki G. is a Certified Trauma Recovery Coach  who helps survivors recover and thrive after Religious Trauma \u0026 Cult involvement. She is also survivor of multiple narcissistic relationships, religious trauma, and several cultic communities. Nikki is the CEO of Nikki G Speaks LLC, which provides survivors with individual coaching, online community, and psychoeducation related to religious trauma, narcissistic abuse, and cult involvement. Nikki is a co-host of the podcast “Surviving the Black Church” where she and her co-hosts delve into conversations regarding religious trauma in the Black Church. She is also the co-founder of The Black Religious Trauma Recovery Network and she sits on the board of directors for Tears of Eden, a non-profit organization that supports survivors who have experienced abuse in the evangelical community. Web: nikkigspeaks.com | IG: @nikki_g_speaksReferenced In This Episode:Surviving The Black Church PodcastThe Black Religious Trauma Recovery NetworkTears of EdenSupport the showThe stories and opinions shared in this episode are based on personal experience and are not intended to malign any individual, group, or organization.Join The Deeper Pulse at Patreon for weekly bonus episodes \u002B other exclusive bonus content. Follow The Deeper Pulse on IG @thedeeperpulse \u002B @candiceschutter for more regular updates. ",
      "release": "2024-01-31T07:00:00Z",
      "duration": "01:28:50.3490000",
      "explicit": true,
      "spotifyId": "6ukMOrTe093vJEtSGXVvaO",
      "appleId": 1000643624623,
      "subjects": [
        "Psychology",
        "Cult Recovery",
        "Self-Help",
        "Evangelicalism",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ukMOrTe093vJEtSGXVvaO",
        "apple": "https://podcasts.apple.com/podcast/77-spiritual-religious-abuse-raising-awareness-supporting/id1556669396?i=1000643624623"
      }
    }
  ]
}