{
  "id": "3e808435-0af5-4257-9790-99ffe6125123",
  "name": "The Development by David Podcast",
  "spotifyId": "6DV9tUfz5nGCmH0bfZUFrM",
  "appleId": 1542740010,
  "episodes": [
    {
      "id": "c01a6c07-c9ba-4c14-a2dc-7810c5c142cb",
      "title": "#111 Will Storr - The Dark Psychology of Status, Cults and Neo-Nazis",
      "description": "Will Storr is a Journalist and Award-Winning Author of The Status Game, Selfie, The Heretics and the Science of Story Telling. If you are low-status, you are more 4x more likely to die early. Status is proven to be more important than diet or exercise for health outcomes.. Status is not just a modern phenomenon; it\u0027s a fundamental part of the human experience, existing long before our current society. As writer Will Storr explains, the need for status and respect from others is not merely a luxury—it\u0027s an essential psychological and biological requirement for humans to thrive. He calls it the original currency. Throughout history, status hierarchies have existed in animal societies, serving as a means to organise social life and prevent constant conflict. From our tribal ancestors to modern civilization, the desire for status has deeply shaped human behavior and social structures. But despite its importance, the topic of status often makes people feel uneasy. While discussions about connection and belonging are more comfortable, status remains a somewhat taboo subject. It\u0027s this discomfort that has perhaps led to fewer books being written about this universal human drive. However, Storr\u0027s work aims to shed light on this fundamental aspect of the human condition, unraveling its complexities and unveiling its significance in our lives. Also, join us to hear about the psychology of cults, why architechts are the most illusive modern day cult, Will’s experience from going undercover following Neo-Nazi’s to understand the madness of groupthink and his experiences of David Irving the infamous holocaust denier. Will’s books: The Status Game: On Human Life and How to Play It https://amzn.to/41R6rsL Selfie: How the West Became Self-Obsessed https://amzn.to/41cJ2BL The Science of Storytelling: Why Stories Make Us Human, and How to Tell Them Better https://amzn.to/3ohtxKo Signup to my Patreon: ⁠https://www.patreon.com/developmentbydavid⁠ SPONSORS: Vybey (code DBYD for 15%) - https://vybey.co.uk/?shpxid=fd5d5aab-fd5f-48d9-bf37-b58aa4317f25West Coast Motors - https://www.wcmotors.co.uk/",
      "release": "2024-05-06T15:01:02Z",
      "duration": "01:18:57.6450000",
      "explicit": true,
      "spotifyId": "3xMDzyFxzX46UoxRNrj7D9",
      "appleId": 1000654691650,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3xMDzyFxzX46UoxRNrj7D9",
        "apple": "https://podcasts.apple.com/podcast/111-will-storr-the-dark-psychology-of-status-cults/id1542740010?i=1000654691650"
      }
    }
  ]
}