{
  "id": "5e209eaa-49ab-4f85-8fff-6170488169e6",
  "name": "The Getting Real with Hilary Show",
  "spotifyId": "0WKao0gYI3fpwLPNLiPNKi",
  "appleId": 1676839425,
  "youTubeChannelId": "UC_33JtLoZM3WkQx85OgeP3A",
  "episodes": [
    {
      "id": "4e6d1800-4c92-4004-920f-a1b8476baae8",
      "title": "S2 EP64 | 25 Years of Mental, Spiritual, Emotional and Physical Abuse - Escaping the Cult with Martha Kartaoui",
      "description": "Martha Kartaoui was chosen by “Cultman” at age 8. He was the intercessor to God.  No one questioned his authority. They deserved the mental, spiritual, emotional and physical abuse. It cleansed them of their sins.\n\nIt\u0027s the life she knew. She only escaped so that she could be with her sister in the \u0022outside world\u0022 through her pregnancy. She didn\u0027t even realize that \u0022Cultman\u0022 was an evil narcissistic sociopath.\n\nMartha has gone through her own healing of all the abuse that she suffered and now is clear about her purpose. She is bringing awareness and healing to others who have left highly controlled relationships and organizations.\n\nShe wants to provide community, trauma healing, a way to release shame, fear and guilt, and help people feel less alone as they transition to life outside of the cult.\n\nMartha\u0027s book, \u0022Glory Going All In\u0022 is available on her website and you can reach out to her to find out about her speaking, coaching, and retreats.\n\nThank you, Martha, for your courage, your generosity, and your commitment for the world.\n\nBio:\n\nMartha Glory Kartaoui is a resilient and courageous warrior who has transformed her life from being a Cult Survivor to becoming an influential voice and leader in the wellness industry. As the owner of PIC Wellness, LLC, she is dedicated to helping others achieve their best overall holistic health Mind, Body and Spirit. Martha is also an Amazon Best Selling International Author, a dynamic speaker, a life visionary, and a skilled healing workshop facilitator. Her unique blend of professional training, personal experience, and spiritual wisdom enables her to walk alongside survivors and support profound warrior transformations.\n\nWebsite:\n\ncult-x.org\n\nfacebook.com/martha.kartaoui\n\ninstagram.com/marthakartaoui\n\nlinkedin.com/in/martha-kartaoui-44318893\n\n#hilaryburns #MarthaKartaoui #gettingrealwithhilary #realtalk #getreal #getfree #inspiration #thegettingrealwithhilaryshow #cultsurvivors #cult #cultleader #escape #spiritualjourney #sexualabuse #mentalabuse #emotionalabuse #physicalabuse #starvation #rape #torture #mindcontrol #trauma #traumahealing #shame #fear #guilt #abuse #narcissist #evil #sociopath \n\nHilary\u0027s Website: https://www.gettingrealwithhilary.com/\n\nYoutube: https://www.youtube.com/@GettingRealWithHilary \n\nSpotify: https://shorturl.at/pQY68 \n\niTunes: https://shorturl.at/qyTZ3 \n\nBBS Radio: https://bbsradio.com/thegettingrealwithhilaryshow\n\nE360tv: bit.ly/TGRWHS",
      "release": "2024-12-05T22:00:00Z",
      "duration": "00:56:13",
      "explicit": false,
      "spotifyId": "4UeFBLsXIMEnlCKGuGXhKK",
      "appleId": 1000679403962,
      "youTubeId": "ZwlcqFKLVGk",
      "subjects": [
        "Samanta Roy Institute of Science and Technology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4UeFBLsXIMEnlCKGuGXhKK",
        "apple": "https://podcasts.apple.com/podcast/s2-ep64-25-years-of-mental-spiritual-emotional/id1676839425?i=1000679403962",
        "youtube": "https://www.youtube.com/watch?v=ZwlcqFKLVGk"
      }
    }
  ]
}