{
  "_ts": 0,
  "id": "c43447b5-ffb4-47d9-a778-f1247e1d1da8",
  "name": "The Epstein Chronicles",
  "spotifyId": "6gQDvlvEa89IH90jHfuIRM",
  "appleId": 1575753383,
  "episodes": [
    {
      "id": "fb012bfc-80c8-4777-a66d-7e14f96a4ff2",
      "title": "The Chad Daybell Trial:  A Recap Of Jury Selection Day Number Two (4/3/24)",
      "description": "Chad Daybell is a former gravedigger, author, and member of the Church of Jesus Christ of Latter-day Saints. He gained notoriety in connection with the disappearance and deaths of his former wife, Tammy Daybell, and his new wife\u0027s children, Joshua \u0022JJ\u0022 Vallow and Tylee Ryan. Chad Daybell is a former gravedigger, author, and member of the Church of Jesus Christ of Latter-day Saints. He gained notoriety in connection with the disappearance and deaths of his former wife, Tammy Daybell, and his new wife\u0027s children, Joshua \u0022JJ\u0022 Vallow and Tylee Ryan.Daybell\u0027s background includes his involvement in the \u0022prepper\u0022 community, which focuses on preparing for potential disasters, as well as his self-published books that touch on religious and apocalyptic themes. The case gained national attention when Tammy Daybell died suddenly in October 2019, initially attributed to natural causes. However, suspicions arose when Chad quickly remarried Lori Vallow, whose children were reported missing later that year. Authorities began investigating the disappearances of JJ and Tylee, leading to the discovery of their bodies buried on Chad Daybell\u0027s property in Idaho in June 2020. Autopsies revealed that both children had been murdered, and their deaths were ruled as homicides. Chad Daybell was subsequently arrested and charged with several counts, including two felony counts of destruction, alteration, or concealment of evidence. He has also been charged with conspiracy to commit destruction, alteration, or concealment of evidence. In this episode we get a look at what went down during the second day of jury selection, plus a look at how Daybell\u0027s trial will differ from Vallow\u0027s. (commercial at 10:03) to contact me: bobbycapucci@protonmail.com source: Chad Daybell trial: Lori Vallow husband seeks different outcome from ‘cult mom’ | Fox News source: Chad Daybell trial day 2 - jury selection | ktvb.com Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-04-03T15:00:02Z",
      "duration": "00:14:09.7020000",
      "explicit": true,
      "spotifyId": "5t61CA4jsUWGpsnllAhP84",
      "appleId": 1000651321958,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5t61CA4jsUWGpsnllAhP84",
        "apple": "https://podcasts.apple.com/podcast/the-chad-daybell-trial-a-recap-of-jury/id1575753383?i=1000651321958"
      }
    },
    {
      "id": "ff87f4b5-f7ad-49b0-a801-dc99c09182cb",
      "title": "A Look Back:  The CentrePoint Community And The Abuse That Occurred Within It",
      "description": "The Centrepoint Community was a controversial commune in New Zealand that operated from 1977 to 2000. It was founded by Bert Potter and his wife, Mary, and was based on principles of communal living, personal growth, and spiritual exploration. However, over the years, the community became mired in controversy due to allegations of sexual abuse, drug use, and other forms of misconduct.In 1991, Bert Potter was convicted of indecent assault and sentenced to two and a half years in prison for sexually abusing children within the community. After his release, he continued to be associated with the community, which eventually led to its downfall.In 2000, the Centrepoint Community was raided by police, and a number of people associated with the community were arrested and charged with various offenses, including sexual abuse, drug offenses, and firearms offenses. The community was shut down, and many of its former members have spoken out about the abuse and trauma they experienced while living there.The Centrepoint Community scandal remains a dark chapter in New Zealand\u0027s history, and it has had a profound impact on those who were affected by it. In this episode, we hear from one of the women who was abused while living in the commune as a child and how that abuse was pervasive. (commercial at 8:27) to contact me: bobbycapucci@protonmail.com source: Inside sickening \u0027orgasm cult\u0027 where kids as young as 10 were forced into vile sex games and fed LSD by warped leader | The US Sun (the-sun.com) Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-03-17T00:00:02Z",
      "duration": "00:13:56.7140000",
      "explicit": true,
      "spotifyId": "1gqGL3uJSrdIyZajtqPoBy",
      "appleId": 1000649440961,
      "subjects": [
        "Centrepoint"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gqGL3uJSrdIyZajtqPoBy",
        "apple": "https://podcasts.apple.com/podcast/a-look-back-the-centrepoint-community-and/id1575753383?i=1000649440961"
      }
    }
  ]
}