{
  "id": "5dd51ac1-0756-480a-bfbe-615b2f662923",
  "name": "The Kangaroo Leadership by MaxFab Consulting",
  "spotifyId": "2FrE5rhoz79BZmXKqMAeS5",
  "appleId": 1695110852,
  "youTubeChannelId": "UCBAJWbx1rniCpClOnZ9Mw9Q",
  "episodes": [
    {
      "id": "992bb132-07e4-4d2a-9add-9745aff52fa7",
      "title": "Episode #38: Dr. Robyn Odegaard: From Cult to Cartel to Coach and Sage Counselor",
      "description": "I had the absolute pleasure of speaking with Dr. Robyn Odegaard. Dr. Robyn\u0027s journey is nothing short of extraordinary. She grew up in a cult and faced incredible challenges, including being married off right out of high school to a man who was a drug dealer. Her story doesn’t stop there; she navigated a turbulent relationship with a narcissistic second husband, all while transforming her life experiences into a thriving coaching and consulting career. Dr. Robyn is a former competitive beach volleyball player turned business psychologist and professional confidante. With a graduate degree in business psychology focused on high performance and sport, she has spent over fifteen years bridging the gap between executive coaching, therapy, and friendship. Her clients range from founders and executives to surgeons, lawyers, pro athletes, and even celebrities. In addition to her coaching work, Dr. Robyn is an in-demand keynote speaker and podcast guest, captivating and inspiring diverse audiences with her sharp business acumen and no-nonsense approach. She tackles head trash, self-sabotage, and the psychological barriers that hold even the most successful individuals back. Today, she also shares her personal story of resilience, making this episode especially powerful for everyone, particularly our female listeners. Books Stop the Drama! The Ultimate Guide to Female Teams https://a.co/d/6Y3Opid The Ultimate Guide to Handling Every Disagreement Every Time https://a.co/d/5VDawro Website https://www.MentalMacGyver.com",
      "release": "2025-01-25T22:11:33Z",
      "duration": "00:37:58.7500000",
      "explicit": false,
      "spotifyId": "7rvYSPtEtLWefU5RR5HgxA",
      "appleId": 1000685454301,
      "youTubeId": "njh-0MQ8q1Q",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7rvYSPtEtLWefU5RR5HgxA",
        "apple": "https://podcasts.apple.com/podcast/episode-38-dr-robyn-odegaard-from-cult-to-cartel-to/id1695110852?i=1000685454301",
        "youtube": "https://www.youtube.com/watch?v=njh-0MQ8q1Q"
      }
    }
  ]
}