{
  "id": "238507d0-0d86-4993-a9b6-fababa859a24",
  "name": "The Documentary Channel",
  "episodes": [
    {
      "id": "d0ed3db0-9c68-41ab-b74d-72b9de894821",
      "title": "Cult Witness - How People Join and Leave Cults",
      "description": "At the age of 19 Samuel Stefan, consumed by crisis, was drawn into a cult. It would be 10 years before he was able to escape.Using a technique called ‘love-bombing’ cults prey on the vulnerable, recruiting new members with love and warmth. After a period of brain-washing, members are forbidden to leave, enslaved through psychological control, and in Samuel\u0027s case, even violence. He was finally able to escape in the dead of night, persued by other members and seek help.Cult Witness is an intelligent exploration of how cults attract and manipulate their followers, sharing the disturbing firsthand experiences of Cult Witness director Samuel Stefan and six others who have freed themselves from cults: Jill Mytton (The Exclusive Brethren), Jim Bergin and Judy Garvey (The Gentle Wind Project), Lea Saskia Laasner (The Janus Project), and Celeste Jones and Amoreena Winkler (The Children of God).Analytical insights into the cult experience are provided by leadership expert Betty Sue Flowers; Benjamin Zablocki, chair of the Department of Sociology at Rutgers University; UCLA Professor Emeritus Bertram Raven, an expert on interpersonal influence and social power relationships; psychotherapist Miguel Perlado, who specializes in cult-related problems; and Urs Eschmann, a specialist in legal issues involving cults.Cult Witness unravels the hidden world of cults; the hold they have on their victims, the reasons people form and fall prey to them and what takes place within..",
      "release": "2024-02-12T18:36:49",
      "duration": "00:56:09",
      "explicit": false,
      "subjects": [
        "Children Of God",
        "Cult-Expert",
        "Cult Psychology",
        "Gentle Wind Project",
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "internetArchive": "https://archive.org/details/youtube-ugDuE7g1nvA"
      }
    }
  ]
}