{
  "_ts": 0,
  "id": "06bd1517-cda6-4973-98b3-37560346d67c",
  "name": "The Empowered Millennials Podcast",
  "spotifyId": "38uiIx2fLyGiupnTq7vqw8",
  "appleId": 1673139345,
  "episodes": [
    {
      "id": "2b686f38-dfeb-4a43-8379-a213464b6e60",
      "title": "Is it a Cult? with Expert,  Daniella Mestyanek Young",
      "description": "Daniella Mestyanek Young who is a scholar of cults and extreme groups, and extremely bad leadership, and the author of the critically acclaimed memoir UNCULTURED. Daniella was raised in the religious sex cult, The Children of God. She later served as an intelligence officer for the US Army, making the rank of Captain, and became one of the first women in US Army history to conduct deliberate ground combat operations when she volunteered to serve on a Female Engagement Team, and received the Presidential Volunteer Service Award. Daniella lives with her husband and daughter in Maryland, and holds a master’s degree in industrial and organizational psychology from the Harvard Extension School. Daniella is an organizational development speaker with the Macmillan Speaker’s Bureau, and you can see her speak on her TEDx. Sponsors: Spiritual Readings and Psychic Guides: www.trykeen.com/empoweredmillennials Or use code: EMPOWEREDMILLENNIALS Book your breakthrough session HERE: https://www.theangelagentile.com/break-through-session Follow on socials: https://www.instagram.com/theempoweredmillennials/ https://tiktok.com/@theangelagentile Angela\u0027s Instagram: https://www.instagram.com/theangelagentile/",
      "release": "2024-04-06T08:00:00Z",
      "duration": "01:10:38.9680000",
      "explicit": true,
      "spotifyId": "63J8KnlnJZom5MMp6BCAnO",
      "appleId": 1000651608876,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/63J8KnlnJZom5MMp6BCAnO",
        "apple": "https://podcasts.apple.com/podcast/is-it-a-cult-with-expert-daniella-mestyanek-young/id1673139345?i=1000651608876"
      }
    }
  ]
}