{
  "id": "97ba6213-1e0b-416e-9ad2-0e5e6936ed3a",
  "name": "The Cult Next Door",
  "spotifyId": "4dojrCgB54VhDBRGZSEdbg",
  "appleId": 1699470395,
  "episodes": [
    {
      "id": "19819fec-bb89-45a6-ae4a-e621b548de24",
      "title": "Season 2: Coming Soon",
      "description": "Season 2 coming April 2024! - Season 1 is complete \u0026 now Ashleigh \u0026 Mattie will be prepping and recording for Season 2. Stay tuned for more updates \u0026 be sure to follow us on Instagram \u0026 Tiktok for videos from upcoming episodes!",
      "release": "2024-01-31T10:30:02Z",
      "duration": "00:01:57.5510000",
      "explicit": false,
      "spotifyId": "7pZAcmLOHqrbaJy724caP2",
      "appleId": 1000643646787,
      "subjects": [
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7pZAcmLOHqrbaJy724caP2",
        "apple": "https://podcasts.apple.com/podcast/season-2-coming-soon/id1699470395?i=1000643646787"
      }
    },
    {
      "id": "581eb944-e3f9-4e5e-ba4e-e5823ef66f58",
      "title": "Ep.22: \u0022Call Me Big Daddy\u0022",
      "description": "In the riveting conclusion of David Brown\u0027s narrative on \u0022The Cult Next Door Podcast,\u0022 hosts Mattie Lasiter and Ashleigh Teeter present the episode titled \u0022Call Me Big Daddy.\u0022 This installment explores David\u0027s tenure as a member and minister in Crusade Church, unraveling the façade of the charismatic leader, and exposing the control within the cult\u0027s family dynamics.Listeners are drawn into the final chapter of David\u0027s journey as he shares his experiences within Crusade Church, shedding light on the cracks that began to appear in the carefully constructed image of the pastor and leader. The hosts guide the conversation, delving into the challenges David faced as he grappled with the dissonance between the outward appearance of righteousness and the lack of substance within the cult.\u0022Call Me Big Daddy\u0022 provides a powerful exploration of the control mechanisms within the cult, as David reflects on the intricacies of family dynamics and the manipulation that kept members entangled in the web of authority",
      "release": "2024-01-24T10:30:01Z",
      "duration": "01:19:04.8000000",
      "explicit": false,
      "spotifyId": "2q0cMvF8kS8OSpD2a262f8",
      "appleId": 1000642765187,
      "subjects": [
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2q0cMvF8kS8OSpD2a262f8",
        "apple": "https://podcasts.apple.com/podcast/ep-22-call-me-big-daddy/id1699470395?i=1000642765187"
      }
    },
    {
      "id": "1a1e1d57-4633-42ed-aa31-3d985c6f25f3",
      "title": "Ep.20: \u0022The Lone Prophet\u0022",
      "description": "In a compelling continuation of David Brown\u0027s story, \u0022The Cult Next Door Podcast\u0022 presents \u0022The Lone Prophet.\u0022 We unravel the complexities of David\u0027s journey from Worldwide Church of God to a mainstream Christian church, only to be drawn back into Armstrongism and eventually becoming a member and minister in Crusade Church.Listeners are immersed in David\u0027s recounting of the conditioning that shaped his path, exploring the twists and turns that led him from one religious community to another.The episode concludes with David\u0027s recounting of an invitation to the Feast of Tabernacles, an event hosted by Crusade Church in Arkansas. This enigmatic glimpse sets the stage for the next chapter in David\u0027s story, leaving listeners eager to uncover the unfolding events in the next installment.\u0022The Lone Prophet\u0022 stands as a captivating exploration of the subtle forces that guide individuals into and within cults, offering a glimpse into the intricate web of beliefs and conditioning that shape their journeys.",
      "release": "2024-01-17T10:30:01Z",
      "duration": "00:47:59.1110000",
      "explicit": false,
      "spotifyId": "7jkRdOsjgQKYkrfPuAJszN",
      "appleId": 1000641955194,
      "subjects": [
        "The Crusade Church",
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jkRdOsjgQKYkrfPuAJszN",
        "apple": "https://podcasts.apple.com/podcast/ep-20-the-lone-prophet/id1699470395?i=1000641955194"
      }
    },
    {
      "id": "e38f361b-f4ad-4b24-b3e7-2083afe6dde1",
      "title": "Ep.20: \u0022Exploited, Manipulated \u0026 Poisoned\u0022",
      "description": "In a gripping and deeply introspective episode of \u0022The Cult Next Door Podcast,\u0022 hosts Mattie Lasiter and Ashleigh Teeter are joined by special guest David Brown, a former member of both Worldwide Church of God and Crusade Church. Titled \u0022Exploited, Manipulated \u0026 Poisoned,\u0022 this installment delves into David\u0027s harrowing journey, exploring the extreme narcissistic abuse he endured within his own family and the subsequent 12 years spent as a member and minister in the destructive Christian cult, Crusade Church.The episode begins with David bravely recounting his upbringing in Worldwide Church of God, offering listeners a glimpse into the traumatic environment that shaped his early years. David shares the intense narcissistic abuse he experienced within his own family, shedding light on the profound impact it had on his understanding of relationships and personal boundaries.Listeners are taken on a journey through David\u0027s vulnerability as he reflects on the factors that contributed to his blindness regarding narcissism, ultimately leading him to become a member and minister in Crusade Church.",
      "release": "2024-01-10T10:30:03Z",
      "duration": "00:56:28.3200000",
      "explicit": false,
      "spotifyId": "0ob6SXcgOwhc7SH7Zqn8W0",
      "appleId": 1000641155929,
      "subjects": [
        "The Crusade Church",
        "Psychology",
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ob6SXcgOwhc7SH7Zqn8W0",
        "apple": "https://podcasts.apple.com/podcast/ep-20-exploited-manipulated-poisoned/id1699470395?i=1000641155929"
      }
    },
    {
      "id": "09e2618c-3c8d-4fcf-9e22-3cb325f237d8",
      "title": "Ep.19: \u0022Something\u0027s Wrong With Liz\u0022",
      "description": "In a revealing and emotionally charged episode of \u0022The Cult Next Door Podcast,\u0022 hosts Mattie and Ashleigh Teeter, along with special guest Liz Lasiter, lay bare the intricacies of Liz and Mattie\u0027s courtship and engagement within the family cult. Titled \u0022Something\u0027s Wrong With Liz,\u0022 this episode explores the family enmeshment that permeated every aspect of their lives and the erosion of privacy within the tightly knit community.The episode unfolds with Liz and Mattie sharing intimate details of their courtship, providing listeners with a firsthand account of the challenges and complexities they faced. They delve into the impact of enmeshment within the church, where boundaries blurred and the concept of privacy became a distant memory. The episode explores the challenges of navigating a romantic relationship under the watchful eyes of the community, leading to a sense of unease and a feeling that something was inherently wrong.\u0022Something\u0027s Wrong With Liz\u0022 offers a poignant reflection on the toll of family enmeshment, as Liz and Mattie share the emotional strain of having every aspect of their relationship scrutinized within the confines of the cult. The hosts skillfully navigate the discussion, uncovering the layers of complexity inherent in trying to maintain personal boundaries in an environment that values conformity and obedience.",
      "release": "2024-01-03T10:30:03Z",
      "duration": "01:33:51.8160000",
      "explicit": false,
      "spotifyId": "7zFfSwF0WhygzC14hLftNJ",
      "appleId": 1000640416345,
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7zFfSwF0WhygzC14hLftNJ",
        "apple": "https://podcasts.apple.com/podcast/ep-19-somethings-wrong-with-liz/id1699470395?i=1000640416345"
      }
    },
    {
      "id": "83cf1b2d-2a56-4e44-b851-510acf7becab",
      "title": "Ep.18: \u0022Cower \u0026 Obey\u0022",
      "description": "In a deeply personal and introspective episode, \u0022The Cult Next Door Podcast\u0022 takes a closer look at the yet untold story of Liz Lasiter, the wife of co-host Mattie Lasiter, in an episode aptly titled \u0022Cower \u0026 Obey.\u0022 Hosts Mattie and Ashleigh Teeter sit down with Liz as she bravely recounts her entrance into the cult and the profound impact it had on her life, identity, and relationship with Mattie.The episode begins with Liz sharing the circumstances that led her into the clutches of the cult, peeling back the layers of her initial attraction to the charismatic leader and the complex dynamics within the church. Listeners gain insight into the challenges faced by Liz and Mattie as their budding romantic relationship caused ripples of disapproval within the tightly knit community.A vivid picture is painted of the transformation she underwent from an independent and confident individual to someone who felt compelled to cower and obey the whims of the cult and its leader. Listeners are taken on a journey through the subtle erosion of Liz\u0027s sense of self, exploring the psychological mechanisms employed by the cult to exert control over its members.\u0022Cower \u0026 Obey\u0022 delves into the struggles Liz faced within the church, navigating the delicate balance between her personal desires and the expectations imposed by the cult. The episode explores the emotional toll of living under the shadow of a charismatic leader and the challenges of maintaining a sense of self within a culture of obedience.",
      "release": "2023-12-27T10:30:02Z",
      "duration": "01:17:59.7360000",
      "explicit": false,
      "spotifyId": "4v4ywZPfIfTu5XZAL9If9V",
      "appleId": 1000639803264,
      "subjects": [
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4v4ywZPfIfTu5XZAL9If9V",
        "apple": "https://podcasts.apple.com/podcast/ep-18-cower-obey/id1699470395?i=1000639803264"
      }
    },
    {
      "id": "5517480f-6bc7-45b6-86d8-efb07d8c906d",
      "title": "Ep.17: \u0022The Mask Slips\u0022",
      "description": "In the riveting sequel to \u0022Prince Sandstorm,\u0022 \u0022The Cult Next Door Podcast\u0022 brings back former Crusade Church member Michael \u0022Sandy\u0022 Sandow in the episode titled \u0022The Mask Slips.\u0022 Hosts Mattie Lasiter and Ashleigh Teeter continue their exploration of Sandy\u0027s journey, this time focusing on his experiences in Arkansas after becoming enmeshed in the intricate web of Crusade Church.Listeners are invited to delve into the dynamics within the church, gaining insight into the expectations placed on members and the unique challenges faced by Sandy as he navigated his role within the community. The episode unfolds as Michael candidly shares the turning point in his journey – the moment when he began to see red flags about the structure of the church and the character of its leadership. Metaphorically, he describes the chilling experience of watching the \u0022mask slip\u0022 off the leader of Crusade Church, exposing a darker, manipulative side that shattered the illusion of benevolence.Listeners are taken on a rollercoaster of emotions as Michael recounts the internal struggle of coming to terms with the true nature of the church he once believed to be the path to salvation. The hosts skillfully navigate the conversation, exploring the psychological impact of witnessing the unraveling of the carefully constructed facade and the disillusionment that followed.",
      "release": "2023-12-20T10:30:02Z",
      "duration": "00:31:13.5110000",
      "explicit": false,
      "spotifyId": "6DvWb0WBEP5FlxNs9cyTfP",
      "appleId": 1000639197584,
      "subjects": [
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6DvWb0WBEP5FlxNs9cyTfP",
        "apple": "https://podcasts.apple.com/podcast/ep-17-the-mask-slips/id1699470395?i=1000639197584"
      }
    },
    {
      "id": "85fe36d8-a7c5-488a-afcf-55dbf32304eb",
      "title": "Ep.16: \u0022Prince Sandstorm\u0022",
      "description": "\u0022The Cult Next Door Podcast\u0022 welcomes former Crusade Church member Michael Sandow to the microphone in the episode titled \u0022Prince Sandstorm.\u0022 Hosts Mattie Lasiter and Ashleigh Teeter guide listeners through Michael\u0027s remarkable journey from a career in the film business to a transformative detox in his father\u0027s California home, ultimately leading him to the doors of Crusade Church.Listeners gain insights into the challenges Michael faced, including a personal struggle with drugs that prompted a pivotal detox period at his father\u0027s house on the West Coast. He recounts how he was introduced to video sermons by Crusade Church, led by an enigmatic figure who promised purpose and salvation. The hosts skillfully navigate the conversation, probing into the circumstances that drew Michael to the charismatic teachings of the cult and the allure that ultimately compelled him to relocate across the country to attend Crusade Church.Listeners are taken on a journey through Michael\u0027s eyes as he describes the initial appeal of the community, the sense of belonging that filled a void in his life, and the gradual immersion into the rituals and beliefs of Crusade Church. The hosts delve into the challenges he faced, the relationships forged \u0026 broken, and the eventual realization that the promises of the cult were veiled in manipulation and control.",
      "release": "2023-12-13T10:30:02Z",
      "duration": "01:28:53.7330000",
      "explicit": false,
      "spotifyId": "7A0H209dytA95sxEoF3oKA",
      "appleId": 1000638422023,
      "subjects": [
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7A0H209dytA95sxEoF3oKA",
        "apple": "https://podcasts.apple.com/podcast/ep-16-prince-sandstorm/id1699470395?i=1000638422023"
      }
    },
    {
      "id": "6d18f25a-caf8-49ff-bcf9-851fec65b09b",
      "title": "Ep.15: \u0022The Facade Fades\u0022",
      "description": "In the gripping conclusion to the Blake Moorer trilogy on \u0022The Cult Next Door Podcast,\u0022 hosts Mattie Lasiter and Ashleigh Teeter delve into the final chapter of Blake\u0027s tumultuous journey within the walls of Crusade Church. Titled \u0022The Facade Fades,\u0022 this episode unveils the stark reality behind the veneer of the seemingly perfect model family and explores the emotional toll of a courtship overshadowed by the whims of a cult leader.Listeners are invited to join the hosts and Blake as they revisit the turbulent period leading up to his marriage, a time marked by the constant fear of having his courtship ripped away at the whim of his soon-to-be father-in-law, the leader of Crusade Church. Blake opens up about the psychological weight of living on edge, always aware that the facade of stability could crumble at any moment.The episode provides a poignant reflection on the facade of the perfect family that initially drew Blake into the fold. As he gained a deeper understanding of the dynamics within the family cult, the facade began to fade, revealing a complex web of relationships and power dynamics. Listeners are taken on a journey through Blake\u0027s eyes as he peeks behind the curtain, exposing the cracks in the carefully constructed image of unity and harmony.",
      "release": "2023-12-06T10:30:03Z",
      "duration": "01:25:52.9910000",
      "explicit": false,
      "spotifyId": "33tEOSU61lP1t4ZDfjt7IR",
      "appleId": 1000637668013,
      "subjects": [
        "The Crusade Church",
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33tEOSU61lP1t4ZDfjt7IR",
        "apple": "https://podcasts.apple.com/podcast/ep-15-the-facade-fades/id1699470395?i=1000637668013"
      }
    },
    {
      "id": "14219d36-3125-45c8-a37a-ebb4aee958b8",
      "title": "Ep.14: \u0022Watched Like a Hawk\u0022",
      "description": "In this follow-up episode to the eye-opening \u0022His Voice Was God\u0027s Voice,\u0022 hosts Mattie Lasiter and Ashleigh Teeter continue their exploration of the journey of their brother-in-law, Blake Moorer, within the confines of Crusade Church. Titled \u0022Watched Like a Hawk,\u0022 this episode dives deeper into Blake\u0027s personal experiences during his time as a member, shedding light on the intricacies of life within the secretive cult.The hosts pick up where the previous episode left off, guiding listeners through the tumultuous period of Blake\u0027s courtship and engagement, which he describes as some of the most challenging times of his life. Blake shares intimate details about the pressures, expectations, and constant surveillance he endured as he navigated the delicate balance of courtship within the tight-knit community.Listeners gain a firsthand account of the emotional toll exacted on Blake during this period, as he grappled with the realization that the family he was marrying into was deeply entwined with the leader of Crusade Church. The episode explores the psychological impact of being \u0022Watched Like a Hawk,\u0022 examining the layers of control that extended beyond the religious teachings and seeped into the personal lives of its members.",
      "release": "2023-11-29T10:30:02Z",
      "duration": "01:08:30",
      "explicit": false,
      "spotifyId": "0ZcH41at0qAtsEOVuBVQTy",
      "appleId": 1000636898457,
      "subjects": [
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ZcH41at0qAtsEOVuBVQTy",
        "apple": "https://podcasts.apple.com/podcast/ep-14-watched-like-a-hawk/id1699470395?i=1000636898457"
      }
    },
    {
      "id": "467dfd12-15aa-440f-be82-fd74fd2dd97c",
      "title": "Ep.13: \u0022His Voice Was God\u0027s Voice\u0022",
      "description": "In this riveting episode of \u0022The Cult Next Door Podcast,\u0022 hosts Mattie Lasiter and Ashleigh Teeter delve into the personal journey of their brother-in-law, Blake Moorer. This episode explores Blake\u0027s upbringing in an offshoot of the Worldwide Church of God and the startling revelations that led him to become a member of the enigmatic Crusade Church.Blake opens up about the pivotal moments that led him to join Crusade Church and how he became intertwined with the Lasiter family. With candor, he reflects on the challenges he faced and the allure of a sense of belonging that eventually drew him into the fold of his father-in-law\u0027s leadership.The episode sheds light on the emotional and psychological journey of a family member who, over time, begins to question the authority of the leader, realizing that this leader\u0027s voice was not God\u0027s voice, but rather a tool of manipulation.",
      "release": "2023-11-22T10:30:03Z",
      "duration": "01:37:29.2310000",
      "explicit": false,
      "spotifyId": "3vJ9ejq0RWg1B1RB0L3uNj",
      "appleId": 1000635666740,
      "subjects": [
        "The Crusade Church",
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vJ9ejq0RWg1B1RB0L3uNj",
        "apple": "https://podcasts.apple.com/podcast/ep-13-his-voice-was-gods-voice/id1699470395?i=1000635666740"
      }
    },
    {
      "id": "2b961840-6262-49f5-ab7e-8160ea588f65",
      "title": "Ep.12: \u0022Pulling On A Thread\u0022 - Part 2",
      "description": "Part 2: In the riveting second part of our two-part series, \u0022Pulling On A Thread,\u0022 hosts Ashleigh and Mattie embark on a deeply personal journey as they explore Ashleigh\u0027s profound experience of leaving The Living Church of God, a significant offshoot of the Worldwide Church of God. Like the delicate act of pulling on a thread in a sweater, what begins as a small revelation unravels into a transformative exploration of faith and self-discovery.Ashleigh shares the intimate details of her time within The Living Church of God and the events that led to her eventual departure. Through candid conversations, the hosts delve into the intricacies of religious beliefs, community dynamics, and the emotional toll of questioning one\u0027s faith.As the thread of Ashleigh\u0027s story is pulled, listeners witness the unraveling of deeply ingrained beliefs and the emergence of new perspectives. The episode captures the vulnerability and courage required to confront one\u0027s faith, challenging the status quo and embracing the uncertainty of a spiritual journey in uncharted territory.",
      "release": "2023-11-18T10:30:02Z",
      "duration": "00:49:10.5300000",
      "explicit": false,
      "spotifyId": "1utRzmk8yLGNSwBPRxY5Pw",
      "appleId": 1000635257432,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1utRzmk8yLGNSwBPRxY5Pw",
        "apple": "https://podcasts.apple.com/podcast/ep-12-pulling-on-a-thread-part-2/id1699470395?i=1000635257432"
      }
    },
    {
      "id": "539b5c06-0c0a-49a9-8bd4-eea43cef44bb",
      "title": "Ep.11: \u0022Pulling On A Thread\u0022 - Part 1",
      "description": "In the riveting first part of our two-part series, \u0022Pulling On A Thread,\u0022 hosts Ashleigh and Mattie embark on a deeply personal journey as they explore Ashleigh\u0027s profound experience of leaving The Living Church of God, a significant offshoot of the Worldwide Church of God. Like the delicate act of pulling on a thread in a sweater, what begins as a small revelation unravels into a transformative exploration of faith and self-discovery.Ashleigh shares the intimate details of her time within The Living Church of God and the events that led to her eventual departure. Through candid conversations, the hosts delve into the intricacies of religious beliefs, community dynamics, and the emotional toll of questioning one\u0027s faith.As the thread of Ashleigh\u0027s story is pulled, listeners witness the unraveling of deeply ingrained beliefs and the emergence of new perspectives. The episode captures the vulnerability and courage required to confront one\u0027s faith, challenging the status quo and embracing the uncertainty of a spiritual journey in uncharted territory.",
      "release": "2023-11-15T10:30:03Z",
      "duration": "01:04:17.0610000",
      "explicit": false,
      "spotifyId": "40aux2dRVEuFOFNz1fwbP8",
      "appleId": 1000634891338,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/40aux2dRVEuFOFNz1fwbP8",
        "apple": "https://podcasts.apple.com/podcast/ep-11-pulling-on-a-thread-part-1/id1699470395?i=1000634891338"
      }
    },
    {
      "id": "811736ae-b69c-40b4-a0ac-13e41cbaaa2f",
      "title": "Ep.10: \u0022Reverberations of Abuse\u0022",
      "description": "In this special episode, we take a break from our usual storyline to delve deep into a critical and often overlooked topic: the long-lasting impact of mental and emotional abuse. Titled \u0022Reverberations of Abuse,\u0022 we explore the profound and enduring ways that abuse can shape an individual\u0027s life, influencing how they interact with the world and how their body responds to stress and trauma.Mental and emotional abuse can leave indelible marks on a person\u0027s psyche, often invisible but undeniably present. In this episode we discuss how survivors of emotional and mental abuse can experience difficulties in forming healthy relationships, trusting others, and managing their own emotions. It highlights the ways in which their self-esteem and self-worth can be deeply affected, impacting their overall quality of life.In addition, \u0022Reverberations of Abuse\u0022 delves into the physiological effects of abuse, shedding light on the connection between mental and emotional trauma and long-term health issues. It explores the concept of toxic stress and how the body reacts to prolonged periods of fear, anxiety, and instability, potentially leading to a range of physical ailments.",
      "release": "2023-11-08T10:30:03Z",
      "duration": "00:42:09.9860000",
      "explicit": false,
      "spotifyId": "4oRbxdNbbnJSJXWIaPzSnj",
      "appleId": 1000634118614,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4oRbxdNbbnJSJXWIaPzSnj",
        "apple": "https://podcasts.apple.com/podcast/ep-10-reverberations-of-abuse/id1699470395?i=1000634118614"
      }
    },
    {
      "id": "aae67f49-341b-4d1b-8ab4-16b182aa2d38",
      "title": "Ep.9: \u0022Demon Problems \u0026 Coming Catastrophe\u0022",
      "description": "In this eye-opening episode of \u0022The Cult Next Door\u0022, we delve into the intriguing world of the Worldwide Church of God (and it\u0027s offshoots) and their unique perspectives on mental health and the impending apocalypse. Join us as we unravel the fascinating history and beliefs of this religious organization in \u0022Demon Problems \u0026 Coming Catastrophe.\u0022Unlike conventional approaches that seek to address mental health issues through medical and psychological means, the church viewed mental health challenges as manifestations of demonic oppression and possession. We explore the implications of this belief system and its impact on the lives of the church\u0027s followers, shedding light on the personal struggles they faced.The Church was known for its unwavering focus on the imminent arrival of the great tribulation and the end times. Our episode takes you on a journey through the church\u0027s teachings, which were steeped in apocalyptic fervor. We\u0027ll discuss the messages and prophecies that kept the followers on edge, believing that the end of the world was just around the corner.\u0022Demon Problems \u0026 Coming Catastrophe\u0022 offers a thought-provoking exploration of how a religious organization\u0027s unorthodox beliefs about mental health and doomsday scenarios can shape the lives of its adherents. Listen in as we navigate the complexities of faith, belief, and the human psyche in the face of impending catastrophe.",
      "release": "2023-11-01T09:30:02Z",
      "duration": "01:30:50.3190000",
      "explicit": false,
      "spotifyId": "0asuUZ1ObNtMz3Btd6o7Dr",
      "appleId": 1000633335377,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0asuUZ1ObNtMz3Btd6o7Dr",
        "apple": "https://podcasts.apple.com/podcast/ep-9-demon-problems-coming-catastrophe/id1699470395?i=1000633335377"
      }
    },
    {
      "id": "6da17f23-299e-446a-a0bc-5780f301aba6",
      "title": "Ep.8: \u0022Forty Days \u0026 Forty Nights\u0022",
      "description": "Part 2: In this episode of \u0022The Cult Next Door\u0022 we return to the gripping story of Mattie, the youngest child in a family plagued by a toxic cult-like dynamic. This time, we delve into a particularly harrowing chapter of his life, one that left a lasting scar on his psyche.At the tender age of 15, Mattie experienced a period of isolation, forced to spend \u0022Forty Days \u0026 Forty Nights\u0022 away from his family, church, and friends. This extreme and psychologically damaging ordeal was orchestrated within the confines of the religious cult led by their father, shrouding Mattie\u0027s adolescence in darkness and despair.Joining Mattie in this deeply personal and revealing episode are his sisters, Jen and Ashleigh, the former providing crucial insights into the emotional and psychological torment they all endured during this time \u0026 the latter only learning of this ordeal recently.This episode continues to unravel the layers of dysfunction within their family and the oppressive grip of their father\u0027s religious cult. The narrative illustrates the profound impact of this forty-day ordeal on Mattie, who, at such a vulnerable age, grappled with an unfathomable degree of pain, fear, and uncertainty.Let’s get social!: https://linktr.ee/cultnextdoorpodcast We’d love to hear from you. Contact us at contact@thecultnextdoorpodcast.com #cult #igotout #cultsurvivor #familycult",
      "release": "2023-10-25T09:30:02Z",
      "duration": "01:02:34.0840000",
      "explicit": false,
      "spotifyId": "7ywES49snhsQe6AE5YI4CU",
      "appleId": 1000632554254,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7ywES49snhsQe6AE5YI4CU",
        "apple": "https://podcasts.apple.com/podcast/ep-8-forty-days-forty-nights/id1699470395?i=1000632554254"
      }
    },
    {
      "id": "7950a9e9-6b00-4bcf-8a9c-e4170618cd6a",
      "title": "Ep.7: \u0022The Extra Child\u0022",
      "description": "Part 1: In this episode of \u0022The Cult Next Door\u0022 we begin to delve into the story of Mattie, the youngest child in a family ensnared by a cult-like dynamic, led by their own father. \u0022The Extra Child\u0022 explores the painful journey of Mattie, who found himself thrust into the role of the family\u0027s new scapegoat, enduring the cruel and unjust treatment from his own father.Joining Mattie in this compelling narrative are his two sisters, Ashleigh and Jen, who provide essential insight into their shared experiences growing up in the shadow of their father\u0027s religious cult. Together, they share their memories, revealing the complex dynamics that engulfed their family, leaving them scarred and searching for answers.As we journey through their recollections, we uncover the layers of manipulation, control, and emotional abuse that permeated their lives. The episode sheds light on the psychological toll this family cult took on its youngest member, Mattie, as he grappled with isolation and mistreatment.\u0022The Extra Child\u0022 explores the complex dynamics within their family and the challenges they encountered along the way.Let’s get social!: https://linktr.ee/cultnextdoorpodcast We’d love to hear from you. Contact us at contact@thecultnextdoorpodcast.com #cult #igotout #cultsurvivor #familycult",
      "release": "2023-10-18T09:30:02Z",
      "duration": "00:56:33.9320000",
      "explicit": false,
      "spotifyId": "1nUolLd3D2tM1LrSCwExUu",
      "appleId": 1000631713715,
      "subjects": [
        "Family Cult",
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1nUolLd3D2tM1LrSCwExUu",
        "apple": "https://podcasts.apple.com/podcast/ep-7-the-extra-child/id1699470395?i=1000631713715"
      }
    },
    {
      "id": "7cc3f3dd-c4b4-4e49-93d4-65e02445f8eb",
      "title": "Ep.6: \u0022No One is Safe. No One.\u0022",
      "description": "Part 2: In this gripping and deeply personal episode of The Cult Next Door, hosts Mattie and Ashleigh are joined by a very special guest: their sister, Jen. Together, they open up about their shared experiences growing up in the shadow of a family cult and the heart-wrenching and lifelong ordeal of a Christian doomsday cult led by their own father. Join us as we delve into the harrowing world of cults and the profound impact they had on Mattie, Ashleigh, and Jen\u0027s lives. They\u0027ll recount their early memories, the seductive promises of the cult, and the chilling reality they eventually faced. This raw and emotional conversation sheds light on the hidden dangers of cults and the insidious role that narcissism can play in the rise of cult leaders. We explore the complex dynamics within their family and the challenges they encountered along the way. Let’s get social!: https://linktr.ee/cultnextdoorpodcast We’d love to hear from you. Contact us at contact@thecultnextdoorpodcast.com #cult #igotout #cultsurvivor #familycult",
      "release": "2023-10-11T09:30:02Z",
      "duration": "01:03:15.8330000",
      "explicit": false,
      "spotifyId": "7Hk6tRaE9RWuN9ZVsVSDtx",
      "appleId": 1000630942137,
      "subjects": [
        "Psychology",
        "Family Cult",
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Hk6tRaE9RWuN9ZVsVSDtx",
        "apple": "https://podcasts.apple.com/podcast/ep-6-no-one-is-safe-no-one/id1699470395?i=1000630942137"
      }
    },
    {
      "id": "166b3b68-8b51-4ff2-b858-6efcb6ba9241",
      "title": "Trailer: The Cult Next Door Podcast",
      "description": "Trailer for The Cult Next Door Podcast.",
      "release": "2023-10-08T17:06:14Z",
      "duration": "00:00:47.6300000",
      "explicit": false,
      "spotifyId": "1Z11FM5LGGKEuZ39ZPMkFD",
      "appleId": 1000630607166,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Z11FM5LGGKEuZ39ZPMkFD",
        "apple": "https://podcasts.apple.com/podcast/trailer-the-cult-next-door-podcast/id1699470395?i=1000630607166"
      }
    },
    {
      "id": "43940064-c791-40da-b9e3-03de2d3b785f",
      "title": "Ep.5: \u0022An Absolutely Catastrophic Event\u0022",
      "description": "Part 1: In this gripping and deeply personal episode of The Cult Next Door, hosts Mattie and Ashleigh are joined by a very special guest: their sister, Jen. Together, they open up about their shared experiences growing up in the shadow of a family cult and the heart-wrenching and lifelong ordeal of a Christian doomsday cult led by their own father. Join us as we delve into the harrowing world of cults and the profound impact they had on Mattie, Ashleigh, and Jen\u0027s lives. They\u0027ll recount their early memories, the seductive promises of the cult, and the chilling reality they eventually faced.  This raw and emotional conversation sheds light on the hidden dangers of cults and the insidious role that narcissism can play in the rise of cult leaders. We explore the complex dynamics within their family and the challenges they encountered along the way.  Let’s get social!: https://linktr.ee/cultnextdoorpodcast  We’d love to hear from you. Contact us at contact@thecultnextdoorpodcast.com #cult #igotout #cultsurvivor #familycult    ---   Support this podcast: https://podcasters.spotify.com/pod/show/cultnextdoor/support",
      "release": "2023-10-04T09:30:00Z",
      "duration": "01:21:30.0990000",
      "explicit": false,
      "spotifyId": "2wWvHzBGzmyD1ObXSazFJb",
      "appleId": 1000630160239,
      "subjects": [
        "Psychology",
        "Family Cult",
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2wWvHzBGzmyD1ObXSazFJb",
        "apple": "https://podcasts.apple.com/podcast/ep-5-an-absolutely-catastrophic-event/id1699470395?i=1000630160239"
      }
    },
    {
      "id": "69045837-66f2-4fdd-87f8-e8825eef04b6",
      "title": "Ep.4: Unmasking Cults: Recognizing the Signs",
      "description": "Ep.4 of The Cult Next Door Podcast w/ Ashleigh Teeter \u0026 Mattie Lasiter  ---   Support this podcast: https://podcasters.spotify.com/pod/show/cultnextdoor/support",
      "release": "2023-09-27T00:00:00",
      "duration": "00:40:46.5700000",
      "explicit": false,
      "spotifyId": "1LF0WuTD7szzENozVBCRGo",
      "appleId": 1000629366685,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1LF0WuTD7szzENozVBCRGo",
        "apple": "https://podcasts.apple.com/podcast/ep-4-bite-model-key-to-recognizing-cults/id1699470395?i=1000629366685"
      }
    },
    {
      "id": "cd9b2e66-c8ce-444b-b3c8-3d07f6599259",
      "title": "Ep.3: \u0022The Magnitude of the Evil You Have Done.\u0022",
      "description": "Ep.3 of \u0022The Cult Next Door\u0022 Podcast w/ Ashleigh Teeter \u0026 Mattie C. Lasiter. September 20, 2023. ",
      "release": "2023-09-20T00:00:00",
      "duration": "01:25:05.9050000",
      "explicit": false,
      "spotifyId": "3sLr9FnVzPwrL7tjr5hyS1",
      "appleId": 1000628553740,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sLr9FnVzPwrL7tjr5hyS1",
        "apple": "https://podcasts.apple.com/podcast/ep-3-the-magnitude-of-the-evil-you-have-done/id1699470395?i=1000628553740"
      }
    },
    {
      "id": "ec0777ff-60d9-45e6-97fe-b8a5d4a0ab2e",
      "title": "Ep.2: \u0022If He Can\u0027t Control Her, He Will Destroy Her.\u0022",
      "description": "Ep.2 of \u0022The Cult Next Door\u0022 Podcast w/ Ashleigh Teeter \u0026 Mattie C. Lasiter. September 13, 2023.",
      "release": "2023-09-13T00:00:00",
      "duration": "01:25:02.3570000",
      "explicit": false,
      "spotifyId": "61MQZf4Eaoo7YcslBcadlk",
      "appleId": 1000627715745,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61MQZf4Eaoo7YcslBcadlk",
        "apple": "https://podcasts.apple.com/podcast/ep-2-if-he-cant-control-her-he-will-destroy-her/id1699470395?i=1000627715745"
      }
    },
    {
      "id": "6459148c-6d44-499a-a3fd-253885c3b9aa",
      "title": "Ep.1: \u0022God Has Given Me a Message for You\u0022",
      "description": "Episode 1 of \u0022The Cult Next Door\u0022 Podcast w/ Ashleigh Teeter \u0026 Mattie C. Lasiter. September 6, 2023.",
      "release": "2023-09-06T00:00:00",
      "duration": "01:23:21.5570000",
      "explicit": false,
      "spotifyId": "34Y3WF62XEYHrWEp1AQkrA",
      "appleId": 1000626935669,
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34Y3WF62XEYHrWEp1AQkrA",
        "apple": "https://podcasts.apple.com/podcast/ep-1-god-has-given-me-a-message-for-you/id1699470395?i=1000626935669"
      }
    },
    {
      "id": "ada76e88-8a54-4672-bd93-e4ae14f3d6cb",
      "title": "Ep.3 Teaser: \u0022I can\u0027t imagine more of a family cult dynamic...\u0022",
      "description": "Excerpt from Episode 3 of \u0022The Cult Next Door\u0022 Podcast  ---   Support this podcast: https://podcasters.spotify.com/pod/show/cultnextdoor/support",
      "release": "2023-08-31T00:00:00",
      "duration": "00:01:08.6710000",
      "explicit": false,
      "spotifyId": "6YNN2siA5w24F5qDhx71sQ",
      "subjects": [
        "Family Cult",
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YNN2siA5w24F5qDhx71sQ"
      }
    },
    {
      "id": "154e16ae-02c8-4102-8843-f0350bbde4c4",
      "title": "Ep.3 Teaser: \u0022I think he thought he had me in the bag\u0022",
      "description": "Excerpt from Ep.3 of \u0022The Cult Next Door\u0022. Episodes releasing September 2023.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/cultnextdoor/support",
      "release": "2023-08-28T00:00:00",
      "duration": "00:01:16.8850000",
      "explicit": false,
      "spotifyId": "3VOll5DtRrJmsTQ89sCkIi",
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3VOll5DtRrJmsTQ89sCkIi"
      }
    },
    {
      "id": "a7ec7ba8-4c37-488b-a389-8a96c422b890",
      "title": "Ep.2 Teaser: \u0022We knew what would happen if you didn\u0027t stay in line.\u0022",
      "description": "Excerpt from Ep.2 of The Cult Next Door Podcast. Full episodes coming September 2023. #cultnextdoor   ---   Support this podcast: https://podcasters.spotify.com/pod/show/cultnextdoor/support",
      "release": "2023-08-25T00:00:00",
      "duration": "00:00:58.8160000",
      "explicit": false,
      "spotifyId": "0zngPHRm17uxnHbYLnSe83",
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0zngPHRm17uxnHbYLnSe83"
      }
    },
    {
      "id": "8406ef70-cae3-4d81-b899-e54edede3bf0",
      "title": "Trailer: \u0022This isn\u0027t just another cult story.\u0022",
      "description": "Full episodes releasing September 2023. #cultnextdoor   ---   Support this podcast: https://podcasters.spotify.com/pod/show/cultnextdoor/support",
      "release": "2023-08-25T00:00:00",
      "duration": "00:03:12.3620000",
      "explicit": false,
      "spotifyId": "6r9lQkrHelcSoj0WZdAmFd",
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6r9lQkrHelcSoj0WZdAmFd"
      }
    },
    {
      "id": "194c6dc7-434c-46ec-b7b1-d54feca2773a",
      "title": "Ep.2 Teaser: \u0022It felt like I Jumped Out of a Burning Building\u0022",
      "description": "Excerpt from Ep.2. Coming September 2023  ---   Support this podcast: https://podcasters.spotify.com/pod/show/cultnextdoor/support",
      "release": "2023-08-18T00:00:00",
      "duration": "00:01:23.7970000",
      "explicit": false,
      "spotifyId": "24B1WYR0k7AFBus4vJ8Skm",
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/24B1WYR0k7AFBus4vJ8Skm"
      }
    },
    {
      "id": "6cbc6775-46e0-4f4c-851c-c5b93c05b909",
      "title": "Ep.1 Teaser: \u0022Seared into my memory like a branding iron\u0022 ",
      "description": "An excerpt from Ep.1 of \u0022The Cult Next Door\u0022. Full episodes coming September 2023.   ---   Support this podcast: https://podcasters.spotify.com/pod/show/cultnextdoor/support",
      "release": "2023-08-05T00:00:00",
      "duration": "00:01:14.4100000",
      "explicit": false,
      "spotifyId": "5OAedkZEK2gFsJIrPxQzr2",
      "subjects": [
        "Living Church of God",
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5OAedkZEK2gFsJIrPxQzr2"
      }
    }
  ]
}