{
  "_ts": 0,
  "id": "2307c767-08e5-464a-b68f-bd56aa39fb84",
  "name": "The Daily Zeitgeist",
  "spotifyId": "6Z0jGDQp46d69cja0EUFQe",
  "appleId": 1289384685,
  "episodes": [
    {
      "id": "fcc843ce-a0c2-48dd-83bc-ca2d9194e0e8",
      "title": "New Cult Just Dropped, Alito Blames Wife For EVERYTHING? 05.31.24",
      "description": "In episode 1685, Jack and Miles are joined by actor, writer, and co-host of Go Fact Yourself , J. Keith Van Straaten, to discuss… Trump Dropped The N-Word While Making The Apprentice--Producer Claims, Alito Won’t Recuse From Sh*t... Blames Wife For EVERYTHING, Why Are We So Obsessed With Cult Documentaries? And more! Trump Dropped The N-Word While Making The Apprentice--Producer Claims The Donald Trump I Saw on The Apprentice Former Apprentice Producer Claims Trump Said ‘Would America Buy A N***** Winning?’ — And It’s On Tape Alito Won’t Recuse From Sh*t... Blames Wife For EVERYTHING Why Are We So Obsessed With Cult Documentaries? The Insane True Story Behind Netflix’s ‘Dancing For The Devil: The 7M TikTok Cult’ Dancing for the Devil: The 7M TikTok Cult | Official Trailer | Netflix Why Are We Suddenly All Obsessed With Cults? Why Are Young People So Obsessed With Cults? “Why are we so obsessed with cults?” Professor Poulomi Saha’s Homecoming lecture explores a pop culture phenomenon Why we\u0027re so obsessed with cults LISTEN: 1968 by Jairus Mozee See omnystudio.com/listener for privacy information.",
      "release": "2024-05-31T10:00:00Z",
      "duration": "01:13:40.9890000",
      "explicit": true,
      "spotifyId": "4IQntD5IJa8LoYv8879qf5",
      "appleId": 1000657394660,
      "subjects": [
        "7M Films",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4IQntD5IJa8LoYv8879qf5",
        "apple": "https://podcasts.apple.com/podcast/new-cult-just-dropped-alito-blames-wife-for-everything/id1289384685?i=1000657394660"
      }
    }
  ]
}