{
  "id": "08a3543d-0728-4b01-a503-f3f695e7e1de",
  "name": "The Free Press",
  "youTubeChannelId": "UCSRRURbKlPf1HwPUhjmufTg",
  "episodes": [
    {
      "id": "073e10f2-75a4-4e64-a70e-7b88a4b8ecd7",
      "title": "Inside OneTaste: The Wellness Trend That Hid a Sex Cult",
      "description": "It’s not every day we witness the downfall of a pro-orgasm wellness guru. But in June 2025, a federal jury sent founder—and alleged cult leader—Nicole Daedone to jail.\n\nTwo decades earlier, Daedone had founded OneTaste, a global wellness company promising sexual education, empowerment, and even enlightenment. \n\nThe company’s signature offering was a 15-minute clitoral-stroking method called “orgasmic meditation,” or OM, supplemented by for-purchase demonstrations, workshops, and retreats for members to immerse themselves in the practice. The goal was to make OM as common as yoga or meditation. “Do you want to OM?” was meant to reverberate across the San Francisco wellness community. \n\nAt its peak, OneTaste drew endorsements from Gwyneth Paltrow, Khloé Kardashian, Theo Von, and Tim Ferriss. But behind closed doors, a very different reality was taking shape—one that former members say involved exploitation, labor violations, and sexual trauma. Some have even called it a “prostitution ring.”\n\nBloomberg journalist Ellen Huet spent six years investigating OneTaste and broke the first story about its abuse. She chronicles the rise and collapse in her new book, Empire of Orgasm: Sex, Power, and the Downfall of a Wellness Cult.\n\nI ask her what really happened inside the organization; how to understand consent and agency in a cult environment; how the movement took on religious overtones; and how, in the end, this “wellness revolution” left so many lives in ruins.",
      "release": "2025-11-25T17:21:22Z",
      "duration": "01:03:24",
      "explicit": false,
      "youTubeId": "vHtcaNxdo0k",
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vHtcaNxdo0k"
      }
    }
  ]
}