{
  "_ts": 0,
  "id": "e26cd40f-0933-4843-9b06-e4c15af7e86d",
  "name": "The Sullivanians:Through a Blue Window",
  "spotifyId": "5lMvi1FoB4BNBkOslguSDv",
  "appleId": 1697359383,
  "youTubeChannelId": "UCDbf6SUwLWww0Q8Shh44gCw",
  "episodes": [
    {
      "id": "a4c95030-3f59-4f2f-8627-54df9476eac1",
      "title": "The Sullivan Institute: The Fourth Wall,  Dark Deception and Betrayal",
      "description": "theIn the five years I\u0027d been in the group, I\u0027d seen its ranks swell and the therapy group where artistic endeavors was once revered merge with the authoritarian cult-like Fourth Wall with its many directives. The shift coincided with Lewin\u0027s marriage to his second wife a soap opera actress and aspiring stage director. It was her idea to merge the two. Personal identities were subsumed by the Fourth Wall’s collective thinking. Membership was mandatory along with its burgeoning monetary demands. After the summer as my friendship with Annie disintegrated her zealotry increased. Eventually, she pushed me out of the apartment with only the backing of her therapist. “ You can either vote yes or no, based on my request. Beverly said I can do it this way, so, I am. “ I\u0027d been betrayed by Annie, Stan, and Ollie. Listen to this episode to learn about the bizarre twist Stan threw my way the week after I\u0027d moved out. Had I lost my individuality? After five years, I was left with two choices: I could start over alone or stay and exist on the fringe The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2024-05-07T09:00:00Z",
      "duration": "00:12:59.8850000",
      "explicit": false,
      "spotifyId": "6hdvJSht9IXoWDlWgoul5G",
      "appleId": 1000654785832,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6hdvJSht9IXoWDlWgoul5G",
        "apple": "https://podcasts.apple.com/podcast/the-sullivan-institute-the-fourth-wall-dark/id1697359383?i=1000654785832"
      }
    },
    {
      "id": "1e009f30-49d0-439d-bc20-214093d40366",
      "title": "Inside a Sullivanian Summer House - Annie and Shattered Trust",
      "description": "This latest episode continues to expose the machinations of the Sullivanian Cult On a serene Labor Day morning, the summer house ignites into a tinderbox of drama and emotion after Sandra\u0027s inexplicable emotional breakdown behind the wheel of the summerhouse car. Annie, who is without empathy believes Sandra should be punished. A month later, when Stan takes a stand against Cora\u0027s relationship with Ollie she is stunned by his ultimatum: invite Ollie to a group party or he would be forced to stop therapy. She complies but is left feeling vulnerable. Then at the party, after Ollie meets Bernadette Luden, Sandra\u0027s date, he abandons Cora. The following morning she is left to confront the feeling of neglect hanging heavy in the air. Ollie\u0027s unexplained behavior, missing Maria, Cora\u0027s lost friendship with Annie, and Stan\u0027s betrayal. Listen to this episode and learn more about these events and how they combined and contributed to leading Cora away from the Sullivanians. And catch up on the other episodes you might have missed. Thank you for your interest and support. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2024-04-17T09:00:00Z",
      "duration": "00:17:22.9900000",
      "explicit": false,
      "spotifyId": "4lyxBrgFIkm0BetNPZBrw8",
      "appleId": 1000652717127,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4lyxBrgFIkm0BetNPZBrw8",
        "apple": "https://podcasts.apple.com/podcast/inside-a-sullivanian-summer-house-annie-and/id1697359383?i=1000652717127"
      }
    },
    {
      "id": "4c0749b4-b17e-4ef4-83bd-f14248eb1890",
      "title": "Framing the Future: The Palette of Love and Independence (from the HIstory tapes)",
      "description": "After my sister’s marriage, I began to feel trapped by the tendrils of my mother’s expectations and my desire for independence. After five years I was ready to leave home. This episode unwraps the story of how I navigated the apartment\u0027s close quarters and the late-night disruptions of my mother\u0027s dating life and meeting Greg, also an art student from Queens College with his own tangled family web. We shared creative dreams and friendship, but because of the humiliation I experienced after Tommy I stubbornly refused his offer of love. Faced with an ultimatum and yearning, I accepted Greg and we began to build a life together. Unfortunately, our journey was fraught with the demands of Greg’s narcissistic and bullying father and my mother\u0027s traditional views that clashed with my desire for self-discovery and happiness. Navigating the stormy seas of the 1960s generational divides and societal pressures, this episode delves into the emotional confrontation between my mother\u0027s cliched disapproval over our then unconventional choice to live together. Her concern for social optics clashed with my wanting to build a life with Greg. This episode explores how my desire for personal identity, love, and approval framed my future. Whether you are drawn to the echoes of familial bonds and the pursuit of individuality or have personally been faced with similar issues of independence, this story will resonate as it details the complexities of carving out one\u0027s path while honoring the roots from which we\u0027ve grown. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2024-03-28T09:00:00Z",
      "duration": "00:17:33.9880000",
      "explicit": false,
      "spotifyId": "2kT9njK18Q0hMomG6366dC",
      "appleId": 1000650709632,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2kT9njK18Q0hMomG6366dC",
        "apple": "https://podcasts.apple.com/podcast/framing-the-future-the-palette-of-love/id1697359383?i=1000650709632"
      }
    },
    {
      "id": "c606a020-06fd-4adb-957b-4e5b2c4c64d8",
      "title": "The Sullivanians: A group that went from Creativity to  Cult",
      "description": "Today\u0027s episode begins Thanksgiving Day three years after I became entangled with the Sullivanians a seemingly benign group that supported creativity but would morph into the singular cult that remained undetected on Manhattan Upper West Side. Annie was my roommate and friend, but I on that day I began to realize her ardent belief in the Sullivanians as the vanguard party that would would soon shape the world\u0027s future was all encompassing. On that frigid day we found our way to a Greenwich Village cafe where Annie also openly discussed wrestling with the presence of her mother in the group. I\u0027d often thought of Maria as an older sister and Annie as the younger but going forward, her declaration left me in the murky waters of uncertainty. The episode doesn\u0027t end at the café, though. Learn why I was referred to a fourth therapist in three years and how I wind up at Reliable Lists, Inc and how I\u0027m guided by Stan Arnold, my new therapist, to become part of that office\u0027s union drive. The episode culminates in an emotionally charged farewell,, as Maria Alena departs for Sierra Leone. This episode carries you little further along my intertwining personal path, that eventually carved a way for me out of the Sullivanian cult and towards a new beginning. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2024-03-13T09:00:00Z",
      "duration": "00:19:17.5110000",
      "explicit": false,
      "spotifyId": "1oI8hxV2EqFR4CO7SUO4Vs",
      "appleId": 1000649029190,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1oI8hxV2EqFR4CO7SUO4Vs",
        "apple": "https://podcasts.apple.com/podcast/the-sullivanians-a-group-that-went-from-creativity-to-cult/id1697359383?i=1000649029190"
      }
    },
    {
      "id": "d7f67097-8c38-4eb1-a2a5-c75507224783",
      "title": "Daddy Dearest: From the History Tapes  - betrayal and the road to the Sullivanians",
      "description": "This episode weaves an intricate tale that begins with a wedding invitation and pulls at the threads of an emotional odyssey navigating the murky waters of a narrative steeped in abandonment, lies, and a profound search for the truth from my mother and estranged father, that would pave the way to the Sullivanians There was a reunion where my sister and I were faced with the complex emotions of rekindling the long-lost connections with our father whose approval still felt like the cornerstone of our existence. We\u0027re confronted with the superficiality of his gestures and his strange declaration, \u0022That\u0027s what fathers are for\u0022 and grapple with the innate desire for parental affirmation. Eight years pass and then during the rawest of conversations with my mother, she unveils secrets that have simmered beneath the surface for decades. Prompted by my therapist I\u0027m meeting with my father who amid the clinking of dinnerware, has some revelations of his own. As they tumble out my emotions are stretched thin, and with these betrayals, you bear witness to what eventually led me to the Sullivanians and the the enduring struggle to understand the past The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2024-02-27T10:00:00Z",
      "duration": "00:26:54.8630000",
      "explicit": false,
      "spotifyId": "1xdR4yNd9tYBIOi136wncN",
      "appleId": 1000647209437,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1xdR4yNd9tYBIOi136wncN",
        "apple": "https://podcasts.apple.com/podcast/daddy-dearest-from-the-history-tapes-betrayal-and-the/id1697359383?i=1000647209437"
      }
    },
    {
      "id": "7964436a-6e77-4fbf-8b4c-315a92880557",
      "title": "A Sullivanian stalwart, Marxist Echoes and a death in the family.",
      "description": "Initially, the group was a vibrant blend of energy—artists, musicians, writers, actors, politics, and interpersonal drama. Serena left the apartment, and Sandra Aguilar, the only minority in the group, was added to the mix. In the group, there was an elite hierarchy among the trainees, the therapists of the institute, and the people they dated, who were given preferential placement in the burgeoning Marxist classes. In this episode, you\u0027ll learn about the conflict created by Annie\u0027s decision to hire and then fire Steve Berman, a non-Sullivanian, as an instructor of Intro to Marxism based on the directive of Annie\u0027s therapist. This is another example of Annie\u0027s intractability and a foreshadowing of events to come as heard in the Aug 30, 2023, Through a Blue Window( getting out) episode. The episode takes an intimate and harrowing turn as it recounts the dictate given to me by my therapist after a call from my sister, the support I did receive, and the emotional wasteland I still can find myself wandering in a lifetime later. In the immediate aftermath of leaving the Sullivanians, in the quiet of my new apartment, I wrote an eulogy for my mother. This was the first step in helping me shape the trajectory of my life and 45 years later I still turn to it when I feel her presence and profound absence. Join me as I navigate these deeply human experiences, with insights that may resonate with your journey facing the complexities of life and relationships. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2024-02-18T10:00:00Z",
      "duration": "00:16:27.5850000",
      "explicit": false,
      "spotifyId": "22K9u6IEPSnUx27qqjK4II",
      "appleId": 1000645747270,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22K9u6IEPSnUx27qqjK4II",
        "apple": "https://podcasts.apple.com/podcast/a-sullivanian-stalwart-marxist-echoes-and-a/id1697359383?i=1000645747270"
      }
    },
    {
      "id": "7e45e6c3-2072-4d58-9fe3-084d309bc72c",
      "title": "Between the Walls and Echoes of the past;  the  Sullivanian collective conscience continues",
      "description": "-After two and a half years of shifting roommates and apartments, I finally found an apartment and a tight-knit group of women and the rewarding discovery of profound connections hitherto absent from my life This episode continues to explore the daunting task of navigating the tightrope of school, intense Sullivanian therapy, and the interpersonal dynamics of the group mixed with family estrangement, and memories that continue to haunt. Take a seat at the latest Sullivanan house meeting where personalities clash over perceived acceptability, the human need to belong. and the moral debate stirred by unconventional lifestyle choices. The roommates: Lanni, whom I met on Thanksgiving Day, my entry into the group Annie, an ardent Sullianian with a bizarre history even by group standards Serena, beautiful and unconventional pushes the envelope on what is acceptable Sullivanian behavior Then, sparked by an unexpected message from her Aunt Hannah a haunting memory resurfaces. I am grateful to all who have listened to my podcast and find this next episode of interest. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2024-02-06T08:00:00Z",
      "duration": "00:22:22.2230000",
      "explicit": false,
      "spotifyId": "2wmK4QeCEHmRrsH8lMvWtY",
      "appleId": 1000644322894,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2wmK4QeCEHmRrsH8lMvWtY",
        "apple": "https://podcasts.apple.com/podcast/between-the-walls-and-echoes-of-the/id1697359383?i=1000644322894"
      }
    },
    {
      "id": "37ae93e5-6429-4bcb-aa73-75778e4ec651",
      "title": "From the history tapes:The 1960s and  Echoes of Innocence Lost",
      "description": "This painful episode depicts the moments of sexual awakening. First with Kenny, my summer crush who loved me, but then taking a sharp turn to the unsettling encounter with Robert Scheinman the most popular boy in the senior class. Imagine a house party that veered off-course spiraling into chaos, an event that would leave my mother in a rage if found out. And the disappointment in realizing that for Robert it was only about sex. The intensity escalates with a chilling story that shifts to a .gripping account of a night that took an unwelcome turn, morphing from casual fun to an unwarranted assault. This narration bears the burden of exploitation and understanding consent and the scars left when ignored. This peeled-back narrative is marked by betrayal, that is as raw as it is real. By sharing these deeply personal stories, I hope to preserve a piece of history from the 1960s that emphasizes the enduring importance of finding the strength to speak out which I did not possess at the time. And in breaking this silence about sexual assault the hope is that the response is one of empathy, respect, and compassion The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2024-01-21T08:00:00Z",
      "duration": "00:19:47.3690000",
      "explicit": false,
      "spotifyId": "3OFCJ7ss3au9KEsxLKJMCc",
      "appleId": 1000642366440,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3OFCJ7ss3au9KEsxLKJMCc",
        "apple": "https://podcasts.apple.com/podcast/from-the-history-tapes-the-1960s-and/id1697359383?i=1000642366440"
      }
    },
    {
      "id": "0b7ac289-4640-41dc-919f-c580c2766afd",
      "title": "A Fragile Balance;  The Suicde Attempt",
      "description": "Liz, who was new to the group, was my new roommate. Ours was her first group apartment and Aggie who could be a bully under the best of circumstances, had no sympathy for Liz when she spoke nostalgically about her life before the Sullivanians, holding her wedding album close, she\u0027d often reminisce during house meetings. “I’m tired of hearing you moon over your family. You’re not married anymore, and your family treated you like shit when you left your husband. Forget them already.” And then Aggie uttered the phrase I’d become all too familiar with during my short time with the Sullivanians. It was what Jackson had said to me and what I had said to Monica, It was a phrase that begins a sentence but stops all further discussion in its tracks. “My therapist said it was okay.\u0022 And then she continued, \u0022My therapist said it was okay for me to tell Liz to stop or else.\u0022 Twenty--four hours later Liz had disappeared, vanished, and with her Aggie\u0027s prescription of Valium. After a frenzied night trying to locate Liz. hoping the worst hadn\u0027t happened, we finally learned the truth and how Aggie\u0027s toxic behavior had been the catalyst that had pushed Liz to the edge. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2024-01-07T09:00:00Z",
      "duration": "00:13:20.1820000",
      "explicit": false,
      "spotifyId": "1R2PjRM8YTXOGLkwvpAmaE",
      "appleId": 1000640792545,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1R2PjRM8YTXOGLkwvpAmaE",
        "apple": "https://podcasts.apple.com/podcast/a-fragile-balance-the-suicde-attempt/id1697359383?i=1000640792545"
      }
    },
    {
      "id": "a4ae9965-5205-40c8-b2a8-b6171fda540c",
      "title": "The  History Tapes:  The 1960s",
      "description": "The History Tapes. The oral telling jumps to the early 1960s and with it more ammunition for the therapists to manipulate. A sixth-grade party goes horribly wrong taking with it my self-esteem as I enter Junior High School without friends. Wanting a more grown-up look for junior high school, Anita and I decided to cut our hair into the layered look, the au currant style of the time leaving me with dandelion fuzz every time the barometer went above fifty percent. I wore scarves, like Audrey Hepburn, I fantasied, but wound up looking more like old Mrs. McCormick, our next-door neighbor who’d bang on the wall between our apartments when she was drunk, yelling, ‘You dirty kikes.’ With Anita gone and because of the Clifford incident, I didn’t have a single friend when I started Kingsley Junior High School, but I’d been placed in Honor Art and that’s where I met Suzanne, only to be abandoned by her two years later when her desire to be popular became more important than our friendship and I was left behind. Eventually, I found a good friend in Rachel. We shared our first sexual experiences, which for me brought back the memory of the rape scene from Peyton Place, the movie that my mother took me to see as a ten-year-old, the traumatic scene that profoundly shaped my ideas about sex and, bolstered by my mother\u0027s continued mixed messages about what \u0022nice girls\u0022 do, just adding to my confusion and misconceptions. You will find out about the sealed envelope handed to me by my guidance for my mother to sign but instead found its way to the bottom of the sewer, torn into tiny pieces. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2023-12-10T07:00:00Z",
      "duration": "00:30:23.7120000",
      "explicit": false,
      "spotifyId": "59uI8vBZA8kV4O0viiiaZx",
      "appleId": 1000638136846,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/59uI8vBZA8kV4O0viiiaZx",
        "apple": "https://podcasts.apple.com/podcast/the-history-tapes-the-1960s/id1697359383?i=1000638136846"
      }
    },
    {
      "id": "3d7b45e6-75ce-434f-88f9-01f69364b847",
      "title": "The Sullivanians  and Amagansett  (the bittersweet Summer of 1974)",
      "description": "Forty years ago the Sullivanians were exposed by NewYork Magazine and the Village Voice for their insidious practices, but as far as I know, Through A Blue Window is the only first-hand accounting, and the next episode of the podcast is about Amagansett and the group. I\u0027d been in the group for six months, but I had no idea what to expect as I headed out to the East End of Long Island to spend the summer cleaning summerhouses. It was Memorial Day 1974, and during the long train ride, I finally learned the details of what had only previously been alluded to and the importance of maintaining a veil of secrecy from the locals. This episode is also about Monica Cipro, the first and only relationship I had with a woman, and despite falling in love with each other that summer, a cold wind of conflicting views about the group ended what had barely begun. I would spend four more years in the group. You can see the complete documentary on my YouTube channel shellfein1 The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2023-11-27T11:00:00Z",
      "duration": "00:12:37.3420000",
      "explicit": false,
      "spotifyId": "7jkkY3LNxba22yKIByeYAn",
      "appleId": 1000636638416,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jkkY3LNxba22yKIByeYAn",
        "apple": "https://podcasts.apple.com/podcast/the-sullivanians-and-amagansett-the/id1697359383?i=1000636638416"
      }
    },
    {
      "id": "110af46b-f110-4be7-aaa7-a537121761d9",
      "title": "Officially a Sullivanian: A Burden Gone a Burden Begins",
      "description": "I was living in a group apartment but I wasn\u0027t officially in Sullivanian therapy. The next step in the process was to have a consultation with one of the four licensed therapists and as the day approached, my roommates were all a twitter. Though I had previously eschewed joining anything, from the Brownies to Gamma Gamma in high school, I seemed to adapt, one could argue, that I blossomed amidst the Arlettians, at first. Never mind that it meant severing all contact with my mother. Never mind that I allowed my friendship with Rachel to disintegrate like the yellowed edges of an old book. Never mind that I was staying up late, falling asleep, stretched like sinew on a bow. To cover all my additional group expenses I began to clean group apartments which led to a life-threatening emergency. After my recovery, I continued to clean and met a remarkable number of men in a matter of months and soon I was having sex with virtual strangers more men than I could count on the fingers of two hands. Listen to the entire episode and hear more details about my early Sullivanian orientation and the expectations of group life. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2023-11-10T19:00:00Z",
      "duration": "00:25:07.2390000",
      "explicit": false,
      "spotifyId": "0p09S8wXlpqefkfmruJpje",
      "appleId": 1000634413783,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0p09S8wXlpqefkfmruJpje",
        "apple": "https://podcasts.apple.com/podcast/officially-a-sullivanian-a-burden-gone-a-burden-begins/id1697359383?i=1000634413783"
      }
    },
    {
      "id": "23891b7b-c0a0-4774-acba-becb82b9a6ab",
      "title": "Personal Histories: The  Group’s Collective Conscious",
      "description": "The ‘group’ was self-monitoring by design, with the oral telling of one’s life, a history, at its core. Each history began with your earliest memory and ended on the day you entered the group and like Madame Defarge, all this information was knitted into the group’s collective conscious with every detail deemed significant. History sessions were recorded with the trainees passing the tapes on to their supervisors and then in turn to Seth. Childhood trauma was the bedrock of therapy and the way in which Cora and the others in the group were controlled. Abandonment was a constant thread throughout Cora\u0027s life and the turmoil of one event in particular and the emotional roller coaster of unanswered questions it created. This episode delves into the inherent power and profound influence our childhood experiences wield over our lives and how Cora, \u0022in the twilight before sleep, flies out the window, into the mystery of a sudden disappearance and asks why.\u0022 The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2023-10-31T18:00:00Z",
      "duration": "00:23:35.8620000",
      "explicit": false,
      "spotifyId": "3XjbQ3Ka3ooos5ZuFlIqRQ",
      "appleId": 1000633256840,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XjbQ3Ka3ooos5ZuFlIqRQ",
        "apple": "https://podcasts.apple.com/podcast/personal-histories-the-groups-collective-conscious/id1697359383?i=1000633256840"
      }
    },
    {
      "id": "57d58a82-ca49-475b-89a0-0a201b8df0d6",
      "title": "Making the Connections: Cora, Jackson Mory, and the Sullivanians",
      "description": "Two long years following my divorce I was financially situated to return to school without my mother\u0027s help. This episode delves into my seemingly innocent meeting and infatuation with Jackson Mory, the graduate assistant in my color theory class at Queens College, and how he became the gateway into the notorious world of the group and the Sullivanians, years later classified as a cult. Unbeknownst to me there was enormous pressure put on Jackson to encourage me to join the group and our \u0027dates\u0027 played a pivotal role in this entanglement. Time to continue navigating the mysterious workings of the Sullivanian Institute, this controversial lesser-known side of society that after decades still spurs debate. So brace yourselves. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2023-10-22T00:00:00Z",
      "duration": "00:19:46.5330000",
      "explicit": false,
      "spotifyId": "5VaB6R1XApSickl833j5UV",
      "appleId": 1000632150300,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5VaB6R1XApSickl833j5UV",
        "apple": "https://podcasts.apple.com/podcast/making-the-connections-cora-jackson-mory/id1697359383?i=1000632150300"
      }
    },
    {
      "id": "957aeefc-7bb5-41bb-be6a-654e26d13ad5",
      "title": "(After the group )Jonestown and the Three Mile Island Fallout",
      "description": "]As this episode unfolds the eerie news bulletins of Jonestown bring with it the realization that the Sullivanians were a cult and I was part of it. Hoping, one last time to make a go of my relationship with Chris we move to the East Village, Still cleaning for two Sullianian apartments, a few months later the events of near nuclear meltdown at Three Mile Island nuclear plant unfolds. Caught in the crossfire I learned of the treacherous events, marked by unprecedented actions and some shocking discoveries. These events are true. I experienced them. Thank you for listening and please pass along The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2023-10-08T18:00:00Z",
      "duration": "00:14:50.8270000",
      "explicit": false,
      "spotifyId": "2Ri7qhQdYuj3EZztjVi5LY",
      "appleId": 1000630617883,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Ri7qhQdYuj3EZztjVi5LY",
        "apple": "https://podcasts.apple.com/podcast/after-the-group-jonestown-and-the-three-mile-island-fallout/id1697359383?i=1000630617883"
      }
    },
    {
      "id": "70ee149c-6354-4040-822e-a23e53e4b09d",
      "title": "Abortion ( January 1973)",
      "description": "It was New York, in 1973, and though Rove v Wade had become law, I was having trouble finding a doctor. During my initial examination Dr. Lowenthal, was clinically brusque, but then a few days later at the hospital when he presented in his wheelchair, my mother couldn\u0027t hide her unnerving apprehension in her voiced fears — it was a whirlwind. The daunting intricacies of the late-term procedure and the risks that came with it – are laid bare along with emotional turbulence at the moment of chilling realization that the doctor was operating without anesthesia. This is a raw and unfiltered description of the often overlooked, intense fear, the physical agony, and the psychological distress, of abortion. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2023-09-22T20:00:00Z",
      "duration": "00:14:52.3950000",
      "explicit": false,
      "spotifyId": "1O4nubjvysgshAdfFFjNKA",
      "appleId": 1000628873702,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1O4nubjvysgshAdfFFjNKA",
        "apple": "https://podcasts.apple.com/podcast/abortion-january-1973/id1697359383?i=1000628873702"
      }
    },
    {
      "id": "a9efb62a-4576-49ec-bdb7-99c29495f8fa",
      "title": "Through a Blue Window( getting out)",
      "description": "\u0022I am asking the apartment to ask Cora to leave. I don\u0027t have to say anymore. My therapist said I didn\u0027t have to give my reasons and that I could just ask the apartment to ask her to leave. You could either vote yes or no based on my request.\u0022 This is what Annie, my once-upon-a-time ally and friend in the group asked of our roommates, in the apartment where I had lived for three years. I had heard this uncompromising reasoning many times in my five years in the group. To me, it was bullying. In the end, it was majority rule and I had a week to leave. A group apartment was forming on the 12th floor of our building and that was where I wound up. This new apartment coming together in the middle of the winter didn\u0027t exactly include the cream of the Sullivanian crop, . A week after I moved upstairs, Stan, my fourth and final therapist - a former history teacher - in another bizarre twist, asked me if I wanted to move back because if I did, \u0027I should call the apartment and ask for a house meeting and say that I should be allowed to move back because Annie had bullied my roommates.\u0022 This is exactly what I had said to him weeks before. To this day, I don\u0027t know what held me to the chair because at the time every impulse I had was urging me to grab Stan by his bony shoulders and shake him until he fell apart. Listen to this episode and hear how Stan\u0027s incompetence and Annie\u0027s bullying helped me recover the resilience I thought was lost. The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2023-08-31T02:00:00Z",
      "duration": "00:12:15.1370000",
      "explicit": false,
      "spotifyId": "0YWnAuRpbebIoeGqLH7g49",
      "appleId": 1000626361929,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0YWnAuRpbebIoeGqLH7g49",
        "apple": "https://podcasts.apple.com/podcast/through-a-blue-window-getting-out/id1697359383?i=1000626361929"
      }
    },
    {
      "id": "94ceee54-a002-4ca5-a0bd-c3e8a476e59b",
      "title": "Through a Blue Window(",
      "description": "CULT! Through a Blue Window: is a podcast that chronicles the rise and fall of the Sullivanian Institute and its members. This psycho-sexual therapy institute existed on Manhattan\u0027s Upper West Side from the 1970s through the 1990s, and in later years was characterized as a cult. I was a member of the Sullivanians for five years during which time I was directed to abandon family and friends. After learning of my mother\u0027s death in May 1975, while deeply entrenched in the Sullivanians, I was ordered not to go to the funeral, and I didn’t, thus inextricably altering my life and a decision I regret to this day. The first hour-and-a-half podcast and ensuing chapters tell of these events, beginning with my earliest memory - a \u0027history,\u0027 if you will, to borrow from the Sullivanian lexicon and bedrock of their control. Once in the group members were instructed to break ties with their families, and in particular mothers, who were seen as toxic and the root of all neurosis. This philosophy was the engine that drove the Sullivanian ideology. In 2013, still haunted by the events of my involvement, I began to write a memoir. By trade, I am a visual artist and teacher, and also a poet and short story writer. I had no idea the deep dive and the many many iterations and years it would take to complete the book. I tried to get an agent or publisher, however, the book languished on my computer. Years passed, then with the advent of iMovie and using my memoir as the scaffolding I created a documentary. It was an official selection of New FilmMakers NY 2020 and a Spotlight Documentary Bronze award winner for artistic merit. Unlike other practicing therapists who worked under a strict code of ethics, there were no such boundaries for the Sullivanians or \u0022the group,\u0022 as the members of the Institute and their therapists were self-referentially known. Sex between patients and therapists, the wide use of Valium, and drinking were encouraged The Village Voice and NewYorkMagazine, documented these events in 1989, blowing the lid off the pathological and secretive lives of the group from its seemingly benign beginnings to the children and to the bravery of three former members and the custody battles that ensued. One, a very brave mother who was forced into hiding with her newborn baby, and two fathers who fought for custody after escaping. The Sullivanians were eventually brought down by their collective paranoia, and hubris. Through Blue Window recounts all these events in a podcast for anyone who would find it hard to wrap their head around the want or need to belong to a group like this and wants to understand why. This is my personal accounting tracing early childhood trauma that made me vulnerable to the lure of a group that painted itself as the vanguard party, where the patients were controlled by the information they revealed in sessions as well as by sex, sleep deprivation, and valium, This is what you will hear in Through a Blue Window: the podcast now available for download through many platforms: Apple, Amazon, iheartradio The documentary can be seen on my YouTube channel shellfein1. Thank you so much for your time. I would love to hear your thoughts https://youtu.be/ADhx7KHb_p8 (trailer) https://youtu.be/4WUpfh3HFlg ( full ) www.shelleyfeinerman.com shellfein2@aol.com \u0027 The complete documentary Through a BlueWindow can be seen on my youtube channel shellfein1. I would love to hear your thoughts. Thank you",
      "release": "2023-07-12T00:00:00",
      "duration": "01:31:34.5950000",
      "explicit": false,
      "spotifyId": "39bFd0I90EZldgvtHLeCp7",
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39bFd0I90EZldgvtHLeCp7"
      }
    },
    {
      "id": "c32d6176-df7e-4379-a0ca-323e3db74a37",
      "title": "through a blue window c2019 S Feinerman edited 2021",
      "description": "In the 1970s, on Manhattan\u0027s upper west side, there existed a pyscho-sexual therapy group, know as the SULLIVANIANS. Unlike other practicing therapists who worked under a strict code of ethics, there were no such boundaries for the Sullivanians or \u0022the group,\u0022 as the members of the Institute and their therapists were known.  In later years it was characterized as a cult. I became a member in the fall of 1973 and left five years later. This is my story, but it begins with my mother and hers before her.  It is an unheard  story that effected hundreds. Forty years later it is a story that should be told.\n\nI have been  a practicing visual artist for 50 years, I  was a member of  the Atlantic Gallery and the Prince Street Gallery, NYC and I taught  students with special needs for 22 years.\n\n\nThis is my first film. OFFICIAL SELECTION: NewFilmmakers NYC\nwww.shelleyfeinerman.com",
      "release": "2021-01-27T05:00:01Z",
      "duration": "01:29:41",
      "explicit": false,
      "youTubeId": "4WUpfh3HFlg",
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4WUpfh3HFlg"
      }
    },
    {
      "id": "38ad2048-8e86-4b0a-ae13-5aa238f6b6dd",
      "title": "through a blue window: The Sullivanians (c)2019 S Feinerman(edited (2020)",
      "description": "In the 1970\u0027s, on Manhattan\u0027s upper west side, there existed a pyscho sexual therapy group known as the Sullivanian\u0027s  In later years characterized as a cult, the therapists advocated patients sleep with the therapists and cut off all contact with their families. Babies were forcibly taken from their mothers.  I was involved for five years. This is my story. (c) 2019 S. feinerman",
      "release": "2020-03-28T23:08:35Z",
      "duration": "01:29:45",
      "explicit": false,
      "youTubeId": "kHJ0LyhfH9o",
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kHJ0LyhfH9o"
      }
    }
  ]
}