{
  "_ts": 0,
  "id": "bd90a1f6-2f17-4cad-a14b-1d50133673ba",
  "name": "The Dauntless Grace Exchange",
  "spotifyId": "6ePPATBAE5ujHRnSX980eT",
  "appleId": 1538773554,
  "episodes": [
    {
      "id": "1dc8d35d-fc5a-4cc6-a8a9-5fcdfc246b7b",
      "title": "163: Healing After the Cult with Anna LeBaron",
      "description": "Author and Hulu documentary subject Anna LeBaron joins Deedra and Megan to share about her life post-cult. Anna\u0027s escape at 13 led her on a lifelong healing journey from the trauma she endured, and she opens up about the hardships and blessings of walking it. Also, don\u0027t miss the bonus interview in the DG Community where she answers the question, \u0022What\u0027s been left unsaid?\u0022 and her tearful response. Survivor of a violent, polygamist cult; Author of The Polygamist\u0027s Daughter: A Memoir (Tyndale, 2017); subject of the recently released 5-episode Hulu documentary called, \u0022Daughters of the Cult.\u0022 Empty nester \u0026#43; Mother of five grown children and Yaya to one grandchild. Currently pursuing a Masters Degree in Christian Spiritual Formation and Leadership through Friends University (graduation is soon! May 2024); then immediately jumping into a Doctor of Ministry in Formation and Soul Care, also at Friends. She is 55 years old, and only 29 years into her healing journey. Studying the Enneagram helped her immensely (I\u0027m a 2w3--embracing the 1 wing as needed) and she loves Internal Family Systems therapy most of all. She loves helping those who have experienced any kind of childhood developmental trauma or abuse, but especially any kind of religious trauma or spiritual abuse. You can find Anna on all social platforms @annaklebaron --- Send in a voice message: https://podcasters.spotify.com/pod/show/dauntless-grace-exchange/message",
      "release": "2024-03-28T10:21:00Z",
      "duration": "00:36:13.2480000",
      "explicit": false,
      "spotifyId": "10wAYVNb2iY4Wmqj6waAuD",
      "appleId": 1000650717273,
      "subjects": [
        "Psychology",
        "Cult Recovery",
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/10wAYVNb2iY4Wmqj6waAuD",
        "apple": "https://podcasts.apple.com/podcast/163-healing-after-the-cult-with-anna-lebaron/id1538773554?i=1000650717273"
      }
    }
  ]
}