{
  "id": "6c5b56b8-5e54-4964-a356-f6b7352daae5",
  "name": "The Cluttered Path",
  "spotifyId": "6Pi8MrpE8Yt7hZX27vGs9R",
  "appleId": 1733916220,
  "youTubeChannelId": "UCSjpf1yEgoqO6IU3Mve9w0A",
  "episodes": [
    {
      "id": "9fddef39-9b93-4882-aafe-b4e3e57cd939",
      "title": "#24 Andrew Profaci - Lessons From a Cult Survivor",
      "description": "Send us a text In this episode, we delve into Andrew Profaci\u0027s incredible escape from the notorious Love Has Won cult, revealing the darkest corners of psychological manipulation and leading to the illuminating light of truth. As Amy Carlson\u0027s closest companion, Andrew witnessed firsthand how cult leaders exploit vulnerabilities through powerful psychological control, transforming ordinary individuals into devoted followers. What makes Andrew\u0027s story compelling goes beyond sensational headlines featured on Dateline, HBO, and Vice; it encapsulates a universal human struggle with vulnerability and belief systems. His tumultuous childhood experiences left him susceptible to the cult\u0027s seductive allure. After a tragic car accident at 18 claimed his friend\u0027s life and led to his own opioid addiction, profound spiritual questions emerged—serving as an unexpected gateway to a path he never anticipated. The pivotal moment of Andrew arriving at the cult’s house reveals shocking truths—encountering an incoherent, intoxicated woman instead of the charismatic leader he expected. Despite immediately recognizing red flags, he remained entangled in this web of deception. This tension between awareness and attachment forms the backbone of his narrative, culminating in his brave decision to expose a massive hoax from within and ultimately break free. Embark on this transformative journey through manipulation, resilience, and redemption with Andrew Profaci’s remarkable story. His memoir \u0022The War on Love\u0022 provides deeper insights into these harrowing experiences while offering wisdom for anyone questioning their beliefs and seeking personal freedom. Where to Find Andrew: https://thewaronlove.com/ _____________________________________ Resources from This Episode: The War on Love, by Andrew-Ryan Profaci: https://amzn.to/45tut05 As an Amazon Partner, our podcast earns from qualified purchases at no extra cost to you. ________________________________________________________________ Where to Find Us: Web: https://clutteredpath.com/ Patreon: https://patreon.com/clutteredpath Questions/Comments: feedback@clutteredpath.com _________________________________________________________________ Follow us on Social Media: YouTube Instagram Facebook X (Formerly Twitter) TikTok",
      "release": "2025-09-10T23:00:00Z",
      "duration": "01:09:45.6780000",
      "explicit": false,
      "spotifyId": "55dDmdxAdBgbrMDUYqqvpr",
      "appleId": 1000725975724,
      "youTubeId": "wTZRHArBsq0",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/55dDmdxAdBgbrMDUYqqvpr",
        "apple": "https://podcasts.apple.com/podcast/24-andrew-profaci-lessons-from-a-cult-survivor/id1733916220?i=1000725975724",
        "youtube": "https://www.youtube.com/watch?v=wTZRHArBsq0"
      }
    }
  ]
}