{
  "id": "92aa531a-f0d3-49db-b719-2a8d786085e2",
  "name": "The Marie Embodied Podcast",
  "spotifyId": "3Kn8QeL3376zWV07xdK0UH",
  "appleId": 1870111202,
  "episodes": [
    {
      "id": "4812f0da-f1bc-40c4-a1fc-8d96d104c809",
      "title": "The Truth Will Set You Free: Healing Religious Trauma with Danii Zak",
      "description": "Why do people join cults and why do they stay? How does spiritual, mental and emotional trauma impact physical pain? Today I sit down with my sister, Danii Zak, to discuss her her complex journey through trauma, chronic pain, and religious abuse. Danii shares about several key traumatic events that shaped her life, including a devastating natural disaster and a life-altering car accident that occurred while she was studying to become a pastor at a cult-adjacent religious organization, Hillsong Church. The conversation delves into the impact of these experiences on her mental health and the development of chronic pain. Danii discusses her healing journey through somatic therapy, emphasizing the importance of understanding the connection between trauma and physical pain. The episode will invite you to think for yourself, reclaim your truth, and take agency over your life. Trigger Warning: In this episode we discuss trauma, religious abuse, chronic pain, and suicidal ideation. Resources Hillsong: A Megachurch Exposed Curable: A Different Approach to Chronic Pain Stay in Touch! Danii on Instagram: @heal.with.danielle Danii\u0027s website: https://www.thewellnessjourney.ca/ Marie on Instagram: @althaeaherbals Marie\u0027s Substack: @marieembodied Book a somatic therapy and/or herbalism session.",
      "release": "2026-02-02T13:00:00Z",
      "duration": "01:14:24.1060000",
      "explicit": true,
      "spotifyId": "3y9Pf5qHYYXjh0jcuVniUy",
      "appleId": 1000747698965,
      "subjects": [
        "Hillsong",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3y9Pf5qHYYXjh0jcuVniUy",
        "apple": "https://podcasts.apple.com/podcast/the-truth-will-set-you-free-healing-religious-trauma/id1870111202?i=1000747698965"
      }
    }
  ]
}