{
  "id": "18c6e20a-b6aa-4d24-9acf-94a9b62a6fe7",
  "name": "The Copy Table",
  "spotifyId": "1p8PKOi3qk9ywy0LSmWKAW",
  "appleId": 1716604675,
  "episodes": [
    {
      "id": "32504630-a256-4624-8201-0d9a2a6569c3",
      "title": "Episode 9 - The BITE Model and Ethical Marketing",
      "description": "Welcome back to another episode of The Copy Table! \u0022With great power comes great responsibility...\u0022 This quote (and a book that Grace could not put down) inspired this episode, in which we discuss ethical marketing and our responsibility as copywriters to avoid sleazy tactics when we weave words for our clients and our own businesses. Listen up, and you\u0027ll learn: What the BITE model is (and the overlap between MLM culture and marketing businesses like copywriting). That you\u0027re not immune to marketing tactics even though you\u0027re a marketer! (Copywriters are sold a potentially harmful glamorized image of the \u0022six-figure business\u0022 regardless of their personal circumstances) Red flags to look for so you can know when you\u0027re crossing the sometimes slipper slope between ethical and unethical marketing. Most importantly? You\u0027ll learn that you can take a stand on ethical marketing without reducing your results simply by giving a damn and baking transparency into your business. The takeaway? There really is no one right way to build a copywriting business you love, but it\u0027s on you to use your powers of persuasion responsibly! Whether you need actionable tips to market your copywriting business, a push to raise your rates, or the courage to plant your flag in a new niche, we\u0027ve got you covered. Over the years, we\u0027ve met some extraordinary people who\u0027ve helped us, and we\u0027re ready to help you avoid the pitfalls that so many copywriters find. The Extras: The Book: Hey, Hun: Sales, Sisterhood, Supremacy, and the Other Lies Behind Multilevel Marketing - https://a.co/d/hKb7wen Grace\u0027s \u0027No Assholes\u0027 Clause (tweak and add to your contracts if you like): \u0022One of the very core business values of The Contractor is The Golden Rule: Treat Others As You Want To Be Treated. As such, a strict “No Assholes Clause” is in effect. The Contractor defines “Asshole” as an individual who engages in the following behaviors: Inconsiderately wielding power over others and/or stepping on others to advance their own interests Exploiting the powerless Prioritizing their own comfort and gain above all others Treating others well based on their utility and/or perceived social ranking Exerting control unnecessarily Degrading, dehumanizing, and devaluing those around them Providing derogatory, unhelpful feedback of work provided Getting angry quickly, being slow to forgive, and hanging onto past wrongdoings If The Client engages in behaviors that the Contractor deems to fall under the above definition, the Contractor has the right to immediately cease work based on the severity of the infraction. The Client will be given a partial refund based on the completion status of the project or retainer, and no recommendations will be made to others in the Contractor’s network of colleagues.\u0022",
      "release": "2024-04-23T13:00:00Z",
      "duration": "00:33:59.6640000",
      "explicit": false,
      "spotifyId": "5yIVEVVdc8XgKDnj25rVC4",
      "appleId": 1000653331191,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5yIVEVVdc8XgKDnj25rVC4",
        "apple": "https://podcasts.apple.com/podcast/episode-9-the-bite-model-and-ethical-marketing/id1716604675?i=1000653331191"
      }
    }
  ]
}