{
  "id": "d3255d2e-d799-4577-ae4b-2dc81f90eac2",
  "name": "The Dichotomy Diaries Podcast",
  "spotifyId": "59rymoKFD9jyhYftSSfKNz",
  "appleId": 1707714917,
  "youTubeChannelId": "UCIHHs7eNd2J7ABfxiVbtsMQ",
  "episodes": [
    {
      "id": "18a55cec-4d96-452d-9be0-d8bd1e038d46",
      "title": "From The Ashes: The Final Episode",
      "description": "Dear Diary \u0026 Listeners, I’d be lying if I said getting to this last episode of The Dichotomy Diaries was anything close to a walk in the park. In truth, it’s been a grueling journey—one that has required me to face the ashes of my past and find a way to rise above them. Starting and maintaining this podcast has been the single hardest thing I’ve done, forcing me to dissect my experiences and uncover the roots of my pain. Much like the haunting echoes in Illenium’s From the Ashes, I\u0027ve wrestled with being broken down only to rise again. That song is close to my heart because, just as Phoenix shaped who I am today, it’s also where I became my most broken. It\u0027s ironic: Phoenix both created and nearly destroyed me. As humans, we crave understanding. When faced with unanswered questions, we can either bury them or seek answers, no matter the cost. So, yes—I fucked around and found out, and I don\u0027t regret it. There were days I wanted to give up, to disappear from the internet entirely. But each day, I rose with purpose, determined to see this through. And while this process has been healing, it has also been intensely challenging, revealing both sadness and the joy of personal transformation. Hosting this podcast has unintentionally filtered out the wrong people from my life—The Fuck Boy Filter, if you will. Those who approached me should have known that I have no patience for those who aren’t genuine or respectful. It\u0027s worked, more or less, but I have encountered some strange birds along the way. Thankfully, the DMs have slowed, and the wildest proposals now feel like a distant memory. Even better, the podcast has acted as a background check, a sort of litmus test for anyone new who enters my life. I am so happy to mention that the new man in my life is beyond amazing. Though he respects my work and acknowledges my commitment, he hasn’t listened to a single episode. Initially, I was disappointed—it’s my art, after all. But then, I realized that not everyone needs to know every detail. True connection doesn’t need to know the scars in high definition; it can see the resilience in your eyes and recognize your strength without needing every gritty detail. I am positive that if he tuned in, he’d be fuming just a few minutes into the first episode. And honestly? I can’t blame him. I hope this final episode brings you the closure it brought me. I hope you found value in listening to my journey, and if you did, I’d love to hear about it. My DMs are always open. As I wrap up Season 1 of The Dichotomy Diaries, I find myself reflecting on all I’ve endured and overcome. There were countless times when I was faced with people trying to burn down everything I had worked to rebuild. To those who wanted to see me fall, here’s my response: What do you want from me tonight? You wanna burn down everything in sight? I’ve walked through the flames and emerged stronger, unafraid of what comes next. Because I’ve realized I’m not just surviving this fire; I’m thriving in it. So go on, light your matches, and watch as I rise from the ashes. Thank you for standing beside me in the fire. Season 2 awaits... Forever Speaking My Truth, Amanda L. Arnier, MLS I WANT TO HEAR YOUR STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England AV Production: Amanda Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-10-08T10:04:55Z",
      "duration": "01:06:31.9090000",
      "explicit": true,
      "spotifyId": "1x7ABD1z9AMibJq4fxL5JP",
      "appleId": 1000672201643,
      "youTubeId": "CWuUhI1gEew",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1x7ABD1z9AMibJq4fxL5JP",
        "apple": "https://podcasts.apple.com/podcast/from-the-ashes-the-final-episode/id1707714917?i=1000672201643",
        "youtube": "https://www.youtube.com/watch?v=CWuUhI1gEew"
      }
    },
    {
      "id": "f8c0030e-c9d5-4b1c-a063-f7743c9c5ab7",
      "title": "Let\u0027s Chat with Kyree Oliver: The #1 Masculinity Coach in the World",
      "description": "Dear Diary \u0026 Listeners, In this episode of The Dichotomy Diaries, I welcome Kyree Oliver, the world’s leading masculinity coach featured on: FOX, CNBC, Inc., ABC, ESPN, MSN, NBC News, \u0026 CBS; for a thought-provoking discussion on personal transformation, relationships, and redefining masculinity. With a background in psychology and marketing, Kyree shares insights into what sets his coaching approach apart and why his clients seek him out after working with others. The conversation dives into the balance between support and challenge, the power of storytelling in shaping identity, and the often-overlooked nuances of masculinity. Kyree and I explore the dynamics of relationships, the importance of authenticity, and the challenges of staying true to oneself in a world full of expectations. From navigating difficult conversations and setting boundaries to understanding the complexities of energy in relationships, this bonus episode offers a fresh perspective on what it means to grow and connect in today\u0027s world. Whether you’re curious about the modern take on masculinity or looking for advice on personal growth and relationships, this episode is a must-listen. Don’t miss out on the powerful insights and practical advice that could change the way you see yourself and those around you. Forever Speaking Truth, Amanda Arnier, MLS HOW DO I GET IN TOUCH WITH KYREE? Website: https://www.kyree.com Kyree\u0027s Course: The Man Inside: Personal Power Through Identity Instagram: @kyree YouTube: ‪@Kyreeoliver94 TikTok: @kyreeoliver Twitter: @kyreeoliver Facebook: @kyreeoliver1994 WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music \u0026 Sound Production: Ashley England Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-10-08T06:30:40Z",
      "duration": "01:31:57.1400000",
      "explicit": true,
      "spotifyId": "6Dn0wGn6J8ERoj8tL9MlW6",
      "appleId": 1000672183501,
      "youTubeId": "p_Nv8yKW2PQ",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Dn0wGn6J8ERoj8tL9MlW6",
        "apple": "https://podcasts.apple.com/podcast/lets-chat-with-kyree-oliver-the-1-masculinity-coach/id1707714917?i=1000672183501",
        "youtube": "https://www.youtube.com/watch?v=p_Nv8yKW2PQ"
      }
    },
    {
      "id": "b2c97edd-235f-450e-b543-66eebf19e671",
      "title": "Boystown Bathtub",
      "description": "TRIGGER WARNING: This episode of The Dichotomy Diaries discusses sexual assault in detail. If this topic is triggering for you, please take care of yourself and consider skipping this episode. Dear Diary \u0026 Listeners, The past few months have been a serious struggle for me. I’ve been dragging my feet on wrapping up Season 1 of the podcast, stuck in this frustrating writers\u0027 block. No matter what I did, I just couldn’t get the creative juices flowing like I used to, keeping me up late into the night creating for you all. I think I know what sparked the shift, but it’s still a bit confusing. I reconnected with someone who just gets my brain. Being around him feels amazing—safe, even. It’s like all the overthinking noise in my head quieted down for a change. But here’s the thing: I need challenges in my life to stay motivated. I thrive on goals to work toward every day. This podcast was that challenge for me. But as Season 1 wrapped up and I got to the final interview, I looked around and thought, “WTF? This is too easy now.” And you know what? The most unexpected challenge I found was in my own head. My new relationship is healthy and fulfilling, but I’m literally challenging my traumatized brain every day not to go off the deep end and screw it all up. Can you imagine that feeling? Being completely happy and fulfilled, yet your brain is like, “ABORT! Everyone\u0027s a liar!” It’s a wild ride. Here’s the thing I didn’t know: there are people out there who see you struggling, who actually help and affirm your feelings, and who can take a horrible situation born from trauma and make it better. Yep, not worse—better. So, that brings me to why I’m sharing what I’m sharing today. I’m going to take you back to something that happened to me about 11 years ago. It was traumatic then, and it still is to think about (I definitely had a few mini panic attacks while recording this—watch it on YouTube if you want to see how wild it was). I’ll walk you through one of my first Tinder dates, back when it was the hottest dating app out there. As I always say, shame has no home inside me. I made some bad choices that put me in danger, and I need to own up to that. I want to share it with you so you can see, 1) we all make mistakes, 2) how serious those mistakes can be, 3) what you can do to avoid them, and 4) the tools you need to stay safe in this crazy dating world. Maybe it’s because I feel safe, seen, and truly loved right now, but I really want to get this off my chest. I’m not going to lie, though—this is rough. It’s graphic, and if you have any issues with content related to sexual assault, I suggest you skip this episode. As always, thanks for giving me a place to be 100% myself. Thank you for listening to me without judgment. You all keep me going. Oh, and PS: I’m so glad to be back on the mic. Forever Sharing My Truth, Amanda WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England AV Production: Amanda Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-09-23T12:32:18Z",
      "duration": "01:29:14.1810000",
      "explicit": true,
      "spotifyId": "0czfgfkiTpcGoMPkVtFfRR",
      "appleId": 1000670403863,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0czfgfkiTpcGoMPkVtFfRR",
        "apple": "https://podcasts.apple.com/podcast/boystown-bathtub/id1707714917?i=1000670403863"
      }
    },
    {
      "id": "e334aab5-2687-49f8-9a30-56f312678f75",
      "title": "Let\u0027s Chat with Behk \u0026 LAH from Narcissists, Gaslighters, and Cheaters, Oh My!",
      "description": "Dear Diary \u0026 Listeners, I did an interview a while back with two LOVELY ladies by the name of Behk \u0026 LAH. If you haven\u0027t heard it yet, you\u0027re about to. Enjoy! Amanda --------------------------------------------------- In this special collaboration episode, Behk \u0026 LAH of \u0022Narcissists, Gaslighters, and Cheaters, Oh My!\u0022 sit down with Amanda Arnier, the insightful host of \u0022The Dichotomy Diaries Podcast.\u0022 Together, they explore emotional intricacies in relationships, focusing on the challenges of dealing with narcissists and toxic people. Topics Discussed: Meet Amanda Arnier of the podcast, The Dichotomy Diaries Trust – is it earned or a gift? Why Amanda started “The Dichotomy Diaries” podcast The importance of sharing our stories The case of Dick The dual mothership theory by Dr. Vaknin We’re Carl Jungians Attachments Amanda’s healing journey What\u0027s next for “The Dichotomy Diaries?” Amanda brings her unique perspective from \u0022The Dichotomy Diaries,\u0022 where she recounts her relationship with Dick and shares the experiences of other women who were also involved with him. This episode discusses the complexities of narcissists, strategies for navigating toxic dynamics, and the importance of sharing these stories for healing. Please tune in for an intimate and revealing dialogue that offers a deeper understanding of Amanda’s mission and the powerful stories she shares with her audience. Subscribe and listen to \u0022Narcissists, Gaslighters, and Cheaters, Oh My!\u0022 and \u0022The Dichotomy Diaries\u0022 on your favorite podcast platforms. Don\u0027t forget to rate, review, and share! Book mentioned in this episode: The Road Less Traveled: A New Psychology of Love, Values, and Spiritual Growth by M. Scott Peck M.D. Content Warning: This episode discusses various forms of toxic abuse, narcissistic abuse, and any topics that may disturb some listeners. Listener discretion is advised. We are not doctors or therapists; you should not take our opinions as medical advice. Hosts: Behk \u0026 LAH Follow us on Instagram \u0026#43; Facebook @ngcompod Production \u0026 Design: LAHarden Music: No Reason Why by Anchor Help us keep the show going on Patreon Narcissists, Gaslighters, Cheaters, Oh My! Podcast\u0027s Patreon The Dichotomy Diaries Podcast\u0027s Patreon WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music \u0026 Sound Production: Ashley England Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-08-07T05:45:34Z",
      "duration": "01:09:53.1810000",
      "explicit": true,
      "spotifyId": "1v4q8yfew5KxiKc2H3tJ54",
      "appleId": 1000664563144,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1v4q8yfew5KxiKc2H3tJ54",
        "apple": "https://podcasts.apple.com/podcast/lets-chat-with-behk-lah-from-narcissists-gaslighters/id1707714917?i=1000664563144"
      }
    },
    {
      "id": "01a48e91-8d56-41f2-b4dc-44b0a98ed83a",
      "title": "Let\u0027s Chat with The Duchess of Bay Ridge AKA Dr. Nadine Macaluso, LMFT, PhD",
      "description": "Dear Diary \u0026 Listener\u0027s, I cannot tell you how excited I was to book this interview, with Dr. Nadine Macaluso. While most of you may not know her immediately by just mentioning her name- most of you probably know her story. Dr. Nadine Macaluso was married to Jordan Belfort, The Wolf of Wall Street. Her character, name changed, was played by the beautiful Margo Robbie in the Scorsese director box office hit! Join Dr. Nae and I as we discuss so many topics dear to both of our hearts. In this episode Dr. Nadine Macaluso, a licensed marriage and family therapist, shares her story of being married to Jordan Belfort, the Wolf of Wall Street, and how it led her to write a book and become an advocate for trauma bonding and pathological lovers. She discusses the challenges of having her life portrayed in a movie and the lack of control she had over the narrative. Dr. Macaluso emphasizes the importance of self-reflection and understanding one\u0027s own vulnerabilities in order to break free from toxic relationships. She also explores the concept of cognitive dissonance and the difficulty of leaving an abusive partner. The conversation explores the themes of healing from trauma bonds, finding one\u0027s voice, and navigating new relationships after abuse. Dr. Nae and I emphasize the importance of self-compassion and grace in the healing process. The conversation also touches on the challenges of co-parenting and the impact of trauma bonds on children. We both share their personal experiences and offer hope for post-traumatic growth and reinvention. Forever Speaking My Truth, Amanda Be sure to check below for Dr. Nadine\u0027s website where you can order her book Run Like Hell and explore many of her free tools, like the Self Compassion Assessment we discussed in this episode. Give Dr. Nae a follow on her social media, all linked below as well! ‪@TheRealDrNadine‬ Website: https://drnae.com/about-dr-nadine-mac... Free Assessments by Dr. Nae: https://drnae.com/assessments/ Order Run Like Hell Book Here: https://drnae.com/run-like-hell-book/ Instagram: / therealdrnadine TikTok: / drnaelmft Twitter: / therealdrnadine Facebook: / drnaelmft WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music \u0026 Sound Production: Ashley England Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-08-07T04:52:28Z",
      "duration": "00:53:37.9140000",
      "explicit": true,
      "spotifyId": "186xanAMexcYNt2G1UCvVf",
      "appleId": 1000664558231,
      "youTubeId": "8yTUQPHy58E",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/186xanAMexcYNt2G1UCvVf",
        "apple": "https://podcasts.apple.com/podcast/lets-chat-with-the-duchess-of-bay-ridge-aka/id1707714917?i=1000664558231",
        "youtube": "https://www.youtube.com/watch?v=8yTUQPHy58E"
      }
    },
    {
      "id": "c9a8789f-6d62-4ea6-9e60-acdb08641f54",
      "title": "Let\u0027s Chat with Vanessa Reiser, LCSW",
      "description": "Dear Diary \u0026 Listeners, In this exciting Bonus Episode of The Dichotomy Diaries, I interview the beautiful, bad ass, Vanessa Reiser, a Licensed Clinical Social Worker from The Big Apple who\u0027s got a BOOK coming out soon! (Pre-Order Link Below!) We talk about SO many juicy topics including the connection between narcissistic abuse and cults, the behavior and mindset of narcissists and psychopaths, and dissect the experience of victims down piece by piece. We touch on the confusing role most family members take in (not) warning others about the narcissist in their life. Join us as we break down the challenges of conveying the complexity of narcissistic abuse in a concise manner others. A topic that I\u0027ve really struggled with lately... This episode also explores trauma bonding and addiction in narcissistic relationships. Vanessa and I talk about the repetitive cycle of love bombing, devaluing, and discarding, which creates a trauma bond and intense addiction to the makeup session. Vanessa emphasizes the need for support and understanding for those trying to extricate themselves from these relationships, comparing it to drug addiction. Not to mention the post-separation abuse that can occur, which more often than not, includes attempts to destroy the victim\u0027s life. I had SO MUCH FUN chatting in up with Vanessa and learning all the things from her not only about my relationship with Dick, but about important topics and congruencies I wasn\u0027t even aware of. Forever Speaking My Truth, Amanda Be sure to check below for Vanessa\u0027s website, how to find her on Social Media, and Pre-Order her new book: Narcissistic Abuse: A Therapist\u0027s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People. @vanessareiserlcsw-narcissi5380 Website: https://www.tellatherapist.net Instagram: https://www.instagram.com/vanessareiserlcsw TikTok: https://www.tiktok.com/@vanessareiser BOOK PRE ORDER: https://www.amazon.com/dp/0306833174 WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Vanessa Reiser, LCSW Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-07-12T06:18:35Z",
      "duration": "00:55:44.5110000",
      "explicit": true,
      "spotifyId": "65vMQercddBSuKz4EgFAHi",
      "appleId": 1000661998069,
      "youTubeId": "6i1BEgn479g",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65vMQercddBSuKz4EgFAHi",
        "apple": "https://podcasts.apple.com/podcast/lets-chat-with-vanessa-reiser-lcsw/id1707714917?i=1000661998069",
        "youtube": "https://www.youtube.com/watch?v=6i1BEgn479g"
      }
    },
    {
      "id": "a3c21ca8-41ef-41f4-bfc2-50705ee29b8a",
      "title": "SAVANA - Straight to Zelle: Part 2",
      "description": "Dear Diary \u0026 Listeners, I think we may have uncovered something important during this episode... As Savana and I discuss how her and Dick\u0027s engagement came to an abrupt end, I realize that I share with her that she had NO idea about. Imagine her surprise when I fill her in on what HER FIANCE was doing way back when. Better yet, imagine the AUDACITY this man has to tell me the truth about his whereabouts and doings, while completely leaving out the fact that he was actively engaged to this beautiful human. Savana and I really want to emphasize how important it is to continue to do things for YOURSELF while in a relationship, NEW or OLD, you need to maintain your sense of self at all cost. Luckily for Savana, Dick wasn\u0027t able to break her spirit like he did many others, myself included. Savana\u0027s fighter soul is what gave her the strength to persevere and know what was best for her... A LIFE WITHOUT DICK. Let\u0027s be honest, that\u0027s literally what\u0027s best for everyone. I hope you enjoyed hearing Savana\u0027s story and have some good takeaways. Whether you\u0027re in a similar relationship, or know someone who is struggling to get out- just remember that your presence matters in the life of others. Whether they are gracious or not. Forever Sharing My Truth, Amanda L. Arnier, MLS Savana\u0027s Hair Instagram Savana\u0027s Personal Instagram Savana\u0027s TikTok WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Savana Martin Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-07-02T20:09:42Z",
      "duration": "01:31:00",
      "explicit": true,
      "spotifyId": "0TmKF2qR3K0f0Tbv7miFwp",
      "appleId": 1000660955360,
      "youTubeId": "9jKv8VfTzeI",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0TmKF2qR3K0f0Tbv7miFwp",
        "apple": "https://podcasts.apple.com/podcast/savana-straight-to-zelle-part-2/id1707714917?i=1000660955360",
        "youtube": "https://www.youtube.com/watch?v=9jKv8VfTzeI"
      }
    },
    {
      "id": "694ed98a-46b6-4f7c-96bd-5c7ab88bfe67",
      "title": "SAVANA - Straight to Zelle: Part 1",
      "description": "Dear Diary \u0026 Listeners, In today’s episode, I am joined by a very special guest—Savana, who was once engaged to Dick. From the moment I reached out to her, Savana has been a pillar of support in uncovering the shocking truths about our shared ex. Savana’s story is one of beauty, resilience, and positive energy. She brings her sassy and captivating personality to this conversation, making for an episode you won\u0027t want to miss. Together, we dive into the complexities of their experiences with Dick, revealing insights that are both startling and compelling. This episode marks part one of their revealing conversation, titled “Straight to Zelle.” Be sure to give Savana a follow, her social media links are listed below! Oh, go check out the video recording of this podcast, now live on YouTube. Don’t forget to subscribe to our channel, each podcast episode drops on YouTube before anywhere else! Forever Sharing My Truth, Amanda L. Arnier, MLS Savana\u0027s Hair Instagram Savana\u0027s Personal Instagram Savana\u0027s TikTok Stay tuned for PART 2 of Straight to Zelle coming out NEXT WEEK! WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Savana Martin Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-06-20T21:55:01Z",
      "duration": "01:52:07.0900000",
      "explicit": true,
      "spotifyId": "7GR1ZdD865aqJDX4cieDoe",
      "appleId": 1000659683482,
      "youTubeId": "JwQCXBSWZg8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7GR1ZdD865aqJDX4cieDoe",
        "apple": "https://podcasts.apple.com/podcast/savana-straight-to-zelle-part-1/id1707714917?i=1000659683482",
        "youtube": "https://www.youtube.com/watch?v=JwQCXBSWZg8"
      }
    },
    {
      "id": "b89f40df-e2a3-4fbf-8d21-b38b072bc64e",
      "title": "AMBRE - Summer Solstice: Part 3",
      "description": "Dear Diary \u0026 Listeners, HAPPY SUMMER SOLSTICE! I know right? Quite coincidental for the LAST part of Ambre\u0027s story to be released wouldn\u0027t you say? I love it when things like that happen. I also love it when you can tell by the look in someone\u0027s face that a weight has been lifted from sharing something they kept to themselves for so long. I applaud Ambre for making herself vulnerable and putting herself out there by telling this story. In this episode you will hear some pretty shocking things... From Dick\u0027s unconventional bedroom requests to a new scary part to his persona- stalking... I hope you enjoy Summer Solstice Part 3. Please make sure you give Ambre a follow, her links are below and make sure you head over and subscribe to YouTube. All episodes are released there FIRST. Forever Speaking My Truth, Amanda L. Arnier, MLS Instagram: @AmbreFit YouTube: @ambrefit Twitter: @TheAmbreFit TikTok: @AmbreFit www.AmbreFit.com WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Ambre McKee Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-06-20T21:50:01Z",
      "duration": "01:05:53.1810000",
      "explicit": true,
      "spotifyId": "30NR94y2qlL1bm4e9XNwzy",
      "appleId": 1000659683079,
      "youTubeId": "XWmZAEIEjzE",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/30NR94y2qlL1bm4e9XNwzy",
        "apple": "https://podcasts.apple.com/podcast/ambre-summer-solstice-part-3/id1707714917?i=1000659683079",
        "youtube": "https://www.youtube.com/watch?v=XWmZAEIEjzE"
      }
    },
    {
      "id": "2f97ad04-0a8e-411e-9caf-6f306ee1f045",
      "title": "AMBRE - Summer Solstice: Part 2",
      "description": "Dear Diary \u0026 Listeners, In this powerful and raw episode of The Dichotomy Diaries, Amanda sits down with Ambre to uncover the many layers of their toxic relationships. The conversation delves into several deeply personal themes, including: Strained Family Dynamics: Amanda shares insights into the troubled relationship between her husband and his father, exposing the negative family dynamics and emotional abuse she endured. Financial Control and Manipulation: Both Amanda and Ambre discuss the financial issues they faced, including how their partners used money as a tool for control and manipulation. Emotional and Verbal Abuse: They recount the hurtful comments, derogatory language, and verbal attacks that characterized their relationships, highlighting the damaging impact on their mental health. Gambling Addiction: The episode explores the significant role that Amanda\u0027s husband\u0027s gambling addiction played in their lives, adding another layer of complexity to the abuse. Conflict Diffusion: Amanda and Ambre describe their roles as peacemakers in constant conflicts, often at the expense of their own well-being. Suspicious Friendships: The conversation also touches on the suspicious and unhealthy relationship between Amanda\u0027s husband, Dick, and his friend Matt. The episode continues with Ambre\u0027s experiences of manipulation, coercion, and financial abuse in her relationship. Key points include: Broken Promises and Anxiety: Ambre recounts how her partner\u0027s broken promises left her feeling scared and anxious, a sentiment Amanda relates to deeply. Self-Prioritization and Derogation: They discuss how their partners prioritized themselves, often putting Ambre down and making her feel insignificant. Steroids and Hormone Therapy: Ambre shares how her partner\u0027s involvement with steroids and hormone therapy affected their relationship, including an incident of physical aggression. Car Situation: They talk about the partner\u0027s procrastination in getting a new car, reflecting his overall lack of responsibility. Finally, Amanda and Ambre discuss their experiences living with a narcissist, shedding light on: Unstable Living Conditions: They share stories of being moved to different apartments without consent, contributing to financial instability. Empty Promises: The narcissists\u0027 habit of making promises and failing to follow through, leaving them in precarious situations during trips and daily life. Obsession with Fitness: The narcissists\u0027 fixation on gyms and fitness, and how it impacted their relationships. Dangerous Behavior: Accounts of physically aggressive behavior during \u0022play fights\u0022 and the narcissists\u0027 lack of remorse. Through this candid conversation, Amanda and Ambre highlight the manipulative, unpredictable, and damaging nature of their relationships with narcissists. Tune in to hear their stories and gain a deeper understanding of the complex dynamics of abusive relationships. Remember to share this episode if it resonates with you or someone you know, and follow The Dichotomy Diaries for more stories of strength and resilience. Forever Speaking My Truth, Amanda WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Ambre McKee Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-06-04T20:47:20Z",
      "duration": "01:16:48",
      "explicit": true,
      "spotifyId": "5iidi1ar5wuz8pmkw3wfur",
      "appleId": 1000657849183,
      "youTubeId": "88x-KkeyO2k",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5iidi1ar5wuz8pmkw3wfur",
        "apple": "https://podcasts.apple.com/podcast/ambre-summer-solstice-part-2/id1707714917?i=1000657849183",
        "youtube": "https://www.youtube.com/watch?v=88x-KkeyO2k"
      }
    },
    {
      "id": "12d7060d-120a-4813-972f-31a07d5a3847",
      "title": "AMBRE - Summer Solstice: Part 1",
      "description": "Dear Diary \u0026 Listeners, In today\u0027s episode, I had the pleasure of sitting down with Ambre to delve into the whirlwind of emotions and experiences that come with falling in love with a Wolf in Sheep\u0027s clothing. Ambre takes us through her journey of meeting our shared ex, where the sparks flew and the relationship progressed rapidly. She opens up about the initial attraction, the deepening of their feelings, and the shared belief that they had each found their soulmate. Our conversation also takes a personal turn as Ambre shares insights into her background, family life, and religious upbringing, providing a rich context to her part of this story. We navigate through my own experiences, recounting the excitement and connection I felt upon meeting Dick. I reveal the challenges and discoveries I faced, including the surprising revelations about his past engagements and financial behaviors that led to a stark realization of dishonesty and manipulation. Together, Ambre and I explore the intricate dynamics of our scarily similar relationships, from meeting significant family members to confronting the turmoil and uncertainties that emerged. It\u0027s a heartfelt and eye-opening discussion about love, trust, and the lessons we learn along the way. Thank you for tuning in, and I hope this episode resonates with you as much as it did with me. You can learn more about Ambre by checking out her socials below: Instagram: @AmbreFit YouTube: @ambrefit Twitter: @TheAmbreFit TikTok: @AmbreFit www.AmbreFit.com Stay tuned for PART 2 or this THREE part story next week! Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Ambre McKee Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-05-29T00:04:38Z",
      "duration": "01:22:48.6810000",
      "explicit": true,
      "spotifyId": "78gtdEMZUrFL3Lj4JwSHgs",
      "appleId": 1000657100434,
      "youTubeId": "MsCbQZVVeyI",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/78gtdEMZUrFL3Lj4JwSHgs",
        "apple": "https://podcasts.apple.com/podcast/ambre-summer-solstice-part-1/id1707714917?i=1000657100434",
        "youtube": "https://www.youtube.com/watch?v=MsCbQZVVeyI"
      }
    },
    {
      "id": "7d38e17f-9f68-48cc-a042-2c1ee5e6ad3f",
      "title": "KYLIE - All Bark. No Bite.",
      "description": "Dear Diary \u0026 Listeners, In this episode, Kylie opens up about what drove her to be part of The Dichotomy Diaries podcast as we reflect on our shared experiences with relationships. Join me as Kylie Brocato bravely shares her story about dating Dick, a man with a violent criminal history. What started with attraction and compliments soon turned into a nightmare of verbal abuse, manipulation, and attempts to disrupt her co-parenting relationship. Despite the chaos, Kylie’s strength shone through, and she ultimately ended the toxic relationship, leading to a much healthier co-parenting dynamic with her ex. We dive deep into the dynamics of Kylie\u0027s relationship with Dick, including his neglect of his own children while trying to claim hers, his financial instability and gambling, and his secret life as a sex worker for men! Kylie’s revelation about being deceived by Dick\u0027s false narratives highlights the importance of setting boundaries and recognizing red flags. We also discuss how Dick used location sharing as a control tactic, the financial strain he caused, and his outrageous public behavior. Join us for a heartfelt and insightful conversation that underscores the importance of resilience, boundaries, and self-awareness in relationships. Don\u0027t forget to like, comment, and subscribe for more episodes every week! \u0026#x1f496; Forever Speaking My Truth, Amanda CLICK HERE FOR THE VIDEO RECORDING OF THIS EPISODE! WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Kylie Brocato Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-05-18T05:14:51Z",
      "duration": "01:24:37.3870000",
      "explicit": true,
      "spotifyId": "0maSfdNkz1L78sIKIEJ04O",
      "appleId": 1000655980717,
      "youTubeId": "-OY8rQs3Z7E",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0maSfdNkz1L78sIKIEJ04O",
        "apple": "https://podcasts.apple.com/podcast/kylie-all-bark-no-bite/id1707714917?i=1000655980717",
        "youtube": "https://www.youtube.com/watch?v=-OY8rQs3Z7E"
      }
    },
    {
      "id": "2e19911f-508d-4a84-9a36-1c47fe9e0deb",
      "title": "ROHANNA - Never Been Pro",
      "description": "Dear Diary \u0026 Listeners, In this deep and insightful conversation, Rohanna and I explore Rohanna’s multifaceted life experiences, touching on her early life on Whidbey Island, her journey through homeschooling, and her early marriage. Rohanna also shares about her collaborative natural body care business with her mom in the Pacific Northwest, and the beauty of living near the orcas. The conversation shifts to more personal themes, delving into Rohanna’s past narcissistic relationship with you guessed it....Dick. The revelations of abuse begin to align with the healing power of storytelling as we both reflect on the importance of empathy, accountability, and reciprocity. We candidly discuss the dynamics of different relationships, from familial to romantic, highlighting the lessons learned about safety, trust, and maintaining one’s individuality. Throughout, Rohanna hopes her openness helps others feel less alone, emphasizing the strength found in shared stories and the support of true friendship- an amazing byproduct of Dick\u0027s treacherous ways. Please give Rohanna a follow and support her business: https://www.sweetsistersbodycare.com Business Instagram: https://www.instagram.com/sweetsistersbodycare Personal Instagram: https://www.instagram.com/wildonefit WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Rohanna Wildon Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-05-02T06:00:14Z",
      "duration": "01:43:20.1810000",
      "explicit": true,
      "spotifyId": "2WMe7SBCn5OFriOleD5DBw",
      "appleId": 1000654255200,
      "youTubeId": "rLPEThYyhTw",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2WMe7SBCn5OFriOleD5DBw",
        "apple": "https://podcasts.apple.com/podcast/rohanna-never-been-pro/id1707714917?i=1000654255200",
        "youtube": "https://www.youtube.com/watch?v=rLPEThYyhTw"
      }
    },
    {
      "id": "e7b30c6d-7f00-4a3a-b068-1ed50457b84c",
      "title": "JOANNA - Houston, We Have a Squatter: Part 2",
      "description": "Dear Diary \u0026 Listeners, In this segment of the conversation, Joanna and Amanda delve into the intricate dynamics of Joanna\u0027s relationship with her ex-partner, Dick. They explore Dick\u0027s isolated lifestyle, his fixation on fitness and steroid use, as well as his troubling control over Joanna\u0027s diet and body image. Furthermore, they shed light on his neglectful behavior as a father to his daughter. The discussion also touches upon Dick\u0027s manipulative tactics, including his skillful redirection during arguments and exploitation of Joanna\u0027s talents and creativity. Joanna bravely shares her profound sense of entrapment and manipulation in the relationship, detailing the emotional and physical abuse she endured. She recounts harrowing experiences, including a violent incident where Dick attempted to suffocate her. Amidst the darkness, Joanna opens up about her journey to healing and the pivotal role therapy played in her recovery process. Follow Joanna and support her business ventures through the links below: Personal Instagram: @_joannahans Business Instagram: @livingbreadbakehouse TikTok: @joanna.hans Business Website: https://www.joannahans.com WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Joanna Hans Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-04-26T04:50:22Z",
      "duration": "01:11:18.2720000",
      "explicit": true,
      "spotifyId": "0aH7PwA2Q0Tb5s12eJaJDj",
      "appleId": 1000653648481,
      "youTubeId": "MxbtltOP12s",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0aH7PwA2Q0Tb5s12eJaJDj",
        "apple": "https://podcasts.apple.com/podcast/joanna-houston-we-have-a-squatter-part-2/id1707714917?i=1000653648481",
        "youtube": "https://www.youtube.com/watch?v=MxbtltOP12s"
      }
    },
    {
      "id": "94837aeb-c82d-42d0-86c6-b60cedca7670",
      "title": "JOANNA - Houston, We Have a Squatter: Part 1",
      "description": "Dear Diary \u0026 Listeners, In this compelling episode, Amanda sits down with Joanna to delve into her personal journey with a former partner who, coincidentally, they both know. Joanna candidly shares the story of their meeting, the subtle early signs of manipulation she noticed, and the profound impact it had on her life. Both Amanda and Joanna hope that by sharing this story, it will provide solace to others and illuminate the realities of narcissistic abuse. They explore the characteristics of women often targeted by narcissists and the manipulative tactics they employ. From the outset, Joanna\u0027s father had reservations about Dick. Yet, Dick managed to maintain a convincing facade, impressing Joanna\u0027s family to some extent. As circumstances would have it, Joanna found herself becoming roommates with Dick, eventually leading to an \u0022exclusive\u0022 relationship...or so she thought. The relationship seemed picture-perfect on social media, providing Joanna with a sense of security. However, this facade crumbled when she began receiving messages about Dick\u0027s inappropriate behavior. Joanna soon recognized that Dick had used his Mormon faith as yet another tool for manipulation. In addition to this, Joanna discovered some of Dick\u0027s unconventional side hustles, one of which even surprised Amanda. Much like Amanda, Joanna found herself trapped in a trauma bond with Dick, experiencing lies, abandonment, verbal abuse, and coercion firsthand. VIDEO RECORDINGS OF EPISODES ARE HERE! Please give Joanna a follow \u0026 support her business! Personal Instagram: @_joannahans Business Instagram: @livingbreadbakehouse TikTok: @joanna.hans Business Website: https://www.joannahans.com WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: Joanna Hans Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-04-17T00:29:16Z",
      "duration": "00:57:01.0360000",
      "explicit": true,
      "spotifyId": "0YRI4uzerZKblYG9F7CunF",
      "appleId": 1000652674171,
      "youTubeId": "MxbtltOP12s",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0YRI4uzerZKblYG9F7CunF",
        "apple": "https://podcasts.apple.com/podcast/joanna-houston-we-have-a-squatter-part-1/id1707714917?i=1000652674171",
        "youtube": "https://www.youtube.com/watch?v=MxbtltOP12s"
      }
    },
    {
      "id": "bc6a5a2f-fedf-484e-a102-9cd3714a4b2a",
      "title": "A Lil\u0027 Update",
      "description": "Dear Diary \u0026 Listeners, Per your request, I have chosen to break up the interviews with solo update episodes. Here is a fun update. Well- fun in terms of entertainment I guess. What you\u0027ll hear today had me shook. Thanks for letting me share and be vulnerable with you. I am forever grateful... Forever Speaking My Truth, Amanda Lynette Arnier, MLS VIDEO RECORDINGS OF EPISODES ARE HERE! WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: SOLO Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-03-26T09:53:07Z",
      "duration": "00:41:22.5000000",
      "explicit": true,
      "spotifyId": "5tyuqdCqasdf8PiV0sVS2e",
      "appleId": 1000650472439,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tyuqdCqasdf8PiV0sVS2e",
        "apple": "https://podcasts.apple.com/podcast/a-lil-update/id1707714917?i=1000650472439"
      }
    },
    {
      "id": "ac004aa5-1c41-4691-b677-0e711e5219d2",
      "title": "KYLE - For The Plot: Part 2",
      "description": "Dear Diary \u0026 Listeners, We\u0027re back with Kyle for Part Two! I want to extend my greatest gratitude out to Kyle for sharing his story with us. It was so wonderful to hear from another person with similar experiences. This validates me in my truth and I hope so many more of you in your own. I know you\u0027ve waited alllll day. So here you go. Let\u0027s get to it! VIDEO RECORDINGS OF EPISODES ARE HERE! Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: \u0022Kyle\u0022 Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-03-20T05:26:00Z",
      "duration": "01:08:36.5450000",
      "explicit": true,
      "spotifyId": "39SN0xvzDS8KzPVpGpLlne",
      "appleId": 1000649820194,
      "youTubeId": "9fblLZN2nKw",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39SN0xvzDS8KzPVpGpLlne",
        "apple": "https://podcasts.apple.com/podcast/kyle-for-the-plot-part-2/id1707714917?i=1000649820194",
        "youtube": "https://www.youtube.com/watch?v=9fblLZN2nKw"
      }
    },
    {
      "id": "0b72ccb2-4779-48e3-91e9-7913fd2112b3",
      "title": "KYLE - For The Plot: Part 1",
      "description": "Dear Diary \u0026 Listeners, You are now entering the part of The Dichotomy Diaries I like to refer to as... THE INTERVIEWS Everyone you will hear from, from this point forward is someone who had a first hand relationship with the monster that I married. What my guests will be sharing will be FACTUAL, raw, and chronological. You will also get an opportunity to ask guests of The Dichotomy Diaries questions in between the different parts of their episodes... Please submit your questions in a DM on @TheDichotomyDiaries Instagram or directly to Email at TheDichotomyDiaries@yahoo.com First up, we have Kyle. A wonderfully warm and chatty gentleman from Phoenix, AZ who saw through Dick\u0027s facade faster than most; but played along- because the P L O T was just too juicy. Please don\u0027t forget to rate, review, share, and comment. Your interactions get The Dichotomy Diaries noticed. Thank you for your continued support as always. VIDEO RECORDINGS OF EPISODES ARE HERE! Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Guest: \u0022Kyle\u0022 Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-03-12T05:28:42Z",
      "duration": "01:05:18.9540000",
      "explicit": true,
      "spotifyId": "6cYjC9z4MljgnO5MpuXADk",
      "appleId": 1000648863275,
      "youTubeId": "faE5kbGXFJc",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cYjC9z4MljgnO5MpuXADk",
        "apple": "https://podcasts.apple.com/podcast/kyle-for-the-plot-part-1/id1707714917?i=1000648863275",
        "youtube": "https://www.youtube.com/watch?v=faE5kbGXFJc"
      }
    },
    {
      "id": "0f89be79-d45e-4fe2-981c-f0bc609f17e7",
      "title": "Beyond The Rainbow",
      "description": "Dear Diary \u0026 Listeners, We made it! We survived. VIDEO RECORDINGS OF EPISODES ARE HERE! Even though at times it may have seemed impossible, we are both stronger than we thought. This episode is the last episode in MY part of this story. And while I am going to miss sharing my experiences with you weekly, I feel this indescribable weight lifted off my shoulders that it is all FINALLY OVER.. The next part of The Dichotomy Diaries Season One has one main focus… To help others share their truth, finally experience closure, and help countless others. Many times while recording this episode, I caught myself smiling. Stupidly proud of what I have created. Stupidly proud of my own personal growth and accelerated healing. But most importantly, stupidly proud that the woman I have become- is someone little 7 year old, ruby slipper wearing Amanda would be proud to become. While sometimes I feel down when reflecting on the path my life has taken; the pride I feel directly relating to my resilience supersedes all of it. In Episode 20, you will hear how my story ends. You will hear exactly how I uncovered all the other women Dick swindled in almost the exact same way. You will learn who’s interview comes first, as well as who to expect in the upcoming episodes. There’s No Place Like Home. Especially when you build home within yourself. Be on the lookout for opportunities to interact with the upcoming guests on Instagram. Thank you all for your support and hanging in there during this difficult and trying story that was my life. I will be forever grateful and humbled by this extraordinary experience. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-03-05T09:06:32Z",
      "duration": "00:51:09.7380000",
      "explicit": true,
      "spotifyId": "4sL6UKrCHBG5YnTkoxLcJo",
      "appleId": 1000648051528,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4sL6UKrCHBG5YnTkoxLcJo",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-rainbow/id1707714917?i=1000648051528"
      }
    },
    {
      "id": "b4d09400-2d93-4f20-905e-bbde07062079",
      "title": "This Fuggin\u0027 Guy",
      "description": "Dear Diary \u0026 Listeners, Welcome to the second to LAST episode in MY part of this tragic story. We\u0027ve been on a wild ride together. But you know what...? There\u0027s no one else I would have rather taken this trip with. Episode 19 really needs no introduction, but I might as well give you a taste... This is the episode where you find out how my marriage really ended. Yep. This is the one. I won\u0027t keep you waiting. Just please, don\u0027t forget. One day, you wake up...and it just doesn\u0027t hurt anymore. I promise. VIDEO RECORDINGS OF EPISODES ARE HERE! Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-02-27T11:11:31Z",
      "duration": "00:59:58.3630000",
      "explicit": true,
      "spotifyId": "4KPv7Mb7IfmXRyFUMgzY1x",
      "appleId": 1000647217086,
      "youTubeId": "7OyG0lzy3qU",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4KPv7Mb7IfmXRyFUMgzY1x",
        "apple": "https://podcasts.apple.com/podcast/this-fuggin-guy/id1707714917?i=1000647217086",
        "youtube": "https://www.youtube.com/watch?v=7OyG0lzy3qU"
      }
    },
    {
      "id": "87ad5c81-f120-43b2-925a-f66ea34b1eab",
      "title": "With Liberty \u0026 Justice for All",
      "description": "Dear Diary \u0026 Listeners, While I had hoped the justice system would come through, it fell short, leaving me disappointed. Did I get the justice I deserved? Not at all. My experiences were dismissed, making them seem like lies. But does it matter in the grand scheme of things? Also -Nope. Why? Because even if the court didn\u0027t see it, I know the truth, and now - so do you. That feels like a win to me. In Episode 18, I\u0027ll give you a quick rundown of my messy divorce court saga and share how I celebrated my birthday. Then, get ready for more drama as I spill the beans on the treachery leading up to my first wedding anniversary. Buckle up—it\u0027s gonna be a wild ride! VIDEO RECORDINGS OF EPISODES ARE HERE! Forever Speaking My Truth, Amanda L. Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-02-20T07:56:13Z",
      "duration": "01:23:02.5340000",
      "explicit": true,
      "spotifyId": "4QmWF5CuvgQhqHcRFlpYlz",
      "appleId": 1000645967012,
      "youTubeId": "wQEjAWSZyCk",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4QmWF5CuvgQhqHcRFlpYlz",
        "apple": "https://podcasts.apple.com/podcast/with-liberty-justice-for-all/id1707714917?i=1000645967012",
        "youtube": "https://www.youtube.com/watch?v=wQEjAWSZyCk"
      }
    },
    {
      "id": "8f534a1e-8041-418a-9b90-d94160d7fd86",
      "title": "Creampie Confessions",
      "description": "Dear Diary \u0026 Listeners, Stress has taught me a lot this year. I have learned that stress can be both debilitating AND motivating. I have learned that no one cares what is going on in your life; they expect you to keep it moving as usual- no matter the price. I have learned that while devastatingly debilitating at times; stress can sometimes be invisible to anyone other than yourself. So what do we do with this information? Well- we learn of course. We learn how to manage our stress levels. We learn new tools to soften the blow it has on our activities of daily life. But we also learn that stress relief is NO ONES job, but our own. Episode 17 is ALL THE THINGS. You\u0027re going to hear the raunchy, the sad, the shocking, and of course- the heartbreaking... So sit tight. OH- and if you\u0027re not fully prepared to hear some insanely gross sexual content...I would advise you to skip this episode. Shit\u0027s NASTYYYYYY up in here. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-02-06T09:49:43Z",
      "duration": "01:25:46.9090000",
      "explicit": true,
      "spotifyId": "5R3CDIM56oKbNGfsJRha3p",
      "appleId": 1000644331169,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5R3CDIM56oKbNGfsJRha3p",
        "apple": "https://podcasts.apple.com/podcast/creampie-confessions/id1707714917?i=1000644331169"
      }
    },
    {
      "id": "5820d8a6-8ba5-40c9-ba52-589fe4d81628",
      "title": "Bang, Bang",
      "description": "Dear Diary \u0026 Listeners, You ever just want to pack a bag, grab your dogs, and drive to the furthest possible corner of the map and DEEP exhale into the vast nothingness? Yeah...Me too. This is where I am this week. After returning home from an exhausting work trip; the inevitable happened. I got sick. And when I say sick, I mean SICK. Influenza A got cha girl in a choke hold. Bang, Bang. I hit the ground. Today is the first day in almost a week that I am able to get out of bed and do life. So that\u0027s fun. And what better a story to lull myself to sleep tonight...than my own. In Episode 16 you\u0027ll join me as I cringingly beg Dick to come back home after abandoning me yet again for Las Vegas. Does he come back? Oh- you bet- but as always, I\u0027m sure you\u0027ll never guess how this episode ends. Buckle your seatbelts. Bang, Bang. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-02-01T11:42:02Z",
      "duration": "00:54:46.2270000",
      "explicit": true,
      "spotifyId": "0JkmaJDZRJzkanQ85tJrOX",
      "appleId": 1000643789481,
      "youTubeId": "_45FC9HU1L8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0JkmaJDZRJzkanQ85tJrOX",
        "apple": "https://podcasts.apple.com/podcast/bang-bang/id1707714917?i=1000643789481",
        "youtube": "https://www.youtube.com/watch?v=_45FC9HU1L8"
      }
    },
    {
      "id": "737fd8ce-8e7f-43d6-a283-042f23ed031c",
      "title": "Behoove This",
      "description": "Dear Diary \u0026 Listeners, The flood gates are open and the reflective thoughts are pouring in. Values. I\u0027ve been talking a lot about family lately, but what about unique values I desire in a man? I know you\u0027ll be shocked to know...(sarcasm) that every single one of these unique values are dead opposite of Dick. It feels good to think for myself again. I finally have my present and future back. Le Sigh... Now I just need to sleep more. Here\u0027s a few Unique Qualities I pulled from a list I wrote tonight... Dick: Untrustworthy \u0026 Secretive I Value: Mystery \u0026 Enigma A mysterious aura adds an element of excitement and intrigue. I value a man who has the ability to keep a sense of mystery while still being open and vulnerable. Dick: Weakness \u0026 Inability to Cope I Value: Strength \u0026 Resilience There is nothing sexier than physical and emotional strength to navigate challenges. A man who is humbly resilient in the face of adversity, reflecting a capacity to overcome obstacles. Dick: Absence of Protective Instincts I Value: Guardian-like Qualities A man with protective instincts are key. Having the willingness to be a guardian and support in times of need. A sense of justice and the ability to stand up for what is right. Dick: Disconnect from Spiritual \u0026 Emotional Depth I Value: Spiritual Connection My person has the capacity to connect on a deep, spiritual level while maintaining strong emotional intelligence and empathy for understanding and support of shared inner growth. Dick: Predictable \u0026 Monotonous Behavior I Value: Unpredictable Allure An element of positive unpredictability that adds excitement to the relationship is a must. The distinct allure of this person should keeps the flame of passion perpetually burning. In Episode 15 I am officially homeless. Well- for a few days anyway. After Dick deploys an atomic bomb in Las Vegas, we are forced to seek refuge in Illinois. (Cue the Country Music) All is going well...I feel my nerves calming and an overwhelming sense of safety being around my family. It\u0027s short lived. SHOCKER. And guess what..? Dick recants yet another one of HIS decisions. You\u0027re going love Episode 15. Grab your popcorn y\u0027all. BEHOOVE THIS. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-01-24T11:22:25Z",
      "duration": "00:48:46.9090000",
      "explicit": true,
      "spotifyId": "0LOmiiAu3yLPruUbcHwOXl",
      "appleId": 1000642769558,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0LOmiiAu3yLPruUbcHwOXl",
        "apple": "https://podcasts.apple.com/podcast/behoove-this/id1707714917?i=1000642769558"
      }
    },
    {
      "id": "b4a0d0c3-4b98-4591-b0da-343e47aee1dd",
      "title": "Divina Commedia",
      "description": "Dear Diary (\u0026 Listeners), This episode is a total standout for me. I hardly ever get to geek out about Italian Literature and why it means so much to me. This week, I had this awesome \u0022aha\u0022 moment while chatting about my absolute favorite piece of literature. But hold on tight, \u0027cause things take a wild turn. We\u0027re talking a whopping $14k in medical bills, I manage to rip a door clean off its hinges (yeah, that happened), and guess what? Homelessness decided to make a guest appearance in my life for the first time... Life\u0027s got its own plans, right? Wrong. This wasn\u0027t fate or left to chance- this was strategic. Calculated. So, grab your popcorn...this one gets GOOD. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-01-18T07:12:24Z",
      "duration": "01:29:16.9090000",
      "explicit": true,
      "spotifyId": "1PL7OgSBLFlO91yHCoNwC9",
      "appleId": 1000642063959,
      "youTubeId": "qEdagkj1MW8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1PL7OgSBLFlO91yHCoNwC9",
        "apple": "https://podcasts.apple.com/podcast/divina-commedia/id1707714917?i=1000642063959",
        "youtube": "https://www.youtube.com/watch?v=qEdagkj1MW8"
      }
    },
    {
      "id": "f92c09b9-20e0-46be-86a8-b590561b46da",
      "title": "Make a Wish",
      "description": "Dear Diary \u0026 Listeners, I want to start off by saying Thank You. The Dichotomy Diaries has jumped insane numbers this past week and I have you all to thank for that. Episode 13 starts off with an overview...and maybe a little sneak peek. The point that we are at in this story is went mentally things all go down hill for me. Naturally, this is taxing, but when I tell you it is C O M P L E T E L Y necessary- I mean it. I am constantly questioned on why I would choose to sit with the bad decisions and pain inflicted on me. It is a very simple answer I will repeat over and over again. TO PROCESS IT. Unprocessed trauma is and will always be the underlying reason for all the things that go wrong. Choosing to experience pain over immediate pleasure of ignorance takes a self-aware individual. Are you self-aware? EP13 - Make a Wish is the story of my 32nd birthday in Arizona for Super Bowl Weekend \u0026 the Valentine\u0027s Day to follow. Here\u0027s a secret I never admitted to anyone ever... Each birthday that I spent with Dick, my birthday wish as I blew out the candles was always the same. \u0022Please Heavenly Father (what Mormons refer to God as), make things easier for my husband so that we can have a good life. I never wished for things to be easier for me. And that should tell you everything you need to know. Enjoy and be sure to listen to the entire Outro for some additional sneak peeks that will reinvigorate the marathon listener in you... Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2024-01-10T05:45:44Z",
      "duration": "00:48:50.7270000",
      "explicit": true,
      "spotifyId": "3Zr7A5GIYlL0PSflBn3mwl",
      "appleId": 1000641126502,
      "youTubeId": "J4Ft6Skm0QA",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Zr7A5GIYlL0PSflBn3mwl",
        "apple": "https://podcasts.apple.com/podcast/make-a-wish/id1707714917?i=1000641126502",
        "youtube": "https://www.youtube.com/watch?v=J4Ft6Skm0QA"
      }
    },
    {
      "id": "1f856669-12a7-4c2b-bc7c-a7a1560e9474",
      "title": "Butterfly Language",
      "description": "Dear Diary \u0026 Listeners, As I sit here today writing this, it is January 1st, 2024. A New Year always brings reflection. I can\u0027t help but think about where I was on this exact day last year. I remember waking up in an empty bed. I always enjoyed waking up and having the first view of my day be my husbands face. This day was different. The night prior I had felt like we were a team. He was leading with WE. He had outwardly demonstrated what I had been asking for, for so long. And yet here I was, waking up on the first day of the New Year, wondering where he was... At this point, I\u0027m sure you won\u0027t be shocked to hear that he was naked on camera, doing a video call with one of his regular clients... It hit me different this morning. So much so that I remember it a year later. The reality that no matter what had happened yesterday, my current days would most likely always consist of THIS...was horrifying. I thought I was seeing change in him, but in reality- it was me wishing change on him. Dick will forever be a Caterpillar person. And I speak Butterfly Language. In Episode 12 you will witness Dick\u0027s aggression increase incrementally. You\u0027ll also join me on the ever-so-frequent rollercoaster of a \u0022Run Up\u0022 where Dick will eventually hit a BIG jackpot. We will head to Arizona for my favorite week of the year and return once again as my birthday approaches. Excitement turns to anxiety when I uncover yet another demonstration of his promiscuous personality... Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries s",
      "release": "2024-01-02T23:38:53Z",
      "duration": "01:19:08.1810000",
      "explicit": true,
      "spotifyId": "2AH7Bif8XVJ1fnRbwgvaF7",
      "appleId": 1000640373706,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AH7Bif8XVJ1fnRbwgvaF7",
        "apple": "https://podcasts.apple.com/podcast/butterfly-language/id1707714917?i=1000640373706"
      }
    },
    {
      "id": "89f8b8e0-a817-480d-9c78-8a02fa919ba9",
      "title": "Method Acting",
      "description": "Dear Diary \u0026 Listeners, We all strive to be the best at something. For me, it was being a wife, a partner, a team member. For others it might be more career oriented or status driven. Not for me. I\u0027ve known as long as I can remember that I wanted to be a wife, a mother, and right hand to a fearless teammate who strives for greatness in life. I\u0027ve thought about this a lot this past week because as I try to be the best version of myself; I find that I fall short in a lot of areas I once thought I had conquered... The thing is, I hadn\u0027t conquered anything. I was acting like I had. In pure hope that one day I would meet the expectations I and my husband had set out for me. But as it does often in this story- the goalpost kept moving. And I kept falling short. It was easier to adopt a \u0022fake it \u0027till I make it\u0022 mentality than it was to sit with my shortcomings and dissect them. While we are striving to be the best at whatever that \u0022one thing\u0022 might be; there is someone out there looking for the perfect partner for them. Setting exceedingly high standards in the name of self respect or \u0022not settling\u0022... This could really be the basis on which a lot of relationships fail. Instead of trying to find or be the perfect partner, I believe that we should love an imperfect partner- perfectly. That should be the goal. To grow and stretch your beliefs in everything you ever wanted out of life; for the sake of happiness and love. If you can look at someone who is imperfect and see through the scars and skeletons, and STILL find a way to love them. I think you\u0027ve beat the game. You win. In this episode you\u0027ll hear pivotal conversations that pave the disastrous road ahead. We will celebrate New Years Eve with friends and finally uncover the reason behind me painting our life so \u0022picture perfect\u0022 constantly online. Be sure to share, like, and review. Your feedback and support mean everything. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Guest: Marissa Murray Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-12-28T09:54:23Z",
      "duration": "01:14:31.2270000",
      "explicit": true,
      "spotifyId": "1IGTEUUmBsuavjSqnZrNpU",
      "appleId": 1000639900571,
      "youTubeId": "G-Yso2iRLgA",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IGTEUUmBsuavjSqnZrNpU",
        "apple": "https://podcasts.apple.com/podcast/method-acting/id1707714917?i=1000639900571",
        "youtube": "https://www.youtube.com/watch?v=G-Yso2iRLgA"
      }
    },
    {
      "id": "d062b0c2-c804-4ee4-abb9-96a817a99ce7",
      "title": "The House Always Wins",
      "description": "Dear Diary \u0026 Listeners, There is so much I want to say. Today I reflect on the fact that this is the TENTH episode of The Dichotomy Diaries... TEN?! I was so scared to release the TRAILER you guys... I remember recording it over and over again. On my IPHONE of all devices. Something inside of me knew that this was exactly what I needed to heal, find purpose, and remember the feeling of self-love. With Christmas right around the corner, I feel more emotional than usual. I am so PROUD of myself. I am so HUMBLED with the support I receive from you all. I am SHOCKED at the amount of listener submissions I receive. I am NOSTALGIC for the warmth of family tradition around the holiday season. I am DISGUSTED at the attempts of Victim Shaming that happens in our society. I am MOTIVATED to continue to lead by example for those who have been taken advantage of an abused. I AM ALL THE THINGS. And that\u0027s probably why I cried during this episode. In Episode 10 - The House Always Wins, we uncover the truth behind the mysterious Arizona Woman who shared countless hours on the phone with Dick, and all the things associated. We finally move into our BELOVED apartment in the \u0022best part\u0022 of town...And Christmas is spent with Dick\u0027s family. That holiday was filled with a lot of love. I remember feeling such warmth. However, there was this unshakable feeling that something was wrong...or maybe it was that there was something- that everyone around me knew, but I didn\u0027t. This is my piece of advice for you. Especially after recording this episode... Childhood Trauma, whatever that may be, is NO joke. If you do not seek to heal or understand your childhood trauma, you WILL carry it into every relationship you have in the future- until you do. Give your parents grace. They are doing this for the first time too. And tell your family that you love them as often as you can. While Christmas may seem like a happy time of year to most; to some, there is a dreaded anticipation around the approach of this holiday. To some, Christmas serves as a stark reminder that the people we love most, are no longer with us. If you find yourself sad around the Christmas because of the absence of loved ones; I challenge you do at least one thing a day that is in celebration of those gone too soon. Light a candle at church. Play their favorite song in the car. Cook their favorite meal. The more we keep their memory alive, the more we embrace the feeling of happiness and feel freer to celebrate instead of mourn during Christmastime. Buon Natale, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-12-19T22:18:12Z",
      "duration": "01:39:29.7740000",
      "explicit": true,
      "spotifyId": "0OXKF3GMkdHPqoQmljhMrf",
      "appleId": 1000639141556,
      "youTubeId": "KnTg-ns71UI",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0OXKF3GMkdHPqoQmljhMrf",
        "apple": "https://podcasts.apple.com/podcast/the-house-always-wins/id1707714917?i=1000639141556",
        "youtube": "https://www.youtube.com/watch?v=KnTg-ns71UI"
      }
    },
    {
      "id": "13ca6a1e-b624-4cf8-8262-e0631e354ae7",
      "title": "Wined, Dined, and Sixty-Nined",
      "description": "Dear Diary \u0026 Listeners, S U R P R I S E! You\u0027ve waited patiently. So without further adeiu... I\u0027d like to introduce you to Kyle. Kyle is a past client, friend, and confidante of Dick. He is going to take us to school today on ALL THINGS FINDOM \u0026 Taboo. He will answer some of your most asked questions...and give you a look inside what it meant to know Dick, as an openly gay male client. AND. It\u0027s GOOOOOOD. Juicy. Spicy. The Tea Kettle is Whistling BayBEE. One thought I\u0027d like to leave you with this week... We all have a past. We all have baggage that we carry around with us. It gets heavy. I know. Don\u0027t put your bags down. Your bags are what MAKE you... Sit on your floor and invite human beings over to help you unpack them. Speak to people. Leave your house. Write a love letter. Sing loud as fuck in the car. It\u0027s time to live again. Forever Speaking My Truth, Amanda L. Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Guest: \u0022Kyle\u0022 Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-12-12T10:56:46Z",
      "duration": "00:45:05.8720000",
      "explicit": true,
      "spotifyId": "2M0Ww4gsyjvoxvnJ0TBFIZ",
      "appleId": 1000638297438,
      "youTubeId": "0CUKqy6s0bg",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2M0Ww4gsyjvoxvnJ0TBFIZ",
        "apple": "https://podcasts.apple.com/podcast/wined-dined-and-sixty-nined/id1707714917?i=1000638297438",
        "youtube": "https://www.youtube.com/watch?v=0CUKqy6s0bg"
      }
    },
    {
      "id": "73e15a02-4def-4ec9-9d6d-90f23aa905ce",
      "title": "Mama Tried",
      "description": "Dear Diary \u0026 Listeners, I am stressed this week. I have so many things going at once. The holidays crept up and I feel like I am burning the candle at both ends. I\u0027ve found myself in a strange lull because of the holidays. Everywhere I look someone is experiencing joy and new beginnings. I held space for myself for a moment, but didn\u0027t let it get the best of me. Between family, friends, and Italian Batman- there is so much potential, positivity, and love in my life right now. Thats why this week it\u0027s extra appropriate to introduce you to my Mom for the very first time. In Episode 8, you will get a first-hand, unfiltered (as always) view as to what Life with Dick looked like from a Mother\u0027s perspective. Join us as this delusional cross-country road trip takes us to Lake Geneva, WI \u0026 Huntsville, AL and takes Dick on a Farewell to FinDom Tour all along the East Coast. Prepare yourself for some SHOCKING confessions. Oh - and in this Episode, Dick leaves his precious computer unlocked while he goes on a day trip to see a \u0022client\u0022 in Reno. Finally, you\u0027re never going to FUCKING guess who calls me... ** One last thing. If you find yourself feeling down because of the holidays. Seriously- shoot me a message. I\u0027ll be the first to remind you that your presence in this World is not only important; it may be the very reason someone else exists...** Forever Speaking My Truth, Amanda L. Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Guest: Tina Scianna Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-12-05T06:28:52Z",
      "duration": "02:14:24.5450000",
      "explicit": true,
      "spotifyId": "18MnH4hoQIA1s9Hf5ua4B1",
      "appleId": 1000637522484,
      "youTubeId": "ZzGjNGoSzTQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18MnH4hoQIA1s9Hf5ua4B1",
        "apple": "https://podcasts.apple.com/podcast/mama-tried/id1707714917?i=1000637522484",
        "youtube": "https://www.youtube.com/watch?v=ZzGjNGoSzTQ"
      }
    },
    {
      "id": "f6002cc0-5c50-4df0-8286-4fd84f39709a",
      "title": "Rocky-Road Trip",
      "description": "Dear Diary \u0026 Listeners, You know the saying \u0022If you don\u0027t use it, you lose it\u0022... First off, I want to go on the record and call BULLSHIT. Why? I\u0027m glad you asked! When I first met Dick, he was entranced with my brain. He loved the way I thought, spoke, and saw the world. He would tell me, even as recent as June of 2023- that I was the smartest woman he had ever met. I ate that shit up. As our relationship progressed, it seemed that the very thing he loved so much about me, threatened him. He no longer asked my advice about complex matters. My opinions were shot down and even criticized. Which leads me to another question: How do you starve a dog to death? I know...You\u0027re like AMANDA...what?! I listened to a talk Dr. Jordan Peterson gave with Sean \u0026 Saxony Whalen the other day. He asked this question and here\u0027s why it\u0027s relevant. Starving a dog to death is simple. All you have to do is swat it on its nose with a newspaper every time it goes to eat. After about 50 times, the dog will stop eating and eventually perish. The same is true for humans. Dick figuratively swatted me on my nose every time I used my brain in a way that he couldn\u0027t. Dissect that how you may; jealousy, dominance, or just plain hatred- it fucked me up. I found myself in this space where I would ignore my creative thoughts, my opinions, my views, and my expertise. I rarely spoke up and on the rare occasion he would ask me for my advice- I actually found hard to articulate my thoughts. If you don\u0027t use it, you lose it. That saying scared the SHIT out of me. I thought I would never regain my ability to create complex thought process. It made me sad. It made me scared. It made me a slave to him and his approval. As I sit here typing to you today, I can proudly affirm that if you don\u0027t use it, you won\u0027t lose it. My brain is operating at what seems like 150% these days. So much so, that I can see why all of this was entirely necessary. Cruel. Abusive. Villanous. But 100% necessary for me to become the woman I knew I was destined to be. I had lost my faith. Given up on God simply because years of my prayers weren\u0027t answered. The happiest realization I\u0027ve had since regaining my functional nerd-brain is that God actually DID answer my prayers. I couldn\u0027t see it then, but I see it now. He will never bring you to something; he won\u0027t bring you through. In Episode 7: Rocky-Road Trip you will join my best friend of 20 years, Marissa and I as we navigate leaving Phoenix, AZ to start our cross country road trip. Join us as we talk about this quest to find a less \u0022depressive\u0022 home base, what happens along the way, and revisit some topics from past episodes. You will finally get to hear the perspective of someone close to me. And when I say she holds NOTHING back...I mean it. Forever Speaking My Truth, Amanda L. Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Guest: Marissa Murray Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-11-27T17:06:58Z",
      "duration": "01:35:48",
      "explicit": true,
      "spotifyId": "5NUnDpq6ABAJKY9wnfLVoE",
      "appleId": 1000636678575,
      "youTubeId": "m8HDHM5_37U",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5NUnDpq6ABAJKY9wnfLVoE",
        "apple": "https://podcasts.apple.com/podcast/rocky-road-trip/id1707714917?i=1000636678575",
        "youtube": "https://www.youtube.com/watch?v=m8HDHM5_37U"
      }
    },
    {
      "id": "cabef595-43ce-486e-bc04-10b951714666",
      "title": "Vanished in Happy Jack",
      "description": "NOTE: This episode\u0027s audio is less than desirable, but if you can make it through- I PROMISE Episode\u0027s 7 on are INCREDIBLE. I really taught myself all of the things. Please do not judge The Dichotomy Diaries based on this Episode\u0027s audio quality. Dear Diary \u0026 Listeners, There\u0027s a theme this week. We Teach People How To Treat Us. And while yes, what I taught Dick our entire relationship was that he could walk all over me... My lesson plan is a little different now. Boundaries are difficult for so many reasons. The scariest part for me always was that I meant well with them, but they were always perceived as mean, cruel, or selfish. We tend to fall into habits of letting people cross our boundaries to \u0022keep the peace\u0022. But let\u0027s be honest, PEACE for who? Episode 6 comes with a TRIGGER WARNING. This episode contains discussions about suicide ideations. Listener discretion is advised. If you or someone you know is struggling with suicidal thoughts, please seek help immediately. National Suicide Prevention Lifeline: 1-800-273-TALK (1-800-273-8255) or your local crisis hotline. This week you will sit with me some of the darkest times I\u0027ve ever experienced. I\u0027m not going to lie to you. This isn\u0027t something I share easily. I am embarrassed about it. However, just like everything else I am embarrassed of- I know it is something I have to get out of my soul. You will find that all of my fears and assumptions come true in this episode. My false sense of self-esteem comes shattering down. And just when you think the delulu can\u0027t get any worse...I sell all my belongings. Someone asked me this week if I am open to love again... I giggled. I am love. I don\u0027t know any other way to be. And that is something I will never change about myself. We teach people how to treat us. So if we lead with love, chances are- we just might just end up finding that needle in the hay stack. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Guest: Riley Imwie Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries s",
      "release": "2023-11-21T09:14:41Z",
      "duration": "01:53:22.9090000",
      "explicit": true,
      "spotifyId": "2WZm73socjzkQajEGipnPh",
      "appleId": 1000635524274,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2WZm73socjzkQajEGipnPh",
        "apple": "https://podcasts.apple.com/podcast/vanished-in-happy-jack/id1707714917?i=1000635524274"
      }
    },
    {
      "id": "67714d89-c7d3-424a-a889-3febcb546c3e",
      "title": "Sergeant Steroids",
      "description": "NOTE: This episode\u0027s audio is less than desirable, but if you can make it through- I PROMISE Episode\u0027s 7 on are INCREDIBLE. I really taught myself all of the things. Please do not judge The Dichotomy Diaries based on this Episode\u0027s audio quality. Dear Diary \u0026 Listeners, When I tell you I have had the busiest three weeks of my life. I am nowhere close to joking. You know, sitting back right now with my feet up on my desk and my hair up in a bun- I feel pretty damn accomplished. I did some shit I didn\u0027t even think I was capable of... I just recorded, edited, and fully produced an entire podcast episode BY MY SELF! I put myself out there to create new relationships with actual human people. I gritted my teeth through the discomfort of social anxiety and what I uncovered on the other side is so fucking special. (Not me basking in the new incredible friendships I have created) Now you\u0027re probably like \u0022Wait, Amanda...You\u0027re so extroverted. How could you possibly have social anxiety...?\u0022 Let me let you in on a little secret. When you are alienated from everyone you love and continue to self isolate through healing- you straight up lose those skills. I\u0027m also just going to be blatantly honest... The trauma I endured while with Dick, made me develop an anxious speech pattern where I LONG PAUSE almost every time I speak, when asked a question. I also swear to (Non-Mormon) God, that I developed a stutter. This is what happens when you are so afraid of constantly saying the wrong thing. Walking on eggshells virtually every second of your life, does crazy shit to your brain. And when you have an immensely unique and complex brain, you need to socialize. Otherwise, you end up in a prison of your own thoughts. It wasn\u0027t very fun, but thankfully as you can hear- no more stutter and shorter pauses. WIN. During this episode we dive DEEP into the World of Financial Domination. You will meet Jamie, a client of 9 years and begin to understand the \u0022why\u0022 behind this secret fetish lifestyle that so many live behind closed doors. Join me as my two oldest friends and I explore all things FinDom in Episode 5, Sergeant Steroids. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier Guests: Brittany Ryan \u0026 Jenny Jeske Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-11-15T17:51:36Z",
      "duration": "01:57:49.4080000",
      "explicit": true,
      "spotifyId": "6sOefb1sOMmasmhRxL0aFF",
      "appleId": 1000634937905,
      "youTubeId": "7eoh3FJLdKw",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6sOefb1sOMmasmhRxL0aFF",
        "apple": "https://podcasts.apple.com/podcast/sergeant-steroids/id1707714917?i=1000634937905",
        "youtube": "https://www.youtube.com/watch?v=7eoh3FJLdKw"
      }
    },
    {
      "id": "5bf5be3a-9541-43c7-a8d0-3789038d89cd",
      "title": "Promises, Panic \u0026 Poppers",
      "description": "Dear Diary \u0026 Listeners, I cried recording part of this episode. And it got me thinking... Why did THIS episode make me cry? What is it about my wedding that sparks the tears? You’d think that reliving the abandonments, the emotional abuse, and all the other subpar efforts confused as love would make me sad... I know the answer. This episode didn’t make me cry because I was reflecting on that moment of my wedding ceremony. Tears started flowing in the studio because right then; I felt as if I may never get to experience such a meaningful moment again. I felt hijacked. Such important meaningful moments, all hijacked by a human incapable of love and compassion. The thing is...it’s all bullshit. We don’t just get ONE shot at happiness. We get as many as we give ourself. So this is me publicly throwing away the self-limiting doubts. I finally feel happy again. I know who Amanda Lynette Arnier is. I love that bad ass, resilient bitch. Someone will love me. Far better than I could ever imagine before. In this episode you will join me for my beautiful wedding in Sedona, AZ. You will also spend an evening in the emergency room. Followed by a road trip to Colorado, Dick’s self-proclaimed LEAST FAVORITE state. Be sure to share, like, and review. Your feedback and support mean everything. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music: Ashley England Sound Production: Amanda L. Arnier \u0026 Ashley England Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-10-31T04:58:59Z",
      "duration": "01:08:51.3110000",
      "explicit": true,
      "spotifyId": "6Xc3wWqozDTKxTjPPe8Dcm",
      "appleId": 1000633178298,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Xc3wWqozDTKxTjPPe8Dcm",
        "apple": "https://podcasts.apple.com/podcast/promises-panic-poppers/id1707714917?i=1000633178298"
      }
    },
    {
      "id": "8f742e61-6880-485a-894a-35a3caca7696",
      "title": "Electric Daisy Abandonment",
      "description": "Dear Diary \u0026 Listeners, You know how some people say, \u0022God will never give you more than you can handle\u0022? After recording this episode, I found myself thinking about that phrase a lot. The process of outlining my relationship with Dick for this podcast has been filled with sorrow, but it has also brought understanding. There were so many painful moments I experienced during this time that had been subconsciously tucked away in a file cabinet in my mind. Unpacking those file cabinets feels like I am experiencing them again, for the first time, right along with you. I probably have some of the same questions you all are having: Why didn\u0027t I just let him leave for good? How many times does Dick have to tell me he doesn\u0027t want to be with me before I actually believe him? But the biggest question of them all is... Why didn\u0027t leaving him ever cross my mind? So, I did a little soul searching, and what I realized was heart-wrenching. I subliminally laid everything I had at his feet: my money, my family, my love, my support, and my future. I continued to trust him even when he gave me every reason not to. I was scared not to trust. I was scared to lose the ONE thing I had left... Him. God would never give me more than I can handle, right? This week, you\u0027ll learn more about my proposal, wedding planning, and events leading up to the big day. We will uncover yet another Sugar Daddy, dissect the gambling more, and experience the worst abandonment up until this point in the story. You\u0027ll also begin to understand his explanation behind leaving, followed by our plan to fix the core problem. Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music \u0026 Sound Production: Ashley England Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-10-31T04:55:45Z",
      "duration": "01:22:38.4230000",
      "explicit": true,
      "spotifyId": "3URQc3VE7sh7ZUvMTpVtJR",
      "appleId": 1000632393600,
      "youTubeId": "zBoDCE-1hPA",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3URQc3VE7sh7ZUvMTpVtJR",
        "apple": "https://podcasts.apple.com/podcast/electric-daisy-abandonment/id1707714917?i=1000632393600",
        "youtube": "https://www.youtube.com/watch?v=zBoDCE-1hPA"
      }
    },
    {
      "id": "80cffd9a-1447-448d-a59c-dcaffaffddac",
      "title": "Q\u0026A Surprise!",
      "description": "Dear Diary and Listeners, Surprise! I had fun answering all your questions. Can’t wait for Tuesday! See you there, Amanda WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music \u0026 Sound Production: Ashley England Patreon: The Dichotomy Diaries YouTube: Video Recordings of Episodes! Merch: The Dichotomy Diaries Podcast Storefront Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-10-28T11:51:23Z",
      "duration": "00:59:16.3900000",
      "explicit": true,
      "spotifyId": "2Q53YLk6fMlXcKiA7KoSiK",
      "appleId": 1000632922691,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Q53YLk6fMlXcKiA7KoSiK",
        "apple": "https://podcasts.apple.com/podcast/q-a-surprise/id1707714917?i=1000632922691"
      }
    },
    {
      "id": "5c095dfa-df38-426a-aa8f-f12d8680da16",
      "title": "Shroom Things \u0026 Wedding Rings",
      "description": "Dear Diary \u0026 Listeners, I had a profound realization this week. It\u0027s easy to view all that has happened as a loss. A devastating, painful loss. Recounting my relentless effort and hope left me with this overwhelming feeling of emptiness. How could I have given and given with absolutely nothing in return? Why did he never feel or notice how hard I was trying to love him? Was I actually loving him? And then it clicked. Sometimes, the way we learn the true meaning of Unconditional Love- is by experiencing the pain of its absence. This wasn\u0027t one big L. My Try, My Consistency, My Persistence...it was all unconditional, always. This week you will start to see Dick\u0027s true colors start to emerge. Lies wrapped in manipulation presenting themself as love are sprinkled all over this episode. You\u0027ll meet a few Sugar Daddies, Our Bishop, and find yourself front row to the epic way Dick proposed... Forever Speaking My Truth, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music \u0026 Sound Production: Ashley England Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiariesPodcast TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-10-17T04:30:00Z",
      "duration": "01:24:07.6660000",
      "explicit": true,
      "spotifyId": "3XPKvhAgqRMCNfdoTyvvZg",
      "appleId": 1000631560599,
      "youTubeId": "OPgkpLd_KgQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XPKvhAgqRMCNfdoTyvvZg",
        "apple": "https://podcasts.apple.com/podcast/shroom-things-wedding-rings/id1707714917?i=1000631560599",
        "youtube": "https://www.youtube.com/watch?v=OPgkpLd_KgQ"
      }
    },
    {
      "id": "d17ad5c5-1293-40e6-a3a7-135eb6c0ac9e",
      "title": "S1:E1 - The Sin City Serpent",
      "description": "Want the SCOOP \u0026 UNEDITED Visual Timeline for ALL The Dichotomy Diaries Episodes AND MORE?... Click below. You won\u0027t want to miss how Season One ENDS... PATREON IS LIVE!!! and MERCH IS LIVE!!! Dear Diary (\u0026 Listeners), There is nothing more difficult than losing a loved one. The pain one experiences when they can no longer hug, kiss, smell, confide in, and share life with a loved one is unlike any other. Imagine experiencing this pain abruptly. There\u0027s just one difference, your loved one isn\u0027t dead. They ran away, entirely aware of the pain they knew this would cause you. How does one manage the stages of grief and the confusion intertwined in such a malicious act- at the hands of someone they trusted? It\u0027s fucking hard, but it is possible. I am proof. This inaugural episode of The Dichotomy Diaries is called The Sin City Serpent. You will relive with me; meeting the Mormon/Latter Day Saint (LDS) man I married. We will dive into the spiraling, dark world where his career choice lived. You will experience the love-bombing, narcissistic tendencies, and financial abuse and manipulation first hand. Together we will dissect how deep trauma bonds are formed. And how trauma responses can look different for everyone. You may find yourself, like me- asking these questions... Why does she offer love to those who treat her so poorly? Why does she exhaust herself for the sake of others\u0027 comfort? Why does she anchor her \u0022home\u0022 in another person rather than within herself? These questions and more will be answered throughout Season One. If you\u0027re looking for \u0022The Tea\u0022, you have come to the right place. Every episode released will get you closer and closer to the center of what just might be, the cruelest love scam of all time. Stay tuned for surprise BONUS episodes featuring special guests and the highly anticipated upcoming episodes featuring the NINE WOMEN who DICK got to first; and how all of this was unknown, until now. If you\u0027re looking for an amazing story on True Crime, Narcissistic Abuse, Emotional Abuse, Financial Abuse, Manipulation, Sex Work, and Spiritual Abuse. You\u0027re in the right place. Brace yourself, this is just beginning. With Truth, Courage, and Pain, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music \u0026 Sound Production: Ashley England Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiaries TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-10-10T04:30:00Z",
      "duration": "01:34:09.5020000",
      "explicit": true,
      "spotifyId": "0xcSV0LD3abCAzchbl9P1f",
      "appleId": 1000630781112,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0xcSV0LD3abCAzchbl9P1f",
        "apple": "https://podcasts.apple.com/podcast/s1-e1-the-sin-city-serpent/id1707714917?i=1000630781112"
      }
    }
  ]
}