{
  "id": "1027a6bf-2bf2-49e8-bce7-1629d0baacde",
  "name": "The FBI Files",
  "youTubeChannelId": "UCwxod2w5NT4qMWfMgZivCYQ",
  "episodes": [
    {
      "id": "c0a4c591-dfa6-4b8e-b4f8-76b0fbdca16e",
      "title": "80s Florida Gangs \u0026 Cults | TRIPLE EPISODE | The FBI Files",
      "description": "Temple of Fear: (S03E10) In the early 1980s, the decapitation of a young African-American male led the Miami-Dade police department and the FBI along a trail of murder.  Investigators quickly discovered that the victim was a dissident member of a religious sect headed by a man calling himself Yahweh ben Yahweh, or God, Son of God.  Although the FBI believed Yahweh ben Yahweh and his followers were responsible for many murders, they could find no direct evidence linking them to the crimes.  Agents knew they had but one recourse: to convince one of the cult leader’s fanatical followers to betray a man he considered a god.\n\nDeadly Threat: (S04E11) In the late 80’s, Florida’s cocaine imports were among the highest in the nation.  Regional territories were enforced with intimidation and murder.  Desperate to stop the violence, local authorities turned to the FBI for help. One dealer bowed to no one.  He would stop at nothing to keep detectives and agents from building a case against him.  When his organization began targeting the government itself, a city went on high alert.  Bringing him down would take the combined efforts of the police, the DEA, and the FBI.\n\nDeadly Influence: (S05E18) Amid the cocaine wars of early 1980’s Miami, three dead bodies led a multi-agency tactical squad to suspect that a group of cops might be involved in illegal drug busts.   Investigating rumors of corruption, the squad uncovered a ring of patrolmen who were making millions by ripping off smuggled cocaine.  The investigators set out to prove that even with the advantages wealth and the protection of a police badge, nobody is above the law. \n\nUnravel the mystery alongside the FBI\u0027s greatest law enforcers and forensic scientists.\n\n#TheFBIFiles #TrueCrime #gangs\n\nThe FBI Files is an American docudrama that takes a look behind the scenes of the Federal Bureau of Investigation\u0027s crime laboratory.\n\nReal FBI cases are recounted through reenactments and interviews, due to the sensitive nature of the show, viewer discretion is advised.",
      "release": "2024-07-12T13:00:22Z",
      "duration": "02:31:03",
      "explicit": false,
      "youTubeId": "LLwUwnFOTQY",
      "subjects": [
        "Nation of Yahweh",
        "Black Hebrew Israelites"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LLwUwnFOTQY"
      }
    }
  ]
}