{
  "id": "92fb4f77-68e6-4247-b1ee-7a95dcbfb424",
  "name": "The Mirror",
  "youTubeChannelId": "UC3EmxrWVl7K8xBH_UVIWY4Q",
  "episodes": [
    {
      "id": "7269eb6d-9cda-4f73-8f47-5b43b98241be",
      "title": "Billionaire Les Wexner’s lawyer caught THREATENING him on mic during Epstein questioning",
      "description": "Les Wexner appeared before the U.S. House Oversight Committee yesterday. The billionaire founder of Victoria\u0027s Secret was questioned about his past relationship with Donald Trump and Jeffrey Epstein, and his knowledge of Epstein’s activities, including posing as a model scout for Victoria\u0027s Secret to engage with young women.\n\nDuring the deposition, his lawyer was caught on a hot mic threatening him over his lengthy answers, saying: ‘I will f****** kill you if you answer a question with more than five words\u0027. \n\nThe Mirror Facebook: http://facebook.com/dailymirror\nThe Mirror IG: http://instagram.com/dailymirror\nThe Mirror TikTok: https://www.tiktok.com/@dailymirror\nThe Mirror Twitter: http://twitter.com/DailyMirror\nThe Mirror Homepage:  https://www.mirror.co.uk\n\nSign up for our newsletters: https://www.mirror.co.uk/email\n\n#worldnews  #trump  #epsteinfiles",
      "release": "2026-02-20T15:00:24Z",
      "duration": "00:11:51",
      "explicit": false,
      "youTubeId": "7ptrjASRCBU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7ptrjASRCBU"
      }
    },
    {
      "id": "d18033f6-e655-439d-a9b0-2323a8d13360",
      "title": "Footage shows Police INVESTIGATING Andrew\u0027s Sandringham home as former Prince taken into custody",
      "description": "Police have arrested Andrew Mountbatten-Windsor at his temporary home on the Sandringham estate this morning on suspicion of misconduct in public office, Thames Valley Police has said. At least six unmarked cars with eight officers in plain clothes carrying police issue laptops were spotted driving into Wood Farm around 8am today - Andrew\u0027s 66th birthday.\n\nIt comes as the National Crime Agency (NCA) revealed it is supporting UK police forces investigating information in the Epstein files. The NCA said it is supporting police to “enable a full and independent assessment of the information released”. Thames Valley Police confirmed a man in his sixties from Norfolk was arrested on suspicion of misconduct in public office and is in police custody. Officers are carrying out searches at addresses in Berkshire and Norfolk.\n\nContinue reading...\nhttps://www.mirror.co.uk/news/royals/breaking-police-arrive-disgraced-andrews-36747284\n\nThe Mirror Facebook: http://facebook.com/dailymirror\nThe Mirror IG: http://instagram.com/dailymirror\nThe Mirror TikTok: https://www.tiktok.com/@dailymirror\nThe Mirror Twitter: http://twitter.com/DailyMirror\nThe Mirror Homepage:  https://www.mirror.co.uk\n\nSign up for our newsletters: https://www.mirror.co.uk/email\n\n#andrew epstein #breakingnews",
      "release": "2026-02-19T11:00:24Z",
      "duration": "00:01:26",
      "explicit": false,
      "youTubeId": "JvFahkDXcjY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JvFahkDXcjY"
      }
    },
    {
      "id": "34de7309-1971-40f3-a222-b1078f90673b",
      "title": "Howard Lutnick UNDER FIRE after revelations he continued to meet with Epstein AFTER guilty verdict",
      "description": "Howard Lutnick was grilled at the Senate Committee last week over his hazy timeline of relationship with convicted sex offender Jeffrey Epstein. \n\nLutnick previously claimed to have met Epstein in 2005, three years before the billionaire was convicted of child sex trafficking, and that he vowed to never see the predator again after he used a sexual innuendo that made him feel \u0022gross\u0022.\n\nHowever, nestled in the millions of documents released as part of the Epstein Files disclosure, there were curious emails that hinted at further meetings. One email, penned by Lutnick’s wife Allison and sent to Epstein’s assistant in December 2012, said: “We would love to join you for lunch.”\n\nTo read more: https://www.mirror.co.uk/news/us-news/donald-trump-tell-pal-howard-36714844\n\nThe Mirror Facebook: http://facebook.com/dailymirror\nThe Mirror IG: http://instagram.com/dailymirror\nThe Mirror TikTok: https://www.tiktok.com/@dailymirror\nThe Mirror Twitter: http://twitter.com/DailyMirror\nThe Mirror Homepage:  https://www.mirror.co.uk\n\nSign up for our newsletters: https://www.mirror.co.uk/email\n\n#epsteinfiles  #trump  #uspolitics",
      "release": "2026-02-17T20:00:08Z",
      "duration": "00:09:22",
      "explicit": false,
      "youTubeId": "B4q_reLB2rs",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=B4q_reLB2rs"
      }
    },
    {
      "id": "1784f779-abca-4cce-b97c-6ada8618def9",
      "title": "EXCLUSIVE: William wanted Andrew REMOVED from Royal fold immediately after Epstein scandal",
      "description": "Prince William demanded his disgraced uncle Andrew be immediately banished from the royal fold “before the rot set in”, following revelations of the former Duke of York’s close relationship with Jeffrey Epstein.\n\nThe Prince of Wales appealed to his father and Queen Elizabeth II to take drastic action in the aftermath of Andrew’s catastrophic BBC Newsnight interview, where he failed to apologise for associating with the convicted paedophile or recognise the effect on Epstein’s victims. \n\nA new biography William and Catherine: The Intimate Inside Story, by by The Mirror\u0027s royal editor Russell Myers, reveals for the first time William’s firm stance on dealing with the disgraced former Duke of York, six years before he was finally exiled from public life by King Charles.\n\nDrawing on exclusive access to numerous palace insiders, the explosive book offers never-before-told context to about the biggest stories to have followed the Prince and Princess of Wales in recent years - including how William went against the late Queen and Chales who were in favour of protecting Andrew, prompting a furious reaction from his father who “put him in his place”. \n\nIn an exclusive four part serialisation in The Mirror starting today, this first joint biography of the Prince and Princess of Wales in more than a decade also highlights the couple’s resilience and dedication in the face of adversity, from the relentless media scrutiny and controversies of their 2022 Caribbean tour, to the shock cancer diagnoses of both the princess and King Charles. \n\nBehind the scenes\u0027 context of the prince and princess\u0027 reaction to the departure from royal life by the Duke and Duchess of Sussex, the forming of the ‘Cambridge way’ and the death of Queen Elizabeth II, is also revealed for the first time.\n\nThe Mirror Facebook: http://facebook.com/dailymirror\nThe Mirror IG: http://instagram.com/dailymirror\nThe Mirror TikTok: https://www.tiktok.com/@dailymirror\nThe Mirror Twitter: http://twitter.com/DailyMirror\nThe Mirror Homepage:  https://www.mirror.co.uk\n\nSign up for our newsletters: https://www.mirror.co.uk/email\n\n#royalfamily #princeandrew #princewilliam",
      "release": "2026-02-13T19:00:13Z",
      "duration": "00:03:56",
      "explicit": false,
      "youTubeId": "FjG1om4mIXo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FjG1om4mIXo"
      }
    },
    {
      "id": "b3690823-ef6a-41f7-bf07-09668a497d66",
      "title": "Ghislaine Maxwell REFUSES to answer any questions in US congress in a desperate bid for Trump pardon",
      "description": "Ghislaine Maxwell, Jeffrey Epstein’s convicted associate, refused to answer questions during a closed-door virtual deposition with the US House Oversight Committee from a Texas prison, where she is serving a 20-year sex trafficking sentence.\n\nThe Mirror Facebook: http://facebook.com/dailymirror\nThe Mirror IG: http://instagram.com/dailymirror\nThe Mirror TikTok: https://www.tiktok.com/@dailymirror\nThe Mirror Twitter: http://twitter.com/DailyMirror\nThe Mirror Homepage:  https://www.mirror.co.uk\n\nSign up for our newsletters: https://www.mirror.co.uk/email\n\n#epsteinfiles  #uscongress  #worldnews",
      "release": "2026-02-10T08:54:57Z",
      "duration": "00:15:23",
      "explicit": false,
      "youTubeId": "42wr5kcvbbY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=42wr5kcvbbY"
      }
    },
    {
      "id": "c0726e2d-99e4-429e-85ee-52f970c1d5fb",
      "title": "Congressman RIPS into Andrew and Mandelson after Ghislaine Maxwell PLEADS for clemency from Trump",
      "description": "Democratic Congressman Ro Khanna has ripped into the Royal Family and British politics after Ghislaine Maxwell refused to answer questions on the Epstein Files to the House Oversight Committee. \n\nThe Mirror Facebook: http://facebook.com/dailymirror\nThe Mirror IG: http://instagram.com/dailymirror\nThe Mirror TikTok: https://www.tiktok.com/@dailymirror\nThe Mirror Twitter: http://twitter.com/DailyMirror\nThe Mirror Homepage:  https://www.mirror.co.uk\n\nSign up for our newsletters: https://www.mirror.co.uk/email\n\n#ghislainemaxwell #epsteinfiles #mandelson #princeandrew",
      "release": "2026-02-09T20:00:21Z",
      "duration": "00:04:52",
      "explicit": false,
      "youTubeId": "UcI6VWAbhb8",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UcI6VWAbhb8"
      }
    },
    {
      "id": "e1534f41-aa99-4489-b41b-febac946319a",
      "title": "EXPOSED: Inside the \u0027Freemason cover-up\u0027 that let paedo cop walk free",
      "description": "A survivor of child sexual abuse has accused the Metropolitan Police of failing to bring a paedophile detective to justice, alleging he was protected because of Freemason links. John Hudson, a former Met detective sergeant, abused Marina Narayan from the age of six after fostering her as a baby. Despite being reported to police on three occasions, Hudson was never charged.\n\nThe case was uncovered by the Shirley Oaks Survivors Association and has renewed scrutiny of Freemasonry within policing. Relatives claimed Hudson was a Freemason and boasted of being tipped off by colleagues during investigations. Marina, now 60, has waived her anonymity to highlight what she says is a long-standing culture of secrecy and protection that denied victims justice.\n\nHer comments follow Met Commissioner Sir Mark Rowley’s decision to require officers to declare Freemasonry membership, after intelligence suggested secret networks may have influenced misconduct cases. The Met accepts Hudson was never prosecuted and says the allegations underline the need for greater transparency and accountability.\n\nThe Mirror Facebook: http://facebook.com/dailymirror\nThe Mirror IG: http://instagram.com/dailymirror\nThe Mirror TikTok: https://www.tiktok.com/@dailymirror\nThe Mirror Twitter: http://twitter.com/DailyMirror\nThe Mirror Homepage:  https://www.mirror.co.uk\n\nSign up for our newsletters: https://www.mirror.co.uk/email\n\n#metpolice #crime #freemasons",
      "release": "2026-02-08T17:00:27Z",
      "duration": "00:10:32",
      "explicit": false,
      "youTubeId": "MDyHe7YEoNE",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MDyHe7YEoNE"
      }
    },
    {
      "id": "3310154c-a8ab-436d-8faa-2dbc5d717c55",
      "title": "Mandelson gave Epstein tip off of €500Bbn BAILOUT and Gordon Brown resignation new files claim",
      "description": "Labour veteran Peter Mandelson is stepping down from the House of Lords after facing a fresh wave of fury over his links to Jeffrey Epstein.\n\nAnnouncing the move, the Speaker of the Lords told peers today: \u0022Given the public interest and for the convenience of the House, I\u0027ve decided to inform the House that the clerk of the Parliaments has today received notification from Lord Mandelson of his intention to retire from the House, effective from February 4. I will formally notify this to the house tomorrow in the usual way.\u0022\n\nThe Mirror Facebook: http://facebook.com/dailymirror\nThe Mirror IG: http://instagram.com/dailymirror\nThe Mirror TikTok: https://www.tiktok.com/@dailymirror\nThe Mirror Twitter: http://twitter.com/DailyMirror\nThe Mirror Homepage:  https://www.mirror.co.uk\n\nSign up for our newsletters: https://www.mirror.co.uk/email\n\n#TheMirror #News #Politics",
      "release": "2026-02-03T16:30:32Z",
      "duration": "00:03:47",
      "explicit": false,
      "youTubeId": "ow0cK6r7UR0",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ow0cK6r7UR0"
      }
    }
  ]
}