{
  "_ts": 0,
  "id": "d3255d2e-d799-4577-ae4b-2dc81f90eac2",
  "name": "The Dichotomy Diaries Podcast",
  "spotifyId": "59rymoKFD9jyhYftSSfKNz",
  "appleId": 1707714917,
  "episodes": [
    {
      "id": "d17ad5c5-1293-40e6-a3a7-135eb6c0ac9e",
      "title": "S1:E1 - The Sin City Serpent",
      "description": "Want the SCOOP \u0026 UNEDITED Visual Timeline for ALL The Dichotomy Diaries Episodes AND MORE?... Click below. You won\u0027t want to miss how Season One ENDS... PATREON IS LIVE!!! and MERCH IS LIVE!!! Dear Diary (\u0026 Listeners), There is nothing more difficult than losing a loved one. The pain one experiences when they can no longer hug, kiss, smell, confide in, and share life with a loved one is unlike any other. Imagine experiencing this pain abruptly. There\u0027s just one difference, your loved one isn\u0027t dead. They ran away, entirely aware of the pain they knew this would cause you. How does one manage the stages of grief and the confusion intertwined in such a malicious act- at the hands of someone they trusted? It\u0027s fucking hard, but it is possible. I am proof. This inaugural episode of The Dichotomy Diaries is called The Sin City Serpent. You will relive with me; meeting the Mormon/Latter Day Saint (LDS) man I married. We will dive into the spiraling, dark world where his career choice lived. You will experience the love-bombing, narcissistic tendencies, and financial abuse and manipulation first hand. Together we will dissect how deep trauma bonds are formed. And how trauma responses can look different for everyone. You may find yourself, like me- asking these questions... Why does she offer love to those who treat her so poorly? Why does she exhaust herself for the sake of others\u0027 comfort? Why does she anchor her \u0022home\u0022 in another person rather than within herself? These questions and more will be answered throughout Season One. If you\u0027re looking for \u0022The Tea\u0022, you have come to the right place. Every episode released will get you closer and closer to the center of what just might be, the cruelest love scam of all time. Stay tuned for surprise BONUS episodes featuring special guests and the highly anticipated upcoming episodes featuring the NINE WOMEN who DICK got to first; and how all of this was unknown, until now. If you\u0027re looking for an amazing story on True Crime, Narcissistic Abuse, Emotional Abuse, Financial Abuse, Manipulation, Sex Work, and Spiritual Abuse. You\u0027re in the right place. Brace yourself, this is just beginning. With Truth, Courage, and Pain, Amanda Arnier, MLS WE ARE ACTIVELY LOOKING FOR SEASON TWO\u0027S STORY! If you or anyone you know has experienced anything similar and is willing to share, please click the link below to schedule a time to chat with me. Season Two Story Pitch Call Email: TheDichotomyDiaries@yahoo.com Music \u0026 Sound Production: Ashley England Patreon: The Dichotomy Diaries Merch: The Dichotomy Diaries Podcast Storefront YouTube: Video Recordings of Episodes! Podcast Website: www.TheDichotomyDiaries.com Insta: @TheDichotomyDiaries TikTok: @TheDichotomyDiaries Facebook: The Dichotomy Diaries",
      "release": "2023-10-10T04:30:00Z",
      "duration": "01:34:09.5020000",
      "explicit": true,
      "spotifyId": "0xcSV0LD3abCAzchbl9P1f",
      "appleId": 1000630781112,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0xcSV0LD3abCAzchbl9P1f",
        "apple": "https://podcasts.apple.com/podcast/s1-e1-the-sin-city-serpent/id1707714917?i=1000630781112"
      }
    }
  ]
}