{
  "_ts": 0,
  "id": "0fd46880-c77f-4c77-ae9b-f75a4ec35788",
  "name": "The Sarah Fraser Show",
  "spotifyId": "3J6pQAP70RgtLLgWwiXbJm",
  "appleId": 1064651383,
  "youTubeChannelId": "UCM8m3IwaQutr5tZnGGzSKog",
  "episodes": [
    {
      "id": "7ca9a164-f2c2-448a-8356-727303898cbc",
      "title": "INTERVIEW: Ben Brown (Kody Brown’s Nephew) Talks Being Raised In A Cult, Advice For The Sister Wives, And His Famous Brown Cousins. Wednesday, October 30th, 2024 | Sarah Fraser",
      "description": "I had an engaging conversation with Ben Brown, a comedian and TikTok star known for his candid takes on his upbringing in a polygamous family, being a nephew of Kody Brown from the Sister Wives franchise. Ben discussed the challenges of growing up poor in a polygamous household governed by strict beliefs, the complexities of family dynamics, and the misconceptions surrounding polygamy. Plus, does he stay in touch with Kody Brown and his cousins. Ben offers Janelle, Meri, and Christine advice now that they’re free, talks TLC and profiting off children, Garrison’s passing, and more. Timestamps: 00:00:00 - Introduction to Ben Brown 00:10:00 - History of Mormonism, Brown family history, when Kody and his dad became polygamists. 00:29:00 - Ben chats mormonism as a cult, Janelle’s mom marrying his grandmother, child abuse and more 00:35::00 - Does he stay in touch with Kody and his cousins, Ben slams TLC, and gives advice for Janelle, Meri, and Christine Live Virtual Podcast Halloween Edition! VIP ticket, Q\u0026A, Halloween costume contest! https://www.eventbrite.com/e/q-a-with-david-yontef-sarah-fraser-halloween-costume-party-edition-tickets-1006324021237?aff=oddtdtcreator Show is sponsored by: Amazfit.com/tsfs a wearable band to help you focus on health and wellness that looks sexy and cute! Get 15% OFF when you use code TSFS Article.com/tsfs for $50 OFF your purchase of $100 or more. Gorgeous furniture, garden, and home decor products that are built to last Field Of Greens use promo code TSFS get 15% OFF your order and FREE rush shipping Honey Play Box adult toys for everyone! Use code TSFS for 20% OFF your order Horizonfibroids.com get rid of those nasty fibroids Nutrafol.com use code TSFS for FREE shipping and $10 off your subscription Oneskin.co use code TSFS for 15% OFF your fabulous order Quince.com/tsfs for FREE shipping on your order and 365 day returns Taskrabbit.com use promo code TSFS at checkout for 15%. Book taskrabbit for trusted help or home tasks Timeline Nutrition is offering 10% off your first order of mitopure. Go to timeline.com/tsfs Follow me on Instagram/Tiktok: @thesarahfrasershow ***Visit our Sub-Reddit: reddit.com/r/thesarahfrasershow for ALL things The Sarah Fraser Show!!!*** **Check out some of my FAVORITE things on Amazon Marketplace - especially if you\u0027re looking to get geared-up to start your own Podcast!!!** https://www.amazon.com/shop/thesarahfrasershow Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-10-30T13:18:00Z",
      "duration": "01:43:02.5820000",
      "explicit": true,
      "spotifyId": "2JFH1ir0HhhZFgKzLppPAV",
      "appleId": 1000675011555,
      "youTubeId": "rGMZQS66Rng",
      "subjects": [
        "Apostolic United Brethren"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2JFH1ir0HhhZFgKzLppPAV",
        "apple": "https://podcasts.apple.com/podcast/interview-ben-brown-kody-browns-nephew-talks-being/id1064651383?i=1000675011555",
        "youtube": "https://www.youtube.com/watch?v=rGMZQS66Rng"
      }
    }
  ]
}