{
  "id": "f67b6d73-c84d-4d3b-a4c7-dc5e71a544ee",
  "name": "The Bunker",
  "spotifyId": "1g7XYt7lI0XNVZ4Ze8mDau",
  "appleId": 1496246490,
  "episodes": [
    {
      "id": "8e2c0331-b032-467d-ae43-24a92aa79ae7",
      "title": "Bunker USA: Living on a prayer – How false prophets are launching cults across America",
      "description": "Tell us what you think of The Bunker in our Listener Survey – five respondents will get the Bunker mug or t-shirt of their choice. As religious fanatics surge to megachurches across the United States, how do those in charge garner such cult-like devotion? Inspiring total obedience from their followers, some have even made supporters abandon families to support their religious pursuits. How do these groups form, and what about the U.S culture makes them thrive? Adam Morris, author of American Messiahs: False Prophets Of A Damned Nation, joins Dr Seth Thévoz in the Bunker. American Messiahs Book Link • “Messiah’s offer members salvation from the here and now, they see the established religions as offering no comfort.” – Adam Morris • “These types of figures are uniquely amenable to the U.S, due to the societal structure, migrant population etc.” – Adam Morris • “Obedience to the leader is important, but also an obedience to the movement is necessary in these quasi-communist communes.” – Adam Morris www.patreon.com/bunkercast   Written and presented by Seth Thévoz. Produced by: Adam Wright. Audio Editor: Simon Williams. Managing editor: Jacob Jarvis. Music by Kenny Dickinson. Group Editor: Andrew Harrison. THE BUNKER is a Podmasters Production Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-11-18T00:00:00",
      "duration": "00:22:52.7080000",
      "explicit": false,
      "spotifyId": "5KhNhxojsdBEj63BotbZJE",
      "appleId": 1000635179484,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KhNhxojsdBEj63BotbZJE",
        "apple": "https://podcasts.apple.com/podcast/bunker-usa-living-on-a-prayer-how-false-prophets/id1496246490?i=1000635179484"
      }
    }
  ]
}