{
  "id": "62e5742e-6cea-4460-8140-e694d363e188",
  "name": "The Bravo Investigator Podcast",
  "spotifyId": "51vAQHGv8i0Q8H2G8hDlIS",
  "appleId": 1723539749,
  "episodes": [
    {
      "id": "664167b8-119f-4880-a881-28f0619e2442",
      "title": "The Cult of The Real Housewife: Thoughts and Feels",
      "description": "Hello Bravo Bosses!\n\nIn this episode, we dive deep into TLC’s explosive three-part documentary The Cult of the Real Housewife, which peels back the headlines and goes behind the scenes of the controversial life of Real Housewives of Salt Lake City star Mary Cosby and the church she leads. Over three gripping installments, the series traces the rise of Faith Temple Pentecostal Church — from its founding by Mary’s grandmother to a controversial transfer of leadership that sparked serious allegations of spiritual and financial misconduct.\nWe’ll break down the most talked-about moments: testimonies from former congregants and family members who describe pressure, manipulation, and coercive giving; the puzzling marriage between Mary and her step-grandfather, Robert Cosby Sr.; and expert insight into the tactics often associated with high-control groups.\n\nWhether you watched the docuseries on TLC, streamed it afterward, or just caught the headlines, we’ll unpack what it all means — from cult allegations and leaked audio to how this story reshapes the narrative around one of reality TV’s most enigmatic personalities. Tune in for analysis, reactions, and what this documentary might signal for Mary’s future in the spotlight.\n\nLove you BBs!\n\nJoin the Patreon for $5 a month to get 4 extra episodes a month! ad free episodes! early episodes! and bonus content! Join the fun at patreon.com/thebravoinvestigatorpodcast\n\nSubscribe to my new YouTube Channel!\n\nFollow me on ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠Instagram⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠\n\nFollow me on ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠Tik Tok⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠\n\nFollow me on ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠Threads⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠\n\nJoin my Facebook Group\n\nNOTE: No claims have been verified and all information today is alleged, speculation, and is intended purely just for fun.\n\n Hosted by Simplecast, an AdsWizz company. See pcm.adswizz.com for information about our collection and use of personal data for advertising.",
      "release": "2026-01-03T01:14:00Z",
      "duration": "01:00:26",
      "explicit": false,
      "spotifyId": "45jrG5nUA77SzU6VXCKh8U",
      "appleId": 1000743576317,
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/45jrG5nUA77SzU6VXCKh8U",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-the-real-housewife-thoughts-and-feels/id1723539749?i=1000743576317"
      }
    }
  ]
}