{
  "_ts": 0,
  "id": "c113e9f6-8206-47cd-ae9a-016060f3d65a",
  "name": "The Texas Goat Radio Show",
  "youTubeChannelId": "UC_9Qf-WmrFEBnvdFyJ98oJw",
  "episodes": [
    {
      "id": "58a848fb-3d6b-433b-b0d4-ce2da2fb8c05",
      "title": "Dark Triad Ch. 1 Just a Comedian - Introduction to Owen Benjamin",
      "description": "This video is to be considered a transformative work according to fair use in copywrite law. \n\nThe Texas Goat Radio Show does not support bullying of any kind towards anyone. All statements made by Texas Goat Radio are entirely opinions of TGR.  \n\n#truecrimecommunity #cultleader #beartariatimes #texasgoatradio\n\nWhen I first started this video, I was not considering that Owen was on a promotional tour for his new comedy special \u0022Must Be Nice\u0022. I did not consider the disgusting factor that so many people would give Owen Benjamin a platform without even questioning the blatant video and audio evidence that proves Owen Benjamin is not who and what he claims to be while on this tour. So, I shifted from my original vision of what would be called an outlined documentary to what you see here. I will go back to that vision for the chapters that follow. \n\nChapter 2 \u0022In Tents\u0022\n\nChapter 3 \u0022The Storm of Accountability\u0022\n\nI will ask that you specifically share this video in order to get the attention of those I address within this video to appeal to them to look closer at Owen Benjamin and his dangerous and predatorial ways. Some of those people are Tower Gang, Jake Shields, The Red Headed Libertarian, James Delingpole, Adam Green, and Nick Di Paulo. I will add that I am saying this to them out of respect. If I was them and I didn\u0027t know I would like someone to point it out. \n\nThe comment section will obviously be left open for dialog about the subject matter as well as positive or negative feedback to this video.  I do ask to keep it civilized..  \n\nI want to thank Milker Nation, Owen Benjamin Subreddit, Liz and the many others that do their part in revealing the true nature of the dangerous predatorial cult leader Owen Benjamin. \n\nThank you for watching. \n\nPlease like, subscribe, comment and share. \n\nI appreciate you. \n\nThank you. \n\nP.S. Take off those \u0022Bear Goggles\u0022\n\nThere are two songs. \nPiano cinematic - syafeea library\nYou - As D",
      "release": "2024-10-30T17:57:00Z",
      "duration": "00:44:14",
      "explicit": false,
      "youTubeId": "KOQFNXVLNhQ",
      "subjects": [
        "Owen Benjamin"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KOQFNXVLNhQ"
      }
    },
    {
      "id": "d442c2a9-4e4b-4c21-a8c0-9e94e668932d",
      "title": "TEASER: OWEN BENJAMIN Doc Yew Men Tary by TGR",
      "description": "Owen Benjamin is a dangerous predatorial cult leader who ran an investment scam in 2020 during the worldwide pandemic.  This channel and its contents are to bring awareness to the nature of cults and what to look for. This video and channel are for educational and entertainment purposes only. The Texas Goat Radio Show does not encourage bullying of any kind. Any and all material found in this live stream and channel is considered fair use and the commentary is considered a transformative work.\n\nA work is considered transformative if it\u0027s used in a new way or for a new purpose than the original work. This can include using a work to criticize or comment on the original, or to incorporate it into a new work with a different meaning or utility. \n\nLet\u0027s Talk!",
      "release": "2024-10-20T06:25:16Z",
      "duration": "00:03:04",
      "explicit": false,
      "youTubeId": "9KdxCmVUSGI",
      "subjects": [
        "Owen Benjamin"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9KdxCmVUSGI"
      }
    }
  ]
}