{
  "id": "9a48eac7-ddb2-4aa3-93fd-dc1bbb98dcd8",
  "name": "The Jordan Harbinger Show",
  "spotifyId": "5RVoEOIACQbBDZnGBJ7Ec2",
  "appleId": 1344999619,
  "episodes": [
    {
      "id": "e92ebd53-5023-48a8-bf8a-d20010256135",
      "title": "823: Daniella Mestyanek Young | How to Disengage from a Lifelong Cult",
      "description": "Daniella Mestyanek Young (@daniellamyoung) is a survivor of the religious Children of God cult, a US Army combat veteran, an extremely advanced knitter, and the author of Uncultured: A Memoir. What We Discuss with Daniella Mestyanek Young:  How the seemingly wholesome Children of God (later known by variations of \u0022The Family\u0022) religious group centered around love, faith, and Jesus — and packaged to appeal to impressionable countercultural hippie types of the day — veered into true cult territory under the direction of its leader, David Berg. How female followers of Children of God were encouraged to use their bodies and sexuality to gain converts and money in a practice known as \u0022flirty flashing.\u0022 How child sexual abuse became a commonplace Children of God practice in an effort to raise \u0022sexually liberated\u0022 children. What this cult and others do to cultivate credibility — and raise funds — among its followers and the outside world. The toll that life in a cult takes on those who are lucky enough to exit. And much more...  Full show notes and resources can be found here: jordanharbinger.com/823  This Episode Is Brought To You By Our Fine Sponsors: jordanharbinger.com/deals  Sign up for Six-Minute Networking — our free networking and relationship development mini course — at jordanharbinger.com/course!  Like this show? Please leave us a review here — even one sentence helps! Consider including your Twitter handle so we can thank you personally!",
      "release": "2023-04-11T00:00:00",
      "duration": "01:35:42.9150000",
      "explicit": false,
      "spotifyId": "7CmAGCrMAAfnwrmIhOwffg",
      "appleId": 1000608334904,
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7CmAGCrMAAfnwrmIhOwffg",
        "apple": "https://podcasts.apple.com/podcast/823-daniella-mestyanek-young-how-to-disengage-from/id1344999619?i=1000608334904"
      }
    }
  ]
}