{
  "id": "ce611878-6e34-413e-a9f2-083cf8ac71cc",
  "name": "The Lucie Beatrix Podcast",
  "spotifyId": "1Av1Fi7L6N9M9jMAHkwEpe",
  "appleId": 1451893225,
  "youTubeChannelId": "UCQPLnkGJtqJ3Xipj0KKu1bw",
  "episodes": [
    {
      "id": "76d2cb2b-1b9f-4cbd-b565-d36ef737440d",
      "title": "How A Yoga Cult, Saving 50 Cents, And Stair-climbing 400\u002B Floors A Day Built A Lifelong Friendship",
      "description": "A friendship that started with a shy hello after yoga turned into a decade-plus of bridge walks, bodega quests, and a shared obsession with doing hard things well. We pull back the curtain on how two self-described lone wolves built chosen family in New York—first through daily practice, then through the scrappy reality of making rent, and now through a strangely joyful sport most people only touch for ten minutes: the stair climber.\n\nYou’ll hear how our rituals evolved from pre-Instagram yoga marathons to epic weekend walks and, eventually, to quantifiable stair benchmarks: the 400-floor club, 420 club, and a recent leap to 450 floors per hour. We break down why intensity beats endless volume, how momentum can make rest days backfire for some, and why an honest hour of focused effort can anchor an entire day. Beyond metrics, the heart of the story is mental health—how training quiets anxiety, strengthens self-trust, and shifts the tone of everything that follows.\n\nWe also get candid about fueling: raw-fruit eras, sardine emergencies, tofu salvation, and the practical truth that protein can be a game changer when you want power without the crash. Expect real talk on cortisol, recovery, and the double standard where men “biohack” while women get labeled for the same choices. Along the way, we reflect on leaving New York and returning, the third places that hold us together, and a city that still lets you belong without a resume or a brand.\n\nIf you care about sustainable performance, NYC life, or the craft of building a day that actually feels good, this conversation is for you. Subscribe, share with a friend who needs a nudge to chase their 400-floor moment, and leave a review with your wildest frugal hack or training PR—we might read it on a future show.",
      "release": "2026-02-11T01:00:00Z",
      "duration": "01:00:21",
      "explicit": false,
      "spotifyId": "0l1t4X1iezccWWtvNqphKK",
      "appleId": 1000749166785,
      "youTubeId": "BaJWYTGG8P0",
      "subjects": [
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0l1t4X1iezccWWtvNqphKK",
        "apple": "https://podcasts.apple.com/podcast/how-a-yoga-cult-saving-50-cents-and-stair-climbing/id1451893225?i=1000749166785",
        "youtube": "https://www.youtube.com/watch?v=BaJWYTGG8P0"
      }
    }
  ]
}