{
  "_ts": 0,
  "id": "22c1cbab-9d7e-4de3-a98e-6705ac806957",
  "name": "The Mike Sea Podcast",
  "spotifyId": "2A4i3Su3PTQSc3y43kgnCw",
  "appleId": 1533341620,
  "youTubeChannelId": "UCY-ZIS_JBo9wEKUxWBFFBpw",
  "episodes": [
    {
      "id": "49f84b6a-53eb-42ac-a51f-05079246348e",
      "title": "A Former CULT MEMBER Shares Her Story",
      "description": "In this episode, host Mike Sea speaks to Isabella Young, a former messianic cult member. Isabella shares her personal story for the first time and gives a riveting account of the murder of her son, and the brainwashing she experienced under the rule of a cult. What started as a seemingly innocent relationship with a spiritual guru led to years of mental abuse and manipulation. Isabella shares her brave account of escaping this cult community and her healing journey from the trauma of the entire experience.\n\n★ TABLE OF CONTENTS ★\n0:00 Start\n2:40 How It All Started\n9:54 Arrival At The Ashram\n15:00 Tactics Of Cults\n22:06 Sexual Abuse And Manipulation\n30:20 Theological Teachings\n35:55 Punishments Of The Cult\n35:26 Common Problems In Marriages Today\n39:35 Marriages And Finances\n41:02 Cult Leader Gaslighting\n44:11 The Loss Of Isabella\u0027s Son\n50:21 Isabella\u0027s Breaking Point\n54:24 Custody Battle\n58:40 How To Leave A Cult\n\n\nShow notes:\n\nhttps://www.youtube.com/@feelingbetternaturally1099/videos\n\nDISCLAIMER:\nThe Mike Sea Podcast/Natural Man, LLC is intended as general information for educational purposes only and should not be construed as professional advice, assessment or a diagnosis of any kind or as a substitute for licensed treatment by a qualified professional. The information provided in this Podcast is not meant to replace the advice of or treatment by any licensed professional. Do not rely upon any information to replace consultations or advice received by a qualified professional regarding your own specific situation. If you suspect that you have a problem, you are urged to seek competent and qualified help and not to rely on the information presented in this podcast. The Mike Sea Podcast/Natural Man, LLC, and its representatives and agents disclaim any liability for any negative or other medical or other outcomes that may occur as a result of acting on or not acting on any information contained in the Podcast.\n\nThe views and opinions expressed by the Host and all guests are their own and their appearance on this Podcast and at the website of The Mike Sea Podcast does not imply an endorsement of them or any entity they represent and does not necessarily reflect the views and opinions of The Mike Sea Podcast/Natural Man, LLC.",
      "release": "2024-05-13T10:00:52Z",
      "duration": "01:10:26",
      "explicit": true,
      "spotifyId": "1zjzqcXgp44LCoCVytdq1m",
      "appleId": 1000655398439,
      "youTubeId": "sszJYkMGHuk",
      "subjects": [
        "Louix Dor Dempriey"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zjzqcXgp44LCoCVytdq1m",
        "apple": "https://podcasts.apple.com/podcast/a-fomer-cult-member-shares-her-story/id1533341620?i=1000655398439",
        "youtube": "https://www.youtube.com/watch?v=sszJYkMGHuk"
      }
    }
  ]
}