{
  "id": "d9e7fbe7-6f67-43d2-973c-1f05f6b5784f",
  "name": "The Connected Community: Exploring Possibility",
  "spotifyId": "2XuFQfGWnfcN3YEv7PM0uS",
  "appleId": 1700539413,
  "episodes": [
    {
      "id": "bab76b2e-5f90-44a6-85f8-489a529a721a",
      "title": "A Fighter’s Tale of Cults, Sex Trafficking, and Personal Reinvention",
      "description": "Trigger Warning: This podcast episode contains discussions of sensitive topics, including suicidal ideation and sex trafficking. Please proceed with caution and take care of yourself while listening.   In today\u0027s podcast episode, I had the privilege of interviewing Amanda Catarzi Hengst, a remarkable individual who has overcome immense challenges in her life. Amanda\u0027s parents were originally from an Italian circus family working within the Ringling Brothers Circus. They immigrated to America from Italy, hoping to provide Amanda with a better life. However, Amanda\u0027s journey took an unexpected turn when her parents became involved with the cult ATI (Advanced Training Institute) or IBLP (Institute of Basic Life Principles). Amanda\u0027s story is one of survival and resilience as she shares her experiences of growing up within the ATI/IBLP cult, an environment where young girls were matched with middle-aged men as brides and were groomed to be servants and “slaves” within this male dominated community. She also discusses her eventual escape from the cult and the harrowing experiences she faced as a victim of both sex trafficking and labor trafficking. Throughout her journey, Amanda also pursued her passion for MMA fighting, which unexpectedly provided her with a cover for the bruises and black eyes she sustained, as no one questioned them due to the nature of her sport. Despite the immense obstacles she faced, Amanda found the strength and courage to break free from the chains that bound her. Her story is a testament to the resilience of the human spirit and the power to overcome obstacles. Through her courage and determination, she not only overcame her own challenges but also became an advocate for change, empowering others who have faced similar hardships. Amanda\u0027s story serves as an inspiration to all, reminding us that no matter the difficulties we encounter, we have the inner strength to overcome them. By diving deep into her emotions, seeking healthy support systems, and engaging in therapy, Amanda was able to heal and create a brighter future for herself. Amanda\u0027s story is not just about the difficulties she faced; it is also about her unwavering determination to rise above them. After escaping her trafficker, Amanda dedicated the next 8 years of her life to combating sex trafficking. She counseled the New Zealand Government, helped draft federal anti-trafficking legislation, has gone undercover assisting law enforcement in busting trafficking rings, and worked tirelessly to save numerous victims from the clutches of this heinous crime. Her dedication and efforts in this field are inspiring. Today, Amanda is a successful high-ranking executive of three companies where she continues to create opportunities for others to build their dream life through smart investments and clear communication. Despite the immense obstacles Amanda faced, she never gave up on herself. Amanda\u0027s story serves as a reminder that no matter the challenges we face, we have the power to overcome and create a better future for ourselves. Her determination and resilience are a testament to the strength and power of the human spirit.   Connect with me: https://nickyYyoga.com https://www.youtube.com/@TheConnectedCommunity support@nickyYyoga.com   Connect with Amanda: www.instagram.com/amandacatarzi https://www.linkedin.com/in/amanda-catarzi/   Amanda’s companies: www.automationempire.com www.wholesaleautomationllc.com www.inkeryco.com   Resources: www.selahfreedom.com www.missingkids.org/home National Human Trafficking Hotline: 888-373-7888",
      "release": "2023-10-26T00:00:00",
      "duration": "00:57:03.4600000",
      "explicit": false,
      "spotifyId": "2wYjVphXhJDg9ugkX7FFKa",
      "appleId": 1000632687865,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2wYjVphXhJDg9ugkX7FFKa",
        "apple": "https://podcasts.apple.com/podcast/a-fighters-tale-of-cults-sex-trafficking/id1700539413?i=1000632687865"
      }
    }
  ]
}