{
  "_ts": 0,
  "id": "7e29b7a3-56d7-4bef-94a0-1aab70369cc6",
  "name": "The One Inside: An Internal Family Systems (IFS) podcast",
  "spotifyId": "5BDwvDhkdi625G3kOMc0CB",
  "appleId": 1460334766,
  "episodes": [
    {
      "id": "5fb6fd7c-35bf-4185-8638-d03eb841fe91",
      "title": "Align Your Mind with Britt Frank",
      "description": "Britt Frank escaped a cult, rebuilt her life after addiction, and is one of the most grounded, funny, and inspiring IFS speakers and educators around.\n In this week’s episode, we talk about her new book Align Your Mind, and how parts work helped her move from chaos to clarity.\n We get into all of it...motivation, procrastination, inner critics, cults, menopause, and what alignment looks like beyond the buzzwords.\n Britt shares how she uses parts language in her own life, how she reframes procrastination as protection, and why your most extreme parts might actually be your best coaches.\n She also opens up about what it’s like to come out of systems of control and begin to trust your own experience again. As Britt says, “Our parts don’t want us to feel better. They want us to feel safe.”\n If you’ve ever felt stuck or like your parts are pulling you in opposite directions, this conversation is for you.\n In this episode, we talk about:\n   What alignment really means (hint: it’s not a vibe)\n   How procrastination isn’t laziness; it’s a protective part trying to help\n   Why “Self Energy is not codependency in a pretty dress”\n   Reframing the inner critic as your best coach\n   What it means to “coach your parts like a team”\n   How parts work can reframe midlife and menopause as meaningful transitions\n   Parts work as a way to “rewrite the script” with compassion and clarity\n   Favorite Quote:\n  “I want to talk to the parts of you that are doing weird things and say, ‘You\u0027re not crazy. You\u0027re a person with an activated nervous system, and there\u0027s a reason why this is happening.’” – Britt Frank\n   \n Be sure to catch my extended interview with Britt over on  Substack, where she talks about her complicated relationship with \u0022hope\u0022 -- and what she reaches for instead.\n About Britt:\n Britt Frank, LCSWS, SEP, is an IFS Level 3 therapist, keynote speaker, and the author of The Science of Stuck and Align Your Mind. She’s trained in Internal Family Systems and Somatic Experiencing and is a contributing columnist to Psychology Today. Her work has been featured in Forbes, NPR, Fast Company, Psych Central, SELF, and Thrive Global.\n .\n Episode Sponsor: Life Architect\n ✨ Get access to 3 IFS webinars organized by Life Architect (featuring Einat Bronstein, Kay Gardner \u0026 Robert Falconer, and Ann Sinko) and receive a 30% discount on selected IFS workshops: https://lifearchitect.com/tammy/ ✨\n  \n About The One Inside: Check out The One Inside Substack community to access all episodes, exclusive extended interviews, meditations and exercises, and more. \n Find The One Inside Self-Led merch at The One Inside store\n Watch video clips from select episodes on  The One Inside on YouTube\n Follow Tammy on Instagram @ifstammy and on Facebook at The One Inside with Tammy Sollenberger.\n  Jeff Schrum co-produces The One Inside. He’s a writer and IFS Level 2 practitioner who specializes in helping therapists create with clarity and confidence.\n  Are you new to IFS or want a simple way to get to know yourself? Tammy\u0027s book, \u0022The One Inside: Thirty Days to your Authentic Self\u0022 is a PERFECT place to start. \n Sign up for Tammy\u0027s email list and get a free \u0022Get to know a Should part of you\u0022 meditation on her website\n  Tammy is grateful for Jack Reardon who created music for the podcast. \n  To learn more about sponsorship opportunties on The One Inside Podcast, email Tammy  ",
      "release": "2025-05-30T17:16:00Z",
      "duration": "00:42:00",
      "explicit": false,
      "spotifyId": "17TbjHwsC5DXDKG4lRajM1",
      "appleId": 1000710587477,
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/17TbjHwsC5DXDKG4lRajM1",
        "apple": "https://podcasts.apple.com/podcast/align-your-mind-with-britt-frank/id1460334766?i=1000710587477"
      }
    }
  ]
}