{
  "_ts": 0,
  "id": "5764ba9e-e1ba-4238-b0fa-f7c697a10c23",
  "name": "The Southern Star In The News Podcast",
  "spotifyId": "5QfR7KdlKwPYF872DxoX9q",
  "appleId": 1494107235,
  "episodes": [
    {
      "id": "01d34bcb-37f5-46ab-8d29-76ef0d799d5e",
      "title": "The Holocaust deniers on our doorstep",
      "description": "IN RECENT weeks we have seen some anti-aslyum seeker protests take place across the country, with far-right groups and beliefs seeming to take a more mainstream place in Irish culture in recent times.On today’s podcast we’ll focus on how some beliefs associated with far-right thinking may be closer to home in West Cork than you would imagine, and have been for some time now.The Southern Star\u0027s editor, Siobhán Cronin, joins us to speak about her visit to Auschwitz and a recent court case involving a human rights activist and the SSPX Resistance - a fringe religious group which broke away from mainstream Catholicism over its belief that the modern Church has become too liberal.Thanks for watching and listening to The Southern Star\u0027s In The News podcast. Please be sure to like, share and subscribe wherever you listen to your podcasts.Catch up with our previous episode, focusing on the rise and decline of fishing on Cape Clear, here.This podcast was produced and presented by Dylan Mangan and Siobhán Cronin.For more on this story pick up a copy of this week\u0027s Southern Star or subscribe online via www.southernstar.ie/epaper. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-01-17T00:00:00",
      "duration": "00:18:18.0570000",
      "explicit": false,
      "spotifyId": "5cQNownZoo6w18Erl1zKnB",
      "appleId": 1000594866567,
      "subjects": [
        "SSPX Resistance",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5cQNownZoo6w18Erl1zKnB",
        "apple": "https://podcasts.apple.com/podcast/the-holocaust-deniers-on-our-doorstep/id1494107235?i=1000594866567"
      }
    }
  ]
}