{
  "id": "e29f14c6-78c4-44aa-91ac-8931134adf75",
  "name": "The Financial Express",
  "youTubeChannelId": "UCmk6ZFMy1CT80orXca4tKew",
  "episodes": [
    {
      "id": "5aaa7021-7867-451a-8a82-ce2c9e5dc2c4",
      "title": "Jasmine Crockett Sparks Controversy With Comments on Jeffrey Epstein Files | US Senate Highlights",
      "description": "Rep. Jasmine Crockett ignited controversy after making pointed remarks about the release of files connected to Jeffrey Epstein. Her comments quickly drew strong reactions from both supporters and critics, intensifying the political debate surrounding transparency and accountability.\n\nThe renewed focus on Epstein-related documents has fueled broader questions about who may be named in the records and what further disclosures could reveal. As political tensions rise, Crockett’s statement has become a flashpoint in the ongoing fight over transparency and public trust.\n\nWatch the full clip and reaction breakdown.\n\n#JasmineCrockett #EpsteinFiles #USPolitics #pambondi #usnews #worldnews\n\nSubscribe to The Financial Express: https://bit.ly/2TN006o\n\nWelcome to The Financial Express, your trusted source for world affairs, geopolitics, business news, global economy updates, and market insights.\nConnect with us:\n\n📌 On this channel, we cover: \nGlobal news \u0026 geopolitics that impact world\nInternational markets, trade, and policies \nFinance news \u0026 global economy trends \nBusiness analysis on global companies \u0026 economies\n\nFrom breaking updates on the US, China, Europe, India, and beyond to deep dives into global markets, trade wars, and international relations, we simplify the most important stories shaping today’s world.\n\nAt The Financial Express, our goal is to keep you informed, empowered, and ahead in the fast-changing global landscape.\n\n🔔 Subscribe now for daily insights on world affairs, finance, business, and economy.\n\n#Finance #Economy #WorldNews #Geopolitics #StockMarket #GlobalEconomy #BusinessNews #MarketTrends #InternationalNews #TradeWar #GlobalAffairs #GlobalMarkets\n\nFacebook: https://www.facebook.com/thefinancialexpress\nTwitter: https://twitter.com/FinancialXpress\nWebsite: https://www.financialexpress.com/",
      "release": "2026-02-16T15:00:36Z",
      "duration": "00:06:11",
      "explicit": false,
      "youTubeId": "KDncyj-PM24",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KDncyj-PM24"
      }
    }
  ]
}