{
  "_ts": 0,
  "id": "9905fd40-3dff-4ae6-a44b-c831f0f08912",
  "name": "The Awakened Heart Collective",
  "youTubeChannelId": "UCFyQs-NXAxG54r6Q-Gz2aAg",
  "episodes": [
    {
      "id": "91f08833-dd8c-44db-8ef6-4e86d437fa89",
      "title": "From Cult to Freedom: Journey of Liberation, Healing, Resilience, and Awakening",
      "description": "Episode #98 This powerful episode, Isabella Young takes us through her remarkable journey from the grips of a cult to discovering freedom and healing through the transformative power of nature. She unpacks the dynamics of mind control, the profound importance of self-love, and the collective awakening happening in humanity today. Isabella sheds light on grounding practices like connecting with nature and sun gazing while exploring the critical role of women in the paradigm shift unfolding before us. \n\nHer path included pilgrimages, retreats, shamanic journeys, and eight years in a messianic cult as the wife of the “guru” who tragically took her son’s life. This heartbreaking loss freed her from brainwashing and propelled her relentless quest for healing, truth, and empowerment. Now thriving in Hawaii, Isabella enjoys the natural beauty of Kauai while dedicating her life to writing, growing food, and helping others awaken to their fullest potential.\n\nHer first book, “Putting on the Armor of God: A survival handbook for the Great Awakening and New Earth”, exposes the war on Humanity and what we can do to protect and empower ourselves. Her second book, “New Human of New Earth”, offers readers hundreds of natural medicines, body technologies, and spiritual technologies to optimize physical and mental health, expansion of consciousness, multidimensionality, and sovereignty.\n\nThis conversation dives deep into the battle against darkness, the significance of awareness, and the call to embody light and love in our everyday lives.\n\nTakeaways\n\n* Isabella\u0027s journey illustrates the power of resilience and healing.\n* Understanding mind control is crucial for personal liberation.\n* Nature plays a vital role in healing and self-discovery.\n* Sun gazing can enhance consciousness and well-being.\n* Grounding practices are essential for emotional balance.\n* Recognizing cult dynamics helps in overcoming manipulation.\n* The shift in human consciousness is a collective experience.\n* Women hold significant power in the current paradigm shift.\n* Self-love is essential for breaking free from toxic patterns.\n* Awareness and action are necessary to combat evil.\n\nSound Bites\n\u0022I had to love myself to break free.\u0022\n\u0022We are in a paradigm shift.\u0022\n\u0022We are light beings, creating light.\u0022\n\nChapters\n\n00:00 Introduction and Overview\n02:44 Escaping the Grip of a Cult\n11:26 Recognizing Mind Control and Manipulation\n18:21 The Power of Nature and Staying Grounded\n24:03 The Attack on Women and Dehumanization\n30:39 Exposing Evil and Embracing the Frequency of Light\n38:25 Creating a World of Support and Equality\n40:27 The Ascension and the New Earth\n42:44 The Lionsgate Portal and High Frequency Light\n47:17 Embodying Light and Radiating Love\n49:58 Living in Alignment with Nature for Balance and Well-being\n01:08:49 end screen podcast 17.4 sec.mp4\n\nConnect with Isabelle:\n\nEmail: isabellayoung19@gmail.comwebsite: www.feelingbetternaturally.loveYouTube: Feeling Better NaturallySubstack: https://www.substack.com/@feelingbetternaturally",
      "release": "2024-12-10T14:00:31Z",
      "duration": "01:09:07",
      "explicit": false,
      "youTubeId": "Oxcdxk02Kqk",
      "subjects": [
        "Louix Dor Dempriey"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Oxcdxk02Kqk"
      }
    }
  ]
}