{
  "id": "a887865d-932f-4dcb-91ec-acbd94ae8757",
  "name": "The Mob Reporter",
  "youTubeChannelId": "UCnsj4TU7mOQ-4l2HOaRekgA",
  "episodes": [
    {
      "id": "49337b04-41d6-4663-9bfe-e5d0431440e5",
      "title": "Probing the trans vegan tech cult that\u0027s making global headlines",
      "description": "A cult-like cabal of anarchist, transgender-activist, computer nerds is linked to six killings and one or two faked deaths across the United States, and now these bizarre circumstances threaten one more life — at least. Let me tell you about it.\nThe Mob Reporter here with a true-crime story that sounds like it’s ripped from a dystopian B-movie because the characters in this idiosyncratic crime ring are math and computer whizzes, exceptionally educated, with a passion for artificial intelligence, veganism, gender fluidity, and, allegedly, violence.\nThe Zizians look for all the world like a modern-day Manson Family, a contagious doomsday cult that beggars belief and bends the mind.\nA new development in the allegations provides the perfect opportunity to parse the odd tale of the Zizians.\nIt was a deadly highway shootout that dragged all this into public view. The gun fight connects bizarre events and attacks from years past with events and events still to happen. It started when US Border Patrol Agents pulled over a Toyota Prius in Vermont, near the Canadian border. The woman who had been driving came out shooting, officials say. A German passenger also reached for a gun. The agents returned fire. The German, Felix Bauckholt, died. The driver, Teresa Youngblut, survived. Also killed was agent David Chris Maland.\nThis happened on Jan. 20, 2025, the day of the inauguration of Donald Trump as president of the United States. That timing is likely a coincidence, but the video shows why this become significant. While the incident brought the group to wide public attention, it was not the beginning.\nThe beginning was closer to 2016 and started with Jack LaSota, who went by the name Ziz. It is from the perception Ziz was the leader that the group was branded the Zizians. They are highly educated with degrees in the sciences, mathematics, computing. Most are militantly vegan and champion gender fluidity. They were involved in the Rationalist community. Modern-day Rationalism obsesses over artificial intelligence, with the fear that A.I. will be the end of us all. Ziz became a vocal contrarian, a zealot.\nZIz and acolytes have since been linked to weird and alarming incidents across the United States, as detailed in the video. These include a dramatic protest against the mainstream Rationalist community at a wooded retreat in 2019; the fake death of Ziz in a purported boating accident in San Francisco Bay in 2022, a sword attack on the landlord where several Zizians lived in Vallejo, California, in 2022; the murder of the parents of Michelle Zajko, alleged to be one of the Zizians, in Chester Heights, PA, in 2023; and a second attack on the landlord, Curtis Lind, this time he didn’t make it. Police allege he was killed so he wouldn’t testify against the Zizians charged in the first attack. Arrested was Maximillian Snyder, who was engaged to Teresa Youngblut.\nAll of this is drama is told in detail in this video.\nPlease tap the Thanks button to leave me a tip for my no-robot content and give this video a like, and leave a comment.\nCREDITS:\nMusic is Beyond the Lows by The Whole Other // True Crime Documentary and Chill by Rod Kim // Event Horizon by The Grey Room Density \u0026 Time;\nMap animations created using Google Earth, some street scenes from Google Street View;\nZajko crime scene by NBC: https://www.nbcnews.com/news/us-news/married-couple-was-murdered-pennsylvania-are-zizians-responsible-rcna193875\nLandlord crime scene by KTVU: https://www.ktvu.com/news/two-held-in-death-of-fellow-squatter-shot-by-elderly-vallejo-property-owner\nSnyder article is from the Vacaville Reporter: https://www.thereporter.com/2025/02/06/jail-arraignment-reset-for-defendant-in-fatal-vallejo-stabbing-case/\nScenes from V for Vendetta, showing similarities between the movie and real events, are from the 2005 movie distributed by Warner Bros.;\nFuneral of Maland from the U.S. Border Patrol;\nA Leatham photo is from a public Facebook page;\nLind photos are from the Lind family;\nRed shroud video by cottonbro studio, San Fran fog by Zetong Li, San Fran skyline by Offgrideli,\nRedwoods by RDNE Stock, Geometric by Pressmaster, MD by IVProduced, VT forest by Martin Sanchez, VT fog by John Howard, Bridge by Lukas Rodriguez, Sword by 祝明园, Smoke by cottonbro, Circuits by Soumya, at Pexels;\nSound effects from Pixabay; Woodstock is from University of Georgia; Eleven meadow by August Malmström.\n~ The Mob Reporter is a professional journalist bringing you real-life mob, police and true crime news, investigative journalism and educational videos. \n~ PLEASE SUBSCRIBE: http://www.youtube.com/user/themobreporter?sub_confirmation=1\n~ Please subscribe to my other channels: \n• Crime Watch: https://www.youtube.com/CrimeWatchWorld\n• Crime in Italy: https://www.youtube.com/CrimeInItaly\n~ Written journalism: https://nationalpost.com/author/ahumphreys/\n-~-~~-~~~-~~-~- \nPlease watch: \u0022Genius jewel heist wrecked by sloppy mistakes\u0022: https://youtu.be/KkEk0k0d_7Y\n-~-~~-~~~-~~-~-",
      "release": "2025-09-20T13:12:15Z",
      "duration": "00:21:53",
      "explicit": false,
      "youTubeId": "BBwHKvHhoyc",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BBwHKvHhoyc"
      }
    }
  ]
}