{
  "id": "5ca4d932-d0f1-480e-a4b7-642dd56b635e",
  "name": "The Eben Flow",
  "spotifyId": "28O2rUlgrW5XtweEkJ7KtF",
  "appleId": 1519113552,
  "youTubeChannelId": "UC55iFsVdU_sUX8D7jEhjzQw",
  "episodes": [
    {
      "id": "f00e6227-9a35-42fb-b952-782a6a3f5d8c",
      "title": "Breaking the Spell: Life After a Cult, Radical Change and Self-Discovery w/ Angel DeSantis",
      "description": "In this episode, I sit down with my dear friend Angel DeSantis for a heartfelt and honest conversation about her experience growing up in a cult and the profound before-and-after that comes with massive life change. We explore the ongoing, ever-unfolding process of getting to know oneself after leaving rigid systems behind. From identity and freedom to trust and integration, this conversation is rooted in truth, compassion, and growth. We also share why we’ve decided to co-host an event together in Japan this year and what that journey represents for both of us. Unlock Exclusive Deals on My Favorite Wellness Products! I’ve partnered with some amazing companies to bring you the best in health and wellness, and I’m excited to share exclusive discounts with you. Check out my top recommendations below, and use my code EBENFLOW at checkout for 10% off your next order! 1. Quicksilver Scientific – Longevity Elite Optimize your health with Quicksilver Scientific’s Longevity Elite—the perfect combination of ancient adaptogens and cutting-edge bio-available technology. I use it daily to manage inflammation and boost my energy, especially as a former professional athlete. Shop now: Quicksilver Scientific Use code EBENFLOW for 10% off! 2. Manna Vitality – Manna Vitality 2.0 Manna Vitality 2.0 is my go-to Shilajit supplement, combined with 1,000mg of Dead Sea minerals to rapidly replenish nutrients and minerals. It’s essential for hydration, muscle recovery, and boosting vitality. Shop now: Manna Vitality Use code EBENFLOW for 10% off! 3. SaunaSpace – FireLight® Infrared Sauna Elevate your wellness with SaunaSpace’s FireLight® Infrared Sauna. This cutting-edge sauna combines near-infrared light and radiant heat to detoxify your body, reduce inflammation, and enhance cellular energy—without EMF exposure. Shop now: SaunaSpace Use code EBENFLOW for 10% off! Eben Britton www.ebenbritton.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2026-01-09T23:38:48Z",
      "duration": "01:04:13.7400000",
      "explicit": false,
      "spotifyId": "4RLBvMinsghPE5i8Kqh7uC",
      "appleId": 1000744519678,
      "youTubeId": "fZTIlQbItXw",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4RLBvMinsghPE5i8Kqh7uC",
        "apple": "https://podcasts.apple.com/podcast/breaking-the-spell-life-after-a-cult-radical/id1519113552?i=1000744519678",
        "youtube": "https://www.youtube.com/watch?v=fZTIlQbItXw"
      }
    }
  ]
}