{
  "id": "31858cb3-a732-40aa-bec1-5ab7d654aadf",
  "name": "The Outside Story",
  "youTubeChannelId": "UCo9sshuLBqa7bEvKlhJvIwA",
  "episodes": [
    {
      "id": "94cebb61-8aed-4a7d-82cb-b2a50aef891d",
      "title": "Response to Jehovah\u0027s Witnesses Convention Video about 1975",
      "description": "My name is RC and this is my first video as an Ex-Jehovah\u0027s Witness.\n\nContact: TheOutsideStory@gmail.com\n\nQuotes in the video:\n\nReports are heard of brothers selling their homes and property and planning to finish out the rest of their days in this old system in the pioneer service. Certainly this is a fine way to spend the short time remaining before the wicked world’s end.”\n\n - Kingdom Ministry May 1974 p.3 How Are You Using Your Life?\n\n\nThis is not the time to be toying with the words of Jesus that “concerning that day and hour nobody knows , neither the angels of the heavens nor the Son, but only the Father.” (Matt. 24:36) To the contrary, it is a time when one should be keenly aware that the end of this system of things is rapidly coming to its violent end. Make no mistake, it is sufficient that the Father himself knows both the “day and hour”! \n\n-Watchtower 1968 Aug 15 p.494 Why Are You Looking Forward to 1975?\n\nIf you would like to verify the above quotes, but don\u0027t have access to hard copies of those publications, you\u0027ll need to install the Watchtower Library on DVD for Windows. Unfortunately these publications are not available on JW Library or Watchtower Online Library.\n\nYou may also want to have a look at the following articles:\n\nhttp://jwsurvey.org/conventions/watchtower-whitewashes-failed-1975-prophecy-2017-convention-video\n\nhttps://jwfacts.com/watchtower/1975.php",
      "release": "2017-06-02T03:28:46Z",
      "duration": "00:05:38",
      "explicit": false,
      "youTubeId": "ftTyszVr1ZQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ftTyszVr1ZQ"
      }
    }
  ]
}