{
  "_ts": 0,
  "id": "d6705a70-568a-4b9b-870a-ab3bb6af4bf0",
  "name": "The S.H.I.T.T.S Podcast",
  "spotifyId": "3WruTIpc1uZ20fHnU3HAap",
  "appleId": 1530645708,
  "episodes": [
    {
      "id": "18a2a227-d017-4e89-b97a-780499eaa664",
      "title": "Decoding the Cult-Religion Spectrum with Scott Homan and Anthony Mathenia",
      "description": "Ever grappled with questions about the fine line separating religion and cults? Ever pondered about the shadowy corners of shunning, a practice deeply ingrained in some religious sects? Join us on a cerebral voyage where we decode these contentious issues with our guests, Scott Homan and Anthony Mathenia, creators of the Witness Underground Podcast and Documentary. We engage in a riveting discourse, dissecting the themes of their groundbreaking Kickstarter project and podcast. Venture with us into the labyrinth of religion, spirituality, and humanism. Together we delve into the power of questioning, the role of art in sparking meaningful dialogue and the challenges that come with documenting such profound themes. The discussion takes an intriguing turn as we question the merits of trade schools versus college and university education, shedding light on the music collective \u0027Nuclear Gopher,\u0027 a creative sanctuary for those stifled within their religious communities.As the conversation unfolds, we underscore the strength of individuality and its potential to enrich the collective. Our guests open up, sharing candid personal anecdotes to emphasize that real growth and accomplishment are rooted in patience, passion, and purpose. Join us as we illuminate often ignored topics, challenge norms, and encourage critical thinking. With personal stories and insights from our guests, this episode promises to broaden your horizons and challenge your perspectives on religion, cults, and individualism.https://tubitv.com/movies/100009015/night-life Subscribe to our YouTube Channel: The SHITTS Podcast. Follow us on Spotify, Apple Podcasts, and iHeart Radio. Subscribe and comment. ",
      "release": "2023-11-08T00:00:00",
      "duration": "00:37:13.8750000",
      "explicit": true,
      "spotifyId": "7KbR56W5kEjgLUWMLmP9RH",
      "appleId": 1000634123147,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KbR56W5kEjgLUWMLmP9RH",
        "apple": "https://podcasts.apple.com/podcast/decoding-the-cult-religion-spectrum-with-scott/id1530645708?i=1000634123147"
      }
    }
  ]
}