{
  "id": "580730a5-f444-4c77-a233-fff8daf4fb93",
  "name": "The AUXORO Podcast",
  "spotifyId": "2Xa3GbllxlSnTXarA2HsyK",
  "appleId": 1390263048,
  "youTubeChannelId": "UC_ZiUv9V72nv_IjeGgbbg6g",
  "episodes": [
    {
      "id": "8ec4f31f-b52d-46bb-9939-108edef6763b",
      "title": "#198 - Rick Alan Ross: EXPOSING DESTRUCTIVE CULTS, Tom Cruise And Scientology, Deprogramming Followers, Jim Jones, NXIVM, \u0026 Is Andrew Tate A Cult Leader?",
      "description": "On this episode of The AUXORO Podcast, Rick Alan Ross and Zach discuss how destructive cults control, manipulate, and sometimes kill their followers, how someone like Tom Cruise could be hooked into Scientology, some of the most effective methods he and other experts have used to reverse cult programming, the rise of Jim Jones and the Jonestown Massacre, coming face to face with Keith Raniere the founder of NXIVM, whether Andrew Tate qualifies as a cult leader, and more. Guest Bio:  Rick Alan Ross is a cult expert and the founder of The Cult Education Institute. He is an internationally known expert regarding destructive cults, controversial groups and movements and author of the book \u0022Cults Inside Out: How People Get In and Can Get Out.\u0022 Since 1982 he has been studying, researching and responding to the problems often posed by controversial authoritarian groups and movements. BONUS EPISODES \u0026 PREMIUM ACCESS: https://auxoro.supercast.com/ RICK ALAN ROSS LINKS:Cults Inside Out: How People Get In and Can Get Out: https://amzn.to/3WXoEluCult Education Institute: https://www.culteducation.com/Twitter: https://bit.ly/3HxF6mCTHE AUXORO PODCAST LINKS:Apple: https://apple.co/3B4fYju Spotify: https://spoti.fi/3zaS6sPOvercast: https://bit.ly/3rgw70DYoutube: https://bit.ly/3lTpJdjWebsite: https://www.auxoro.com/ AUXORO SOCIAL LINKS:Instagram: https://www.instagram.com/auxoroYouTube: https://bit.ly/3CLjEqFFacebook: https://www.facebook.com/auxoromagNewsletter: https://www.auxoro.com/thesourceYouTube: https://bit.ly/3CLjEqF If you enjoy the show, please consider leaving a short review on Apple Podcasts. It takes less than 60 seconds, helps us appear higher in searches so more people discover the show, and it boosts my ego;) Past Guests On The Auxoro Podcast Include: Aubrey de Grey, Andy Weir, Eben Britton, Eric Jorgenson, Isabelle Boemeke, Houston Arriaga, Jerzy Gregorek, Chris Cooper, Gryffin, Elsa Diaz, Dave Robinson, Meghan Daum, FINNEAS, Chloé Valdary, Coleman Hughes, Maziar Ghaderi, YONAS, Ryan Michler, Ryan Meyer, Gavin Chops, Bren Orton, Zuby, Jason Khalipa, Ed Latimore, Jess Glynne, Noah Kahan, Kid Super, Deryck Whibley, and many more.  ",
      "release": "2023-02-02T00:00:00",
      "duration": "02:43:20.9520000",
      "explicit": true,
      "spotifyId": "4orIbsG4AvdF6AUKll1FMr",
      "appleId": 1000597754651,
      "youTubeId": "V61YUBhvh3M",
      "subjects": [
        "Scientology",
        "NXIVM",
        "Cult-Expert",
        "Hustler\u0027s University",
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4orIbsG4AvdF6AUKll1FMr",
        "apple": "https://podcasts.apple.com/podcast/198-rick-alan-ross-exposing-destructive-cults-tom-cruise/id1390263048?i=1000597754651",
        "youtube": "https://www.youtube.com/watch?v=V61YUBhvh3M"
      }
    }
  ]
}