{
  "id": "29ba5364-4178-47ab-a980-202da20d1535",
  "name": "The Kelsi Sheren Perspective",
  "spotifyId": "1O3yiobOjThKHtqyjviy1a",
  "appleId": 1610375243,
  "youTubeChannelId": "UCWCy2PRfqQZraiSCocX4Gyw",
  "episodes": [
    {
      "id": "2e026bfe-dd09-4ae8-a898-0f4bc4a22c91",
      "title": "THE VOW Writer/Director/Producer Mark Vicente | #256",
      "description": "Mark Vicente is an author, speaker, and award-winning Writer/Director/Producer from Johannesburg, South Africa. His passion for filmmaking began early, taking his first photograph at age four, he worked his way up through the ranks of the camera department to become a director.\nBecause of the atrocities in his native South Africa, he found himself propelled to question certain fundamental assumptions at a very young age. Beliefs about human behavior, morality, cosmology, existentialism and mysticism. Unifying his love of science, philosophy and film-making, Mark’s dream of creating cinema to inspire and provoke thought began to emerge with the creation of “What the BLEEP do we Know?!” Several books have been written about the film’s remarkable grassroots marketing campaign, which led to its unprecedented success.\nLater, Mark released ‘Encender el Corazon’, a film about the rampant kidnapping epidemic in Mexico. It was bittersweet victory; while the film touched many people deeply, it was by association supporting the criminal enterprise NXIVM. Mark made the difficult decision to pull the film from distribution and, with a small band of whistleblowers, exposed their criminal behavior, resulting in multiple arrests and prosecutions. This journey is captured in the 15 part HBO Documentary Series “THE VOW”.\nHe has since developed a keen and passionate interest in exposing the coercive and duplicitous environments of high-control groups. He is currently in post-production on ‘Empathy Not Included’ (The Narcissist’s Playbook) a feature-length documentary exploring one of the most pervasive and often misunderstood mental pathologies in our culture: Narcissism. Shot in seven countries and viewed through the lens of four self-confessed, self-aware malignant narcissists who openly share the secrets of how they operate with uncensored candor, the film follows their disturbing stories, juxtaposed with the growing body of wisdom from victims, survivors, scientists, and mental health professionals.\n@markvicente\nSubstack: https://substack.com/@kelsisheren\n - - - - - - - - - - - -\nSUPPORT OUR SPONSORS\n - - - - - - - - - - - -\n\nXX-XY Athletics - Code: KELSI20 - https://www.xx-xyathletics.com/?sca_ref=7336247.FtJS2YUK4O\n\n\nKetone IQ- 40% off with code KELSI - https://ketone.com/KELSI\n\n\nGood Livin- 20% off with code BRASS - \nhttps://www.itsgoodlivin.com\n\n\nBrass \u0026 Unity - 20% off with code UNITY - http://brassandunity.com \n\n- - - - - - - - - - - - -\nSHOP\nB\u0026U Jewelry \u0026 Eyewear: https://brassandunity.com \n- - - - - - - - - - - - -\nFollow #thekelsisherenperspective\n- - - - - - - - - - - - -\nCHARITY\nHonour House - https://www.honourhouse.ca\nHeroic Hearts - https://www.heroicheartsproject.org\nAll Secure Foundation - http://allsecurefoundation.org\nDefenders of Freedom -https://www.defendersoffreedom.us\nThe Boot Campaign - https://bootcampaign.org",
      "release": "2025-02-11T15:01:30Z",
      "duration": "01:20:37",
      "explicit": false,
      "spotifyId": "39nYbjqvXSYtXUSQK2ScQn",
      "appleId": 1000691123014,
      "youTubeId": "yJUsrsKSmJ0",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39nYbjqvXSYtXUSQK2ScQn",
        "apple": "https://podcasts.apple.com/podcast/the-vow-writer-director-producer-mark-vicente-256/id1610375243?i=1000691123014",
        "youtube": "https://www.youtube.com/watch?v=yJUsrsKSmJ0"
      }
    }
  ]
}