{
  "id": "a1de7ee1-b39b-4993-bf9c-7407d9851bce",
  "name": "The Juice Radio Talk Show",
  "youTubeChannelId": "UCsDhV2W2-sePQbJvkuUH17g",
  "episodes": [
    {
      "id": "fe9e0f6f-366d-4c01-a561-83c3a129093d",
      "title": "The Cult of The Real Housewife - MARY COSBY - Faith Temple Pentecostal Church",
      "description": "In this shocking new documentary regarding Mary Cosby and her husband Robert Cosby Sr ex members come forward to speak out about their thought on Mary Cosby and the way she runs this church many of them are claiming that this is potentially a cult. And this documentary we get to \nCare what some of the members have to say about this church.  Several members come forward to speak out about their thought on Mary Cosby and the way she runs this church and many of them are claiming that this is a cult. \n\nThis documentary aired on January 1, 2026 on TLC and is available to stream on HBO Max and Discovery\u002B the next day.\n____________________________________\nHelp me grow this channel by Subscribing to my channel today. Click the SUBSCRIBE button located below, IT\u0027S FREE!💕 https://youtube.com/@thejuiceradioandtalkshow?si=cei9dapFZSjTqZ3i\n\nPLEASE HELP ME REACH 50,000 SUBSCRIBERS by clicking the Subscribe button today.❤\nThank you\n\nJOIN OUR YOUTUBE MEMBERSHIP PROGRAM\n    / @thejuiceradioandtalkshow  \n\nRemember to Subscribe, Like, Comment and Share our Videos \u0026 our Channel ❤️❤️❤️\n________________________________________\nDONATIONS can be sent to the following:\nCashapp: $TheJuiceRadioNetwork\nCashapp: $TruthAndTriumph\nZelle: 770-572-6053\n*TRUTH AND TRIUMPH MINISTRIES is our 501c(3) Nonprofit organization.\n________________________________________\nFOLLOW OUR SOCIAL MEDIA CHANNELS\n***\n❤️WEBSITE: https://www.TheJuiceRa...\n❤️WORDPRESS: http://TheJuiceRadioAn...\n❤️FACEBOOK:    / 13qgajvdzb  \n❤️YOUTUBE \u0026 PODCAST:     / @thejuiceradioandtalkshow  \n❤️INSTAGRAM: https://www.instagram....\n❤️THREADS: https://www.threads.ne...\n❤️TWITCH: The Juice Radio And Talk Show\n❤️TWITTER X: https://x.com/TheJuice...\n________________________________________\n🎤📺Do you have a subject you would like us to comment on? DM us the information or email us at TheJuiceRadioAndTalkShow@gmail.com\n_________________________________________\n⚠️Copyright Disclaimer United Section 107 of the Copyright Act 1976, allowance is made for “fair use:” for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.\n⚠️Fair Use Copyright Disclaimer: Any videos, audios or photos used that are not owned by the Juice Radio and Talk Show are being used according to Fair Use Copyrights.\n⚠️Disclaimer: The views and opinions expressed in this video by the hosts or the guests or callers or comments made on this show do not necessarily reflect the opinion of the hosts on this show or the viewpoints of this show channel. All topics are for entertainment purposes only. All commentary and viewpoints are Alleged.\n⚠️Disclaimer: We do not own the right to this music and we do not intend on making a profit from the use of this music also we did not intend to infringe copyright all credit goes to the original copyright individual or company.\n\nRESOURCES:     \n\n#MaryCosby #cult #FaithTemplePentecostalChurch #TheJuiceRadioandTalkShow #TheJuiceRadioTalkShow",
      "release": "2025-12-20T09:20:11Z",
      "duration": "01:10:12",
      "explicit": false,
      "youTubeId": "QIyA56I7uHc",
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QIyA56I7uHc"
      }
    }
  ]
}