{
  "_ts": 0,
  "id": "800aadef-939e-4282-9b83-ac05c4c2b465",
  "name": "The Dating Detectives",
  "spotifyId": "5EFfjKxcZ7AskDVCUcrt7a",
  "appleId": 1684156849,
  "episodes": [
    {
      "id": "10c4f40b-2445-49ce-90c0-06ad033a3185",
      "title": "The Prophecy: Part 2",
      "description": "In this shocking conclusion of a two-part series, Mackenzie and Hanna continue listening to Jubilee\u0027s story, whose journey takes listeners through the dangerous intersection of cult beliefs, prophetic manipulation, and emotional abuse. Jubilee begins by recounting her entry into the Bethel School of Supernatural Ministry, a religious community known for its belief in miracles and prophetic visions. Amid the indoctrination, she meets Ted, a charismatic fellow member whose grand romantic gestures and shared faith quickly draw her in. Their whirlwind romance takes a dramatic turn when a public prophecy declares Jubilee as \u0022God’s gift\u0022 to Ted, cementing the belief that their union is divinely ordained, but everything is not what it seems. Click here to join our Patreon! For only $5 a month you will get 2 extra episodes a month, monthly virtual live events, and access to our community page! If you\u0027ve been dogfished and want to share your story on the show, email investigate@thedatingdetectivespodcast.com or contact us through our website using this link This episode is sponsored by Miracle Made. Get your incredible, temperature maintaining, silver infused sheets for 40% off, PLUS a free three piece towel set, by going to trymiracle.com/TDD and using code TDD at checkout. This episode of The Dating Detectives is sponsored by DeleteMe. Get 20% off your DeleteMe plan when you go to join joindeleteme.com/tdd and use promo code TDD at checkout! This episode of The Dating Detectives is sponsored by BetterHelp. Visit betterhelp.com/tdd today to get 10% off your first month. This episode of The Dating Detectives is sponsored by Quince. For free shipping on your order visit quince.com/TDD ***The following Program contains names, places and events that have been anonymized or fictionalized for the purposes of protection and safety. The following Program is provided for entertainment purposes only and any commentary from the hosts are strictly conjecture and should not be held as making any definitive statements about the truth or identity of any particular individuals or circumstances. If you or a loved one are involved in an abusive relationship, please call the National Domestic Violence Hotline at 1-800-799-7233 for support.",
      "release": "2024-12-02T10:00:00Z",
      "duration": "01:58:34.4160000",
      "explicit": true,
      "spotifyId": "7aqK9Jry6FVNadXGOjS1wn",
      "appleId": 1000678883500,
      "subjects": [
        "Bethel Church (Redding CA)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7aqK9Jry6FVNadXGOjS1wn",
        "apple": "https://podcasts.apple.com/podcast/the-prophecy-part-2/id1684156849?i=1000678883500"
      }
    },
    {
      "id": "529ed669-a20b-437e-bac2-79e8b61604e0",
      "title": "The Prophecy: Part 1",
      "description": "In this chilling first installment of a two-part series, Mackenzie and Hanna welcome Jubilee, whose journey takes listeners through the dangerous intersection of cult beliefs, prophetic manipulation, and emotional abuse. \n\nJubilee begins by recounting her entry into the Bethel School of Supernatural Ministry, a religious community known for its belief in miracles and prophetic visions. Amid the indoctrination, she meets Ted, a charismatic fellow member whose grand romantic gestures and shared faith quickly draw her in.\n\nTheir whirlwind romance takes a dramatic turn when a public prophecy declares Jubilee as \u0022God’s gift\u0022 to Ted, cementing the belief that their union is divinely ordained, but everything is not what it seems. \n\nClick here to join our Patreon! For only $5 a month you will get 2 extra episodes a month, monthly virtual live events, and access to our community page!\n\nIf you\u0027ve been dogfished and want to share your story on the show, email investigate@thedatingdetectivespodcast.com or contact us through our website using this link\n\nEarn points by paying rent right now when you go to join bilt.com/TDD\n\nThis episode is sponsored by Uncommon Goods. To get 15% off your next gift, go to uncommongoods.com/TDD.\n\nThis episode is sponsored by Miracle Made. Get your incredible, temperature maintaining, silver infused sheets for 40% off, PLUS a free three piece towel set, by going to trymiracle.com/TDD and using code TDD at checkout.\n\n***The following Program contains names, places and events that have been anonymized or fictionalized for the purposes of protection and safety. The following Program is provided for entertainment purposes only and any commentary from the hosts are strictly conjecture and should not be held as making any definitive statements about the truth or identity of any particular individuals or circumstances.\n\nIf you or a loved one are involved in an abusive relationship, please call the National Domestic Violence Hotline at 1-800-799-7233 for support.",
      "release": "2024-11-25T10:00:00Z",
      "duration": "01:12:30",
      "explicit": false,
      "spotifyId": "0k1aKGzlRgJBaPYaHxQBm9",
      "appleId": 1000678143220,
      "subjects": [
        "Bethel Church (Redding CA)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0k1aKGzlRgJBaPYaHxQBm9",
        "apple": "https://podcasts.apple.com/podcast/the-prophecy-part-1/id1684156849?i=1000678143220"
      }
    },
    {
      "id": "320e73e4-9672-437c-9dda-4fd318bdede5",
      "title": "The Twin Flame Fight School",
      "description": "Lindsey and her husband were everyone\u0027s favorite couple, until the values of a cult like group seeped into their lives and turned him into a dogfish. Click here to join our Patreon! For only $5 a month you will get 2 extra episodes a month, monthly virtual live events, and access to our community page! If you\u0027ve been dogfished and want to share your story on the show, email investigate@thedatingdetectivespodcast.com or contact us through our website using this link This episode of The Dating Detectives is sponsored by BetterHelp. Visit betterhelp.com/tdd today to get 10% off your first month. This episode of The Dating Detectives is sponsored by Quince. For free shipping on your order visit quince.com/TDD This episode of The Dating Detectives is sponsored by Dipsea. For listeners of the show, Dipsea is offering an extended 30 day free trial when you go to DipseaStories.com/ TDD Stop putting off those doctors appointments and go to Zocdoc.com/tdd find and instantly book a top-rated doctor today. ***The following Program contains names, places and events that have been anonymized or fictionalized for the purposes of protection and safety. The following Program is provided for entertainment purposes only and any commentary from the hosts are strictly conjecture and should not be held as making any definitive statements about the truth or identity of any particular individuals or circumstances. If you or a loved one are involved in an abusive relationship, please call the National Domestic Violence Hotline at 1-800-799-7233 for support",
      "release": "2024-10-07T09:00:00Z",
      "duration": "01:41:14.2800000",
      "explicit": true,
      "spotifyId": "0CHIpRNzOoTYDQLvCdXYtq",
      "appleId": 1000672033118,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CHIpRNzOoTYDQLvCdXYtq",
        "apple": "https://podcasts.apple.com/podcast/the-twin-flame-fight-school/id1684156849?i=1000672033118"
      }
    }
  ]
}