{
  "id": "fab04e0d-add8-4534-9fa6-836d7c21e690",
  "name": "The Divorcing Religion Podcast",
  "spotifyId": "5z9B2C0CXDqeOomm5mV03U",
  "appleId": 1645878058,
  "episodes": [
    {
      "id": "220ecc37-3f89-4c01-9747-aeb200681daa",
      "title": "Mahrs Schoppman - The Colonization of our Bodies",
      "description": "Mahrs Schoppman - The Colonization of our BodiesDivorced: Evangelical Christianity Mahrs Schoppman is a queer \u0026 trans somatic psychotherapist with a private practice based out of his home office in the redwood trees of Occidental, California. Mahrs specializes in working with the queer community and with those who live with the embodied traumatic impacts of growing up in an oppressive religious environment.  He is passionate about walking with people on their journeys of reclaiming embodied knowing, sensation, emotional range, and vitality as a means of recovering from the learned dissociation that comes with restrictive religion.  Mahrs facilitates therapy groups for queer survivors of religious trauma and is in the midst of writing a book about his experiences and ideas around religious trauma.  On today’s episode, Mahrs shares his gripping extimony about coming out as a nonbeliever and member of the LGBTQ\u002B community, and how his own experience informs his private practice.For more from Mahrs, join us at CORT2023.Tickets now available: https://www.religioustraumaconference.org/FIND MAHRS: https://therapywithmahrs.com/Support this podcast on Patreon (starting as low as $2/month) and get access to bonus content: https://www.patreon.com/janiceselbie Thanks to my newest patrons: Hayley, Lois, SatX. Every dollar helps.Recordings from the Shameless Sexuality: Life After Purity Culture conference now 50% off here https://www.religioustraumaconference.org/register with discount code SPECIAL50Subscribe to the audio-only version here: https://www.divorcing-religion.com/religious-trauma-podcastFollow Janice and the Conference on Religious Trauma on Social Media: Mastodon: JaniceSelbie@mas.toTwitter: https://twitter.com/divorcereligionTwitter: https://twitter.com/Wise_counsellorTwitter: https://twitter.com/ComeToCORTFacebook: https://www.facebook.com/DivorcingReligionTikTok: https://www.tiktok.com/@janiceselbieInstagram: https://www.instagram.com/wisecounsellor/The Divorcing Religion Podcast is for entertainment purposes only. If you need help with your mental health, please consult a qualified, secular, mental health clinician.Support the show",
      "release": "2023-05-17T00:00:00",
      "duration": "00:53:33.2170000",
      "explicit": false,
      "spotifyId": "2BVsJmAJXUyRtGhC87b27D",
      "appleId": 1000613423504,
      "subjects": [
        "Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2BVsJmAJXUyRtGhC87b27D",
        "apple": "https://podcasts.apple.com/podcast/mahrs-schoppman-the-colonization-of-our-bodies/id1645878058?i=1000613423504"
      }
    }
  ]
}