{
  "_ts": 0,
  "id": "b89d8c9c-c48f-4945-b0d8-cd847de38772",
  "name": "The Defuse Podcast - The Art and Science or Feeling Safer",
  "spotifyId": "4YkmoT2u8WeXzrujNDldlD",
  "episodes": [
    {
      "id": "7ec71516-4b20-42d7-a00c-e4b88515afa4",
      "title": "The Defuse Podcast - Psychology 101 - Part 1 - Demystifying Psychological Labels: A Deep Dive into Narcissism, Psychopathy, and Personality Disorders with Dr. Caroline Logan",
      "description": "In this episode, the first of a two part series, we learn about what exactly a psycholigist is, the differences between a Clinical and a Forensic Psychologist. Dr Logan talks to us about the meaning of psychological terms such as personality disorders such as narcissistic personality disorder, borderline personality disorder, whether they are the product of nature or nurture and he those affected behave. Dr. Caroline Logan is a Consultant Specialist Clinical Psychologist in Risk Assessment and Management in the NHS and an Honorary Research Fellow at the University of Liverpool. Presently, she is based in a high secure forensic psychiatric service although she consults widely across mental health services in her trust and beyond on issues to do with clinical risk assessment and management. Dr Logan is a chartered clinical and a chartered forensic psychologist and she has a D.Phil in experimental psychology and is currently the President of the International Association of Forensic Mental Health Services. She is a co-author of the recent Department of Health Best Practice in Managing Risk guidance and of the British Psychological Society position paper Understanding Personality Disorder. She maintains her long-standing research and clinical interests in personality disorder more generally and in gender issues in offending more specifically. https://www.linkedin.com/in/caroline-logan-31656b9a/ Support the Show.",
      "release": "2024-05-12T00:00:00",
      "duration": "01:09:28.8950000",
      "explicit": false,
      "spotifyId": "4Cd3DJSaIEfhM47pWTp48y",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Cd3DJSaIEfhM47pWTp48y"
      }
    }
  ]
}