{
  "id": "679aad76-4754-4845-8866-16a4066e768f",
  "name": "The Interfaith Center at Miami University",
  "youTubeChannelId": "UC0pq08p9H2y0IrqtVyAUUWQ",
  "episodes": [
    {
      "id": "badfcaa8-7da8-4f94-a1ea-a61894453c7f",
      "title": "Cults 101: Everything You Wanted to Know about Cults and More",
      "description": "There are more cults and more types of cults than ever before. Dr. Lalich will discuss why people join, how cults operate, current developments, and red flags.\r\n\r\nJanja Lalich, Ph.D., Professor Emerita of Sociology, is an international authority on cults and coercion. Researcher, author and educator, she specializes in analyses of recruitment, indoctrination, and coercive methods of influence and control. Dr. Lalich is the author and/or coauthor of six books, including the now classic, Take Back Your Life: Recovering from Cults and Abusive Relationships (3rd ed.). Bounded Choice: True Believers and Charismatic Cults elucidates her groundbreaking framework and theory on why cult members do things that those on the outside cannot understand. Her research on children born/raised in a high-control group is the basis Escaping Utopia: Growing Up in a Cult, Getting Out and Starting Over. Her work has been translated into Spanish, French, German, Italian, Polish, Japanese, Chinese, Korean, Russian, Serbo-Croatian, Farsi, and Sinhala. In addition to working with survivors and families, she presents at domestic and international conferences and leads workshops for government agencies, international intelligence agencies, private companies, educational institutions, nonprofit organizations, as well as facilitating psychoeducational courses, workshops, and discussion groups for trauma survivors, families, and mental-health professionals. She has also served as an expert witness in civil and criminal legal cases. She has been featured in countless interviews (print, online, podcasts) and has appeared in numerous documentaries on cults and related subjects. Dr. Lalich is the Founder and CEO of the nonprofit, Lalich Center on Cults and Coercion (www.lalichcenter.org) and may be reached at janja.l@lalichcenter.org.\n\n*Please note that the personal views and opinions expressed by Dr. Lalich do not necessarily reflect the position of the Interfaith Center.",
      "release": "2024-08-04T18:02:16Z",
      "duration": "01:17:12",
      "explicit": false,
      "youTubeId": "Y-3XflsC6ZA",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Y-3XflsC6ZA"
      }
    },
    {
      "id": "01a528ef-9e76-42aa-be51-3feefa1070ac",
      "title": "Recognizing Cults \u0026 Abuse of Power with Janja Lalich",
      "description": "Dr. Janja Lalich is an internationally renowned expert on cults. Join us as we learn about her own experience in a political cult earlier in her life and how it influenced her later research.  Why do people stay in cults? What are the parallels between cults and abusive relationships? How do we differentiate extremist religious and political factions from cults? Join us and find out!\n\nJanja Lalich, Ph.D., Professor Emerita of Sociology, is an international authority on cults and coercion. Researcher, author, and educator, she specializes in recruitment, indoctrination, and methods of influence and control. She has been studying the social psychology of controversial groups and exploitative and abusive relationships for 35 years. Dr. Lalich is the author and/or coauthor of six books, including the now classic, Take Back Your Life: Recovering from Cults and Abusive Relationships, and Escaping Utopia: Growing Up in a Cult, Getting Out and Starting Over. Her book Bounded Choice: True Believers and Charismatic Cults has been recognized as the first original contribution to the field of cultic studies in decades. In addition to working with survivors and their families, she leads workshops and educational sessions for government agencies, international intelligence agencies, private companies, educational institutions, nonprofit organizations. She has also served as expert witness in civil and criminal legal cases. A frequent keynoter or presenter at domestic and international conferences, her work has been translated into German, Italian, Spanish, Chinese, Japanese, Turkish, Russian, Serbo-Croatian, and Polish. \n\nDr. Lalich may be reached at drlalich@sbcglobal.net or on Twitter @Janja_Lalich. Her website is www.janjalalich.com.",
      "release": "2021-10-06T12:08:00Z",
      "duration": "00:55:46",
      "explicit": false,
      "youTubeId": "QaKHMvJheiY",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QaKHMvJheiY"
      }
    }
  ]
}