{
  "id": "9268df27-9ce3-4e2e-b1bc-fb25ede053d5",
  "name": "The Unladylike Lounge",
  "spotifyId": "1lQwNDtFfQenXv80C1Ixih",
  "appleId": 1638293281,
  "episodes": [
    {
      "id": "71e5ee6c-522e-4bd7-a037-6873473de35b",
      "title": "Bear Witness",
      "description": "Scott was raised in the fiercly DIY \u0022Northwoods\u0022 of Wisconsin deep in the wild of the Great Lakes region. His father joined a cult when he was a preteen. With his high-school band mates they created Oh The Crib! records in a house in the forest as teenagers, where he recorded his album for A.D.D. Chronicles, his band inside of the cult. He ran camera and sound for a local news station and then went university for photography and digital media. Today he runs Banana Island Films, which was born in Hanoi, Vietnam during his five years there, and their music documentary, Hanoi Mixtape, is streaming now at HanoiMixtape.com. Witness Underground is his sophmore film and a much bigger project which includes the Witness Underground Podcast and the series, \u0022XJW Coming Out of the Jehovah\u0027s Witnesses.\u0022 The proceeds from his Patreon go towards fostering new healing art through an ex-cult-member artist grant program. You can stream it now at Patreon.com/WitnessUnderground.https://WitnessUnderground.comWitnessUnderground.com contains a lot of information about the film: reviews, trailer, links to watch, as well as the XJW Coming Out series episodes that are public, the podcast, the blog articles, the grant application. It\u0027s the best place to get to know more, be entertained, and has links to stream (patreon) and support the film.  Support the show",
      "release": "2023-06-19T00:00:00",
      "duration": "00:31:37.6910000",
      "explicit": false,
      "spotifyId": "7sm0JUOHCYce8otG6C6p6C",
      "appleId": 1000617628739,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7sm0JUOHCYce8otG6C6p6C",
        "apple": "https://podcasts.apple.com/podcast/bear-witness/id1638293281?i=1000617628739"
      }
    }
  ]
}