{
  "id": "c5a408f8-b1e6-4424-aa1c-5e98197d9aa3",
  "name": "The Orgasm Cult",
  "spotifyId": "5PGpwYAgDSiIUSN3SvVf9d",
  "appleId": 1539644195,
  "episodes": [
    {
      "id": "b49a07b2-bbdc-4060-9e38-74ccbda397bd",
      "title": "9. Things get dark",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   This episode has been edited to remove reference to an email which was described as relating to a specific incident involving Sam and Cassidy. This has been removed because the email in fact concerned a different incident.   As One Taste grew, the tensions inside the company escalated.  We hear one especially disturbing story of abuse and coercive control, and hear how members were pressured into practising Orgasmic Meditation or having sex against their wishes.  We learn how the company began to take a turn towards the occult with a course called Magic School, experimenting with sex, spirituality and ritual.  And former One Taste members tell us how they reached breaking point within the organisation.  If you’ve been affected by any of the issues raised in this programme, help and advice are available at bbc.co.uk/actionline.  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-12-16T05:00:00Z",
      "duration": "00:32:25.8300000",
      "explicit": true,
      "spotifyId": "1irtBqvJHWWm9XOpg5d0Rt",
      "appleId": 1000502539618,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1irtBqvJHWWm9XOpg5d0Rt",
        "apple": "https://podcasts.apple.com/podcast/9-things-get-dark/id1539644195?i=1000502539618"
      }
    },
    {
      "id": "ae574687-c9d3-4140-8676-9bc891b54256",
      "title": "10. Picking up the pieces",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   In 2018, Bloomberg Businessweek published an article by reporter Ellen Huet exposing the toxic culture within One Taste.  Shortly afterwards, the FBI started making enquiries into the company over allegations of sex trafficking, prostitution and violation of labour laws.  The company has since closed all its physical locations and is no longer offering in-person courses.  Co-founder Nicole Daedone had stepped down as CEO the previous year – and after the FBI started making enquiries, she vanished.  Former One Taste members tell us about their disappointment that the company has not responded better to the allegations against it.  And we hear how many people struggled to put their lives back together after their time at One Taste.  If you’ve been affected by any of the issues raised in this programme, help and advice are available at bbc.co.uk/actionline.  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-12-16T05:05:00Z",
      "duration": "00:26:44.0230000",
      "explicit": true,
      "spotifyId": "2OQD3SLEdvCvwfEPrYHjBl",
      "appleId": 1000502539619,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2OQD3SLEdvCvwfEPrYHjBl",
        "apple": "https://podcasts.apple.com/podcast/10-picking-up-the-pieces/id1539644195?i=1000502539619"
      }
    },
    {
      "id": "7d16e2d1-acd8-420e-a63a-e757b504dbff",
      "title": "7. Sex, money, power",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   One Taste was all about the female orgasm – but a lot of men wanted to get involved too, whether to learn how to relate to women better or just in the hope of more sex.  And because Orgasmic Meditation was born in the San Francisco Bay Area, the home of Silicon Valley, it attracted a lot of men who worked in the tech industry, some of whom were extremely wealthy.  Many of the women who got involved in One Taste were younger, and open to trying out something different and new age in the search to explore their sexuality, or sometimes heal from trauma.  These two demographics created some complicated gender dynamics, which One Taste used to develop predatory and exploitative sales tactics.  Former One Taste members tell us about the interplay between sex, money and power within the organisation.  If you’ve been affected by any of the issues raised in this programme, help and advice are available at bbc.co.uk/actionline.  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-12-09T05:00:00Z",
      "duration": "00:25:55.6180000",
      "explicit": true,
      "spotifyId": "1cswDJJ6xagVQz1oO6g9mD",
      "appleId": 1000501793035,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cswDJJ6xagVQz1oO6g9mD",
        "apple": "https://podcasts.apple.com/podcast/7-sex-money-power/id1539644195?i=1000501793035"
      }
    },
    {
      "id": "76329797-1e63-436d-bdac-707ee75667f0",
      "title": "8. Is One Taste a Cult?",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   Even from the early days of One Taste, discussion swirled around whether the company was a cult.  Co-founder Nicole Daedone even had a tank top which said “cult” on it in big white letters, and staff were briefed on how to respond to questions from outsiders on the subject.  After everything we’ve learned so far about One Taste, in this episode we speak to cult expert Steve Hassan, author of “Combatting Cult Mind Control”, about what makes a cult – and whether he thinks the term applies to One Taste.  Plus, wellness expert André Spicer tells us how to recognise red flags that an organisation could be a cult, and what makes people vulnerable to joining them in the first place.  If you’ve been affected by any of the issues raised in this programme, help and advice are available at bbc.co.uk/actionline.  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-12-09T05:10:00Z",
      "duration": "00:21:16.2810000",
      "explicit": true,
      "spotifyId": "2EFGg5WQeprTMZ6RLlDMny",
      "appleId": 1000501793036,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2EFGg5WQeprTMZ6RLlDMny",
        "apple": "https://podcasts.apple.com/podcast/8-is-one-taste-a-cult/id1539644195?i=1000501793036"
      }
    },
    {
      "id": "a1a492cf-66c8-4405-b9f9-5bab95b71566",
      "title": "5. Inside the OM Houses",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   Many One Taste members lived in communal houses, known as OM houses. They would practice Orgasmic Meditation together multiple times a day while also working for One Taste selling and running courses.  Some people moved in to the OM houses only weeks after their first encounter with One Taste.  Some were attracted by the possibility of lots of sex, but others were looking for meaning, purpose or community in their lives.  And everyone was captivated by One Taste’s charismatic co-founder Nicole Daedone.  Former members tell us how exciting it was at first – but things soon got complicated.  The company was struggling to make money, and as the price tags for courses went up, the sales tactics got more and more predatory.  If you’ve been affected by any of the issues raised in this programme, help and advice are available at bbc.co.uk/actionline.  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-12-02T05:00:00Z",
      "duration": "00:26:16.1240000",
      "explicit": true,
      "spotifyId": "24KR1TdxaWDfVgq0md95jG",
      "appleId": 1000501038758,
      "urls": {
        "spotify": "https://open.spotify.com/episode/24KR1TdxaWDfVgq0md95jG",
        "apple": "https://podcasts.apple.com/podcast/5-inside-the-om-houses/id1539644195?i=1000501038758"
      }
    },
    {
      "id": "3f4aaee6-8811-4867-99f7-8c8b1105d5da",
      "title": "6. One woman’s story",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   One former One Taste member tells us the story of her experiences inside One Taste.  Before she encountered One Taste, she had struggled to orgasm, and mainstream doctors hadn’t been able to tell her why.  She says the prospect that she could experience orgasm through Orgasmic Meditation left her “saturated with hope”.  Initially, One Taste welcomed her with open arms – but the company soon became exploitative.  She was encouraged to go into debt to pay for One Taste classes, to turn away from her friends and family, and to start a relationship with a wealthy One Taste member who could pay for her courses – a situation she describes as “not exactly prostitution, but not completely different”.  She left One Taste with PTSD.  Plus, her brother tells us what it was like to watch his sister become more and more distant from the outside world.  If you’ve been affected by any of the issues raised in this programme, help and advice are available at bbc.co.uk/actionline.  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-12-02T05:05:00Z",
      "duration": "00:29:22.1430000",
      "explicit": true,
      "spotifyId": "4TgJYKwkQ7VscpOUoAwQNN",
      "appleId": 1000501038757,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4TgJYKwkQ7VscpOUoAwQNN",
        "apple": "https://podcasts.apple.com/podcast/6-one-womans-story/id1539644195?i=1000501038757"
      }
    },
    {
      "id": "f6206ce6-ceef-4b3a-af42-1e7883fad770",
      "title": "3. Welcome to One Taste",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   One Taste didn’t invent Orgasmic Meditation – but they did repackage it for a modern audience.  The idea of “deliberate orgasm” achieved by genital stroking started in the hippy communes of 1960s California. It was a time of huge social and sexual experimentation.  One Taste co-founder Nicole Daedone first experienced the practice in the late 1990s.  She had a vision of it reaching millions of people and changing the world – so she decided to redesign it as Orgasmic Meditation, making it sleeker and more structured.  Former One Taste members tell us about the early days of the organisation, living together in a warehouse in San Francisco and experimenting with sex, self-development and Orgasmic Meditation.  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-11-25T05:00:00Z",
      "duration": "00:23:45.5550000",
      "explicit": true,
      "spotifyId": "6MxVWj2NoplFBPoZjuIY3Z",
      "appleId": 1000500173098,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6MxVWj2NoplFBPoZjuIY3Z",
        "apple": "https://podcasts.apple.com/podcast/3-welcome-to-one-taste/id1539644195?i=1000500173098"
      }
    },
    {
      "id": "a136e47a-3aab-4e28-8bed-1c9de35bf01e",
      "title": "4. Why do people turn to the wellness industry?",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   One Taste sold itself as a wellness company – part of a multi-billion dollar industry selling everything from green smoothies to healing crystals to cryotherapy.  The wellness industry has grown massively in recent years. Wellness practices can offer hope and empowerment to people – particularly women – who are looking for connection or meaning in their lives, or who have medical concerns that they feel haven’t been taken seriously by mainstream doctors.  But wellness can be a double edged sword. While it can offer a sense of control and community, the industry isn’t regulated, which can leave consumers vulnerable.  So what makes people turn to wellness?  What are they looking for that they can’t find elsewhere?  And what are the potential dangers of wellness practices?  We find out with Dr André Spicer, professor of organisational behaviour at Cass Business School and co-author of The Wellness Syndrome, and doctor, midwife and herbalist Dr Aviva Romm.  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-11-25T05:05:00Z",
      "duration": "00:26:06.1840000",
      "explicit": true,
      "spotifyId": "1RMpp44F7R2H2lXAhkJpt9",
      "appleId": 1000500173099,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1RMpp44F7R2H2lXAhkJpt9",
        "apple": "https://podcasts.apple.com/podcast/4-why-do-people-turn-to-the-wellness-industry/id1539644195?i=1000500173099"
      }
    },
    {
      "id": "71bf6a52-ccf7-4ac4-9937-c7fdeb565d0f",
      "title": "2. What is an orgasm?",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   Before we dive into the story of One Taste, we go back to basics on the female orgasm.  What exactly is an orgasm?  What’s going on in the body and the brain during the process?  Why do some women struggle to experience orgasm?  And what’s the best way to get there?  We find out with neuroscientist and sex therapist Dr Nan Wise, author of Why Good Sex Matters: Understanding the Neuroscience of Pleasure for a Smarter, Happier and More Purpose-Filled Life, and social psychologist and psychotherapist Dr Sara Nasserzadeh, co-author of the Orgasm Answer Guide.  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-11-23T15:12:00Z",
      "duration": "00:17:48.3520000",
      "explicit": true,
      "spotifyId": "67rfWumqu4C7z6JS3UMPFL",
      "appleId": 1000499945184,
      "urls": {
        "spotify": "https://open.spotify.com/episode/67rfWumqu4C7z6JS3UMPFL",
        "apple": "https://podcasts.apple.com/podcast/2-what-is-an-orgasm/id1539644195?i=1000499945184"
      }
    },
    {
      "id": "7e39697f-e82a-4e7a-aec9-5c2d16ceefd7",
      "title": "1. Changing the world through orgasm",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.  Nastaran Tavakoli-Far explores the rise and fall of One Taste. We learn how to practise Orgasmic Meditation with a former member and his wife, and hear co-founder Nicole Daedone’s story of how she encountered a Buddhist monk at a party who changed her life. And former One Taste members and staff tell us about the optimism with which they joined the project, looking for a sense of purpose, for adventure, or for healing.  But we hear how things soon started to go sour, with predatory sales practices, coercive control and abuse – financial, emotional, physical and sexual.  And we’re also asking bigger questions that go beyond just one company.  What makes people turn to organisations like One Taste in search of connection in the modern world?  Why are women’s health and women’s sexuality still not taken seriously by conventional medicine?  And where is the line between healing and harm?  Presenter: Nastaran Tavakoli-Far Producer: Lucy Burns Editor: Penny Murphy",
      "release": "2020-11-18T05:00:00Z",
      "duration": "00:22:08.4100000",
      "explicit": true,
      "spotifyId": "1V7mR2Dpwg2swpTvyr3JCG",
      "appleId": 1000499164205,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1V7mR2Dpwg2swpTvyr3JCG",
        "apple": "https://podcasts.apple.com/podcast/1-changing-the-world-through-orgasm/id1539644195?i=1000499164205"
      }
    },
    {
      "id": "2aa77210-c001-438f-a927-74e55c10c985",
      "title": "Discover The Orgasm Cult",
      "description": "This podcast is now the subject of a legal complaint by Nicole Daedone, Rachel Cherwitz, OneTaste Incorporated, the Institute of OM LLC and OM IP Co.   Nicole Daedone, the charismatic co-founder of wellness company One Taste believed that orgasm would one day sit alongside yoga and meditation as the self-care self-care practice for the modern empowered women.   Except that now the FBI is making enquiries in to One Taste over allegations including sex trafficking, prostitution and violations of labour law.  How did Orgasmic Meditation go from hippy beginnings to a sleek, million-dollar operation?   How did this wellness practise – touted as the next big thing everywhere from Gwyneth Paltrow’s Goop to the New York Times – lead to isolation, debt and abuse?  Why is women’s health and pain still not taken seriously by conventional medicine?   The Orgasm Cult is a story about people desperate for connection and how far they would go to find it.   Join Nastaran Tavakoli-Far as she investigates One Taste through exclusive interviews with former employees and asks big questions about the wellness industry.",
      "release": "2020-11-10T10:51:00Z",
      "duration": "00:02:31.3750000",
      "explicit": true,
      "spotifyId": "2lGCIHv1taPlR9FKjsgWQB",
      "appleId": 1000497955123,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2lGCIHv1taPlR9FKjsgWQB",
        "apple": "https://podcasts.apple.com/podcast/discover-the-orgasm-cult/id1539644195?i=1000497955123"
      }
    }
  ]
}