{
  "_ts": 0,
  "id": "3b188020-7de3-4406-8296-a10829aa5e1c",
  "name": "The FOX True Crime Podcast w/ Emily Compagno",
  "spotifyId": "2ICy53cWZCghqnsPTJgqOZ",
  "appleId": 1673121867,
  "episodes": [
    {
      "id": "0662f4f3-0dd2-4ef8-ad22-6eea919e9125",
      "title": "How To Spot A Cult",
      "description": "When you think of a cult, you may picture one of the infamous ones. But in actuality, cults are able to hide themselves and operate in a much more insidious manner. Education and communication are two key components for keeping ourselves and our loved ones safe from the harmful influences of cults, so what do we need to watch out for? Executive Director of the Cult Education Institute Rick Alan Ross explains how cults are defined, why they can be destructive, and how people involved can be deprogrammed. Later, he looks back at some of the more memorable cases on which he\u0027s been involved. Follow Emily on Instagram: @realemilycompagno If you have a story or topic we should feature on the FOX True Crime Podcast, send us an email at: truecrimepodcast@fox.com Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-21T10:00:00Z",
      "duration": "00:39:25.2310000",
      "explicit": false,
      "spotifyId": "3Mtijqd2C9mk2ppzsTVylZ",
      "appleId": 1000677759943,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Mtijqd2C9mk2ppzsTVylZ",
        "apple": "https://podcasts.apple.com/podcast/how-to-spot-a-cult/id1673121867?i=1000677759943"
      }
    },
    {
      "id": "e3d2808b-06aa-4fb8-9f82-168d91b6a70e",
      "title": "Escaping NXIVM: India Oxenberg\u0027s Journey Of Healing",
      "description": "If someone who seemed larger than life offered you a glimpse of a brand-new self, would you believe it? Keith Raniere had the ability to make the people around him see a vision of hope and success with his group, NXIVM. For a moment, India Oxenberg saw it too. However, NXIVM\u0027s true purpose was darker than anything she could have ever imagined. Author and documentary producer India Oxenberg details her seven-year experience with the NXIVM cult and explains how she was able to break free. She shares her journey of healing and finding her voice and discusses the joys of her life today. India has released a documentary about the story of her survival and escape from NXIVM entitled Seduced: Inside the NXIVM Cult, as well as a memoir about her journey, Still Learning . \u0026#xfeff; Follow Emily on Instagram: @realemilycompagno If you have a story or topic we should feature on the FOX True Crime Podcast, send us an email at: truecrimepodcast@fox.com Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-03-19T09:00:00Z",
      "duration": "01:15:52.6720000",
      "explicit": false,
      "spotifyId": "6UDAC6hnqfHmSnWYpa41db",
      "appleId": 1000649683974,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6UDAC6hnqfHmSnWYpa41db",
        "apple": "https://podcasts.apple.com/podcast/escaping-nxivm-india-oxenbergs-journey-of-healing/id1673121867?i=1000649683974"
      }
    }
  ]
}