{
  "id": "6c4d0384-dab0-4337-b944-8280b74d1cde",
  "name": "The Journal.",
  "spotifyId": "0KxdEdeY2Wb3zr28dMlQva",
  "appleId": 1469394914,
  "episodes": [
    {
      "id": "62602a9f-a99d-48fa-8462-17c057ff903f",
      "title": "The Killing Spree Tied to a Silicon Valley Intellectual Movement",
      "description": "The Zizians, a cult-like group of militant vegans, has been connected to six killings across the country. The violence has sent shockwaves throughout Silicon Valley. WSJ’s Zusha Elinson explains how the Zizians splintered from a Bay Area intellectual movement concerned with AI safety. Further Reading: - A Silicon Valley Intellectual Society Kicked Them Out. Now They’re Tied to a Killing Spree. - How a Fervent Belief Split Silicon Valley—and Fueled the Blowup at OpenAI Further Listening: - The Fall of Crypto’s Golden Boy - The Story Behind the Stabbing of a San Francisco Tech Exec - The Biotech Founder Facing Murder Charges Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-03-03T21:00:00Z",
      "duration": "00:17:22.8340000",
      "explicit": false,
      "spotifyId": "3z9gSrmexbcGDA0EZVnBua",
      "appleId": 1000697487823,
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3z9gSrmexbcGDA0EZVnBua",
        "apple": "https://podcasts.apple.com/podcast/the-killing-spree-tied-to-a-silicon-valley/id1469394914?i=1000697487823"
      }
    },
    {
      "id": "4fb01242-0dcd-4c9b-8007-9105e3ae7497",
      "title": "North Korea’s Propaganda Mastermind",
      "description": "For six decades, one man has been largely responsible for creating North Korea’s propaganda machine: Kim Ki Nam. He served all three North Korean dictators and is the architect of many of the myths that have helped to keep the Kim family in power. Last week, Kim Ki Nam died at the age of 94. WSJ’s Timothy Martin reports on his controversial legacy. Further Reading: - The Original Mastermind Behind North Korea’s Cult-of-Personality Propaganda Dies - Kim Jong Un’s New Look Is More Man Than Superhuman Further Listening: - How North Korea’s Hacker Army Stole $3 Billion in Crypto Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-05-14T20:03:00Z",
      "duration": "00:16:11.1020000",
      "explicit": false,
      "spotifyId": "1C9vZkHHWw3gMU4YG59tgw",
      "appleId": 1000655594001,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1C9vZkHHWw3gMU4YG59tgw",
        "apple": "https://podcasts.apple.com/podcast/north-koreas-propaganda-mastermind/id1469394914?i=1000655594001"
      }
    }
  ]
}