{
  "id": "c43447b5-ffb4-47d9-a778-f1247e1d1da8",
  "name": "The Epstein Chronicles",
  "spotifyId": "6gQDvlvEa89IH90jHfuIRM",
  "appleId": 1575753383,
  "episodes": [
    {
      "id": "3a26fc14-4f40-455e-9e2b-a71984aa0b8e",
      "title": "Mega Edition:  Jeffrey Epstein, Glenn Dubin, Les Wexner And Their Harvard Adventures (9/28/25)",
      "description": "Jeffrey Epstein, Glenn Dubin, and Les Wexner’s collective ties to Harvard University expose a deeply unsettling nexus of wealth, influence, and compromised morality within one of the world’s most prestigious academic institutions. Epstein, despite his 2008 conviction, donated millions to Harvard, including $6.5 million to the Program for Evolutionary Dynamics, securing not only access to the university’s intellectual elite but also legitimacy that helped launder his reputation. Glenn Dubin, a hedge fund billionaire and close Epstein associate, reinforced these connections through philanthropy and elite social networks, while his wife, Eva Andersson-Dubin, had an even more personal history with Epstein, further entwining Harvard’s image with the scandal. Les Wexner, Epstein’s most significant benefactor and a longtime Harvard donor himself, indirectly strengthened Epstein’s foothold within the institution, with his fortune and backing lending weight to Epstein’s cultivated status as a man of ideas and influence. Together, these men leveraged Harvard’s prestige as both a shield and a stage, providing Epstein with credibility in academic and scientific circles that should have been out of reach for a registered sex offender.\n\nHarvard’s willingness to accept and defend these relationships, even after Epstein’s criminal record was public, reflects not only institutional greed but also a failure of ethical leadership. While Harvard has since tried to distance itself, the revelations that Epstein maintained an office on campus, retained connections with professors, and used his donations to secure influence long after his conviction speak to a systemic rot. Wexner’s fortune, Dubin’s networks, and Epstein’s money intersected at Harvard in ways that revealed how elite institutions often prioritize financial gain over moral responsibility. Rather than protecting its integrity or safeguarding its reputation, Harvard enabled Epstein’s rehabilitation, offering him cover while he cultivated ties with powerful men like Dubin and Wexner. In doing so, the university not only failed its own values but also became an unwitting accomplice in sustaining the ecosystem that allowed Epstein to thrive.\n\n\nto contact me:\n\nbobbycapucci@protonmail.com\n\nBecome a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support.",
      "release": "2025-09-28T11:30:07Z",
      "duration": "00:55:28",
      "explicit": false,
      "spotifyId": "3WDE1loTOGtpQsY7tIGsKv",
      "appleId": 1000728879493,
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3WDE1loTOGtpQsY7tIGsKv",
        "apple": "https://podcasts.apple.com/podcast/mega-edition-jeffrey-epstein-glenn-dubin-les-wexner/id1575753383?i=1000728879493"
      }
    },
    {
      "id": "fa768819-7819-40ed-a4b1-ed948e5046a7",
      "title": "A Look Back:  Author John Glatt Discusses Lori Vallow",
      "description": "John Glatt, the author of the book Doomsday Mother gave an interview to The Mirror recently and talked about some of the findings he uncovered while talking to those closest to Lori and those who knew her and Chad the best. In this episode, we hear from John Glatt who discusses his book and his impression of Lori Vallow and what might happen during her trial. (commercial at 8:41) to contact me: bobbycapucci@protonmail.com source: \u0027Cult mum\u0027 Lori Vallow a \u0027narcissist convinced murdered kids were zombies\u0027, says author - Mirror Online Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-05-04T19:00:04Z",
      "duration": "00:14:50.3950000",
      "explicit": true,
      "spotifyId": "0U8b96mEdIlhL2L3OP2KEe",
      "appleId": 1000654534478,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0U8b96mEdIlhL2L3OP2KEe",
        "apple": "https://podcasts.apple.com/podcast/a-look-back-author-john-glatt-discusses-lori-vallow/id1575753383?i=1000654534478"
      }
    },
    {
      "id": "d727df21-4c03-41c9-be1a-73612cc480b8",
      "title": "A Look Back:  Chad Daybell And The Venue Order",
      "description": "The dive into the Chad Daybell court documents continues as there has been a flurry of activity as of late in regard to the upcoming trial of Chad Daybell. In this episode we are taking a look at the Venue order that just hit the docket. (commercial at 9:14) to contact me: bobbycapucci@protonmail.com source: 120823-Order-on-States-Motion-to-Reconsider-Change-of-Venue.pdf (amazonaws.com) Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-04-10T03:00:03Z",
      "duration": "00:13:22.6630000",
      "explicit": true,
      "spotifyId": "5UQ666iojn8AstFDx9cPfq",
      "appleId": 1000651969997,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5UQ666iojn8AstFDx9cPfq",
        "apple": "https://podcasts.apple.com/podcast/a-look-back-chad-daybell-and-the-venue-order/id1575753383?i=1000651969997"
      }
    },
    {
      "id": "95562e76-d68f-4b62-9d96-66afe33a5f48",
      "title": "A Look Back:  Lori Vallow, Chad Daybell And The Red Flags In Their Relationship",
      "description": "Lori Vallow and Chad Daybell had managed to avoid prying eyes for months as questions swirled about the whereabouts of Lori Vallow\u0027s children. It got to the point that JJ Vallow\u0027s grandparents asked for a wellness check to be performed. After performing the wellness check and speaking with Alex Cox and Chad Daybell, Detective Hermosillo had a feeling that they were lying and it was this interaction that set the snowball rolling and would eventually lead to the discovery of the remains of JJ and Tylee. (commercial at 7:48) to contact me: bobbycapucci@protonmail.com source: Lori Vallow Daybell Trial: Chad Told Police He \u0027Hardly Knew\u0027 Lori (people.com) Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-04-10T01:00:02Z",
      "duration": "00:10:59.9840000",
      "explicit": true,
      "spotifyId": "6att19K0H4bhy0Wnl8XFwx",
      "appleId": 1000651963678,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6att19K0H4bhy0Wnl8XFwx",
        "apple": "https://podcasts.apple.com/podcast/a-look-back-lori-vallow-chad-daybell-and-the-red/id1575753383?i=1000651963678"
      }
    },
    {
      "id": "d28c4efd-6692-4b79-953e-937b5116994a",
      "title": "A Look Back:  Lori Vallow And Her Lannister Like Relationship With Her Brother Alex",
      "description": "Lori Vallow and her brother Alex Cox had a very strange and bizarre relationship that included touching of a sexual nature and other Lannister like behavior, according to ex friends who spoke with author Joseph Glatt. In this episode, we take a look at the nature of the relationship between Vallow and Cox and how his fixation with his little sister started at a young and carried through his whole life until his death. (commercial at 11:06) to contact me: bobbycapucci@protonnmail.com source: Inside \u0027cult mom\u0027 Lori Vallow\u0027s disturbing relationship with her brother as book claims he \u0027tried to have sex with her\u0027 | The US Sun (the-sun.com) Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-04-09T23:00:03Z",
      "duration": "00:16:41.2970000",
      "explicit": true,
      "spotifyId": "6pJBoA1d1ifm3mviarzHAz",
      "appleId": 1000651957481,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6pJBoA1d1ifm3mviarzHAz",
        "apple": "https://podcasts.apple.com/podcast/a-look-back-lori-vallow-and-her-lannister/id1575753383?i=1000651957481"
      }
    },
    {
      "id": "cc693d26-f3a5-4456-93c3-28374f837041",
      "title": "A Look Back:  How Chad Daybell\u0027s Story During His Trial Will Differ From Lori Vallow\u0027s",
      "description": "Chad Daybell is a former publisher of books focused on the end of the world and the afterlife, and he was also a religious author and speaker. However, he gained notoriety in 2020 when he was arrested and charged with several crimes related to the deaths of his wife, Tammy Daybell, and his stepchildren\u0027s mother, Lori Vallow\u0027s two children, Joshua \u0022JJ\u0022 Vallow and Tylee Ryan.Chad and Lori became the subject of national media attention when it was discovered that the children had been missing for months and that Chad and Lori had fled their home in Idaho. The investigation into their disappearance led to the discovery of their bodies, and Chad and Lori were both arrested and charged with several counts related to the deaths and the concealment of evidence. The case is ongoing, and Chad and Lori have both pleaded not guilty to the charges against them. In this episode, we take a look at the upcoming defense for Chad Daybell and explore the possibility of him trying to pin the whole thing on Lori Vallow. (commercial at 7:42) to contact me: bobbycapucci@protonmail.com source: Attorney asks judge to separate Daybell trials, says Chad\u0027s defense will be \u0027diametrically\u0027 different from Lori\u0027s - East Idaho News Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-04-09T07:00:02Z",
      "duration": "00:10:36.1650000",
      "explicit": true,
      "spotifyId": "1lOL7kcKwVIFHOvgsMKlyM",
      "appleId": 1000651861015,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1lOL7kcKwVIFHOvgsMKlyM",
        "apple": "https://podcasts.apple.com/podcast/a-look-back-how-chad-daybells-story-during-his/id1575753383?i=1000651861015"
      }
    },
    {
      "id": "fb012bfc-80c8-4777-a66d-7e14f96a4ff2",
      "title": "The Chad Daybell Trial:  A Recap Of Jury Selection Day Number Two (4/3/24)",
      "description": "Chad Daybell is a former gravedigger, author, and member of the Church of Jesus Christ of Latter-day Saints. He gained notoriety in connection with the disappearance and deaths of his former wife, Tammy Daybell, and his new wife\u0027s children, Joshua \u0022JJ\u0022 Vallow and Tylee Ryan. Chad Daybell is a former gravedigger, author, and member of the Church of Jesus Christ of Latter-day Saints. He gained notoriety in connection with the disappearance and deaths of his former wife, Tammy Daybell, and his new wife\u0027s children, Joshua \u0022JJ\u0022 Vallow and Tylee Ryan.Daybell\u0027s background includes his involvement in the \u0022prepper\u0022 community, which focuses on preparing for potential disasters, as well as his self-published books that touch on religious and apocalyptic themes. The case gained national attention when Tammy Daybell died suddenly in October 2019, initially attributed to natural causes. However, suspicions arose when Chad quickly remarried Lori Vallow, whose children were reported missing later that year. Authorities began investigating the disappearances of JJ and Tylee, leading to the discovery of their bodies buried on Chad Daybell\u0027s property in Idaho in June 2020. Autopsies revealed that both children had been murdered, and their deaths were ruled as homicides. Chad Daybell was subsequently arrested and charged with several counts, including two felony counts of destruction, alteration, or concealment of evidence. He has also been charged with conspiracy to commit destruction, alteration, or concealment of evidence. In this episode we get a look at what went down during the second day of jury selection, plus a look at how Daybell\u0027s trial will differ from Vallow\u0027s. (commercial at 10:03) to contact me: bobbycapucci@protonmail.com source: Chad Daybell trial: Lori Vallow husband seeks different outcome from ‘cult mom’ | Fox News source: Chad Daybell trial day 2 - jury selection | ktvb.com Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-04-03T15:00:02Z",
      "duration": "00:14:09.7020000",
      "explicit": true,
      "spotifyId": "5t61CA4jsUWGpsnllAhP84",
      "appleId": 1000651321958,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5t61CA4jsUWGpsnllAhP84",
        "apple": "https://podcasts.apple.com/podcast/the-chad-daybell-trial-a-recap-of-jury/id1575753383?i=1000651321958"
      }
    },
    {
      "id": "ff87f4b5-f7ad-49b0-a801-dc99c09182cb",
      "title": "A Look Back:  The CentrePoint Community And The Abuse That Occurred Within It",
      "description": "The Centrepoint Community was a controversial commune in New Zealand that operated from 1977 to 2000. It was founded by Bert Potter and his wife, Mary, and was based on principles of communal living, personal growth, and spiritual exploration. However, over the years, the community became mired in controversy due to allegations of sexual abuse, drug use, and other forms of misconduct.In 1991, Bert Potter was convicted of indecent assault and sentenced to two and a half years in prison for sexually abusing children within the community. After his release, he continued to be associated with the community, which eventually led to its downfall.In 2000, the Centrepoint Community was raided by police, and a number of people associated with the community were arrested and charged with various offenses, including sexual abuse, drug offenses, and firearms offenses. The community was shut down, and many of its former members have spoken out about the abuse and trauma they experienced while living there.The Centrepoint Community scandal remains a dark chapter in New Zealand\u0027s history, and it has had a profound impact on those who were affected by it. In this episode, we hear from one of the women who was abused while living in the commune as a child and how that abuse was pervasive. (commercial at 8:27) to contact me: bobbycapucci@protonmail.com source: Inside sickening \u0027orgasm cult\u0027 where kids as young as 10 were forced into vile sex games and fed LSD by warped leader | The US Sun (the-sun.com) Become a supporter of this podcast: https://www.spreaker.com/podcast/the-epstein-chronicles--5003294/support .",
      "release": "2024-03-17T00:00:02Z",
      "duration": "00:13:56.7140000",
      "explicit": true,
      "spotifyId": "1gqGL3uJSrdIyZajtqPoBy",
      "appleId": 1000649440961,
      "subjects": [
        "Centrepoint"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gqGL3uJSrdIyZajtqPoBy",
        "apple": "https://podcasts.apple.com/podcast/a-look-back-the-centrepoint-community-and/id1575753383?i=1000649440961"
      }
    }
  ]
}