{
  "_ts": 0,
  "id": "c469c694-f2cf-4d06-8b64-b433851d2273",
  "name": "The Trial Of Karen Read | Justice For John O\u0027Keefe",
  "spotifyId": "59zItNCLdq7EqjRD9zA7ui",
  "appleId": 1741967901,
  "episodes": [
    {
      "id": "d8628bcc-79fa-49b7-8967-970b83c79a77",
      "title": "A Look At The Mentally Disturbed \u0027Cult Members\u0027 Who Harass The Family \u0026 Friends Of John O\u0027Keefe",
      "description": "In a recent episode of \u0022Hidden Killers With Tony Brueski,\u0022 defense attorney and host of \u0022Defense Diaries\u0022 Bob Motta discusses the ongoing harassment endured by individuals connected to the John O\u0027Keefe case. Highlighting Allie McCabe\u0027s testimony, Motta explains the severe emotional toll taken on the families involved due to relentless online harassment and misinformation. The conversation delves into the dangerous power of social media in influencing public opinion and creating cult-like behaviors among followers. Motta underscores the importance of letting trials unfold in court rather than through online speculation, emphasizing the potential for serious repercussions when people prematurely judge those involved in high-profile cases. Bullet Points - Allie McCabe testified about enduring severe harassment from bloggers and online individuals. - The harassment included phone calls, emails, and people showing up at their homes. - Bob Motta criticized the irresponsible behavior of online influencers and bloggers for inciting harassment. - Motta compared the case to the Koberger situation, highlighting similar patterns of unfounded accusations. - The discussion emphasized the dangerous power of social media in creating cult-like behaviors among followers. - Motta advocated for the importance of waiting for trials to unfold in court rather than jumping to conclusions online. - The podcast highlighted the real-life trauma and long-term impact on those falsely accused and harassed. #JohnOKeefe #AllieMcCabe #BobMotta #DefenseDiaries #SocialMediaHarassment #TrueCrime #JusticeForJohnOKeefe Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Karen Read Trial, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, Justice for Harmony Montgomery, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2024-05-23T19:00:00Z",
      "duration": "00:09:05.8540000",
      "explicit": false,
      "spotifyId": "1iNQqEV7gmmNxHKXLmq62F",
      "appleId": 1000656550061,
      "subjects": [
        "Chad Daybell",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1iNQqEV7gmmNxHKXLmq62F",
        "apple": "https://podcasts.apple.com/podcast/a-look-at-the-mentally-disturbed-cult-members/id1741967901?i=1000656550061"
      }
    }
  ]
}