{
  "_ts": 0,
  "id": "35e3297f-4e09-4690-a0cf-05698b0ac8c2",
  "name": "The Vermont Conversation with David Goodman",
  "spotifyId": "5DDHyNnmYe1BPg78T0Lfac",
  "appleId": 1182144448,
  "episodes": [
    {
      "id": "a2d0c5bc-bed1-41d3-abfe-c5f1df1a042b",
      "title": "Surviving and escaping the Twelve Tribes cult",
      "description": "In August 2000, 23-year-old Tamara Mathieu and her husband left good jobs, gave up everything, and joined a cult. For 14 years, they were members of Twelve Tribes, which the Southern Poverty Law Center describes as “a Christian fundamentalist cult” that has been accused of child abuse, child labor, racism and misogyny. The Twelve Tribes made national news in 1984 when their Island Pond community, which was then known as the Northeast Kingdom Community Church, was raided by Vermont State Police and 112 children were detained in response to allegations of child abuse. A judge later dismissed the cases, ruling that the raid was unconstitutional. The Twelve Tribes “sees persecution as proof that they\u0027re God\u0027s people,” said Mathieu. Mathieu, her husband and four children left the Twelve Tribes in 2014. She now works for Northwestern Counseling and Support Services in St. Albans as a facilitator of day programs for adults with developmental disabilities. She has just written a book, “All Who Believed: A Memoir of Life in the Twelve Tribes.” The Twelve Tribes attracted “people who don\u0027t want to fit into the 9-to-5 rat race of society, and they want this life of love and caring for each other and community,” explained Mathieu. “Suddenly, you\u0027re surrounded by this group of people who are just enamored by you who are giving you all this praise and encouragement.” Leaving the cult “was terrifying,” said Mathieu. “We had lived in this bubble and raised our children in this bubble. And then to come out, it\u0027s like you are bombarded with stimuli that haven\u0027t been a part of your life. I felt like a new parent. All I had done all those years was just spank my children for everything they ever did wrong. And I knew that we didn\u0027t want to continue on that practice, but what do you do? Like, a timeout?” Mathieu hopes that people who read her book see it as a cautionary tale. “Your personal freedom and your ability to make decisions for you and your family is really a priceless thing. I wouldn\u0027t give that up for anything anymore.” She also noted that cults are everywhere. “People might not really even realize what\u0027s going on right next door.”",
      "release": "2024-04-25T01:52:28Z",
      "duration": "00:50:05.5430000",
      "explicit": false,
      "spotifyId": "5X7LKUo6MS92SXKZK1YRzZ",
      "appleId": 1000653517182,
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5X7LKUo6MS92SXKZK1YRzZ",
        "apple": "https://podcasts.apple.com/podcast/surviving-and-escaping-the-twelve-tribes-cult/id1182144448?i=1000653517182"
      }
    }
  ]
}