{
  "id": "02a6dcc1-96ff-42f0-a32f-5e576b6970ca",
  "name": "The Cult I Left Behind",
  "spotifyId": "1oNHYt9VaYLXZKMKeLl01p",
  "appleId": 1705661944,
  "episodes": [
    {
      "id": "319fba75-a615-4667-817b-89c4896525ba",
      "title": "87 - Chantelle’s Story: From Shame and Control to Healing and Freedom",
      "description": "When Chantelle was sent to the cult Headquarters as an “encouragement case,” she encountered Bill Gothard’s inappropriate and abusive behavior toward teenage girls firsthand. She shares what it was like to grow up in IBLP and ATI, survive both Headquarters and the cult’s finishing school for young ladies, and ultimately marry young to escape her father’s “umbrella of authority.” Today, Chantelle uses her story and training in hypnotherapy to educate others and bring healing to those manipulated by shame, guilt, and fear. She also offers practical ideas and resources for people who want to pursue healing but face financial constraints. Connect with Chantelle: www.chantellen.com Resources Chantelle Recommends: The Tapping Solution App www.ifsbuddy.chat Books Chantelle Recommends: Feeding Your Demons by Tsultrim Allione Self-Therapy (3rd Edition) by Jay Earley, PhD The Untethered Soul by Michael A. Singer Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-09-01T04:00:00Z",
      "duration": "01:42:57.5930000",
      "explicit": true,
      "spotifyId": "03h0VCjX9oCwKIlFvfFYpc",
      "appleId": 1000724328664,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/03h0VCjX9oCwKIlFvfFYpc",
        "apple": "https://podcasts.apple.com/podcast/87-chantelles-story-from-shame-and-control-to-healing/id1705661944?i=1000724328664"
      }
    },
    {
      "id": "f6980a9b-2cf7-40b0-b8cb-8ce3f32d14f0",
      "title": "86 - Mother Wounds with Jessica Jocelyn (Part 2)",
      "description": "In the second half of our conversation with poet Jessica Jocelyn, we pick up where the shocking story of her mom left off. Jessica shares how poetry became a way to make sense of loss, love, and the wounds only a mother can leave behind. Together, Amanda and Jessica talk about healing mother wounds, the fear of becoming like the women who hurt them, and the complicated feelings that surface as we begin to look more and more like our mothers with age. \nConnect with Jessica:\nlinktr.ee/jessicajocelyn\nInstagram: @letters.to.anna\nFacebook: Jessica Jocelyn Poetry\nTikTok: @jessica.jocelyn\nSend us text! Please note this platform only supports one-way communication. \nSupport the show",
      "release": "2025-08-18T04:00:00Z",
      "duration": "01:20:20",
      "explicit": false,
      "spotifyId": "0lcgkjIoEukBCFl5zeKY89",
      "appleId": 1000722359024,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0lcgkjIoEukBCFl5zeKY89",
        "apple": "https://podcasts.apple.com/podcast/86-mother-wounds-with-jessica-jocelyn-part-2/id1705661944?i=1000722359024"
      }
    },
    {
      "id": "01e0d006-64d3-48f0-a989-55f6be237fb0",
      "title": "85 - Mother Wounds with Jessica Jocelyn (Part 1)",
      "description": "In Part 1 of this two-part conversation, we’re honored to welcome poet Jessica Jocelyn—whose writing has been a healing touchstone for Amanda and may already be familiar to listeners of the podcast.\nJessica is a best-selling poet whose work explores love, loss, motherhood, and the complexities of family with raw emotional power. She’s the author of five volumes of poetry, all widely praised for their vulnerability, resonance, and reach.\nIn this episode, we discuss:\nJessica’s childhood with a mother who felt more like a cult leaderHer experience as an adult convert in the Jehovah’s Witnesses—what led her there, and how she found her way outHer forthcoming poetry collection, Paper Flowers, releasing August 31, 2025This is the first time Jessica has shared her full story on record—and it’s a wild, heartbreaking, and healing ride.\nWe can’t wait for you to hear it.\nConnect with Jessica:\nlinktr.ee/jessicajocelyn\n Instagram: @letters.to.anna\n Facebook: Jessica Jocelyn Poetry\nTikTok: @jessica.jocelyn\nSend us text! Please note this platform only supports one-way communication. \nSupport the show",
      "release": "2025-08-04T04:00:00Z",
      "duration": "01:24:53",
      "explicit": false,
      "spotifyId": "4JLckgms6PEtxAhYmDfVN8",
      "appleId": 1000720548166,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4JLckgms6PEtxAhYmDfVN8",
        "apple": "https://podcasts.apple.com/podcast/85-mother-wounds-with-jessica-jocelyn-part-1/id1705661944?i=1000720548166"
      }
    },
    {
      "id": "a953a5d7-b3e5-44bc-890b-bf10f1fb50db",
      "title": "84 - Sometimes, You Get What You Want",
      "description": "Amanda has gotten a lot of questions about whether she would ever let anyone from her biological family back into her life.\n\n\nFor a long time, the answer was no. But then something changed.\n\n\nIt’s been a year and a half, and we\u0027ve waited a long time to talk about it. This is the first time we\u0027re sharing the story. \nSend us text! Please note this platform only supports one-way communication. \nSupport the show",
      "release": "2025-07-21T04:00:00Z",
      "duration": "00:29:23",
      "explicit": false,
      "spotifyId": "0P9utkqpuVYA2sDkD2EtM4",
      "appleId": 1000718224608,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0P9utkqpuVYA2sDkD2EtM4",
        "apple": "https://podcasts.apple.com/podcast/84-sometimes-you-get-what-you-want/id1705661944?i=1000718224608"
      }
    },
    {
      "id": "5a4fa469-13db-4e84-9d1d-e0a517f091b7",
      "title": "83 - Dear Diary",
      "description": "Amanda reads from her childhood diaries—yes, actual entries from her cult years—and then melts through the floor in embarrassment. It’s awkward, vulnerable, and a surprisingly raw window into growing up homeschooled under fundamentalism. \nSend us text! Please note this platform only supports one-way communication. \nSupport the show",
      "release": "2025-07-07T04:00:00Z",
      "duration": "00:45:59",
      "explicit": false,
      "spotifyId": "6DmwM7H914Fb0wMbeXHixF",
      "appleId": 1000716051302,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6DmwM7H914Fb0wMbeXHixF",
        "apple": "https://podcasts.apple.com/podcast/83-dear-diary/id1705661944?i=1000716051302"
      }
    },
    {
      "id": "3e2c401a-debc-44f7-af36-ce010ff8bd2c",
      "title": "One Story, Two Journeys",
      "description": "Amanda opens this episode with some never-before-shared stories from her early experiences in therapy—including one that caught even Kyle off guard. From there, the mic turns, and Kyle shares what it was like to hear Amanda’s story for the first time and slowly step into the world of advocacy and trauma-informed care. What begins as reflection becomes something quietly transformative—revealing just how much learning and love can grow side by side. \nSend us text! Please note this platform only supports one-way communication. \nSupport the show",
      "release": "2025-06-23T04:00:00Z",
      "duration": "00:41:51",
      "explicit": false,
      "spotifyId": "4oO274PwHc3zdx9UJ3Khhb",
      "appleId": 1000714127333,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4oO274PwHc3zdx9UJ3Khhb",
        "apple": "https://podcasts.apple.com/podcast/one-story-two-journeys/id1705661944?i=1000714127333"
      }
    },
    {
      "id": "e97889e2-8953-45d6-b8c0-adef114a2690",
      "title": "81 - Losing Parents the Second Time",
      "description": "In a deeply personal episode, Amanda opens up about the circumstances that led to the end of her relationship with her adoptive parents. What started as a long-building tension came to a head when Amanda asked to be treated like a real daughter—and was told no. She and Kyle walk through the factors that shaped the outcome, what was said, how it unfolded, and what it means to grieve the loss of a family you thought chose you.\nSend us text! Please note this platform only supports one-way communication. \nSupport the show",
      "release": "2025-06-09T04:00:00Z",
      "duration": "00:45:08",
      "explicit": false,
      "spotifyId": "6TUFNZEwsi1zf6fcBPLqD6",
      "appleId": 1000712045317,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6TUFNZEwsi1zf6fcBPLqD6",
        "apple": "https://podcasts.apple.com/podcast/81-losing-parents-the-second-time/id1705661944?i=1000712045317"
      }
    },
    {
      "id": "b8ba3569-1e0e-498d-a9c7-3524937f4995",
      "title": "80 - Family Ended With Boundaries",
      "description": "Content warning: This episode includes discussion of sexual violence, including against children. \nWhen Amanda set boundaries with her bio family—and the brother who abused her—she expected it to be hard. But not like this. In this highly personal episode, she shares a glimpse into the painful correspondence with her three younger brothers and their disturbing responses: manipulation, gaslighting, and spiritual abuse. They questioned her story, weaponized religion, and even tried to enlist her ex-husband—claiming he was “God’s authority” over her life—to force her back into the family’s narrative about the abuse. \nThis episode explores what happens when family chooses power over love. Kyle joins to unpack the emotional and spiritual toll of being betrayed by those you once protected, what it means to forgive, and what it looks like to walk away when the cost of staying is your truth.\nSend us text! Please note this platform only supports one-way communication. \nSupport the show",
      "release": "2025-05-26T04:00:00Z",
      "duration": "01:14:07",
      "explicit": false,
      "spotifyId": "5gjXgmXyrr2EmXlPJy2gnK",
      "appleId": 1000709855304,
      "subjects": [
        "Institute In Basic Life Principles",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5gjXgmXyrr2EmXlPJy2gnK",
        "apple": "https://podcasts.apple.com/podcast/80-family-ended-with-boundaries/id1705661944?i=1000709855304"
      }
    },
    {
      "id": "720fb288-dabc-4e95-bde3-614cacf7f278",
      "title": "79 - Mother’s Day, Mother Wounds",
      "description": "As The Cult I Left Behind listeners know, Mother’s Day isn’t a sappy Hallmark holiday for Amanda. In this episode, Amanda and Kyle talk about what the day brings up—not just for Amanda, but for anyone who experienced harm from their mothers. Amanda shares a letter she wrote to the mother figures in her life and reflects on how watching motherhood play out in the cult shaped her earliest beliefs—and deepest fears—about what it means to be a mom. She also reads a personal list of fears she’s had about becoming a mother herself, and the steps she’s taken to work through them. The episode closes with a short selection of poetry honoring the pain of mother wounds, plus date and time details for an upcoming livestream. \nSend us text! Please note this platform only supports one-way communication. \nSupport the show",
      "release": "2025-05-12T04:00:00Z",
      "duration": "00:45:40",
      "explicit": false,
      "spotifyId": "1vTkcIAIGa6bkkZuVqoER9",
      "appleId": 1000708058682,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1vTkcIAIGa6bkkZuVqoER9",
        "apple": "https://podcasts.apple.com/podcast/79-mothers-day-mother-wounds/id1705661944?i=1000708058682"
      }
    },
    {
      "id": "1cad6c5c-86b2-4da0-864f-169f116c7182",
      "title": "78 - Discipline Outside the Cult",
      "description": "In this companion to the earlier episode on discipline inside the cult, Amanda and Kyle shift their focus to what healthy, respectful discipline actually looks like. They reflect on what they’re learning in their adoption training classes and how sharply it contrasts with the abusive tactics Amanda experienced growing up in the IBLP cult. They also discuss the lasting impact of corporal punishment, including research showing it affects the brain in ways similar to sexual abuse and other forms of violence. For Amanda, this conversation runs even deeper. As someone who’s lost both a biological and chosen family, the process of preparing to become a parent brings up a lot of questions—about worthiness, healing, and whether having a family is in the cards for her. This episode holds space for grief, growth, and the kind of parenting that breaks generational cycles. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-04-14T04:00:00Z",
      "duration": "00:46:24",
      "explicit": false,
      "spotifyId": "3wkly7ucDO7Z3m67YJ4R3s",
      "appleId": 1000703412996,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3wkly7ucDO7Z3m67YJ4R3s",
        "apple": "https://podcasts.apple.com/podcast/78-discipline-outside-the-cult/id1705661944?i=1000703412996"
      }
    },
    {
      "id": "da4a45d3-4a46-41af-8fb1-0176e85f2e4d",
      "title": "77 - Unpacking the Past: Cults, Faith, and Family Truths",
      "description": "In this episode, Amanda and Kyle dive into listener questions about what made Amanda’s parents susceptible to joining the cult, how they became involved, how the cult accumulated massive assets, and whether Amanda’s rapist brother ever received any mental health diagnoses. They also discuss how Amanda’s college viewed the cult\u0027s ideology and its current reputation within the evangelical community. Amanda and Kyle also tackle a thought-provoking question about faith: how does Amanda respond to people who say it wasn’t God who failed her, but people? A nuanced theological conversation follows. Finally, Amanda and Kyle share a brief update about Amanda’s adoptive parents, addressing listener questions and providing some clarity on where things stand now. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-03-31T04:00:00Z",
      "duration": "00:33:56",
      "explicit": false,
      "spotifyId": "3qRyWvNvepLYV9K3Ibxmiw",
      "appleId": 1000701532347,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3qRyWvNvepLYV9K3Ibxmiw",
        "apple": "https://podcasts.apple.com/podcast/77-unpacking-the-past-cults-faith-and-family-truths/id1705661944?i=1000701532347"
      }
    },
    {
      "id": "46954446-ea48-4134-a9e8-c87db34419d8",
      "title": "76 - Finding Peace in Denmark: A Journey from High-Control to True Relaxation",
      "description": "In this episode, Amanda and Kyle share their transformative experience during a recent trip to Denmark, contrasting it with Amanda\u0027s upbringing in a high-pressure religious environment and subsequent military service. Amanda discusses how the slower pace and quieter, more relaxed culture of Denmark allowed her to feel truly relaxed and safe for the first time in her life. They explore the cultural differences they observed, including the emphasis on work-life balance and the importance of being present, which profoundly impacted Amanda. As they strive to integrate these lessons into their life back in the U.S., Amanda and Kyle also announce an upcoming live stream collaboration focused on discussing life in high-control religious environments. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-03-17T04:00:00Z",
      "duration": "00:38:37",
      "explicit": false,
      "spotifyId": "3hiXxYsycRHE4KSLRU02lL",
      "appleId": 1000699446300,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hiXxYsycRHE4KSLRU02lL",
        "apple": "https://podcasts.apple.com/podcast/76-finding-peace-in-denmark-a-journey-from-high/id1705661944?i=1000699446300"
      }
    },
    {
      "id": "66aa39b1-d97b-4566-abf4-93168cf2d93b",
      "title": "75 - How to Deconstruct",
      "description": "In this episode, Amanda and Kyle dive into the process of deconstruction—what it is, why it happens, and how it unfolds across different areas of life. From faith and identity to relationships and worldviews, they explore the key domains of deconstruction and the challenges that come with questioning deeply held beliefs. Whether you\u0027re in the middle of your own deconstruction journey or just curious about what it entails, this conversation offers insight and validation. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-03-03T05:00:00Z",
      "duration": "00:44:22.0600000",
      "explicit": true,
      "spotifyId": "5Lydjmg1qkjATmyMOKTCRk",
      "appleId": 1000697302833,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Lydjmg1qkjATmyMOKTCRk",
        "apple": "https://podcasts.apple.com/podcast/75-how-to-deconstruct/id1705661944?i=1000697302833"
      }
    },
    {
      "id": "333449d6-5a53-4e04-8948-26e48034952e",
      "title": "74 - Big Changes, Listener Q\u0026A, and Cult Realities",
      "description": "Some big life changes are on the horizon, and Amanda and Kyle share a bit about their next steps as a family. They also dive into listener questions, discussing the most effective therapy approaches Amanda has found, how the cult handled cases of incest, and its stance on queer folks. It’s a raw and thought-provoking conversation—one you won’t want to miss. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-02-17T05:00:00Z",
      "duration": "00:25:26.5430000",
      "explicit": true,
      "spotifyId": "5TNrQuuAw7I8mE51U91NhG",
      "appleId": 1000692941787,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TNrQuuAw7I8mE51U91NhG",
        "apple": "https://podcasts.apple.com/podcast/74-big-changes-listener-q-a-and-cult-realities/id1705661944?i=1000692941787"
      }
    },
    {
      "id": "afacddc4-30ea-4e79-8c76-7b0935e1f5c9",
      "title": "73 - Growing Up in IBLP:  A Male Survivor’s Perspective on Trauma and Healing",
      "description": "In this episode, we sit down with Nate, an IBLP/ATI cult survivor and trauma survivor, to unpack the deeply ingrained conditioning we experienced growing up in the cult. From childhood grooming and the loss of personal identity to the twisted teachings that framed God’s love as something to be earned, we explore the ways the cult set us up for harm. Nate shares his personal journey of launching into adulthood without the tools to navigate the real world, the challenges of healing from childhood and religious trauma, and his experiences as a man seeking therapy. We also discuss what it means to reclaim agency, identity, and self-worth after years of being treated as a prop in someone else\u0027s narrative. Was it “worth it all” as IBLP promised? Listen and find out. Adult Children of Alcoholics®\u0026 Dysfunctional Families Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-02-10T05:00:00Z",
      "duration": "01:32:17.5410000",
      "explicit": true,
      "spotifyId": "71megF4Sydc89GSUDmszKb",
      "appleId": 1000690744080,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/71megF4Sydc89GSUDmszKb",
        "apple": "https://podcasts.apple.com/podcast/73-growing-up-in-iblp-a-male-survivors-perspective/id1705661944?i=1000690744080"
      }
    },
    {
      "id": "4e71c848-8ba0-4790-88fb-ce84e96dc3eb",
      "title": "72 - Protecting Kids from Sexual Abuse: What Every Parent Should Know",
      "description": "When we think about keeping kids safe from predators, we often imagine dangers lurking in the shadows—but the reality is much harder to face. Most abuse is committed by people close to the family, making prevention both challenging and deeply personal. In this episode, Amanda shares practical, real-world strategies for protecting kids from sexual predators, setting clear boundaries, and creating open lines of communication that empower children to speak up. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-02-03T05:00:00Z",
      "duration": "00:31:49.7070000",
      "explicit": true,
      "spotifyId": "2PT1ac1vLC0gU4fUMNFRmn",
      "appleId": 1000687711943,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2PT1ac1vLC0gU4fUMNFRmn",
        "apple": "https://podcasts.apple.com/podcast/72-protecting-kids-from-sexual-abuse-what-every-parent/id1705661944?i=1000687711943"
      }
    },
    {
      "id": "04c62f6b-21da-4167-8820-b0a69d6271f0",
      "title": "71 - Your Stories, Our Answers: Family Rejection, Advocacy, and Healing",
      "description": "In this episode, Amanda and Kyle tackle listener questions surrounding the impact of purity culture and sexual trauma. They dive into Sadia’s poignant voicemail, discussing how rigid purity culture affects perspectives on sex and consent, and dissect the harmful black-and-white thinking that can follow. Amanda shares personal insights into breaking free from self-blame and replacing toxic family voices in your head with healing ones. They also respond to a touching message from Naomi, a fellow IBLP survivor, highlighting the importance of self-love and the complexities of family rejection. Additionally, they offer practical advice for listeners like Erica, who are navigating through their past and seeking ways to get involved in advocacy and support. This episode is a heartfelt and educational conversation that you don’t want to miss, especially if you are interested in topics like abuse recovery, psychological healing, and community support. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-01-27T05:00:00Z",
      "duration": "00:55:41.0870000",
      "explicit": false,
      "spotifyId": "3XPc7UnrIaXK7ReSl8tzPN",
      "appleId": 1000685583126,
      "subjects": [
        "Institute In Basic Life Principles",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XPc7UnrIaXK7ReSl8tzPN",
        "apple": "https://podcasts.apple.com/podcast/71-your-stories-our-answers-family-rejection-advocacy/id1705661944?i=1000685583126"
      }
    },
    {
      "id": "083c1542-f63f-46a4-a14e-19a1d2dcceea",
      "title": "70 - A Conversation with Cult Survivor and Author Daniella Mestyanek Young",
      "description": "What happens when you escape a world built on control, fear, and secrecy? How do you begin to heal after a life of indoctrination? This week, we\u0027re joined by Daniella Mestyanek Young, author, TEDx speaker, and cult survivor, to dive deep into the harrowing and inspiring journey of leaving a cult—and finding yourself on the other side. Daniella\u0027s website: https://uncultureyourself.com/ Buy Daniella\u0027s book: https://uncultureyourself.com/pages/book Instagram: @daniellamyoung_ Facebook: @Daniella Mestyanek Young_Author YouTube: @KnittingCultLady X: @daniellamyoung Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-01-20T05:00:00Z",
      "duration": "01:04:08.7770000",
      "explicit": true,
      "spotifyId": "2ThQvUinBQHWi4FYDyqmfq",
      "appleId": 1000684647078,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ThQvUinBQHWi4FYDyqmfq",
        "apple": "https://podcasts.apple.com/podcast/70-a-conversation-with-cult-survivor-and/id1705661944?i=1000684647078"
      }
    },
    {
      "id": "6d1872ba-380b-467e-aeed-6aa5f2e532ec",
      "title": "69 - Sex, Healing, and Breaking Generational Cycles",
      "description": "In this episode, Amanda and Kyle are joined by Marian, a sexual health and pleasure educator, for a powerful conversation about breaking cycles of shame and stigma. Marian shares her positive experience growing up in a family where vulnerability, honesty, and support were the norm when it came to tough topics like sex. Together, they explore the stark contrast between Marian’s upbringing and Amanda’s experience in the oppressive purity culture of the cult. They dive into what it means to pass down healing, not shame, to the next generation and how parents can foster openness and healthy communication about sexuality. They also tackle a listener question about how to talk to kids and teens about sex in an approachable and affirming way, offering practical advice for creating safe spaces for these important conversations. Plus, Amanda and Kyle share details about some exciting upcoming episodes, including the incredible guests and thought-provoking topics you won’t want to miss. This is a must-listen for anyone interested in promoting sexual health, breaking generational cycles, and embracing honest, healing conversations. Resources: https://thepleasureproject.org/the-pleasure-principles/ https://parentandteen.com/resources-about-sex/ https://www.cdc.gov/healthy-youth-parent-resources/conversation-tips/index.html https://parentandteen.com/help-parents-talk-comfortably-about-sex/ Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2025-01-13T05:00:00Z",
      "duration": "00:58:23.4900000",
      "explicit": true,
      "spotifyId": "4a0Y8dKWDAvlCSLVRfbO6x",
      "appleId": 1000683734480,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4a0Y8dKWDAvlCSLVRfbO6x",
        "apple": "https://podcasts.apple.com/podcast/69-sex-healing-and-breaking-generational-cycles/id1705661944?i=1000683734480"
      }
    },
    {
      "id": "ac001ad5-af4e-4926-9f7c-77736cb3e5d3",
      "title": "68 - Wrapping Up \u0026 Moving Forward",
      "description": "Amanda and Kyle reflect on an incredible year of connection and growth and share their heartfelt gratitude for the listeners who’ve supported the show. From messages and comments to thoughtful questions, your voices have made this journey meaningful. Amanda and Kyle also drop some news about exciting episodes coming in January to kick off the new year! As the holiday season approaches, Amanda shares a gentle reminder to prioritize emotional safety, mental health, and self-compassion. The podcast will take a short two-week break, but Amanda and Kyle can’t wait to return in January, refreshed and ready for what’s next. Thanks for being part of this community, and happy holidays! Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-12-23T05:00:00Z",
      "duration": "00:11:39.3760000",
      "explicit": false,
      "spotifyId": "3vfvPAeT8nLDQVIlC7gGUT",
      "appleId": 1000681368496,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vfvPAeT8nLDQVIlC7gGUT",
        "apple": "https://podcasts.apple.com/podcast/68-wrapping-up-moving-forward/id1705661944?i=1000681368496"
      }
    },
    {
      "id": "0d6411c1-05a0-4228-bc08-1effc92a5206",
      "title": "67 - A Forced Apology",
      "description": "Amanda shares a pivotal moment from her childhood: being made to apologize to the person who raped her. She and Kyle discuss the circumstances that led to this event, the family and cult factors at play, and how the experience continues to affect Amanda today. Together, they explore the long-term implications of spiritual manipulation and abuse. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-12-16T05:00:00Z",
      "duration": "00:31:24.4990000",
      "explicit": true,
      "spotifyId": "1tv696IU7hdeOtKzGE5Ddz",
      "appleId": 1000680509978,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1tv696IU7hdeOtKzGE5Ddz",
        "apple": "https://podcasts.apple.com/podcast/67-a-forced-apology/id1705661944?i=1000680509978"
      }
    },
    {
      "id": "95bc834f-b8ff-4174-8102-cebd01cbc390",
      "title": "66 - Defying Gravity and Cults",
      "description": "In this heartfelt and personal episode, Amanda opens up about the unexpected role the musical Wicked played in her journey of leaving the IBLP cult and rediscovering herself. From its powerful themes of challenging authority to embracing individuality, Amanda shares how the story of Elphaba’s courage and defiance resonated deeply during her deconstruction and healing process. With raw vulnerability, she recounts the moments when Wicked’s music and lyrics felt like a lifeline, inspiring her to “defy gravity” and chart a new path. Whether you’re a fan of Broadway or navigating your own personal struggles, this episode is a reminder that even the most unexpected things—like a stage musical—can be a source of hope and strength. Tune in to hear Amanda’s reflections, her favorite songs from the show, and why Wicked remains a meaningful part of her story. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-12-09T05:00:00Z",
      "duration": "00:38:27.2650000",
      "explicit": true,
      "spotifyId": "0j9xspIdZiJ3Rx3sB2Nip7",
      "appleId": 1000679706379,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0j9xspIdZiJ3Rx3sB2Nip7",
        "apple": "https://podcasts.apple.com/podcast/66-defying-gravity-and-cults/id1705661944?i=1000679706379"
      }
    },
    {
      "id": "0d8f2630-5fef-42ed-b10d-27caae1f8e30",
      "title": "65 - Amanda\u0027s Post-Cult Dating Adventure",
      "description": "Amanda finally shares some of her dating history post-cult, pre-Kyle. Stories include the Taco Bell incident (Kyle\u0027s favorite), trad-wife-seeking encounters, insurance scammers, and that one time Amanda asked a guy out (see social media for the whole story). Also, as a public health professional, Amanda is very proud of how she handled the sexual aspect of her dating history. ;) Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-12-02T05:00:00Z",
      "duration": "00:46:54.3800000",
      "explicit": true,
      "spotifyId": "2wSAXLJJN7iun4KdKPpuRS",
      "appleId": 1000678856498,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2wSAXLJJN7iun4KdKPpuRS",
        "apple": "https://podcasts.apple.com/podcast/65-amandas-post-cult-dating-adventure/id1705661944?i=1000678856498"
      }
    },
    {
      "id": "804a0d94-c424-4f96-a1ff-d7850dbc2538",
      "title": "64 - Happy Thanksgiving \u0026 Exciting Announcement!",
      "description": "Join us for a quick Thanksgiving episode and special announcement! Kyle shares his family\u0027s special Thanksgiving meal tradition and Amanda shares some memories of Thanksgivings from her childhood. For all of our listeners with tough family situations this holiday season, we send you love and a reminder that you are worthy, your boundaries are important, and you always have community here with us. Happy Thanksgiving! Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-11-25T05:00:00Z",
      "duration": "00:10:13.9820000",
      "explicit": false,
      "spotifyId": "5vw9lOoYPf0t1X3DQIVAbq",
      "appleId": 1000678119354,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5vw9lOoYPf0t1X3DQIVAbq",
        "apple": "https://podcasts.apple.com/podcast/64-happy-thanksgiving-exciting-announcement/id1705661944?i=1000678119354"
      }
    },
    {
      "id": "9b4b48b4-a6fc-40fb-9bed-2c0616cc0b29",
      "title": "63 - You Asked, We Answered",
      "description": "Amanda and Kyle respond to listener questions about head coverings, cult practices around the Sabbath, if Amanda thinks her boldness and intelligence caused her to be targeted for abuse as she grew up in the IBLP cult, and how Amanda thinks sexual abuse against one of her brothers would have been handled versus how it was handled for her as a girl. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-11-18T05:00:00Z",
      "duration": "00:32:53.2630000",
      "explicit": true,
      "spotifyId": "0gLYtculc1c4G5OKjOd1Lw",
      "appleId": 1000677280684,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0gLYtculc1c4G5OKjOd1Lw",
        "apple": "https://podcasts.apple.com/podcast/63-you-asked-we-answered/id1705661944?i=1000677280684"
      }
    },
    {
      "id": "980262a2-1681-4827-a4fb-e9ae0437b357",
      "title": "62 - Elections and Cults",
      "description": "What do Cabbage Patch Kids and the 2024 election in the US have in common? A lot, as it turns out. This episode was recorded in response to a poll posted on social media asking listeners to share topics they would like to hear in an episode. Amanda and Kyle discuss correlations between Bill Gothard and Trump/Vance. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-11-11T05:00:00Z",
      "duration": "00:39:28.4960000",
      "explicit": true,
      "spotifyId": "3UAX673PlNfbiDgS1FqR9n",
      "appleId": 1000676433463,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3UAX673PlNfbiDgS1FqR9n",
        "apple": "https://podcasts.apple.com/podcast/62-elections-and-cults/id1705661944?i=1000676433463"
      }
    },
    {
      "id": "ea03f8da-ed6e-4364-8a22-b9a28e371699",
      "title": "61 - Kyle and Sex",
      "description": "Kyle is in the hot seat sharing his background in the Christian church, his thoughts about purity culture as a young adult, and the way he handled sex and relationships as someone who attended Baptist church. Amanda learns a shocking revelation about Kyle\u0027s past. Kyle shares his deconstruction story and his eventual departure from Christianity. Jump in the comments and convince Kyle to share photos of his high school hairstyle on our social media channel. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-11-04T05:00:00Z",
      "duration": "01:05:19.0980000",
      "explicit": true,
      "spotifyId": "4u1P7vNwipwREIeSpeynir",
      "appleId": 1000675566908,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4u1P7vNwipwREIeSpeynir",
        "apple": "https://podcasts.apple.com/podcast/61-kyle-and-sex/id1705661944?i=1000675566908"
      }
    },
    {
      "id": "c23db380-f16e-44a5-b082-65588c0799f6",
      "title": "60 - Deconstruction",
      "description": "Amanda shares her deconstruction journey, which began a decade ago when she was a worship leader for a church. That was awkward. She talks through attending seminary after Bible college and her process of realizing there were aspects of Christianity and religion that were irreconcilable with logic, in her opinion. Kyle accidentally lands in the hot seat when revealing parts of his deconstruction experience, so more to come on this topic for sure! Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-10-28T04:00:00Z",
      "duration": "01:00:09",
      "explicit": false,
      "spotifyId": "2j6XWtN0xK0sG9M8lqojhZ",
      "appleId": 1000674659297,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2j6XWtN0xK0sG9M8lqojhZ",
        "apple": "https://podcasts.apple.com/podcast/60-deconstruction/id1705661944?i=1000674659297"
      }
    },
    {
      "id": "c20d3a02-1f00-466b-a863-9f803b2e1506",
      "title": "59 - The Story of Us",
      "description": "Following up on the marriage purposes series, Amanda and Kyle share their non-courtship story that basically ignored all of Bill\u0027s relationship guidelines. However, Kyle almost followed purity culture with room for the Holy Spirit for a whole lotta dates. Amanda will never let him live it down. They compare Bill\u0027s marriage principles to the insights of an actual therapist who, you know, is trained in these matters, and Kyle reports on the results of travel-enforced abstinence--in case you were wondering how Bill\u0027s marriage rules work out in the real world. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-10-21T04:00:00Z",
      "duration": "00:58:59",
      "explicit": false,
      "spotifyId": "55eEM8Yui3UuZm1VfeQfbO",
      "appleId": 1000673793217,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/55eEM8Yui3UuZm1VfeQfbO",
        "apple": "https://podcasts.apple.com/podcast/59-the-story-of-us/id1705661944?i=1000673793217"
      }
    },
    {
      "id": "64ccd7ed-e470-48a7-8961-3fb1d65bf73b",
      "title": "58 - Coming Home",
      "description": "Amanda flies solo for another episode. This time, she shares about her journey out of a very checked out or dissociative state and home to her own body, mind, and emotions. Amanda went on this journey as she left the cult and began abuse recovery, and also more recently. She shares the ups and downs of the process, including the discomfort of checking back into your own life and becoming aware of issues that exist there as well as the joy of getting to know yourself for the first time. In the end, she finds her way home. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-10-14T04:00:00Z",
      "duration": "00:25:10",
      "explicit": false,
      "spotifyId": "3SdCA6MvLyMrqia7V29xD6",
      "appleId": 1000672975142,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3SdCA6MvLyMrqia7V29xD6",
        "apple": "https://podcasts.apple.com/podcast/58-coming-home/id1705661944?i=1000672975142"
      }
    },
    {
      "id": "4c36c815-f5d0-4f34-b6f7-31b38965567f",
      "title": "57 - On a Journey to Trust",
      "description": "Amanda and Kyle are joined by a special guest! Skye\u0027s story caught our attention right away—her mother, the owner of an adult toy business, sent her to a fundamentalist Christian elementary school WAIT WHAT?! The part about her mom’s business is a great story and will make you chuckle, but unfortunately, this school is also where Skye first experienced grooming. It was also at this school, at just seven years old, she was told Satan was living in her heart, sparking a deconstruction journey that began decades before, well, many of us. In this episode, Skye delivers a powerful message on the importance of listening to children when they express discomfort, how naivety can make individuals more vulnerable to grooming, and the crucial role of believing and protecting survivors from further harm. She also opens up about her own journey to heal and reclaim her ability to trust and find goodness in others, even those with differing beliefs. Topic warning: Grooming, rape, biphobia Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-10-07T04:00:00Z",
      "duration": "01:17:08",
      "explicit": false,
      "spotifyId": "0RIw49yA3ifGoKQKXNFD1U",
      "appleId": 1000672008677,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0RIw49yA3ifGoKQKXNFD1U",
        "apple": "https://podcasts.apple.com/us/podcast/57-on-a-journey-to-trust/id1705661944?i=1000672008677"
      }
    },
    {
      "id": "2fd34f3a-d9a5-4981-b6e6-2c48071da492",
      "title": "56 - In Which Amanda Tries to Convince Kyle to Try Bill\u0027s Abstinence Program for Science",
      "description": "We reach the end of our Six Purposes of Marriage journey! Amanda and Kyle procrastinate and talk about a lot of other things, including how the violin is the most righteous instrument, before diving into Bill Gothard’s strange teachings about what marriage “illustrates.” Amanda and Kyle recap the purpose of marriage in the IBLP cult, which is basically about abstinence and the menstrual cycle, and Amanda gets the brilliant idea to try Bill’s abstinence program for science and report back on its marital impacts. Kyle proves difficult to convince. Amanda\u0027s story about being asked to perform music for a mass wedding ceremony to Jesus gets honorable mention. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-09-30T04:00:00Z",
      "duration": "00:39:19",
      "explicit": false,
      "spotifyId": "5WjQL7dNEnd6iyySwsBuyM",
      "appleId": 1000671242961,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WjQL7dNEnd6iyySwsBuyM",
        "apple": "https://podcasts.apple.com/us/podcast/56-in-which-amanda-tries-to-convince-kyle-to-try-bills/id1705661944?i=1000671242961"
      }
    },
    {
      "id": "9883d156-7274-4a55-a20b-b684cfad8f28",
      "title": "55 - Protection of the...Seed?",
      "description": "Mothers aren\u0027t protective. Divorce taints godly seed. A woman finally matters because she made a lot of kids who went and did church work. We talk about these topics and many other confusing aspects of Bill Gothard\u0027s teachings about pure Christian family lines. Amanda and Kyle also answer listener questions about beliefs in the cult regarding doctors/medical intervention/vaccines as well as a cult-adjacent program called \u0022Bright Lights.\u0022 Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-09-23T04:00:00Z",
      "duration": "00:37:17",
      "explicit": false,
      "spotifyId": "3vHwA9mgtikiqnPGnRgorN",
      "appleId": 1000670352123,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vHwA9mgtikiqnPGnRgorN",
        "apple": "https://podcasts.apple.com/us/podcast/55-protection-of-the-seed/id1705661944?i=1000670352123"
      }
    },
    {
      "id": "c847c564-2550-4989-9bf7-c63fbe43e98d",
      "title": "54 - Be Fruitful and Multiply...Like, a Lot",
      "description": "Amanda and Kyle discuss the IBLP cult\u0027s stance on how a godly couple goes about family planning...or doesn\u0027t, because God will plan your family. We learn things like the role of proper music and abstinence in conception, the many \u0022hidden designs\u0022 in the Bible, and how the pull out method of birth control can get you killed. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-09-16T04:00:00Z",
      "duration": "00:50:49",
      "explicit": false,
      "spotifyId": "0VhsziZsbpEovE2AyTf5AF",
      "appleId": 1000669650754,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0VhsziZsbpEovE2AyTf5AF",
        "apple": "https://podcasts.apple.com/us/podcast/54-be-fruitful-and-multiply-like-a-lot/id1705661944?i=1000669650754"
      }
    },
    {
      "id": "93e3d5c7-6ae4-4425-8bf6-5499721ae23d",
      "title": "53 - The Six Purposes of Marriage: Completeness",
      "description": "As Kyle puts it, this episode is all about \u0022connecting with your spouse through abstinence.\u0022 Join us as we talk about Bill Gothard\u0027s view on completeness in marriage and how not eating and not having sex play a big role. We also answer some listener questions about how to talk to people you know who are still in a cult, why the word \u0022encouragement\u0022 was such a popular adjective for women in the cult, how the cult viewed salvation and if you could lose it, the Cook County States Attorney who was in office during the case against Amanda\u0027s brother, and programs men in the cult used for accountability. Kyle asks Amanda his own question about how the IBLP cult viewed the book of Revelations and the end times and gets a pretty gruesome response that reminds Amanda why she needed so much therapy as an adult. Send us text! Please note this platform only supports one-way communication. Support the show",
      "release": "2024-09-09T04:00:00Z",
      "duration": "00:36:03",
      "explicit": false,
      "spotifyId": "5S4Boif5SeVkUpOzillFQ1",
      "appleId": 1000668831695,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5S4Boif5SeVkUpOzillFQ1",
        "apple": "https://podcasts.apple.com/us/podcast/53-the-six-purposes-of-marriage-completeness/id1705661944?i=1000668831695"
      }
    },
    {
      "id": "1b5870a7-aa2a-4ca5-b33f-b5987cb36014",
      "title": "One Year Message from Amanda \u0026 Kyle",
      "description": "To celebrate the one-year anniversary of The Cult I Left Behind podcast, Amanda and Kyle share their favorite moments, favorite episodes, insights into the creation of episodes, and their deep appreciate for the community that has formed around this podcast. Send us text! Please note this platform only supports one-way communication. Support the Show.",
      "release": "2024-09-04T04:00:00Z",
      "duration": "00:21:30",
      "explicit": false,
      "spotifyId": "7viD1GwDoaw4RzaaX0KoWw",
      "appleId": 1000668259152,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7viD1GwDoaw4RzaaX0KoWw",
        "apple": "https://podcasts.apple.com/us/podcast/one-year-message-from-amanda-kyle/id1705661944?i=1000668259152"
      }
    },
    {
      "id": "b6787f5f-f698-41d7-b64b-547bfece2435",
      "title": "52 - The Six Purposes of Marriage: Pleasure",
      "description": "Send us text! Please note this is one-way communication. Let’s talk about sex…again! Amanda and Kyle talk through Bill Gothard’s teaching on pleasure in the marriage relationship. In a shocking turn of events (haha), everything revolves around the menstrual cycle. It turns out abstinence plays a big role in marriage pleasure, as well as in healing all manner of physical ailments. All of this wise relationship and sex advice from Bill, a man who was never married and who was a sexual predator. Definitely words to live by. Support the Show.",
      "release": "2024-09-02T04:00:00Z",
      "duration": "00:54:59",
      "explicit": false,
      "spotifyId": "5cknaoSp8ZwpzCV7uNbPzc",
      "appleId": 1000668009090,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5cknaoSp8ZwpzCV7uNbPzc",
        "apple": "https://podcasts.apple.com/us/podcast/52-the-six-purposes-of-marriage-pleasure/id1705661944?i=1000668009090"
      }
    },
    {
      "id": "6b4da511-6f4e-41fd-8634-98ed68560483",
      "title": "51 - The Six Purposes of Marriage: Companionship",
      "description": "Send us a Text Message. Did you know companionship in marriage is really about the menstrual cycle? Did you also know you’re in a covenant relationships with everyone with whom you’ve shared a meal? And that abstinence is important in marriage? Neither did we. But this is what we learn about in the IBLP Advanced Seminar materials. We also learn more about Bill Gothard’s sex rules for married couples. They’re super weird. Amanda shares an interesting message from a listener regarding the recent courtship episodes, and Amanda and Kyle answer a few listener questions…including a question about their Hogwarts houses. Support the Show.",
      "release": "2024-08-26T04:00:00Z",
      "duration": "00:38:18",
      "explicit": false,
      "spotifyId": "4U1YSzVFz6C6kpk8gwQ9Rw",
      "appleId": 1000666595771,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4U1YSzVFz6C6kpk8gwQ9Rw",
        "apple": "https://podcasts.apple.com/us/podcast/51-the-six-purposes-of-marriage-companionship/id1705661944?i=1000666595771"
      }
    },
    {
      "id": "d0bbf588-d885-4251-93a2-d858174df141",
      "title": "50 - The Seven Phases of a Godly Courtship Part 2",
      "description": "Send us a Text Message.Time to wrap up how to go about courting in the holiest manner possible. Amanda tells Kyle the final steps to a godly pre-marriage relationship. Kyle is confused. We learn why Ruth is way more chaste and holy than other female Bible characters, Amanda\u0027s Bible college and seminary training pays off, and Kyle issues a complaint with the way IBLP uses the word \u0022purpose.\u0022 Support the Show.",
      "release": "2024-08-19T04:00:00Z",
      "duration": "00:29:18",
      "explicit": false,
      "spotifyId": "1D8BvTC7ZLVHesMeiLaRoN",
      "appleId": 1000665841122,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1D8BvTC7ZLVHesMeiLaRoN",
        "apple": "https://podcasts.apple.com/us/podcast/50-the-seven-phases-of-a-godly-courtship-part-2/id1705661944?i=1000665841122"
      }
    },
    {
      "id": "bcf2e44a-c44c-4994-8a77-d894b643ac1f",
      "title": "49 - The Seven Phases of a Godly Courtship",
      "description": "Send us a Text Message. Amanda and Kyle embark on a perilous journey through more cult ideology around dating, sex, marriage, and purity. Bill\u0027s vision (for everyone except himself and his brothers) involves some pretty steep expectations of young men that are, dare we say, impossible in 2024. Young women fare much better under Bill\u0027s system in that they aren\u0027t supposed to do anything but be quiet, grateful, and without expectations. All of this ideology is straight out of the Advanced Seminar, and we do not recommend it unless you like oppression. Support the Show.",
      "release": "2024-08-12T04:00:00Z",
      "duration": "00:39:48",
      "explicit": false,
      "spotifyId": "2fyUcCuXVPv5WYsHKmosBS",
      "appleId": 1000664994163,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2fyUcCuXVPv5WYsHKmosBS",
        "apple": "https://podcasts.apple.com/us/podcast/49-the-seven-phases-of-a-godly-courtship/id1705661944?i=1000664994163"
      }
    },
    {
      "id": "5846b130-6b06-48c8-a1a8-c91a12aadf99",
      "title": "48 - A State Prosecutor\u0027s Perspective on Amanda\u0027s Case",
      "description": "Send us a Text Message. A special guest joins us to discuss the case against Amanda\u0027s brother. Jennifer, an Assistant District Attorney and podcast listener, prosecutes sexual assault cases in her state and has some interesting thoughts on Amanda\u0027s experience as a witness, the politics that impacted the case against her brother, and the legal outcome of the case. Amanda, Kyle, and Jennifer have a heartfelt conversation about the impact of the legal process on sexual assault survivors, the innovative support systems available to survivors who report, and the importance of believing survivors. Jennifer also explains how she builds rapport with survivors, prepares them for court, and selects a jury. We laughed and cried our way through this episode, and we hope you find it as meaningful to listen to as we did to record it. National Child Advocacy Center https://www.nationalcac.org/ Angel House, Alabama https://vocalonline.org/angel-house/ One Place Family Justice Center https://www.oneplacefjc.org/ The HERO program https://opsheroinfo.org/ Southeast Alabama Child Advocacy Center https://www.southeastcac.org/ Support the Show.",
      "release": "2024-08-05T04:00:00Z",
      "duration": "01:29:50",
      "explicit": false,
      "spotifyId": "4PD4KE1wGWY7pLooTi40DM",
      "appleId": 1000664327416,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4PD4KE1wGWY7pLooTi40DM",
        "apple": "https://podcasts.apple.com/us/podcast/48-a-state-prosecutors-perspective-on-amandas-case/id1705661944?i=1000664327416"
      }
    },
    {
      "id": "061b2c23-21ff-4e47-a0c4-9ed56d2bb670",
      "title": "47 - Development of an Immoral Woman",
      "description": "Send us a Text Message.Amanda and Kyle discuss the IBLP Advanced Seminar seven-step chart about how a woman becomes immoral. Obviously, this is all “supported” by random verses from the King James Version of the Christian Bible. So, normal cult stuff. Amanda shares her childhood judgement of females who wore clothes that actually fit (so immoral) and her fear of becoming a Strange Woman. Support the Show.",
      "release": "2024-07-29T04:00:00Z",
      "duration": "00:25:05",
      "explicit": false,
      "spotifyId": "1xh7OxezS2BXw3235eNNoG",
      "appleId": 1000663638585,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1xh7OxezS2BXw3235eNNoG",
        "apple": "https://podcasts.apple.com/us/podcast/47-development-of-an-immoral-woman/id1705661944?i=1000663638585"
      }
    },
    {
      "id": "e7e3d332-cc47-49de-b141-e75b97042ea3",
      "title": "46 - Courtship and the Ten Unchangeables",
      "description": "Send us a Text Message.The Ten Unchangeables make a reappearance in the courtship process. The IBLP Advanced Seminar Textbook lays out intense instructions for how to interrogate a potential romantic partner. Kyle is incredulous, Amanda is shocked he\u0027s still shocked by cult material, and much laughter ensues. Support the Show.",
      "release": "2024-07-22T04:00:00Z",
      "duration": "00:38:18",
      "explicit": false,
      "spotifyId": "1wWECxfZzc9NkXzhgwtDtw",
      "appleId": 1000662935886,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1wWECxfZzc9NkXzhgwtDtw",
        "apple": "https://podcasts.apple.com/us/podcast/46-courtship-and-the-ten-unchangeables/id1705661944?i=1000662935886"
      }
    },
    {
      "id": "31e49630-2206-4469-ad1a-7eec77beafcf",
      "title": "45 - Applying Levels of Friendship to Dating",
      "description": "Send us a Text Message.In the next installment of courtship in the cult, Amanda tells Kyle all about the IBLP Basic and Advanced Training Seminar\u0027s instruction regarding the four levels of friendship and how they govern dating or courtship relationships. Support the Show.",
      "release": "2024-07-15T04:00:00Z",
      "duration": "00:28:17",
      "explicit": false,
      "spotifyId": "0mJw9w9a59drrjaA7CYgLY",
      "appleId": 1000662248814,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0mJw9w9a59drrjaA7CYgLY",
        "apple": "https://podcasts.apple.com/us/podcast/45-applying-levels-of-friendship-to-dating/id1705661944?i=1000662248814"
      }
    },
    {
      "id": "42d5934f-c740-4766-bb83-a6cfc6bc6857",
      "title": "44 - Amanda\u0027s Courtship Story",
      "description": "Send us a Text Message. Amanda shares her own courtship experience and the ill-fated romance that followed. She explains purity culture concepts such as \u0022giving away your heart,\u0022 being a \u0022chewed up piece of gum, \u0022 and being a \u0022trampled garden.\u0022 Amanda and Kyle discuss how Amanda\u0027s ex found out about her childhood abuse and how that information impacted their relationship, and Amanda explains to Kyle how the IBLP cult taught that women were more adversely affected by sex outside of marriage than men. Support the Show.",
      "release": "2024-07-08T04:00:00Z",
      "duration": "00:56:43",
      "explicit": false,
      "spotifyId": "3CPR2gDCmun0yCaFBizfrY",
      "appleId": 1000661484841,
      "subjects": [
        "Institute In Basic Life Principles",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3CPR2gDCmun0yCaFBizfrY",
        "apple": "https://podcasts.apple.com/us/podcast/44-amandas-courtship-story/id1705661944?i=1000661484841"
      }
    },
    {
      "id": "f44d4201-6b41-41ea-86f8-918bb4c050aa",
      "title": "42 - Courtship in the Cult",
      "description": "Send us a Text Message. A conversation Amanda has put off for a long time plays out amid trauma laughs, real laughs, and incredulity (on Kyle\u0027s part). Join us for a conversation about an IBLP cult staple: courtship. Presented as an alternative to \u0022secular dating,\u0022 courtship is Bill Gothard\u0027s highly controlled and supposedly impeccable standard for relationships. Amanda and Kyle talk about the espionage inherent in the courtship process, Old Testament stories taken literally and implemented, the complete disregard for holistic attraction, and—of course—how men were in charge of the entire process and the young woman being courted had very little to no say over her relationship. It\u0027s a ride; thanks for going on it with us. Support the Show.",
      "release": "2024-07-01T04:00:00Z",
      "duration": "01:11:00",
      "explicit": false,
      "spotifyId": "6Xu4S1aXj9zpwVotyID1gP",
      "appleId": 1000660747287,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Xu4S1aXj9zpwVotyID1gP",
        "apple": "https://podcasts.apple.com/us/podcast/42-courtship-in-the-cult/id1705661944?i=1000660747287"
      }
    },
    {
      "id": "4c74e011-435a-4a35-a6d3-d44a4227b301",
      "title": "42 - Don\u0027t Get Locked Out",
      "description": "Send us a Text Message.Amanda and Kyle are reunited for another episode! They answer some listener questions, then Kyle asks Amanda about something she mentioned in passing that startled him and required further investigation. Support the Show.",
      "release": "2024-06-24T04:00:00Z",
      "duration": "00:52:34",
      "explicit": false,
      "spotifyId": "1FPERpLX7igZzJX1cHexAp",
      "appleId": 1000660009015,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1FPERpLX7igZzJX1cHexAp",
        "apple": "https://podcasts.apple.com/us/podcast/42-dont-get-locked-out/id1705661944?i=1000660009015"
      }
    },
    {
      "id": "9f29177e-1bd8-49a8-8c18-820df37c760a",
      "title": "41 - Wisdom Booklet #1",
      "description": "Send us a Text Message. What do Celine Dion and Wisdom Booklet #1 have in common? Well, it\u0027s all coming back to me now as Amanda and Kyle go down the rabbit hole (or up the mountain?) into the world of ATI where male supremacy makes an immediate appearance. Listen along as Kyle reacquaints Amanda with the concepts of the cult\u0027s flagship homeschooling curriculum. And if you were ever curious as to why Christians should learn math, Wisdom Booklet #1 is here to answer that burning question for you. Welcome to Amanda\u0027s personal educational hell. Enjoy. Support the Show.",
      "release": "2024-06-17T04:00:00Z",
      "duration": "00:52:33.9460000",
      "explicit": false,
      "spotifyId": "6Jk80ScqID3jJG4V0SkEy2",
      "appleId": 1000659225160,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Jk80ScqID3jJG4V0SkEy2",
        "apple": "https://podcasts.apple.com/podcast/41-wisdom-booklet-1/id1705661944?i=1000659225160"
      }
    },
    {
      "id": "c4048986-df5e-4cb4-b752-28ea2facbe5a",
      "title": "40 - The Music that Saved Me",
      "description": "Send us a Text Message. In the most vulnerable episode to date, Amanda shares her songwriting diary and describes how the music helped her cope with reporting her brother, losing her biological family, going through a divorce, struggling with her mental health, and, ultimately, finding hope, love, and joy in life. Support the Show.",
      "release": "2024-06-10T04:00:00Z",
      "duration": "01:25:45.7040000",
      "explicit": false,
      "spotifyId": "7ww92wzrjpej3iM1Z44Gwk",
      "appleId": 1000658406788,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7ww92wzrjpej3iM1Z44Gwk",
        "apple": "https://podcasts.apple.com/podcast/40-the-music-that-saved-me/id1705661944?i=1000658406788"
      }
    },
    {
      "id": "619df5ea-9193-4989-beb5-55ef77867b54",
      "title": "39 - The Halls of Satan",
      "description": "Send us a Text Message. Kyle teaches Amanda about the experience of growing up in public school. It all started over a dinner date conversation that resulted in running back to the Airbnb to record Amanda\u0027s questions/shock/terror about \u0022evil public school.\u0022 The IBLP cult taught that public school was immoral, so Amanda had a lot to learn about the concept of public education in general. Additionally, Amanda and Kyle answer a listener question about if they would still be in Christian church if they had a different experience growing up. Support the Show.",
      "release": "2024-06-03T04:00:00Z",
      "duration": "01:16:38.7780000",
      "explicit": false,
      "spotifyId": "4wXikjDcUQmnhn1jn0eKQF",
      "appleId": 1000657620448,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4wXikjDcUQmnhn1jn0eKQF",
        "apple": "https://podcasts.apple.com/podcast/39-the-halls-of-satan/id1705661944?i=1000657620448"
      }
    },
    {
      "id": "b8f35597-6cae-4664-8ed5-769dcb7681eb",
      "title": "38 - Q\u0026A Session #3",
      "description": "Send us a Text Message. Coming to you live from the middle of a cross-country move, Amanda and Kyle answer more listener questions. They discuss the impact of cults/trauma/sexual assault/sin on health, and Amanda shares how she overcame her IBLP cult-induced beliefs that her medical struggles were punishment from God. Amanda also recommends some books written by people who left other cults. Books: Uncultured Educated A Billion Years Support the Show.",
      "release": "2024-05-27T04:00:00Z",
      "duration": "00:35:37.1820000",
      "explicit": false,
      "spotifyId": "2AsNMWA5gHC12GJ8sY2hCc",
      "appleId": 1000656853720,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AsNMWA5gHC12GJ8sY2hCc",
        "apple": "https://podcasts.apple.com/podcast/38-q-a-session-3/id1705661944?i=1000656853720"
      }
    },
    {
      "id": "1fca1c34-4897-41be-ade1-1a790e8a0a44",
      "title": "37 - No Sex on Saturdays!",
      "description": "Send us a Text Message. Thanks to some help from a listener, Amanda and Kyle finally tackle their long-awaited topic: Bill Gothard\u0027s teachings on sex rules in marriage! To absolutely nobody\u0027s surprise, the IBLP cult has a lot to say (ahem, dictate) about how married people go about their sexual relationship -- including days they should not have sex. Amanda and Kyle also answer a listener question about how to be authentic and true to yourself as a non-Christian with many friends and family members who are devout Christians. Links to articles mentioned in the episode: G. Richard Fisher article Patheos blog post Support the Show.",
      "release": "2024-05-20T04:00:00Z",
      "duration": "00:54:24",
      "explicit": false,
      "spotifyId": "5sl2L1BQKUlEfnyqXH52IZ",
      "appleId": 1000656101719,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5sl2L1BQKUlEfnyqXH52IZ",
        "apple": "https://podcasts.apple.com/us/podcast/37-no-sex-on-saturdays/id1705661944?i=1000656101719"
      }
    },
    {
      "id": "4e38aa85-20d6-40bb-9d1a-52bcc71ab4e2",
      "title": "36 - I Hate Mother\u0027s Day",
      "description": "Send us a Text Message. In an angsty and emotional conversation, Amanda tells Kyle about the complexity of Mother\u0027s Day with an abusive mother. Amanda shares how the IBLP cult enabled parental abuse and what it’s like to cut ties with abusive parents.",
      "release": "2024-05-13T04:00:00Z",
      "duration": "00:47:20.7900000",
      "explicit": false,
      "spotifyId": "2YDGEmFB4LqiOIxIKiDdvV",
      "appleId": 1000655369139,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2YDGEmFB4LqiOIxIKiDdvV",
        "apple": "https://podcasts.apple.com/podcast/36-i-hate-mothers-day/id1705661944?i=1000655369139"
      }
    },
    {
      "id": "9b7a957c-8b7b-4ea2-b730-56387ff610c8",
      "title": "35 - Adoption and the Sins of the Father",
      "description": "Amanda tells Kyle about Bill Gothard\u0027s teachings on adoption. It turns out adoption is considered a medical situation. It also turns out couples who can\u0027t have biological children shouldn\u0027t adopt because, according to Bill, God doesn\u0027t think they should be parents. Amanda explains the concept of \u0022sins of the father\u0022 and how Bill taught adopted kids brought the sins of their lineage into their adoptive families. Amanda and Kyle discuss how Bill found every conceivable way to exert power and control over IBLP cult members and what Amanda left behind from cult ideology around adoption.",
      "release": "2024-05-06T04:00:00Z",
      "duration": "00:40:00.7830000",
      "explicit": false,
      "spotifyId": "0Dj8dkvqg5SA8EQRHdUw7u",
      "appleId": 1000654630239,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Dj8dkvqg5SA8EQRHdUw7u",
        "apple": "https://podcasts.apple.com/podcast/35-adoption-and-the-sins-of-the-father/id1705661944?i=1000654630239"
      }
    },
    {
      "id": "b85a4914-e592-4ed6-a0fc-c222404b2d5f",
      "title": "34 - What If I\u0027m Weird?",
      "description": "Amanda and Kyle discuss what it\u0027s like to leave a cult and be that \u0022weird\u0022 person trying to navigate the real world. Amanda shares the hurdles she faced as a weird person after leaving the IBLP cult, the process of recognizing she was different than those around her, and how she made non-cult friends. Amanda and Kyle talk through the challenges of assimilating to society after leaving a repressive environment, and Amanda shares lessons learned along the way to embracing her past and her weirdness. They also discuss helpful ways \u0022normal\u0022 folks can react to folks who grew up in oppressive or repressive environments and might struggle socially.",
      "release": "2024-04-29T04:00:00Z",
      "duration": "00:57:25.2370000",
      "explicit": false,
      "spotifyId": "1kfyl8ozCooQDsgholLibT",
      "appleId": 1000653870858,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1kfyl8ozCooQDsgholLibT",
        "apple": "https://podcasts.apple.com/podcast/34-what-if-im-weird/id1705661944?i=1000653870858"
      }
    },
    {
      "id": "117d2623-b9f7-4132-9c54-0bf0b20571d8",
      "title": "33 - Let\u0027s Talk About Sex",
      "description": "Amanda and Kyle respond to many listener questions about reaching a healthy sex life after experiencing sexual trauma in or outside a cult. They discuss different therapy modalities that helped Amanda heal, why females in the IBLP cult dissociated from their bodies, and why distance from harmful people helps the healing process. \n\nAmanda mentions Rosen therapy for somatic healing. If you are interested, you can check out the Rosen Institute’s website to learn more and see if there is a practitioner near you.",
      "release": "2024-04-22T04:00:00Z",
      "duration": "00:45:41",
      "explicit": false,
      "spotifyId": "2ZKQ6Kv61TAqfvxAUVxDzI",
      "appleId": 1000653159782,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZKQ6Kv61TAqfvxAUVxDzI",
        "apple": "https://podcasts.apple.com/us/podcast/33-lets-talk-about-sex/id1705661944?i=1000653159782"
      }
    },
    {
      "id": "53240e31-0a08-44a7-88db-8178de7f1978",
      "title": "32 - But Did You Cry Out?",
      "description": "Amanda tells Kyle about Bill Gothard\u0027s made up \u0022Law of Crying Out\u0022 which - surprise, surprise - places equal blame on victims and perpetrators. Amanda grew up being taught this ideology as part of ATI\u0027s educational curriculum and bought into it for much of her life until adulthood. She tells Kyle about the different responses humans have to crisis and assault and considers that Bill used his publications to groom his next generation of victims. Together, Amanda and Kyle discuss non-cult ideology of culpability around assault and talk about what support looks like for survivors. Link to Amanda\u0027s book",
      "release": "2024-04-15T04:00:00Z",
      "duration": "00:53:27.8360000",
      "explicit": false,
      "spotifyId": "2GimfYmlvV4GEeEWBBsBQN",
      "appleId": 1000652450986,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2GimfYmlvV4GEeEWBBsBQN",
        "apple": "https://podcasts.apple.com/podcast/32-but-did-you-cry-out/id1705661944?i=1000652450986"
      }
    },
    {
      "id": "67e53e0a-1cc6-4c6b-9eaa-8f6d8db97cb1",
      "title": "31 - The Military and the Cult",
      "description": "Amanda shares some of the most embarrassing moments from her military career. Turns out growing up in the IBLP cult means there\u0027s a lot of slang and innuendo that goes right over your head. A best practice is probably not to repeat any new phrases until you Google them, but sadly that is not what happened. Amanda also tells Kyle about some of her greatest successes in the military and how growing up in a cult helped her cope with military training and other high-pressure environments. Kyle asks Amanda the greatest hinderance she faced as a female cult kid who went into a STEM career field in the military, and it just so happens that you really do need to know more math than fractions. But also, according to the cult, females are not supposed to be in the military. This episode (or at least the good parts of this episode) is dedicated to the men and women with whom Amanda served, will forever love, and for whom she will always be grateful. Correction: Amanda mentions \u0022431 paperwork\u0022 in the episode. What she referred to is actually called AETC Form 341 .",
      "release": "2024-04-08T04:00:00Z",
      "duration": "01:11:28.2350000",
      "explicit": false,
      "spotifyId": "6Gy2gfriEDFHZL6bYGfMqH",
      "appleId": 1000651733252,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Gy2gfriEDFHZL6bYGfMqH",
        "apple": "https://podcasts.apple.com/podcast/31-the-military-and-the-cult/id1705661944?i=1000651733252"
      }
    },
    {
      "id": "4d12bc1b-06d9-40c2-874a-4363d3a64d8a",
      "title": "30 - The Ten Unchangeables",
      "description": "Amanda sings a cult song from her childhood. Kyle is confused. They break down the meaning of each of the Ten Unchangeables, and IBLP word salad makes a reappearance. Amanda tells Kyle more about attending The Children\u0027s Institute for some important childhood brainwashing and why Amanda was so prepared for the military. Also: it turns out some of Bill Gothard\u0027s unchangeables can be changed.",
      "release": "2024-04-01T04:00:00Z",
      "duration": "00:46:01",
      "explicit": false,
      "spotifyId": "5JXotgIrj9kiIAzrTJ2lB6",
      "appleId": 1000651026900,
      "subjects": [
        "Institute In Basic Life Principles",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5JXotgIrj9kiIAzrTJ2lB6",
        "apple": "https://podcasts.apple.com/us/podcast/30-the-ten-unchangeables/id1705661944?i=1000651026900"
      }
    },
    {
      "id": "5bedadc0-62f1-4a05-b406-8da5ccac4547",
      "title": "29 - Discipline in the Cult",
      "description": "Blanket training, 3x training, the abusive tactics of Michael and Debi Pearl... Amanda and Kyle take an insider look at the types of discipline encouraged and endorsed by the IBLP cult. From hiding beating implements in neighborhood culverts to memorizing routes to safety, Amanda describes a childhood at the mercy of an abusive mother and her own road to recovery as an adult.",
      "release": "2024-03-25T04:00:00Z",
      "duration": "01:14:55",
      "explicit": false,
      "spotifyId": "1pO8UMaDZxThv8xr5aPPUR",
      "appleId": 1000650317034,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1pO8UMaDZxThv8xr5aPPUR",
        "apple": "https://podcasts.apple.com/us/podcast/29-discipline-in-the-cult/id1705661944?i=1000650317034"
      }
    },
    {
      "id": "3cee5add-6cee-4e4b-a9b6-956e21e9e66c",
      "title": "28 - Q\u0026A Session #2",
      "description": "Join Amanda and Kyle as they answer more listener questions and discuss issues like taking their potential future kids to church, if religions are cults for real tho, if you can accidentally become a cult leader, why Amanda’s relatives never intervened when they learned about the sexual assault, and if forming a cult to address daylight saving time is a worthy cause. Amanda shares some exciting personal news and tells the story of how she met the people she calls Mom and Dad. She also gives exact wording for how her bio relatives can go on the record in support of her. Take notes.",
      "release": "2024-03-18T04:00:00Z",
      "duration": "01:07:43",
      "explicit": false,
      "spotifyId": "5nIxqLLy3U0HuuIo4WCbVw",
      "appleId": 1000649528105,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5nIxqLLy3U0HuuIo4WCbVw",
        "apple": "https://podcasts.apple.com/us/podcast/28-q-a-session-2/id1705661944?i=1000649528105"
      }
    },
    {
      "id": "93c61897-a436-420d-a5a7-4b26fa07c729",
      "title": "27 - A Day in the Life of a Cult Kid",
      "description": "Amanda tells Kyle what a typical day looked like for her in the IBLP cult, complete with baking bread, caring for her younger siblings, and hiding from the police. She also talks about special circumstances, such as weekly cult gatherings and preparing to spend time around non-cult relatives and their secular influence.",
      "release": "2024-03-11T04:00:00Z",
      "duration": "01:09:34.3930000",
      "explicit": false,
      "spotifyId": "0nzEAiWQ1Io6CgjpEsaipX",
      "appleId": 1000648712834,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nzEAiWQ1Io6CgjpEsaipX",
        "apple": "https://podcasts.apple.com/podcast/27-a-day-in-the-life-of-a-cult-kid/id1705661944?i=1000648712834"
      }
    },
    {
      "id": "d2e9ee4f-067b-4524-8c5c-4ccce79d361e",
      "title": "26 - Demonic Backbeats",
      "description": "Welcome to another analysis of crazy IBLP cult teachings! This week, we tackle Bill Gothard\u0027s Basic and Advanced Seminar materials regarding music, what is holy, what is unholy, what will definitely deform your brain cells, and what will cause your vegetables to grow larger. Spoiler alert: most of the world is probably going to hell due to unholy taste in music.",
      "release": "2024-03-04T05:00:00Z",
      "duration": "00:54:18.0700000",
      "explicit": false,
      "spotifyId": "2GYizw99K3HxLnW1DL4n11",
      "appleId": 1000647886196,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2GYizw99K3HxLnW1DL4n11",
        "apple": "https://podcasts.apple.com/podcast/26-demonic-backbeats/id1705661944?i=1000647886196"
      }
    },
    {
      "id": "120c7e17-3662-4a28-872e-b02631614a93",
      "title": "25 - MLMs and the Cult",
      "description": "In January, we had the opportunity to sit down with special guest Maureen Maus and talk about Multi-Level Marketing – specifically the ways their tactics overlap with cults. We also discuss how MLMs tend to target women, and often women in religious environments who must work from home. Maureen teaches us how MLMs seem to adopt spiritual language, which appeals to individuals in cults, and Amanda shares how certain leaders in the IBLP cult used their position to influence members to join an MLM. So...are MLMs cult-ish? Are they preying on women who have limited work options? Listen and let us know!",
      "release": "2024-02-26T05:00:00Z",
      "duration": "01:07:55.9370000",
      "explicit": false,
      "spotifyId": "2KMuyAuQ3eKOVubDgJwGuW",
      "appleId": 1000646828331,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2KMuyAuQ3eKOVubDgJwGuW",
        "apple": "https://podcasts.apple.com/podcast/25-mlms-and-the-cult/id1705661944?i=1000646828331"
      }
    },
    {
      "id": "b3b9d260-dc67-415f-adce-4bbcdfcfa171",
      "title": "24 - Eyes Down!",
      "description": "Amanda unpacks the phrase \u0022eyes down\u0022 and its implications within her bio family and explains code word \u0022Nike\u0022 from the Shiny Happy People docuseries. Join us for a trip down memory lane as Amanda describes battles against billboards and bikinis, tells Kyle about learning the word \u0022sex\u0022 from a childhood friend, and shares the family rules for watching movies.",
      "release": "2024-02-19T05:00:00Z",
      "duration": "00:52:13.0740000",
      "explicit": false,
      "spotifyId": "1HiA84XaqGa4HYuIpY5iMQ",
      "appleId": 1000645820745,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1HiA84XaqGa4HYuIpY5iMQ",
        "apple": "https://podcasts.apple.com/podcast/24-eyes-down/id1705661944?i=1000645820745"
      }
    },
    {
      "id": "a35cf79d-c84f-4f44-b187-60ffc6700a1d",
      "title": "23- Will You Be My Eye Trap?",
      "description": "In a special episode for the week of Valentine\u0027s Day, Amanda and Kyle discuss Wisdom Booklet 15\u0027s teachings on the importance of modesty, how to avoid eye traps that might make a man lust after you and commit adultery with you in his heart, and the medical implications of immodesty and eye traps. Amanda also shares her bio mom\u0027s insight regarding the inherent evil of lingerie--even in the context of marriage. Make sure you listen to this episode. because it turns out modesty is super important for your health and medical well-being.",
      "release": "2024-02-12T05:00:00Z",
      "duration": "00:56:07.7840000",
      "explicit": false,
      "spotifyId": "4u8ITQdLGQcrT7wfrTgHdN",
      "appleId": 1000644994734,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4u8ITQdLGQcrT7wfrTgHdN",
        "apple": "https://podcasts.apple.com/podcast/23-will-you-be-my-eye-trap/id1705661944?i=1000644994734"
      }
    },
    {
      "id": "3576ee90-f268-4318-af6b-77ad5b5bd617",
      "title": "22 - Seven Basic Needs of a Wife",
      "description": "Kyle continues teaching Amanda about the Seven Basic Needs -- but this time we\u0027re looking at the wife. Shockingly (haha), her needs are a lot simpler and less taxing than the needs of a husband. The needs of a wife are not backed up by biblical text, but they sure are Duggar-approved!",
      "release": "2024-02-05T05:00:00Z",
      "duration": "00:50:38.9810000",
      "explicit": false,
      "spotifyId": "7wwpS3Zo5UXPODk65iOyYS",
      "appleId": 1000644166960,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7wwpS3Zo5UXPODk65iOyYS",
        "apple": "https://podcasts.apple.com/podcast/22-seven-basic-needs-of-a-wife/id1705661944?i=1000644166960"
      }
    },
    {
      "id": "715f842e-6ab5-4d4e-99bc-61a0e532860e",
      "title": "21 - Seven Basic Needs of a Husband",
      "description": "In a shocking turn of events, Kyle teaches Amanda IBLP\u0027s seven basic needs of a husband. Amanda is traumatized. Hilarity ensues.",
      "release": "2024-01-29T05:00:00Z",
      "duration": "01:05:04.8300000",
      "explicit": false,
      "spotifyId": "6NXrTEinKwjLN4ZQis7JE4",
      "appleId": 1000643326834,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6NXrTEinKwjLN4ZQis7JE4",
        "apple": "https://podcasts.apple.com/podcast/21-seven-basic-needs-of-a-husband/id1705661944?i=1000643326834"
      }
    },
    {
      "id": "adc42d06-5340-4493-a570-8f1a3505701a",
      "title": "20 - Demonic Cabbage Patch Kids",
      "description": "Kyle finally gets his wish as he and Amanda discuss the infamous Cabbage Patch Kid dolls and the IBLP teachings surrounding them. Amanda shares the requirements Bill Gothard made of all cult families who owned these dolls, as well as a few other popular toys. Get your burn barrels ready and prepare to cast out some demons, folks!",
      "release": "2024-01-22T05:00:00Z",
      "duration": "00:21:22.0630000",
      "explicit": false,
      "spotifyId": "5kBSVaLXpt5GcEGwXt4IJ7",
      "appleId": 1000642445674,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5kBSVaLXpt5GcEGwXt4IJ7",
        "apple": "https://podcasts.apple.com/podcast/20-demonic-cabbage-patch-kids/id1705661944?i=1000642445674"
      }
    },
    {
      "id": "5afb00d5-a642-42d7-af74-832a7b3aaa1b",
      "title": "19 - So Shall Thy Poverty Come to Thee",
      "description": "Amanda tells Kyle what caused her to become a workaholic (spoiler alert: IBLP teachings).  She walks through the ideology that is burned into her brain about work ethic and what it takes to be a “good” person. Bill Gothard’s twisted interpretation of the Bible makes another appearance, and Kyle shares the strange phenomenon that occurs for Amanda medically when she works too much.",
      "release": "2024-01-15T05:00:00Z",
      "duration": "00:57:32.3950000",
      "explicit": false,
      "spotifyId": "4GTNo7hquprnHKjPIZxzxH",
      "appleId": 1000641663536,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4GTNo7hquprnHKjPIZxzxH",
        "apple": "https://podcasts.apple.com/podcast/19-so-shall-thy-poverty-come-to-thee/id1705661944?i=1000641663536"
      }
    },
    {
      "id": "8a8c5433-c28a-4f6c-808b-7daf60038993",
      "title": "18 - Therapy is Sin",
      "description": "Amanda tells Kyle all about Bill Gothard\u0027s, uh, unique approach to mental health, counseling, and especially counseling abuse survivors. We learn all about reins (send help), how everything is our own fault (especially abuse), and how to get more serotonin (according to IBLP and not medically verified). This episodes takes about as many turns as Bill\u0027s twisted approach to mental health. We laugh, we cry, Kyle experiences shock, and Amanda remembers why she\u0027s still going to therapy today.",
      "release": "2024-01-08T05:00:00Z",
      "duration": "01:09:43.4040000",
      "explicit": false,
      "spotifyId": "6lAWak2Z4EbYLDOMXYBGC6",
      "appleId": 1000640863732,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6lAWak2Z4EbYLDOMXYBGC6",
        "apple": "https://podcasts.apple.com/podcast/18-therapy-is-sin/id1705661944?i=1000640863732"
      }
    },
    {
      "id": "71d19a84-f2a4-4c87-8cf8-ff092251d230",
      "title": "17 - Cult Rhemas for the New Year",
      "description": "Who\u0027s ready for 2024?! Amanda and Kyle start off the New Year with stories of young Amanda\u0027s panicked search for a Rhema (a special word from God) for each new year and, like, every other day of the year. Amanda tells Kyle about a typical New Years in her home growing up in the IBLP cult. Kyle shocks Amanda with his own stories from young adulthood, and we all go on a Myspace search. Join us for a booze-free and somehow still raucous start to the New Year!",
      "release": "2024-01-01T05:00:00Z",
      "duration": "00:50:50.5270000",
      "explicit": false,
      "spotifyId": "1IUdm8dpDM4XI9mX87XOP1",
      "appleId": 1000640204779,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IUdm8dpDM4XI9mX87XOP1",
        "apple": "https://podcasts.apple.com/podcast/17-cult-rhemas-for-the-new-year/id1705661944?i=1000640204779"
      }
    },
    {
      "id": "b1e155dd-e55e-412c-876a-8eacfce579be",
      "title": "16 - Christmas in the Cult",
      "description": "Amanda and Kyle talk about Christmas traditions and ideology influenced by the IBLP cult. From Santa’s role as an agent of Satan to distract from Christ to annual research projects due on Christmas Eve, Amanda walks Kyle through a typical Christmas growing up in the cult. Kyle provides the normal Christmas perspective, and Amanda and Kyle think through what they would keep and what they would definitely leave behind if they have kids someday.",
      "release": "2023-12-18T05:00:00Z",
      "duration": "00:50:02.0170000",
      "explicit": false,
      "spotifyId": "0n2DDjhUf63otZCqEJsR9A",
      "appleId": 1000638896916,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0n2DDjhUf63otZCqEJsR9A",
        "apple": "https://podcasts.apple.com/podcast/16-christmas-in-the-cult/id1705661944?i=1000638896916"
      }
    },
    {
      "id": "d6c5bd02-89a8-428c-9ee8-bc5cf39d9b7a",
      "title": "15 - Are All Religions Cults?",
      "description": "Join Amanda and Kyle along with special guest Tim Whitaker from The New Evangelicals as they explore the distinction between cults and religions. In response to a listener question, the trio discusses the differences and similarities between the two, including whether Jesus could be considered a cult leader. The conversation covers their personal experiences with Christianity, the American church, and IBLP. Tune in to hear their insights and reflections, and discover where the conversation leads.",
      "release": "2023-12-11T05:00:00Z",
      "duration": "00:49:28.7370000",
      "explicit": false,
      "spotifyId": "4ruaaoHaKPYNN7vQqNZphn",
      "appleId": 1000638141814,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ruaaoHaKPYNN7vQqNZphn",
        "apple": "https://podcasts.apple.com/podcast/15-are-all-religions-cults/id1705661944?i=1000638141814"
      }
    },
    {
      "id": "25d5300b-4c41-4145-9d27-8b41feca311d",
      "title": "14 - Divorce in the Cult",
      "description": "In a deeply personal conversation, Amanda and Kyle discuss the ideology surrounding divorce in the IBLP cult. Amanda shares about her divorce, which finalized five years ago the day this episode was released, and explains the way cult teaching keeps people - particularly women - trapped in harmful marriages. Kyle shares his perspective from outside the cult, and together they talk through the spiritual, emotional, and economic implications of divorce for women who are dependent on their husbands as outlined in Bill Gothard\u0027s teachings on authority.Resource List:www.thehotline.orgwww.nrcdv.orgwww.ncadv.org/RESOURCES",
      "release": "2023-12-04T05:00:00Z",
      "duration": "01:14:48.7510000",
      "explicit": false,
      "spotifyId": "7IUMeVGxEwb49xfFcBOxKA",
      "appleId": 1000637386620,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7IUMeVGxEwb49xfFcBOxKA",
        "apple": "https://podcasts.apple.com/podcast/14-divorce-in-the-cult/id1705661944?i=1000637386620"
      }
    },
    {
      "id": "10da3520-c56c-426f-ade1-d5196441df3b",
      "title": "13 - Q\u0026A with Amanda \u0026 Kyle",
      "description": "Amanda and Kyle answer listener questions. As Kyle puts it, everyone and their mom wants to know if Amanda still believes in God. Listen to the episode to find out! And feel free to submit more questions; we’ll keep answering them.",
      "release": "2023-11-27T05:00:00Z",
      "duration": "01:05:55",
      "explicit": false,
      "spotifyId": "4IOyX7TNLeNFHMGywLMgD3",
      "appleId": 1000636607407,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4IOyX7TNLeNFHMGywLMgD3",
        "apple": "https://podcasts.apple.com/us/podcast/13-q-a-with-amanda-kyle/id1705661944?i=1000636607407"
      }
    },
    {
      "id": "24703ccb-83fa-4140-befc-c6bb4257e565",
      "title": "12 - Shiny Happy People Review Part 4",
      "description": "In the final installment of their Shiny Happy People review, Amanda and Kyle have an emotional conversation about episode four of the docuseries. They discuss the correlations between Josh Dugger and Amanda’s brother, as well as the parental responses of Jim Bob and Michelle and Amanda’s bio parents. Kyle and Amanda react to Anna Duggar’s choices in the aftermath of Josh’s investigation and trial and set the stage for a conversation about the cult’s stance on divorce, which will be the subject of an episode coming in a few weeks. Amanda shares her experiences with the Joshua Generation and their goal of taking over the government, and ultimately the world, as an “elite strike force” for Christ. Kyle and Amanda talk about the hard work of deconstruction after leaving the cult and the caring community that awaits anyone who leaves behind the IBLP cult and Bill Gothard’s teachings.    This episode contains some explicit language.",
      "release": "2023-11-20T05:00:00Z",
      "duration": "01:02:21.3610000",
      "explicit": false,
      "spotifyId": "7DmDQhVTJ2TIezT0LXXvLH",
      "appleId": 1000635383200,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7DmDQhVTJ2TIezT0LXXvLH",
        "apple": "https://podcasts.apple.com/podcast/12-shiny-happy-people-review-part-4/id1705661944?i=1000635383200"
      }
    },
    {
      "id": "9a62e93d-566c-4add-be5b-4ec69a3051b0",
      "title": "11 - Shiny Happy People Review Part 3",
      "description": "Amanda and Kyle review episode three of Shiny Happy People. They discuss Bill Gothard’s teachings on authority within the IBLP cult and the creepy dynamic the cult created between fathers and their virgin daughters. Amanda and Kyle discuss the ways Jim Bob Duggar tricked and coerced his children into appearing on the 19 Kids and Counting and Jill and Jessa Counting On TV shows without compensation. Amanda explains to Kyle the dynamics within the cult that would result in an adult child signing legal contracts without knowing the implications of their commitment and how the cult environment and hierarchy conditioned people for abuse and silence.This episode contains some explicit language.",
      "release": "2023-11-13T05:00:00Z",
      "duration": "01:23:24.7730000",
      "explicit": false,
      "spotifyId": "3WxoqT0CyjtiJ9NN01k6pE",
      "appleId": 1000634585223,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3WxoqT0CyjtiJ9NN01k6pE",
        "apple": "https://podcasts.apple.com/podcast/11-shiny-happy-people-review-part-3/id1705661944?i=1000634585223"
      }
    },
    {
      "id": "c923dcf0-0ce1-499b-bba0-b759163697b9",
      "title": "10 - Shiny Happy People Review Part 2",
      "description": "Amanda and Kyle recap episode two of Shiny Happy People. They discuss Josh Duggar\u0027s sexual assault of his sisters and the Ashley Madison scandal in which Josh was implicated. Kyle asks Amanda to explain the IBLP cult concept of eye traps, and they discuss the complexities of being a female in the cult. This episode is a wild ride of burning various items in to avoid satanic influence, spiritual gifts, parentification of children, and how parents in the cult went about breaking a child\u0027s will. Amanda and Kyle also discuss the public abuse of children that comes up in the second episode of the documentary, and Amanda explains Bill Gothard\u0027s teachings on authority. This episode contains some explicit language.",
      "release": "2023-11-06T05:00:00Z",
      "duration": "01:09:44.1370000",
      "explicit": false,
      "spotifyId": "4xJQ7enINE6X07RJIhFsxS",
      "appleId": 1000633801967,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xJQ7enINE6X07RJIhFsxS",
        "apple": "https://podcasts.apple.com/podcast/10-shiny-happy-people-review-part-2/id1705661944?i=1000633801967"
      }
    },
    {
      "id": "d5d441f9-e2cf-4b11-897c-9332f2d405b3",
      "title": "Special Halloween Message from Amanda \u0026 Kyle",
      "description": "Here\u0027s your weather forecast for Halloween 2023. Enjoy!",
      "release": "2023-10-31T20:00:00Z",
      "duration": "00:05:13.0510000",
      "explicit": false,
      "spotifyId": "5HIOOMn9CPwVfnipLtKtn9",
      "appleId": 1000633270868,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5HIOOMn9CPwVfnipLtKtn9",
        "apple": "https://podcasts.apple.com/podcast/special-halloween-message-from-amanda-kyle/id1705661944?i=1000633270868"
      }
    },
    {
      "id": "929c0db6-d0c1-4ce5-b001-0188ccdbc7d8",
      "title": "9 - Shiny Happy People Review Part 1",
      "description": "Amanda and Kyle talk through the first episode of Shiny Happy People, a documentary about the Duggar family and their TLC show 19 Kids and Counting. The Duggars are part of the IBLP cult, and Amanda and Kyle discuss the many ways Amanda\u0027s story overlaps with the Duggar story, Josh\u0027s sexual assault scandal, and what life was like growing up under Bill Gothard\u0027s influence. This episode contains some explicit language.",
      "release": "2023-10-30T04:00:00Z",
      "duration": "01:22:33.6520000",
      "explicit": false,
      "spotifyId": "5WZlqMD76LJcFGd7zEfBJu",
      "appleId": 1000633038342,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WZlqMD76LJcFGd7zEfBJu",
        "apple": "https://podcasts.apple.com/podcast/9-shiny-happy-people-review-part-1/id1705661944?i=1000633038342"
      }
    },
    {
      "id": "d971046c-f4f2-4857-9ed0-86b4e170704e",
      "title": "8 - Four Years in Court",
      "description": "Amanda tells Kyle about breaking away from IBLP ideology and reaching the point of being able to report her brother. She talks about the people who helped her disengage from Bill Gothard\u0027s teachings and develop an appropriate understanding of justice and accountability. Amanda details the four-year process of criminal court, how her family reacted, and how the case concluded.  This episode includes Amanda\u0027s victim impact statement from her brother\u0027s sentencing hearing, minus the graphic details of assault. This episode contains some explicit language.",
      "release": "2023-10-23T04:00:00Z",
      "duration": "01:39:30.5460000",
      "explicit": false,
      "spotifyId": "4clOp1fKFysc7RV33zeujs",
      "appleId": 1000632232766,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4clOp1fKFysc7RV33zeujs",
        "apple": "https://podcasts.apple.com/podcast/8-four-years-in-court/id1705661944?i=1000632232766"
      }
    },
    {
      "id": "777c3b36-468b-43b3-990c-eaa153d7fad2",
      "title": "7 - Healing Begins",
      "description": "Amanda\u0027s world opens up even more as she begins to step away from her family and IBLP cult ideology and towards healing. Amanda and Kyle talk about the circumstances that occurred to get Amanda to finally begin speaking up about what happened to her, her parents\u0027 reaction to her speaking up, and the people who supported her through her first tentative steps toward health and safety. Additionally, Amanda tells Kyle about how she finally got a mental health diagnosis, the process of going through PTSD treatment, and how she moved toward seeking accountability and justice. Link to Amanda\u0027s bookThis episode contains some explicit language.",
      "release": "2023-10-16T04:00:00Z",
      "duration": "01:26:04.2250000",
      "explicit": false,
      "spotifyId": "0aE3rPm1Z6QNB2F6PArQyh",
      "appleId": 1000631427353,
      "subjects": [
        "Institute In Basic Life Principles",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0aE3rPm1Z6QNB2F6PArQyh",
        "apple": "https://podcasts.apple.com/podcast/7-healing-begins/id1705661944?i=1000631427353"
      }
    },
    {
      "id": "fedd1f4b-48aa-4327-a207-29549aa380c1",
      "title": "6 - Girl Meets World",
      "description": "Amanda tells Kyle about the people and circumstances that created formative moments as she finished high school and left her biological family\u0027s home for college. She talks about her older sister finding out about the abuse, the ways IBLP ideology influenced her parents\u0027 decision about her college education and relationships, and how Bill Gothard\u0027s teachings about authority caused her to be controlled even as a young adult living away from home and supporting herself. This episode contains some explicit language.",
      "release": "2023-10-09T04:00:00Z",
      "duration": "01:24:44.9950000",
      "explicit": false,
      "spotifyId": "0eyrPqhVPKmPPJ4DhpvdZ7",
      "appleId": 1000630646051,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0eyrPqhVPKmPPJ4DhpvdZ7",
        "apple": "https://podcasts.apple.com/podcast/6-girl-meets-world/id1705661944?i=1000630646051"
      }
    },
    {
      "id": "4130e18a-be31-48f6-8b0d-e487a8148681",
      "title": "5 - The Abuse Continues",
      "description": "Amanda and Kyle pick up where they left Amanda\u0027s story in the previous episode. Amanda talks about life after her first disclosure of sexual assault, getting through high school, and trying to protect her younger siblings from her brother.  Due to Bill Gothard\u0027s teachings, Amanda was denied mental, emotional, and physical health care of any kind. She tells Kyle about her brother being sent away to an IBLP facility, much like Josh Duggar, and her parents\u0027 refusal to see the abuse for what it was.  This episode contains some explicit language.",
      "release": "2023-10-02T04:00:00Z",
      "duration": "01:00:08.9730000",
      "explicit": false,
      "spotifyId": "7Htqlv1PVpz5WbR0F5672L",
      "appleId": 1000629854902,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Htqlv1PVpz5WbR0F5672L",
        "apple": "https://podcasts.apple.com/podcast/5-the-abuse-continues/id1705661944?i=1000629854902"
      }
    },
    {
      "id": "68b98a3a-4f1a-4df9-9160-b8d9169fd53f",
      "title": "4 - The Abuse Begins",
      "description": "Amanda begins her story of surviving childhood physical, emotional, verbal, spiritual, and sexual abuse in the IBLP cult. This episode contains some explicit language.",
      "release": "2023-09-25T23:00:00Z",
      "duration": "01:06:44.2050000",
      "explicit": false,
      "spotifyId": "7jFfb4oqUryIt7SgCuEhez",
      "appleId": 1000629138422,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jFfb4oqUryIt7SgCuEhez",
        "apple": "https://podcasts.apple.com/podcast/4-the-abuse-begins/id1705661944?i=1000629138422"
      }
    },
    {
      "id": "426b907e-4021-4bf0-a11d-ae5f0beadffd",
      "title": "3 - Gothard Girls",
      "description": "Amanda details Bill Gothard\u0027s pattern of sexual harassment and assault of teenage girls and young women in IBLP that went unhindered for decades. Edit: Toward the end of the episode, Amanda says Bill resigned in 2004, but she meant to say 2014. This episode contains some explicit language. Y\u0027all, there are always gonna be some cuss words when we talk about Bill.",
      "release": "2023-09-18T04:00:00Z",
      "duration": "01:23:03.2220000",
      "explicit": false,
      "spotifyId": "3CujEcfPj7q3X8dy9wdodv",
      "appleId": 1000628207840,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3CujEcfPj7q3X8dy9wdodv",
        "apple": "https://podcasts.apple.com/podcast/3-gothard-girls/id1705661944?i=1000628207840"
      }
    },
    {
      "id": "4ba8099b-01c0-47a9-93af-855208dd2b4f",
      "title": "2 - A Harem, a Coup, and a Ponzi Scheme",
      "description": "Amanda tells Kyle about the Gothard brothers - particularly Steve. She details their various scandals and the ways IBLP covered them up.This episode contains some explicit language.",
      "release": "2023-09-11T04:00:00Z",
      "duration": "00:32:36.9110000",
      "explicit": false,
      "spotifyId": "5xbh3aoQdcusF7u32YTB5a",
      "appleId": 1000627418755,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5xbh3aoQdcusF7u32YTB5a",
        "apple": "https://podcasts.apple.com/podcast/2-a-harem-a-coup-and-a-ponzi-scheme/id1705661944?i=1000627418755"
      }
    },
    {
      "id": "ea66b362-1b10-4ce5-828c-ad17bb1f08b0",
      "title": "1 - The First Rule of Cults is We\u0027re Not a Cult",
      "description": "Amanda and Kyle open the podcast with a history of the IBLP cult led by Bill Gothard. Amanda explains the cult\u0027s early beginnings, exponential growth, and transformation into the organization that exists to this day. She shares the core tenants of Gothard\u0027s ideology, as well as her childhood perspective of the teachings she was forced to memorize and live by as a child raised in the cult. This episode contains some explicit language.",
      "release": "2023-09-04T04:00:00Z",
      "duration": "01:13:35.7380000",
      "explicit": false,
      "spotifyId": "6SAjX1Zz3JbZnuISK1p4O6",
      "appleId": 1000626655765,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6SAjX1Zz3JbZnuISK1p4O6",
        "apple": "https://podcasts.apple.com/podcast/1-the-first-rule-of-cults-is-were-not-a-cult/id1705661944?i=1000626655765"
      }
    }
  ]
}