{
  "id": "490c17ae-3128-4b8e-b0a1-a4c67a9a5f8f",
  "name": "The Braving Business Podcast",
  "youTubeChannelId": "UC3vxaQmd8eNk9kcV4I6pGVA",
  "episodes": [
    {
      "id": "12f57901-2b4f-4d5f-8ffd-fe36e0f3b9bc",
      "title": "Breaking Cycles and Building Freedom: Crystal Ball’s Journey from Cult Survivor to Entrepreneur",
      "description": "In this unforgettable episode of Braving Business, we meet Crystal Ball, whose life is a testament to resilience, reinvention, and the power of embracing freedom. Raised in poverty and repression within the infamous “Shiny Happy People” cult, Crystal’s childhood was defined by control and fear. But breaking free was only the beginning.\n\nCrystal shares her journey through profound loss, including surviving Hurricane Michael, losing both grandparents, and helping her husband recover from a stroke—all in one harrowing year. These challenges, combined with the unexpected catalyst of motherhood, pushed her to leave a 13-year corporate career and accidentally embark on a path of entrepreneurship.\n\nNow thriving in Panama City Beach, Crystal combines her passion for real estate and the coastal lifestyle as a successful entrepreneur and Sales Director of a boat club. She’s also preparing to release her autobiography, “Diary of a Cult Girl,” in early 2025, a bold and deeply personal account of breaking generational cycles and reclaiming self-worth.\n\nIn this episode, Crystal reveals:\n\nHow her upbringing shaped her drive and why hyper-achievement can be a trauma response.\n\nThe role of radical honesty and forgiveness in rebuilding her life.\n\nThe hilarious story of how she offered her ex-husband as part of a real estate deal, which made headlines in the New York Post.\n\nWhat “success” looks like now and how it’s changed over the years.\n\nThe values she’s instilling in her children to break harmful cycles.\n\nCrystal’s story is raw, inspiring, and a powerful reminder that healing, freedom, and purpose are within reach—even in the face of unimaginable challenges.\n\nKey Takeaways:\n\n“Life is a daring adventure or nothing at all.”—Crystal’s favorite quote by Helen Keller encapsulates her journey of resilience and courage.\n\nHow counseling, partnerships, and boundaries helped her overcome trauma and rebuild.\n\nWhy she believes honesty and openness are the keys to resilience in life and business.\n\nConnect with Crystal Ball:\n\nFacebook: Crystal Ball\n\nResources Mentioned:\n\nDiary of a Cult Girl (coming 2025)\n\nNew York Post feature\n\nEpisode Highlights:\n\n[00:03:00] Crystal’s childhood in the “Shiny Happy People” cult and breaking free.\n\n[00:10:30] Surviving Hurricane Michael and navigating loss.\n\n[00:20:15] The story behind leaving corporate America and her “life-changer baby.”\n\n[00:30:45] How she hilariously offered her ex-husband as a bonus in a home sale.\n\n[00:40:10] Radical honesty, boundaries, and breaking generational cycles.\n\n[00:50:00] Her advice: “If they’re not in the arena, don’t worry about them.”\n\nCrystal Ball’s extraordinary journey reminds us that resilience and transformation are possible for everyone. Tune in for an episode filled with courage, humor, and hope!",
      "release": "2025-01-06T21:28:44Z",
      "duration": "00:43:41",
      "explicit": false,
      "youTubeId": "MkpCDrvTUBs",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MkpCDrvTUBs"
      }
    }
  ]
}