{
  "id": "773d80ba-2857-4329-b1f6-6a69888fee28",
  "name": "The Way of Escape",
  "spotifyId": "0LfeCPUJv0OYv72C7yxnkK",
  "appleId": 1851760157,
  "youTubeChannelId": "UCycJEaI2C48ZkNypO83Et6g",
  "episodes": [
    {
      "id": "58777788-15a0-4694-81c3-d8ff1b11e758",
      "title": "Ep. 4 - I Thought I Was Going to Hell - The Way of Escape",
      "description": "Host: Rhonna RickmanGuest: Adam RickmanPodcast: The Way of Escape - Ep. 4 - I Thought I Was Going to Hell\nRaised in a system of perfectionism and condemnation, Adam Rickman spent years believing fear was faith.\nIn this heartfelt conversation with his mom, Rhonna Rickman, he shares how leaving Remnant Fellowship helped him rediscover Jesus as a loving Savior who rescues, not condemns.\nThis is an episode about healing, truth, and learning that grace really is enough.\nDisclaimer:The views expressed in this podcast are those of the host and guests. They reflect personal experiences and opinions and are shared for informational and educational purposes only. The podcast is not affiliated with any organization mentioned, and all references to individuals or groups are based on personal recollection and public record.",
      "release": "2025-11-12T04:29:15Z",
      "duration": "00:39:04",
      "explicit": false,
      "spotifyId": "1MDFVzxhaYRX5JfPN0Zc55",
      "appleId": 1000736370184,
      "youTubeId": "nUVFLibTp1M",
      "subjects": [
        "Remnant Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MDFVzxhaYRX5JfPN0Zc55",
        "apple": "https://podcasts.apple.com/podcast/ep-4-i-thought-i-was-going-to-hell-the-way-of-escape/id1851760157?i=1000736370184",
        "youtube": "https://www.youtube.com/watch?v=nUVFLibTp1M"
      }
    },
    {
      "id": "7aca41ac-c745-42c2-b79e-6d9f6829d5bb",
      "title": "Ep. 3 - When Truth Gets Twisted - The Way of Escape",
      "description": "Host: Rhonna RickmanGuest: Abbi WatersonPodcast: The Way of Escape - Ep. 2 - When Truth Gets Twisted\nWhat happens when the version of faith you’ve been taught turns out to be built on control and fear instead of grace and truth?\nIn this episode, Rhonna Rickman and her daughter, Abbi Waterson, dive deep into the distorted doctrine of Remnant Fellowship Church and Weigh Down Ministries. Abbi shares what it was like to grow up believing she was serving God while being kept from truly knowing Jesus.\nTogether, they unpack what it means to unlearn toxic teachings, rediscover the real Gospel, and find peace in a relationship with Christ built on love, not perfection.",
      "release": "2025-11-11T00:02:58Z",
      "duration": "00:28:35",
      "explicit": false,
      "spotifyId": "43sqeWQEfgnqyefOnCJ8jI",
      "appleId": 1000736182526,
      "youTubeId": "YIXFLA6CdKA",
      "subjects": [
        "Remnant Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/43sqeWQEfgnqyefOnCJ8jI",
        "apple": "https://podcasts.apple.com/podcast/ep-3-when-truth-gets-twisted-the-way-of-escape/id1851760157?i=1000736182526",
        "youtube": "https://www.youtube.com/watch?v=YIXFLA6CdKA"
      }
    },
    {
      "id": "0e112ca0-e8cd-4793-b031-c696f1365971",
      "title": "Ep 2 - The Cost of Leaving - The Way of Escape",
      "description": "Host: Rhonna Rickman Guest: Abbi WatersonPodcast: The Way of Escape - Ep. 2 The Cost of Leaving\nWhen you walk away from a high-control religious group, you don’t just leave a church. You leave behind your community, your identity, and sometimes your entire world.\nIn this episode, Rhonna Rickman sits down with her daughter Abbi Waterson to share what it really cost their family to leave Remnant Fellowship Church and Weigh Down Ministries. From fear and isolation to the pain of losing friends, Abbi opens up about the emotional and spiritual journey of finding truth after deception and discovering a faith built on love, not fear.",
      "release": "2025-11-10T00:42:20Z",
      "duration": "00:50:17",
      "explicit": false,
      "spotifyId": "1wROyK9aayehLZAEbtzewE",
      "appleId": 1000736025021,
      "youTubeId": "JsV90NRiMXw",
      "subjects": [
        "Remnant Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1wROyK9aayehLZAEbtzewE",
        "apple": "https://podcasts.apple.com/podcast/ep-2-the-cost-of-leaving-the-way-of-escape/id1851760157?i=1000736025021",
        "youtube": "https://www.youtube.com/watch?v=JsV90NRiMXw"
      }
    },
    {
      "id": "466b8181-540e-4ac4-981a-d4f4961ee245",
      "title": "Ep 1 - How It All Began - Rhonna Rickman - The Way of Escape",
      "description": "In this first episode, Rhonna Rickman opens her heart to share the story of how her family became deeply involved with Remnant Fellowship Church and Weigh Down Ministries and how, after 18 years, they finally found their way out.\nFrom early Weigh Down classes in Minnesota to leadership inside Remnant, Rhonna describes the gradual pull into a high-control environment disguised as faith. She shares the warning signs she missed, the manipulation masked as love, and the courage it took to leave.\nThis powerful first-hand account sets the stage for a season of healing, truth-telling, and hope for anyone seeking freedom from spiritual control.\nHost: Rhonna Rickman",
      "release": "2025-11-09T00:13:58Z",
      "duration": "00:29:23",
      "explicit": false,
      "spotifyId": "58M5gddKbP3UmfJGE5ocJR",
      "appleId": 1000735906471,
      "youTubeId": "o39-xBe6cOg",
      "subjects": [
        "Remnant Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/58M5gddKbP3UmfJGE5ocJR",
        "apple": "https://podcasts.apple.com/podcast/ep-1-how-it-all-began-rhonna-rickman-the-way-of-escape/id1851760157?i=1000735906471",
        "youtube": "https://www.youtube.com/watch?v=o39-xBe6cOg"
      }
    }
  ]
}