{
  "id": "c23fcb91-c287-428d-b082-5f8d628a04fc",
  "name": "The Lincoln Project",
  "spotifyId": "6F16aSGEXM49ktwWScBKuK",
  "appleId": 1551582052,
  "youTubeChannelId": "UCpYCxV51bykhMY-wSUozQRg",
  "episodes": [
    {
      "id": "ee7b5591-92a9-4604-b9f1-befc980cf30d",
      "title": "Nobody\u0027s Girl: Virginia Giuffre\u0027s Reckoning for Epstein, Maxwell, \u0026 the Billionaire Elite",
      "description": "Virginia Roberts Giuffre’s memoir NOBODY’S GIRL: A Memoir of Surviving Abuse and Fighting for Justice -- is more than a book — it’s a final act of truth-telling from a woman who refused to be silenced. In this episode, Rick Wilson honors her story by sitting down with co-author Amy Wallace and Virginia\u0027s brother, Sky Roberts, and his wife, Amanda, to examine how Virginia\u0027s courage blew the lid off of Epstein’s network of abuse, power, and complicity. Through her own words, Virginia\u0027s voice continues to demand accountability, advocate for survivors, and expose the rot behind the façade of wealth and privilege. Justice for victims only happens when someone refuses to stay silent, and that someone was Virginia. This special episode breaks down what Virginia\u0027s story teaches us about resilience, systemic failure, and the ongoing fight for a world where no one else becomes yet another survivor.  #RELEASETHEFILES\n•\n•\n•\n•\n•\nNOBODY’S GIRL: A Memoir of Surviving Abuse and Fighting for Justice has officially hit bookstores everywhere. To support Virginia\u0027s family\u0027s efforts to continue to carry Virginia\u0027s torch and advocate for sex abuse survivors, please follow @virginias_voice on all social media platforms. \n\nRick Wilson is on X at @TheRickWilson, on Bluesky at @TheRickWilson.bsky.social, and you can check out Rick\u0027s Substack at therickwilson.substack.com. You can check out more of LP\u0027s work at www.lincolnproject.us and on X at @ProjectLincoln.",
      "release": "2025-10-28T08:00:06Z",
      "duration": "01:26:30",
      "explicit": false,
      "spotifyId": "60Ckr9gPGG8tH1e5yJsHkA",
      "appleId": 1000733837905,
      "youTubeId": "BJKPTymLsj8",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/60Ckr9gPGG8tH1e5yJsHkA",
        "apple": "https://podcasts.apple.com/podcast/nobodys-girl-virginia-giuffres-reckoning-for-epstein/id1551582052?i=1000733837905",
        "youtube": "https://www.youtube.com/watch?v=BJKPTymLsj8"
      }
    },
    {
      "id": "3cfec6e8-8c6b-43c3-b326-575977eb51fb",
      "title": "Steven Hassan on the Cult of Trump",
      "description": "Rick talks to cult expert Steven Hassan about the dynamics of cult behavior, with a focus on Donald Trump’s powerful hold over his supporters. Hassan shares his insights on how Trump uses fear, loyalty, and manipulation to maintain control, drawing parallels to cult tactics he’s seen in his personal experiences. They discuss the intersection of religion, politics, and media, emphasizing the need to understand these influences in order to help Trump supporters break free and think critically.\n\nFollow Steven Hassan on X at http://www.twitter.com/cultexpert, subscribe to his Substack at http://stevenhassan.substack.com, and buy his book “The Cult of Trump: A Leading Cult Expert Explains How the President Uses Mind Control” at fine bookstores everywhere!\n\nFollow Rick Wilson at http://www.twitter.com/TheRickWilson  on X and subscribe to his Substack at http://www.therickwilson.substack.com.\nJoin the fight with Lincoln Project at http://www.lincolnproject.us and follow us on X at http://www.twitter.com/ProjectLincoln.\n\nAnd please like and subscribe to this podcast, thank you!",
      "release": "2024-09-19T08:00:32Z",
      "duration": "00:37:48",
      "explicit": false,
      "youTubeId": "f26NjZizg1A",
      "subjects": [
        "Cult-Expert",
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f26NjZizg1A"
      }
    }
  ]
}