{
  "id": "23b03693-248a-4056-8746-4377befd2719",
  "name": "The Light Dump",
  "youTubeChannelId": "UCkJqdQvVEZ1dyi1O2n5AT0g",
  "episodes": [
    {
      "id": "deab11fd-3855-40b6-8040-7f165850f5f0",
      "title": "EP:28  BORN INTO A CULT THAT I CHOSE TO LEAVE",
      "description": "What does it take to let go of a life that no longer serves you?\nIn this powerful episode of The Light Dump, host Suzi Jowsey Featherstone speaks with Jilly Moxham a survivor of leaving the global extreme and controlling religious sect—the Exclusive Brethren - also now known as the Plymouth Brethren Christian Church (PBCC).\nBorn into the religion Jilly was raised without television, radio, media, or connection to the outside world. From childhood, she was forbidden from mixing with other children, taught to fear “outsiders,” and conditioned to conform through constant meetings and rigid doctrine. As a woman, her role was predetermined: marry within the sect, produce children, submit, and never leave—no matter the cost.\nAlcohol was quietly normalised inside the religion, while emotional abuse, control, and fear were denied. Jilly married young, endured years of domestic abuse, addiction, and spiritual trauma, and ultimately faced an impossible choice: stay and survive, or leave and lose everything—including her children.\nAfter decades inside the cult, Jilly left. What followed was homelessness, poverty, sobriety, grief, and profound loss. Yet this is not a story of defeat.\nThrough surrender, recovery, and deep inner work, Jilly rebuilt her life from nothing. Today, she lives with peace, clarity, and freedom—happier than she was ever told life could be.\nThis episode explores:\n• Life inside a high-control religious cult\n• Religious trauma, shunning, and excommunication\n• Alcoholism as a coping mechanism\n• Domestic and spiritual abuse\n• The grief of leaving children behind\n• Sobriety and near-death survival\n• Surrender as a path to healing and freedom\n• Rebuilding identity after control\n \nCONTACT FOR JILLY:         www.jillymoxham.com\n\nTHE LIGHT DUMP SURRENDER SERIES\nThis episode heralds the start of The Light Dump  Surrender Series where amongst the spiritual exploration eps. you will find conversations about individuals who have had to face their fears to let go or surrender in order to go create positive life changes.\nIf you have a story of —or know someone who does—please subscribe, leave a comment, and reach out via email found on thelightdump.com. I’d love to hear from you.",
      "release": "2026-01-08T03:45:26Z",
      "duration": "00:51:43",
      "explicit": false,
      "youTubeId": "ZoYebcx-0sg",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZoYebcx-0sg"
      }
    }
  ]
}