{
  "_ts": 0,
  "id": "7fac111e-063d-4cd6-8337-d23449f1dd1a",
  "name": "The Opperman Report",
  "spotifyId": "6jULai3JCSiCzoQWfuZk4F",
  "appleId": 975926302,
  "episodes": [
    {
      "id": "e6c5a2df-a22e-4511-95d4-06ab5f85b1b5",
      "title": "Tony Ortega : Scientology Use of Private Investigators",
      "release": "2025-04-20T20:00:07Z",
      "duration": "00:45:41.5810000",
      "explicit": false,
      "spotifyId": "4EonVFKfcwybPTDEVVm65a",
      "appleId": 1000704220746,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EonVFKfcwybPTDEVVm65a",
        "apple": "https://podcasts.apple.com/podcast/tony-ortega-scientology-use-of-private-investigators/id975926302?i=1000704220746"
      }
    },
    {
      "id": "2e869556-4370-424f-8dda-57e4b902b39b",
      "title": "Tony Ortega - School of Scientology",
      "description": "Tony Ortega - School of Scientology Tony Ortega is a journalist who was formerly the editor of The Village Voice. He\u0027s written about Scientology since 1995, and in May 2015 released a book about Scientology\u0027s harassment of Paulette Cooper titled \u0027The Unbreakable Miss Lovely.\u0027 He continues to monitor breaking developments in Scientology and other controversial subjects from an undisclosed location in an underground bunker he shares with four cats and one of them wrinkly Shar Pei dogs. Despite his super-secret security protections, you can still reach him pretty easily by sending him a message at tonyo94 AT gmail.com The Underground Bunker Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-04-20T18:00:07Z",
      "duration": "01:49:04.4220000",
      "explicit": false,
      "spotifyId": "2XCPIMvif2pIF69ONHcFts",
      "appleId": 1000704211389,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2XCPIMvif2pIF69ONHcFts",
        "apple": "https://podcasts.apple.com/podcast/tony-ortega-school-of-scientology/id975926302?i=1000704211389"
      }
    },
    {
      "id": "13935827-e088-4af0-9ed1-68ac7c961645",
      "title": "Arnaldo Lerma - Scientology Cult",
      "description": "Arnaldo Lerma - Scientology Cult The late Arnaldo Lerma joined the Opperman Report to discuss Scientology. How it works, how it threatens and how it\u0027s influence is more and more a subtext for our times.Ever heard the story of Xenu, the genocidal alien dictator who, when faced with overpopulation troubles 75 million years ago, brought billions of his subjects to Earth to execute with a lethal combination of volcanoes and hydrogen bombs? Their disembodied spirits to cling to humans and their removal can only be achieved through the teachings of the Church of Scientology? If so, you can thank Arnie Lerma.Arnaldo Pagliarini Lerma was born in Washington, D.C., in 1950, to a mother who was an executive secretary to the Sudanese ambassador and a father who was a Mexican agriculture official — and who divorced months after his birth, according to Lerma\u0027s autobiography. His mother was a Scientology official in the D.C. church around 1968, about three decades after American science fiction writer L. Ron Hubbard published the first texts that would form the basis of his new religion, Scientology. By the time Lerma joined Scientology at 16 at the urging of his mother, the church had been banned in several Australian states and stripped of its tax-exempt status by the IRS, which deemed it a commercial operation for Hubbard\u0027s benefit — though a U.S. appeals court later recognized it as a religion in 1969. Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-04-20T16:00:08Z",
      "duration": "02:36:15.0900000",
      "explicit": false,
      "spotifyId": "2JJG56eGwkQ50qbP0I7qtd",
      "appleId": 1000704200694,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2JJG56eGwkQ50qbP0I7qtd",
        "apple": "https://podcasts.apple.com/podcast/arnaldo-lerma-scientology-cult/id975926302?i=1000704200694"
      }
    },
    {
      "id": "44c69dc1-51d5-477c-a711-aee3385afb80",
      "title": "Charles Manson Behind Bars - The Crazy Antics and Amazing Revelations of America\u0027s Icon of Evil",
      "description": "Dr Mark G. Hewitt : Charles Manson Behind Bars - The Crazy Antics and Amazing Revelations of America\u0027s Icon of Evil Jun 1, 2022 Dr. Mark G. Hewitt, DBA is a true crime author and award-winning public speaker who travels the world in his quest for intriguing, unanswered questions and enduring mysteries. Charles Manson holds a special place in history, notorious for his crimes and cult , yet fascinating for his seemingly endless ability to dominate and control all who came into his orbit.In this interview Dr Hewitttells Ed about Manson, who was never a quiet inmate. Mood swings from outbursts of rage to acts of generosity, he made his presence felt to everyone around him. He inspired awe in other inmates, he cozied up to prison guards who were eager to do him favours, and he was responsible for numerous staff transfers in the institution and externally.Mark is also the author of the acclaimed Zodiac Serial Killer Series, three books dedicated to telling the complete story of California’s most notorious unidentified serial killer: HUNTED: the Zodiac murders PROFILED: the Zodiac examined EXPOSED: the Zodiac revealed With inmate Guillermo Mendez, he is the co-author of Charles Manson Behind Bars , the first Manson book from the inside. Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2025-04-05T19:00:07Z",
      "duration": "00:47:10.7790000",
      "explicit": false,
      "spotifyId": "2mEceBwHL6cwCNTN6G7FTN",
      "appleId": 1000702331570,
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2mEceBwHL6cwCNTN6G7FTN",
        "apple": "https://podcasts.apple.com/podcast/charles-manson-behind-bars-the-crazy-antics-and/id975926302?i=1000702331570"
      }
    },
    {
      "id": "7e115fc2-4287-4926-8e86-923e3e9d1c2b",
      "title": "Cults on Trial - A Cross-Examination of Jim Jones, Charles Manson, Hitler… and Donald Trump",
      "description": "Larry Moore - Cults on Trial - A Cross-Examination of Jim Jones, Charles Manson, Hitler… and Donald Trump\n\nMay 6, 2024\n\nDr. Moore is a Pre-Sentence Investigator for Alabama Circuit Courts, with previous careers as an ordained pastor, college educator, and author. He holds a doctoral degree from Emory University, and has been a repeat guest on various TV and radio programs. His previous eight books have garnered widespread positive reviews.The Culture of Cults\nOur current malaise raises questions:\n• Are we all soul-stained with selfishness... or is it just a\nhealthy survival instinct?\n• Where is the line between normal self-interest and full-\nblown Narcissism?\n• How do we distinguish strong leadership from\nmanipulation? Community from Cult?\nDrawing upon court cases and real world experiences, this book shows how cult gurus and “cult cultures” fit a predictable pattern, a common template of destructive traits and tactics. By studying Cult Culture, the author argues, we gain insight into current politics and Fascist demagogues.\nFirst relating his own encounter with disillusioned cult members, author Lance Moore dissects the phenomena, exposing the methods of manipulation found in cult leaders —and on a smaller scale, in our own relationships.\n\nThis book is well-researched: it includes over 500 endnotes citing 500 Sources.\n\n\n\n\n\n\n\n\nBecome a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support.",
      "release": "2025-04-05T18:00:07Z",
      "duration": "00:53:56",
      "explicit": false,
      "spotifyId": "41lTQFqtZTz2duf9MI1lpV",
      "appleId": 1000702329337,
      "subjects": [
        "Peoples Temple",
        "Manson Family",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/41lTQFqtZTz2duf9MI1lpV",
        "apple": "https://podcasts.apple.com/podcast/cults-on-trial-a-cross-examination-of-jim/id1465935902?i=1000702329337"
      }
    },
    {
      "id": "829a9822-b6ee-4288-b44c-e2a8413c722c",
      "title": "When Men Become Gods: Mormon Polygamist Warren Jeffs, His Cult of Fear, and the Women Who Fought Back",
      "description": "New York Times bestselling author Stephen Singular provides an inside look at the Mormon polygamist sect that made headlines in 2008 for coercing young girls into marriage, and the story of their ruthless leader, Warren Jeffs. As the self-proclaimed prophet of the Fundamentalist Latter Day Saints, Warren Jeffs held sway over thousands of followers for nearly a decade. His rule was utterly tyrannical. In addition to coercing young girls into marriages with older men, Jeffs reputedly took scores of wives, many of whom were his father\u0027s widows. But in 2007, after landing on the FBI\u0027s Ten Most Wanted List, Jeffs\u0027s reign was forcefully ended. He would be imprisoned for committing rape as an accomplice. In When Men Become Gods, Edgar Award–nominee Stephen Singular traces Jeffs\u0027s rise to power and the concerted effort that led to his downfall. Newly updated, it describes the controversial 2008 raid on Jeffs\u0027s Texas compound and the fate of the 439 children taken from the sect. It offers readers a rare glimpse into a tradition that\u0027s almost a century old, but has only now been exposed. Buy the book here https://amzn.to/44I7CeX Oppermnan Report seriously needs your support during this seasonal low in radio broadcasting. You can join Pareon at https://www.patreon.com/oppermanreport Or Paypal a dobnation to Oppermareport@gmail.com Donate button with other options at oppermanreport.com Become a supporter of this podcast: https://www.spreaker.com/podcast/the-opperman-report--1198501/support .",
      "release": "2024-12-18T16:43:47Z",
      "duration": "01:00:41.3380000",
      "explicit": false,
      "spotifyId": "23nqvMfa3XaembBqz5oVuY",
      "appleId": 1000680859812,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23nqvMfa3XaembBqz5oVuY",
        "apple": "https://podcasts.apple.com/podcast/when-men-become-gods-mormon-polygamist-warren-jeffs/id975926302?i=1000680859812"
      }
    }
  ]
}