{
  "_ts": 0,
  "id": "75ab18f7-d740-4b2d-814e-936b3ad6accd",
  "name": "The Midlife Revolution",
  "spotifyId": "7rgElkNg4GOxIcUew7Eq6d",
  "appleId": 1739616143,
  "youTubeChannelId": "UCdTAwWoBlyiAEDIdahq5U6g",
  "youTubePlaylistId": "PL8Kkj8iik4-mrlkUxQqS4N6FFwnGuxDlz",
  "episodes": [
    {
      "id": "4cb5bb10-a426-4b16-b6a3-ef23b265007e",
      "title": "Delusions Of Lori: My Rights Have Been Violated!",
      "description": "Lori Vallow Daybell Demands Dismissal of Arizona Conspiracy Cases: Speedy Trial Rights Violated? | True Crime \u0026 High-Demand Religion  \n\n🚨 BREAKING: Lori Vallow Daybell, the infamous \u0022Doomsday Mom,\u0022 has filed a new motion to dismiss BOTH Arizona conspiracy cases, claiming her speedy trial rights have been violated. Join me LIVE as we dive into the latest developments in this chilling true crime saga, exploring the intersection of high-demand religion, narcissistic abuse, and the quest for justice.  \n\nThe details of Lori Vallow Daybell’s latest legal motions and their implications  \nHow her case ties into patterns of coercive control and institutional narcissism in high-demand religions like the LDS Church  \nInsights into the emotional manipulation tactics used in cults and abusive relationships  \nWhat this means for survivors of narcissistic abuse and those exiting controlling religious systems\n\n🔍 As a former Mormon and survivor of narcissistic abuse, I’m here to connect the dots between true crime, healing, and breaking free from coercive systems. Whether you’re fascinated by the Lori Vallow Daybell case, seeking to understand the psychology of cults, or healing from narcissistic relationships, this channel is for you.  \n\n💬 Drop your thoughts in the chat—what do you think about Lori’s latest legal strategy? How do you see high-demand religion playing a role in this case? Let’s discuss!  \n\n🔔 Don’t forget to LIKE, SUBSCRIBE, and hit the bell for more true crime deep dives, insights on exiting high-demand religions, and tools for healing from narcissistic abuse.  \n\n#TrueCrime #LoriVallowDaybell #HighDemandReligion #NarcissisticAbuse #SpeedyTrial #LDSChurch #CultPsychology #HealingJourney #DoomsdayMom #ArizonaCases #CoerciveControl  \n\nLori Vallow Daybell speedy trial violation  \nArizona conspiracy cases true crime  \nHigh-demand religion and narcissistic abuse  \nLori Vallow Daybell latest news 2025  \nTrue crime livestream healing from cults  \nEx-Mormon insights on Lori Vallow case  \nNarcissistic abuse recovery true crime  \nDoomsday Mom Arizona trial updates  \nCoercive control in high-demand religions  \nTrue crime and cult psychology analysis\n\nJoin the conversation and share this stream with anyone interested in true crime, exiting high-demand religions, or healing from narcissistic abuse. Let’s grow this community together!\n\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5143133026910208",
      "release": "2025-02-11T17:22:17Z",
      "duration": "00:30:16",
      "explicit": false,
      "youTubeId": "x09WmBINdb4",
      "subjects": [
        "Chad Daybell",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x09WmBINdb4"
      }
    },
    {
      "id": "62e989b0-f86f-4bdf-8eb3-04dd4aa7e425",
      "title": "Losing Faith, Finding Freedom: My Journey Beyond Mormonism",
      "description": "Episode Description: Embark on an intimate exploration with Megan Conner as she recounts the moment her faith in Mormonism unraveled , leading to a profound personal transformation . In this pivotal episode of \u0022The Midlife Revolution,\u0022 Megan delves deep into the emotional and spiritual upheaval she experienced upon discovering the Church\u0027s concealed history and the contradictions within its doctrine . Listen as Megan narrates the story of a family trip that turned into a catalyst for change, where discussions with her sister and cousin about their shared Mormon background led her down a rabbit hole of research and introspection. She reveals how the church\u0027s own admissions in the Gospel Topic Essays and historical documents, like the controversial 1922 meetings , challenged her faith to its core, ultimately leading to her decision to step away from the LDS Church . This episode isn\u0027t just about loss of faith; it\u0027s about finding joy in the vast expanse of \u0022I don\u0027t know.\u0022 Megan discusses the peace and empowerment she discovered in crafting her own values and morality , free from the confines of religious dogma. Learn how she navigated through feelings of betrayal and deception , to emerge with a renewed sense of self , celebrating each moment of life with newfound appreciation. Whether you\u0027re on your own journey of faith deconstruction , seeking understanding, or simply curious about the personal impacts of religious transitions , this episode offers solace, insight, and a beacon of hope for those redefining their spiritual identity. Join us in this candid conversation that might just inspire you to question, explore, and redefine your own path to self-discovery.",
      "release": "2025-02-10T05:00:00Z",
      "duration": "00:53:35.2900000",
      "explicit": false,
      "spotifyId": "24ypXnNcBchaew2JDYWUVQ",
      "appleId": 1000690741333,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/24ypXnNcBchaew2JDYWUVQ",
        "apple": "https://podcasts.apple.com/podcast/losing-faith-finding-freedom-my-journey-beyond-mormonism/id1739616143?i=1000690741333"
      }
    },
    {
      "id": "27a38869-4cbe-4d6b-a4fa-b6d6caacf485",
      "title": "I was there:  Lori Vallow\u0027s date with her brother Alex, who asked, \u0022Can I borrow g*n? I\u0027m gonna...\u0022",
      "description": "Exclusive Interview: Inside the Mind of Alex Cox - Lori Vallow\u0027s Brother and Alleged Hitman\n\nRandy\u0027s book: https://www.amazon.com/Filling-Empty-Randy-C-Watts\n\nDive deep into the chilling world of one of the most talked-about true crime cases with an exclusive interview featuring a close friend and former coworker of Alex Cox, the brother of Lori Vallow Daybell. This video uncovers two shocking incidents that paint a disturbing picture of Cox\u0027s intentions and actions:\n\nThe Bizarre Date Proposal: Hear firsthand how Alex Cox extended an unusual invitation for a date where his own sister, Lori Vallow, was to be his date, shedding light on the complex and dark dynamics within their family.\nThe Gun Borrowing Incident: Discover the harrowing moment when Cox asked to borrow a gun with the explicit intent to murder his brother-in-law, revealing his lethal involvement in the family\u0027s sinister plot.\n\nThis interview not only explores the depths of narcissism and control within the family but also delves into the influence of their Mormon Church background on these events. Join us as we analyze these explosive revelations with insights into:\n\nTrue Crime dynamics and the psychology behind such heinous acts.\nThe role of coercive control within high-demand religions.\nThe impact of narcissistic personality traits in criminal behavior.\n\nDon\u0027t miss this unique opportunity to understand the psyche of Alex Cox through the eyes of someone who knew him personally. Like, comment, and subscribe for more in-depth true crime content that seeks to understand the human aspects behind the headlines.\n\nAlex Cox\nLori Vallow Daybell\nTrue Crime Interview\nMormon Church Scandal\nNarcissism in the LDS church\nFamily Dynamics in Murder Cases\nCoercive Control\n\n#TrueCrime\n#MormonChurch\n#Narcissism\n\nHit the bell icon to get notified about our upcoming videos on true crime, psychological analysis, and more. Share your thoughts in the comments below - what do you think drove Alex Cox to such extremes?\n\nThis video contains mature themes and discussions related to crime and psychological manipulation. Viewer discretion is advised.\n\nRemember, this content uses real-life accounts and explores sensitive topics with respect and integrity. If you find this video compelling, consider supporting the channel to help us continue bringing you these exclusive stories.\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g/join",
      "release": "2025-02-09T20:30:21Z",
      "duration": "00:57:41",
      "explicit": false,
      "youTubeId": "1S3Bl-odBJ8",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1S3Bl-odBJ8"
      }
    },
    {
      "id": "159546ca-60a4-438d-89e1-31b1f7e1d666",
      "title": "Former LDS missionary EXPOSES Emotional Manipulation tactics used by the Mormon church",
      "description": "E Course on how to identify and defend against manipulation tactics! Email askmeegan@gmail.com \n\nUncover the hidden tactics used by the LDS Church to convert new members through emotional manipulation. In this eye-opening documentary, we delve deep into the strategies taught to Mormon missionaries, revealing how they target the vulnerable and use psychological techniques to persuade individuals to join the church. Learn about the systematic approach from insider perspectives and expert analyses, and understand the impact of these methods on unsuspecting individuals.\n\nFormer missionary exposes the truth! \nMissionary Training: Explore the \u0022Preach My Gospel\u0022 manual and other resources that guide missionaries in their conversion efforts.\nEmotional Manipulation Techniques: Discover how feelings of loneliness, life transitions, and personal loss are exploited to make converts.\nSurvivor Stories: Hear firsthand accounts from those who have experienced these tactics and how they\u0027ve navigated their way to recovery.\n\nWhy Watch?\nGain a critical understanding of religious recruitment practices.\nLearn to recognize signs of emotional manipulation in various contexts.\nEmpower yourself with knowledge to heal from or avoid similar experiences.\n\nLDS Church, Mormon Missionaries, Emotional Manipulation, Conversion Tactics, Religious Recruitment, Narcissism, Healing from Abuse, True Crime, Cult Tactics, Religious Manipulation, Mind Control, High Demand Religion, Coercive Control, Spiritual Abuse, Cult Psychology\n\n#MormonExposed \n#TrueCrimeStories \n#NarcissismRecovery\n\nSubscribe to our channel for more deep dives into the world of true crime, narcissism, and the journey towards healing from manipulative religious practices. Don\u0027t forget to like, comment, and share if this video resonates with you or someone you know.\n\nNote: This video does not aim to defame or generalize about any group but to educate on specific practices that have been documented and discussed in various sources. Your journey to understanding and healing starts here.",
      "release": "2025-02-08T00:30:12Z",
      "duration": "02:18:40",
      "explicit": false,
      "youTubeId": "SXDnabgqWyo",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SXDnabgqWyo"
      }
    },
    {
      "id": "30a9983d-1753-49e7-b17a-e581a9dcd6a2",
      "title": "Unmasking the shadow: Comparing Lori Daybell \u0026 Ruby Franke\u0027s narcissistic traits FT. John Dehlin MSP",
      "description": "For information on my on-demand E-Course learning to identify and defend against manipulation and control, email: askmeegan@gmail.com\n\nJoin me in an eye-opening exploration as we delve into the chilling parallels between Lori Vallow Daybell and Ruby Franke, two women whose lives have spiraled into true crime infamy. With the expert insights of John Dehlin, Ph.D., from the renowned \u0022Mormon Stories\u0022 podcast, we navigate the murky waters where LDS teachings, narcissistic personality traits, and criminal actions meet.\n\nIn this video, we dissect:\nPersonality Traits: A deep dive into the narcissistic behaviors exhibited by both Lori and Ruby, exploring how these traits influenced their actions.\nReligious Beliefs: How their interpretations of Mormon doctrine, particularly around family roles, discipline, and doomsday scenarios, led to radical decisions.\nCrimes Committed: An analysis of the crimes each woman is accused of, from child abuse in Ruby\u0027s case to conspiracy to murder in Lori\u0027s, highlighting the impact of their beliefs and personalities.\n\nJohn Dehlin\u0027s psychological expertise helps us understand:\nThe psychological mechanisms behind their actions.\nHow religious extremism can be a breeding ground for such behaviors.\nThe cultural and doctrinal elements of Mormonism that might enable or exacerbate these tendencies.\n\nWhy Watch?\nGain a unique perspective on how personal beliefs and psychological disorders can intersect to produce tragic outcomes.\nUnderstand the broader implications of these cases on the LDS community and the true crime genre.\nHear firsthand from someone who has been intimately involved in discussing and analyzing these issues within the context of Mormonism.\n\nDon\u0027t forget to:\nLike, Comment, and Subscribe for more thought-provoking content at the intersection of religion, psychology, and crime.\nShare your thoughts on how these cases reflect on or challenge your understanding of religious teachings and human behavior.\n\n#TrueCrime #Narcissism #Mormonism\n\n\nLori Vallow Daybell, Ruby Franke, John Dehlin, Mormon Stories, LDS Church, Narcissistic Personality Disorder, Child Abuse, Conspiracy to Murder, Religious Extremism, Doomsday Beliefs, True Crime Analysis, Psychological Insights, Mormon Doctrine, Family Vlog Crimes, Cult Behavior, Criminal Psychology, Faith and Crime.\n\nWatch now to dissect this disturbing convergence of faith, narcissism, and crime, offering a nuanced look at two of the most talked-about cases in recent years.\n\nNote: This video discusses sensitive topics including child abuse, murder, and psychological disorders. Viewer discretion is advised.\n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g/join",
      "release": "2025-02-04T00:30:06Z",
      "duration": "02:03:52",
      "explicit": false,
      "youTubeId": "kgulnFkYRV8",
      "subjects": [
        "Chad Daybell",
        "Connexions",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kgulnFkYRV8"
      }
    },
    {
      "id": "5e4bd827-f240-4fbb-8e8c-89f6f02e62d4",
      "title": "Millions were Brainwashed",
      "description": "As a 7th generation Mormon, I talk about my experiences being indoctrinated into the LDS faith, and how the programs and rhetoric of the church leaders make it impossible for young people to have informed consent when choosing church membership. I offer unique insights into indoctrination tactics and why it is that millions of LDS members believe that they are not in a cult. Is brainwashing too harsh of a description for what I endured? You be the judge. Visit www.third-verse.com/coaching to schedule a free 20 minute call with Megan! Join the community to gain access to perks! https://www.youtube.com/@Third_Verse/membership About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts. Legal Disclaimer: The content presented on @Third_Verse (\u0022Channel\u0022) is based solely on the personal experiences and opinions of the creator. It is intended for informational and entertainment purposes only and should not be construed as professional advice. The creator is not a licensed professional in any field and therefore the content should not be considered as authoritative guidance. Viewers are encouraged to conduct their own research and consult with qualified professionals before making any decisions based on the information provided on this Channel. The views expressed on this Channel are subjective and should not be taken as evidence or factual statements. While efforts are made to ensure the accuracy and reliability of the information presented, no guarantee is made regarding its completeness or suitability for any particular purpose. By accessing and using this Channel, viewers agree to waive any claims against the creator arising from reliance on the content provided herein.",
      "release": "2024-10-16T04:00:00Z",
      "duration": "02:05:22.2660000",
      "explicit": false,
      "spotifyId": "5ZGq8YNRgYFPqLPBzjGgDW",
      "appleId": 1000673250443,
      "youTubeId": "ou3-eVGAxZM",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZGq8YNRgYFPqLPBzjGgDW",
        "apple": "https://podcasts.apple.com/podcast/millions-were-brainwashed/id1739616143?i=1000673250443",
        "youtube": "https://www.youtube.com/watch?v=ou3-eVGAxZM"
      }
    },
    {
      "id": "24eff4da-dd6c-4b15-ac3a-1b8932c0b0bb",
      "title": "Heal",
      "description": "Heal: We all have wounds. Let\u0027s heal them for our own lives and the ones we love. Healing is the beginning of a series of mini-episodes that will address many of the tools that I learned in my therapeutic process. Most people need some form of healing, but not everyone is ready for therapy. Using these tools, individuals can assess where they are on their mental health journey, and start the process while also assessing what healing modality might work best for them. The host is not a licensed mental health professional. She shares her personal experiences and perspectives for informational purposes only. Listeners should always consult with a licensed professional for therapy work. About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts. Legal Disclaimer: The content presented on @Third_Verse (\u0022Channel\u0022) is based solely on the personal experiences and opinions of the creator. It is intended for informational and entertainment purposes only and should not be construed as professional advice. The creator is not a licensed professional in any field and therefore the content should not be considered as authoritative guidance. Viewers are encouraged to conduct their own research and consult with qualified professionals before making any decisions based on the information provided on this Channel. The views expressed on this Channel are subjective and should not be taken as evidence or factual statements. While efforts are made to ensure the accuracy and reliability of the information presented, no guarantee is made regarding its completeness or suitability for any particular purpose. By accessing and using this Channel, viewers agree to waive any claims against the creator arising from reliance on the content provided herein.",
      "release": "2024-10-05T19:00:26Z",
      "duration": "00:16:17.9600000",
      "explicit": false,
      "spotifyId": "2eyxLgk8juMrLHRfsmxsNS",
      "youTubeId": "RN38MKS73E8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2eyxLgk8juMrLHRfsmxsNS",
        "youtube": "https://www.youtube.com/watch?v=RN38MKS73E8"
      }
    },
    {
      "id": "6886495c-1b45-4a9c-89d1-8a103b7f3033",
      "title": "Juror 18: The Lori Vallow Daybell Trial",
      "description": "Tom Evans, Author of the book \u0022Money, Power, and Sex: The Lori Vallow Daybell Trial\u0022 Juror 18, sat down with me for a vulnerable conversation about the ongoing impact the Daybell trials have had on him, his future, and his dreams for his family. We talk in-depth about the process, his feelings during and after the trial, and his new project: working on a book after attending the entirety of the Chad Daybell Trial. Tom Evans is donating the proceeds of his books to Hope House : https://www.youtube.com/watch?v=geN_tayh08k\u0026t=82s Find Tom\u0027s first book here: https://www.amazon.com/Money-Power-Sex-Vallow-Daybell-Number/dp/1958727318 All Things Tom Evans Here: https://www.tomevansauthor.com/ Visit www.third-verse.com/coaching to schedule a free 20 minute call with Megan! Join the community to gain access to perks! https://www.youtube.com/@Third_Verse/membership About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts. Legal Disclaimer: The content presented on @Third_Verse (\u0022Channel\u0022) is based solely on the personal experiences and opinions of the creator. It is intended for informational and entertainment purposes only and should not be construed as professional advice. The creator is not a licensed professional in any field and therefore the content should not be considered as authoritative guidance. Viewers are encouraged to conduct their own research and consult with qualified professionals before making any decisions based on the information provided on this Channel. The views expressed on this Channel are subjective and should not be taken as evidence or factual statements. While efforts are made to ensure the accuracy and reliability of the information presented, no guarantee is made regarding its completeness or suitability for any particular purpose. By accessing and using this Channel, viewers agree to waive any claims against the creator arising from reliance on the content provided herein.",
      "release": "2024-09-30T04:00:00Z",
      "duration": "00:48:44.3430000",
      "explicit": false,
      "spotifyId": "5s0vmhRl6Nno7Y2r3aUDCR",
      "appleId": 1000671240654,
      "youTubeId": "o1PuLg5LwFU",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5s0vmhRl6Nno7Y2r3aUDCR",
        "apple": "https://podcasts.apple.com/podcast/juror-18-the-lori-vallow-daybell-trial/id1739616143?i=1000671240654",
        "youtube": "https://www.youtube.com/watch?v=o1PuLg5LwFU"
      }
    },
    {
      "id": "1f8f555c-bffb-4724-8c23-c5f530b0f9a1",
      "title": "The Myth of Simplicity and the Joy of Failing Forward",
      "description": "Season 2 of the Midlife Revolution! Podcast begins with a discussion with John Larsen- Philosopher, Farmer, Podcaster and Revolutionary! We talk about the Myth of the simple life, and how failure is an inevitability that we can learn to embrace as we make small changes that change everything! John Larsen’s final Mormon Stories Episode: • Satan in Mormonism w/ John Larsen | E... John Larsen’s current channel: / @johnlarsen1 The Dabbler Farm Website: www.dabblerfarm.org Amazon Wish List for the Dabbler Farm: https://www.amazon.com/hz/wishlist/ls... John Larsen’s Past Podcast, Mormon Expression is hosted at the Open Stories Foundation at www.openstoriesfoundation.org Visit www.third-verse.com/coaching to schedule a free 20 minute call with Megan! Join the community to gain access to perks! https://www.youtube.com/@Third_Verse/membership About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts. Legal Disclaimer: The content presented on @Third_Verse (\u0022Channel\u0022) is based solely on the personal experiences and opinions of the creator. It is intended for informational and entertainment purposes only and should not be construed as professional advice. The creator is not a licensed professional in any field and therefore the content should not be considered as authoritative guidance. Viewers are encouraged to conduct their own research and consult with qualified professionals before making any decisions based on the information provided on this Channel. The views expressed on this Channel are subjective and should not be taken as evidence or factual statements. While efforts are made to ensure the accuracy and reliability of the information presented, no guarantee is made regarding its completeness or suitability for any particular purpose. By accessing and using this Channel, viewers agree to waive any claims against the creator arising from reliance on the content provided herein.",
      "release": "2024-09-23T04:00:00Z",
      "duration": "01:28:15.0080000",
      "explicit": false,
      "spotifyId": "5HGhxrOVyai7tBr2QgksRs",
      "appleId": 1000670480171,
      "youTubeId": "UQa9_jWoOJI",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5HGhxrOVyai7tBr2QgksRs",
        "apple": "https://podcasts.apple.com/podcast/the-myth-of-simplicity-and-the-joy-of-failing-forward/id1739616143?i=1000670480171",
        "youtube": "https://www.youtube.com/watch?v=UQa9_jWoOJI"
      }
    },
    {
      "id": "d4180c44-d421-4048-869c-06117125bc10",
      "title": "Starting Over: A Single Mom\u0027s Courageous Choice",
      "description": "Megan discusses the difficulties of having her job eliminated and her courageous choice to start over as a podcaster and full time coach. Visit www.third-verse.com/coaching to schedule a free 20 minute call with Megan! Join the community to gain access to perks! https://www.youtube.com/@Third_Verse/membership About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts. Legal Disclaimer: The content presented on @Third_Verse (\u0022Channel\u0022) is based solely on the personal experiences and opinions of the creator. It is intended for informational and entertainment purposes only and should not be construed as professional advice. The creator is not a licensed professional in any field and therefore the content should not be considered as authoritative guidance. Viewers are encouraged to conduct their own research and consult with qualified professionals before making any decisions based on the information provided on this Channel. The views expressed on this Channel are subjective and should not be taken as evidence or factual statements. While efforts are made to ensure the accuracy and reliability of the information presented, no guarantee is made regarding its completeness or suitability for any particular purpose. By accessing and using this Channel, viewers agree to waive any claims against the creator arising from reliance on the content provided herein.",
      "release": "2024-09-16T04:00:00Z",
      "duration": "00:56:25.0130000",
      "explicit": false,
      "spotifyId": "3Wv3xIYMHPUV3dndWCD7Vr",
      "appleId": 1000669774798,
      "youTubeId": "tvLKy0SmLL8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Wv3xIYMHPUV3dndWCD7Vr",
        "apple": "https://podcasts.apple.com/podcast/starting-over-a-single-moms-courageous-choice/id1739616143?i=1000669774798",
        "youtube": "https://www.youtube.com/watch?v=tvLKy0SmLL8"
      }
    },
    {
      "id": "68db716c-d2e2-4b17-acd5-81f08e9cd3b9",
      "title": "Missionary",
      "description": "Visit www.third-verse.com/coaching to schedule a free 20 minute call with Megan! Join the community to gain access to perks! https://www.youtube.com/@Third_Verse/membership About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts. Legal Disclaimer: The content presented on @Third_Verse (\u0022Channel\u0022) is based solely on the personal experiences and opinions of the creator. It is intended for informational and entertainment purposes only and should not be construed as professional advice. The creator is not a licensed professional in any field and therefore the content should not be considered as authoritative guidance. Viewers are encouraged to conduct their own research and consult with qualified professionals before making any decisions based on the information provided on this Channel. The views expressed on this Channel are subjective and should not be taken as evidence or factual statements. While efforts are made to ensure the accuracy and reliability of the information presented, no guarantee is made regarding its completeness or suitability for any particular purpose. By accessing and using this Channel, viewers agree to waive any claims against the creator arising from reliance on the content provided herein.",
      "release": "2024-09-09T04:00:00Z",
      "duration": "01:10:43.6840000",
      "explicit": false,
      "spotifyId": "1lxCFvsskgU2XQJqFwbPKy",
      "appleId": 1000668969775,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1lxCFvsskgU2XQJqFwbPKy",
        "apple": "https://podcasts.apple.com/podcast/missionary/id1739616143?i=1000668969775"
      }
    },
    {
      "id": "d78bc039-7f53-4f9e-a6d6-7f75fb2d0ca0",
      "title": "Please Cry!",
      "description": "Megan Conner is an author, coach, and mother of 6 spectacular human beings. Megan is not a mental health professional, but she is an expert on her own healing from cPTSD after a lifetime of abuse. In sharing her journey with others, Megan hopes to spread the message that not only is it possible to heal, it\u0027s possible to have a happy and peaceful life after trauma. In a recent live Q\u0026A, Megan\u0027s channel members had a chance to ask her questions about processing and releasing emotions. This episode features the sections of that discussion that focus on the healing power of crying.",
      "release": "2024-09-02T04:00:00Z",
      "duration": "00:52:28.2130000",
      "explicit": false,
      "spotifyId": "1D6cP4z9Pr3LhjxZDiKz0L",
      "appleId": 1000668113019,
      "youTubeId": "Y5HxX7Bt76g",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1D6cP4z9Pr3LhjxZDiKz0L",
        "apple": "https://podcasts.apple.com/podcast/please-cry/id1739616143?i=1000668113019",
        "youtube": "https://www.youtube.com/watch?v=Y5HxX7Bt76g"
      }
    },
    {
      "id": "7908a952-2598-4737-8206-fe8c7fc7b23f",
      "title": "How To Hire A Therapist",
      "description": "This episode in the continuing series on How To Heal explores the sometimes complicat4ed process of hiring a competent therapist to aid in addressing mental health issues.",
      "release": "2024-07-24T04:00:00Z",
      "duration": "00:42:11.4360000",
      "explicit": false,
      "spotifyId": "5sqwZEeuCsrriDlMT9yBCh",
      "appleId": 1000663157482,
      "youTubeId": "CFjTB2zACQA",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5sqwZEeuCsrriDlMT9yBCh",
        "apple": "https://podcasts.apple.com/podcast/how-to-hire-a-therapist/id1739616143?i=1000663157482",
        "youtube": "https://www.youtube.com/watch?v=CFjTB2zACQA"
      }
    },
    {
      "id": "bdb27df8-5584-405d-8389-ffff11a56a36",
      "title": "How To Heal: Meditation",
      "description": "In this series on how to heal from trauma and wounding, we discuss some of the tools i used in my journey to heal from cPTSD. Join this channel to get access to perks: https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g/join About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts. Legal Disclaimer: The content presented on @Third_Verse (\u0022Channel\u0022) is based solely on the personal experiences and opinions of the creator. It is intended for informational and entertainment purposes only and should not be construed as professional advice. The creator is not a licensed professional in any field and therefore the content should not be considered as authoritative guidance. Viewers are encouraged to conduct their own research and consult with qualified professionals before making any decisions based on the information provided on this Channel. The views expressed on this Channel are subjective and should not be taken as evidence or factual statements. While efforts are made to ensure the accuracy and reliability of the information presented, no guarantee is made regarding its completeness or suitability for any particular purpose. By accessing and using this Channel, viewers agree to waive any claims against the creator arising from reliance on the content provided herein.",
      "release": "2024-07-10T04:00:00Z",
      "duration": "00:09:44.8690000",
      "explicit": false,
      "spotifyId": "2Oon24PiPeo6zQgqxu66FH",
      "appleId": 1000661732468,
      "youTubeId": "VtggSgjVvQI",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Oon24PiPeo6zQgqxu66FH",
        "apple": "https://podcasts.apple.com/podcast/how-to-heal-meditation/id1739616143?i=1000661732468",
        "youtube": "https://www.youtube.com/watch?v=VtggSgjVvQI"
      }
    },
    {
      "id": "e25cc816-668a-4aed-b18a-3ea8d42f1a90",
      "title": "How to Heal: Criticism",
      "description": "In this series on how to heal from trauma and wounding, we discuss some of the tools I used in my journey to heal from cPTSD. Join this channel to get access to perks: https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g/join About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts. Legal Disclaimer: The content presented on @Third_Verse (\u0022Channel\u0022) is based solely on the personal experiences and opinions of the creator. It is intended for informational and entertainment purposes only and should not be construed as professional advice. The creator is not a licensed professional in any field and therefore the content should not be considered as authoritative guidance. Viewers are encouraged to conduct their own research and consult with qualified professionals before making any decisions based on the information provided on this Channel. The views expressed on this Channel are subjective and should not be taken as evidence or factual statements. While efforts are made to ensure the accuracy and reliability of the information presented, no guarantee is made regarding its completeness or suitability for any particular purpose. By accessing and using this Channel, viewers agree to waive any claims against the creator arising from reliance on the content provided herein.",
      "release": "2024-07-09T04:00:00Z",
      "duration": "00:07:30.2080000",
      "explicit": false,
      "spotifyId": "6PDn8gN58G7UYpld6oEJ7g",
      "appleId": 1000661610322,
      "youTubeId": "vfe70x2v_7Q",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6PDn8gN58G7UYpld6oEJ7g",
        "apple": "https://podcasts.apple.com/podcast/how-to-heal-giving-and-receiving-criticism/id1739616143?i=1000661610322",
        "youtube": "https://www.youtube.com/watch?v=vfe70x2v_7Q"
      }
    },
    {
      "id": "d128e2d3-607e-4fad-9d0d-a3fd7cdba631",
      "title": "How To Heal: Seeking Discomfort",
      "description": "In this series on How To Heal, Megan reveals the tools that helped her most in her healing journey and invites listeners to follow along in making small changes that change everything. About the Host:e Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-06-28T04:00:00Z",
      "duration": "00:09:16.1870000",
      "explicit": false,
      "spotifyId": "2PA27GnOdCjncgfnH1I7pW",
      "appleId": 1000660507523,
      "youTubeId": "K_8nn9rS1Uk",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2PA27GnOdCjncgfnH1I7pW",
        "apple": "https://podcasts.apple.com/podcast/how-to-heal-seeking-discomfort/id1739616143?i=1000660507523",
        "youtube": "https://www.youtube.com/watch?v=K_8nn9rS1Uk"
      }
    },
    {
      "id": "1a37d5ad-ffd0-4370-a43c-b129c953d43d",
      "title": "How To Heal: Sitting With Uncomfortable Feelings",
      "description": "In this series on how to heal, Megan reveals the tools that were ost helpfu to her on her healing journey. Today\u0027s discussion is on how to sit with uncomfortable feelings without giving in to the urge to isolate or numb. Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-06-27T04:00:00Z",
      "duration": "00:09:33.8340000",
      "explicit": false,
      "spotifyId": "5YsEhxrfXNk7aFZJNXftkE",
      "appleId": 1000660388594,
      "youTubeId": "fGX-NJxkW7A",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5YsEhxrfXNk7aFZJNXftkE",
        "apple": "https://podcasts.apple.com/podcast/how-to-heal-sitting-with-uncomfortable-feelings/id1739616143?i=1000660388594",
        "youtube": "https://www.youtube.com/watch?v=fGX-NJxkW7A"
      }
    },
    {
      "id": "6f519842-5075-4622-bce5-b4a20bbf0f31",
      "title": "How To Heal: Radical Acceptance",
      "description": "In this series of How To Heal, Megan reveals the tools that were most helpful to her in her healing process. Episode 11.1 addresses the concept of radical acceptance and how embracing change and difficult circumstances can help us to move through trauma to a more balanced world view. Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-06-26T04:00:00Z",
      "duration": "00:11:00.7810000",
      "explicit": false,
      "spotifyId": "3mQKd6AGFbBcr3of6cO5iC",
      "appleId": 1000660282578,
      "youTubeId": "vbHq85fvOO8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mQKd6AGFbBcr3of6cO5iC",
        "apple": "https://podcasts.apple.com/podcast/how-to-heal-radical-acceptance/id1739616143?i=1000660282578",
        "youtube": "https://www.youtube.com/watch?v=vbHq85fvOO8"
      }
    },
    {
      "id": "c9f66446-2a1a-4161-a6a6-e646d2372a84",
      "title": "Parts",
      "description": "Today\u0027s episode continues the exploration of Dr. Richard Schwartz breakthrough healing modality: Internal Family Systems or IFS. I discuss examples of the different parts of us that show up in interesting ways based on our past wounds and experiences. About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-06-13T03:00:00Z",
      "duration": "00:44:08.9340000",
      "explicit": false,
      "spotifyId": "0UCg1BtDYdZZoL0m4fxITi",
      "appleId": 1000658857991,
      "youTubeId": "hEGnYaI7zyY",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0UCg1BtDYdZZoL0m4fxITi",
        "apple": "https://podcasts.apple.com/podcast/parts/id1739616143?i=1000658857991",
        "youtube": "https://www.youtube.com/watch?v=hEGnYaI7zyY"
      }
    },
    {
      "id": "037830ea-7011-4d19-835f-2f7f837ed3eb",
      "title": "Self",
      "description": "Self: In his book “No Bad Parts”, Dr, Schwartz reveals that just under the surface of these wounded parts is a Self which cannot be hurt, knows how to heal both internally and externally, and has characteristics which represent the highest and best of what we can become as human beings. He refers to these traits as the 8 C’s of self-leadership, and I would like to touch on each of these today. As we walk through these traits, I will give some examples from my own healing journey to help illustrate how these characteristics can help us heal our relationship with our Self so that we can then have healthier external relationships as well. Remember that the Midlife Revolution is all about small changes, so I’m not asking anyone to absorb and practice all 8 of these at once. My hope is that you will pick one that resonates with you and feels safe to try. Feel free to save and share this episode so that you can come back to it when you’re ready to try the next one. About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-06-05T04:00:00Z",
      "duration": "00:46:53.0590000",
      "explicit": false,
      "spotifyId": "7nshnJDMqLeJxBz3HkkTK6",
      "appleId": 1000657881155,
      "youTubeId": "ziPIirq63bU",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7nshnJDMqLeJxBz3HkkTK6",
        "apple": "https://podcasts.apple.com/podcast/self-exploring-the-ifs-model-and-the-8-cs-of-self-led-living/id1739616143?i=1000657881155",
        "youtube": "https://www.youtube.com/watch?v=ziPIirq63bU"
      }
    },
    {
      "id": "983d6d6f-d973-4b42-b885-8a1be8c63de3",
      "title": "LDS",
      "description": "To my friends in the church after I\u0027ve left: We learn so much when we listen to voices that express opinions different from our own. One of the best practices we can adopt in our healing journey is to express criticism without judgment, and to accept criticism without shame. In this episode, I express my respect for members of the LDS faith, and discuss three of the issues that I would like LDS members to understand. Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-05-22T16:00:00Z",
      "duration": "01:00:35.6040000",
      "explicit": false,
      "spotifyId": "0A3J14cSs45rrD4XtJ13P0",
      "appleId": 1000656412851,
      "youTubeId": "GWevSEwpl7w",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0A3J14cSs45rrD4XtJ13P0",
        "apple": "https://podcasts.apple.com/podcast/lds/id1739616143?i=1000656412851",
        "youtube": "https://www.youtube.com/watch?v=GWevSEwpl7w"
      }
    },
    {
      "id": "ea8f6f36-2b93-4bb6-bf08-905dbfc61609",
      "title": "Care",
      "description": "Care: The radical love of self care and how to make it a daily practice Megan helps listeners understand that prioritizing our own mental health is important if we want to be able to show up for others. She emphasizes that self-care is not self-ish, and gives practical advice on incorporating self care into a daily routine. Megan gives examples of how she does this in her own life and gives suggestions for listeners as well. Mentioned Resources: LMNT Electrolyte solutions: https://drinklmnt.com/ www.third-verse.com/community About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-05-07T08:00:00Z",
      "duration": "01:00:07.6200000",
      "explicit": false,
      "spotifyId": "1RP1R6SVF0Ahe3DqlghNx2",
      "appleId": 1000654778325,
      "youTubeId": "3a53SV4bcXY",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1RP1R6SVF0Ahe3DqlghNx2",
        "apple": "https://podcasts.apple.com/podcast/care/id1739616143?i=1000654778325",
        "youtube": "https://www.youtube.com/watch?v=3a53SV4bcXY"
      }
    },
    {
      "id": "aa621c50-9191-4c6a-bb18-db53c3abbdb1",
      "title": "Kitchen",
      "description": "When I decided to reorganize my kitchen, I had no idea that I would be confronting some leftover old beliefs that originated with my relationship with my mother. In this episode, I address these concepts and how I overcame them. I discuss how changing my kitchen is a metaphor for the way I changed my life. I also give some practical tips for how to make your kitchen more efficient and how to decide what to keep and what to say goodbye to. About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse \u0026#xfeff; \u0026#xfeff;Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-04-23T08:00:00Z",
      "duration": "00:41:08.4120000",
      "explicit": false,
      "spotifyId": "5MkEkzwkkbTLDYpk2iIcUi",
      "appleId": 1000653305898,
      "youTubeId": "9rcDtbGsNMY",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5MkEkzwkkbTLDYpk2iIcUi",
        "apple": "https://podcasts.apple.com/podcast/kitchen/id1739616143?i=1000653305898",
        "youtube": "https://www.youtube.com/watch?v=9rcDtbGsNMY"
      }
    },
    {
      "id": "2ecf492b-9b57-41ca-b248-8045077b37e2",
      "title": "Tidy",
      "description": "Using the Konmarie method of tidying, we begin with the closet and start addressing the mental blocks that come with ADHD and clutter. About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse \u0026#xfeff;Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-04-16T08:00:00Z",
      "duration": "00:31:41.8270000",
      "explicit": false,
      "spotifyId": "61TIbao53gHcPvEvvvLmjX",
      "appleId": 1000652588494,
      "youTubeId": "Q2h6iIySq8s",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61TIbao53gHcPvEvvvLmjX",
        "apple": "https://podcasts.apple.com/podcast/tidy/id1739616143?i=1000652588494",
        "youtube": "https://www.youtube.com/watch?v=Q2h6iIySq8s"
      }
    },
    {
      "id": "68c38a62-6787-4f7d-ad97-8f160fb35e4e",
      "title": "Physical",
      "description": "Today we explore the harmful stories we tell ourselves when we get the message that we are not acceptable as we are. Specifically, we address how scarcity mentality and modesty culture can affect what we eat, how we dress, and how we feel about ourselves. About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-04-10T08:00:00Z",
      "duration": "00:32:19.1590000",
      "explicit": false,
      "spotifyId": "61eu1oAPXg7Ht1hkfWLgBt",
      "appleId": 1000651995258,
      "youTubeId": "iLY_Gzg67Ow",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61eu1oAPXg7Ht1hkfWLgBt",
        "apple": "https://podcasts.apple.com/podcast/physical/id1739616143?i=1000651995258",
        "youtube": "https://www.youtube.com/watch?v=iLY_Gzg67Ow"
      }
    },
    {
      "id": "2b1d05d3-9c1d-4ed8-b91c-78cf5a4a6221",
      "title": "Satisfied",
      "description": "We are being marketed to all day every day, even if we don’t realize it. How many of the choices we make are influenced by this marketing, and how can we be more mindful about what we consume and why? these are some of the questions we explore in today’s episode. Mentioned Resources: https://www.salon.com/2019/10/14/why-dr-zach-bush-believes-herbicides-could-end-life-on-earth/ (Dr. Zach bush interview) The Life-Changing Magic of Tidying Up by Marie Kondo About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-04-09T08:00:00Z",
      "duration": "00:22:18.7510000",
      "explicit": false,
      "spotifyId": "2LjyGLn5dvzjSX2oUhhXPX",
      "appleId": 1000651865496,
      "youTubeId": "NnE-V7UD3T4",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2LjyGLn5dvzjSX2oUhhXPX",
        "apple": "https://podcasts.apple.com/podcast/satisfied-mr003/id1739616143?i=1000651865496",
        "youtube": "https://www.youtube.com/watch?v=NnE-V7UD3T4"
      }
    },
    {
      "id": "6c80f792-2a72-4615-aae2-410257a23bc6",
      "title": "Unafraid",
      "description": "Today we explore my favorite question: What would you do if you weren’t afraid? We move beyond the trite answers of daredevil stunts and confessions, into the world of what is behind our fears, and how to overcome them. About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-04-08T08:05:00Z",
      "duration": "00:37:58.4660000",
      "explicit": false,
      "spotifyId": "6vNCVKMRWcCcfTltsgqpQC",
      "appleId": 1000651752333,
      "youTubeId": "FETrlL96CJ8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6vNCVKMRWcCcfTltsgqpQC",
        "apple": "https://podcasts.apple.com/podcast/unafraid/id1739616143?i=1000651752333",
        "youtube": "https://www.youtube.com/watch?v=FETrlL96CJ8"
      }
    },
    {
      "id": "8b372a67-6bcd-4d78-82ec-da8d98958b7f",
      "title": "Alone",
      "description": "Megan addresses the difficulty of learning to sit with and release negative emotions. She tells the story of how she learned to be alone without being lonely and how she healed her relationship with herself, making it easier to have healthy connections with others. Mentioned Resources: Philosopher Carl Jung, the opera star Leontyne Price, Poet Sean O’Faolain composer Samuel Barber About the Host: Megan Conner is the mother of 6 spectacular humans and a breaker of generational trauma cycles. She has spent the last 10 years overcoming the effects of child SA and other abusive relationships and cycles. She is the author of I Walked Through Fire to Get Here, which was written to give support and hope to other survivors. Megan is passionate about helping people make small changes that make their lives better every day. https://third-verse.com/ https://www.facebook.com/profile.php?id=29623844 https://www.youtube.com/channel/UCdTAwWoBlyiAEDIdahq5U6g https://www.instagram.com/third_verse/ https://www.tiktok.com/@third_verse Thanks for listening! Thanks so much for listening to our podcast! If you enjoyed this episode, please share with your friends! Buttons below. Do you have some feedback or questions about this episode? Leave a comment! Is there a topic you’d like to hear more about? Let us know! Subscribe to the podcast Get automatic updates of new podcast episodes and live alerts by subscribing on Apple Podcasts or Stitcher. You can also subscribe in your favorite podcast app. Leave us an Apple Podcasts review Ratings and reviews from our listeners are extremely valuable to us and greatly appreciated. They help our podcast rank higher on Apple Podcasts, which exposes our show to more awesome listeners like you. If you have a minute, please leave an honest review on Apple Podcasts.",
      "release": "2024-04-08T08:00:00Z",
      "duration": "00:44:56.5560000",
      "explicit": false,
      "spotifyId": "0OTUEAPL7tTV0WNie3YCXs",
      "appleId": 1000651750608,
      "youTubeId": "tKFFgLHZoyI",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0OTUEAPL7tTV0WNie3YCXs",
        "apple": "https://podcasts.apple.com/podcast/alone/id1739616143?i=1000651750608",
        "youtube": "https://www.youtube.com/watch?v=tKFFgLHZoyI"
      }
    },
    {
      "id": "a5a5cdae-8666-4b61-8a4b-026de9ee732d",
      "title": "Welcome to The Midlife Revolution!",
      "description": "Join host, Megan Connor, as she share the inspiration for this podcast and for you as a listener.",
      "release": "2024-04-04T08:00:00Z",
      "duration": "00:02:24.4580000",
      "explicit": false,
      "spotifyId": "6oxysJ4eSEbo9dXGly8sBh",
      "appleId": 1000651439105,
      "youTubeId": "5n4pq7GSP4Y",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6oxysJ4eSEbo9dXGly8sBh",
        "apple": "https://podcasts.apple.com/podcast/welcome-to-the-midlife-revolution/id1739616143?i=1000651439105",
        "youtube": "https://www.youtube.com/watch?v=5n4pq7GSP4Y"
      }
    }
  ]
}