{
  "id": "e212cf43-9ad8-4860-a769-ffa0323c10ac",
  "name": "The Royalist with Tom Sykes",
  "youTubeChannelId": "UCjqYD6HnhHAgI535x80Ifdw",
  "episodes": [
    {
      "id": "b8b9840f-0d16-419b-b2d0-f8f8abb58d0b",
      "title": "Andrew Lownie LIVE with The Royalist as Andrew Arrested | The Royalist",
      "description": "A fleet of police cars arriving at Wood Farm on the Sandringham estate to arrest Andrew Mountbatten-Windsor on suspicion of misconduct in public office marks an unprecedented moment in modern royal history. The arrest, carried out on his 66th birthday, follows years of controversy surrounding his links to Jeffrey Epstein and fresh scrutiny of financial conduct detailed in Andrew Lownie’s biography of the Duke and Sarah Ferguson.\n\nPolice have confirmed that a man in his sixties from Norfolk has been arrested and that searches are ongoing in Berkshire and Norfolk. The investigation is being supported by the National Crime Agency, signalling that this has moved beyond a routine inquiry into a coordinated national operation. Multiple forces are reviewing material connected to the Epstein files.\n\nFor years, Lownie has argued that any legal reckoning for Andrew would likely centre on financial misconduct rather than sexual allegations. The charge under investigation — misconduct in public office — appears consistent with that assessment. Questions now arise about what Andrew knew, who else knew, and whether a so-called “Paul Burrell defence” could complicate proceedings if senior royals are drawn into the frame.\n\nKing Charles has previously stated he would support and co-operate with any police investigation. The Prime Minister has reiterated that nobody is above the law. The constitutional and institutional implications are profound.\n\nTonight I am joined live by Andrew Lownie to analyse the arrest, the legal risks, the political fallout, and what this means for the monarchy at a moment of acute vulnerability.",
      "release": "2026-02-19T17:37:40Z",
      "duration": "00:34:46",
      "explicit": false,
      "youTubeId": "2LYL4EsnjqA",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2LYL4EsnjqA"
      }
    }
  ]
}