{
  "id": "390b95d6-05c7-4b76-8632-348319e28802",
  "name": "The Queer Family Podcast",
  "spotifyId": "0awALcnqirVWX7yA2XgqWO",
  "appleId": 1331160807,
  "episodes": [
    {
      "id": "4e6c55d4-3976-406a-a398-9794736d81a9",
      "title": "From Cult Upbringing to Queer Co-Parenting",
      "description": "What happens when you grow up in an evangelical cult, spend years closeted, marry to appease your family, and still find your way to queerness, healing, and chosen family? Therapist and author SC Nealy (they/she) joins Jaimie to share their powerful story of resilience and reinvention. From a childhood in religious isolation to co-parenting two daughters one block away from their queerplatonic co-parent, SC shows us that family can be redefined—and joyfully so. They talk about surviving their eldest child’s terrifying medical crisis during COVID, leaving behind a judgmental family, building an affirming community, and supporting others through religious trauma and queer family formation. Plus, returning guest Tiq Milan drops by first to talk about building our own spaces when the systems fail us—introducing his new work as a Gender Doula, guiding trans folks and their families through social and emotional transitions. This one’s all heart, healing, and hard truth. \u0026#x1f3f3;️‍\u0026#x1f308; Key Takeaways SC’s journey from evangelical cult to chosen queer family Creating kids intentionally through “baby-dancing” (the old-fashioned way!) Navigating medical trauma—their baby’s nine surgeries and life-saving resilience Co-parenting queerly: living a block apart, sharing everything, breaking the mold Coming out, losing family, and building chosen family that heals Falling in love again while their partner transitions—and what kids actually notice The beauty and power of group therapy in healing communal trauma Introducing SC’s upcoming book Healing Sacred Wounds (Bloomsbury, Spring 2026) Tiq Milan on gender doulas, toxic masculinity, and creating safe spaces when systems collapse \u0026#x1f3f3;️‍\u0026#x1f308; About the Guest(s)\u0026#x1f3f3;️‍\u0026#x1f308; SC Nealy, LMFT (they/she): Therapist, author, and founder of LGBT\u0026#43; Counseling Collaborative (DC/MD/VA). Specializes in religious trauma, queer family systems, and group therapy. Tiq Milan (he/him): Writer, educator, activist, and now Gender Doula helping families through transitions. \u0026#x1f3f3;️‍\u0026#x1f308; Thanks to our sponsor California Cryobank ! If you’re listening to this show, there’s a good chance you’re building your family the queer way — and might need a little help in the sperm department. \u0026#x1fa75; Use code QUEERFAM25 at cryobank.com for a FREE Level 2 subscription to their donor catalog! \u0026#x1f3f3;️‍\u0026#x1f308; Book with GWK\u0027s Spring Break Cruise Vacation! Join Jaimie and her family (and other LGBTQIA\u0026#43; families) on a 3 night cruise in the Bahamas. Be sure to mention that you heard about it here! Click that link ➡️ https://travelbrilliant.net/mbg/gwk-spring-break-2026/ \u0026#x1f3f3;️‍\u0026#x1f308; Resources Mentioned Find SC: Instagram: @scnealy and @lgbtcounselingdmv Websites: www.lgbtcounselingdmv.com www.booksbysarahrobinson.com Find Tiq: Website: https://www.tiqmilan.com/ Instagram: @ themrmilan \u0026#x1f3f3;️‍\u0026#x1f308; Interested in advertising? Email thequeerfamilypodcast@gmail.com \u0026#x1f3a7; Loved this episode? Support The Queer Family Podcast on Patreon for exclusive bonus content and help keep these stories alive! OR become a paid subscriber through our RedCircle page for bonus episodes and one-time or recurring donations: \u0026#x1f517; redcircle.com/thequeerfamilypodcast/exclusive-content \u0026#x1f3f3;️‍\u0026#x1f308; What resonated most with you? Drop a comment, DM us, or email thequeerfamilypodcast@gmail.com—we love hearing your stories! \u0026#x1f3f3;️‍\u0026#x1f308; Let’s Connect! Find us on IG , TikTok , Bluesky , \u0026 YouTube : @thequeerfamilypodcast \u0026#x1f3f3;️‍\u0026#x1f308; Watch full episodes on YouTube \u0026#x1f3f3;️‍\u0026#x1f308; Order the If These Ovaries Could Talk book \\ \u0026#x1f3f3;️‍\u0026#x1f308; Edited by: Jerson Barajas \u0026#x1f3f3;️‍\u0026#x1f308; Theme Song by: Tiffany Topol \u0026#x1f3f3;️‍\u0026#x1f308; Logo by: Daneen Stevenato \u0026#x1f3f3;️‍\u0026#x1f308; Shop merch here . \u0026#x1f3f3;️‍\u0026#x1f308; Full transcript \u0026 episode info available on our website \u0026#x1f5f3;️ VOTE. \u0026#x1f3f3;️‍\u0026#x1f308;\u0026#x1f3f3;️‍⚧️ ADVOCATE. \u0026#x1f37c; BUILD QUEER FAMILIES. The information shared in this episode is for educational purposes only and not a substitute for professional advice. Always consult a trusted professional for your specific situation! Support this podcast at — https://redcircle.com/the-queer-family-podcast/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2025-10-20T08:30:23Z",
      "duration": "00:57:30.8010000",
      "explicit": true,
      "spotifyId": "52lHJ4iswcPtlDIivn6KTX",
      "appleId": 1000732622990,
      "subjects": [
        "Evangelicalism",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/52lHJ4iswcPtlDIivn6KTX",
        "apple": "https://podcasts.apple.com/podcast/from-cult-upbringing-to-queer-co-parenting/id1331160807?i=1000732622990"
      }
    }
  ]
}