{
  "id": "d7628865-e8f8-4402-bd0f-b20afef44732",
  "name": "The Franciska Show",
  "spotifyId": "5MLys3C3XhhR7uDTJa7eer",
  "appleId": 1316933734,
  "youTubeChannelId": "UCSOSuvCWm6a7vzhMEzc36pg",
  "episodes": [
    {
      "id": "cb33e747-0650-4e82-8e25-aecdf6f0100e",
      "title": "\u0022The Silence Was So Loud\u0022 [Malka Leifer] - with Nicole Meyer",
      "description": "Do you enjoy the Franciska Show? Then please consider treating me to a cup of coffee: https://www.buymeacoffee.com/franciska Email Franciska: franciskakay@gmail.com Surviving the Silence: Nicole Meyer\u0027s Journey Through Abuse and Healing In this heartfelt and revealing episode, Nicole Meyer opens up about her harrowing experiences of abuse by Malka Leifer, a charismatic yet manipulative school principal who groomed and abused her and fellow students over several years. Nicole highlights the grooming process, the abuse, and the dire effects on her life, education, and intimate relationships. She discusses the community\u0027s reaction, or lack thereof, the legal battles to bring Malka to justice, and her personal journey from the initial trauma to healing and advocacy. Nicole\u0027s story sheds light on the often-overlooked issue of female abusers and the importance of breaking the silence surrounding abuse in tight-knit communities. About The Guest: Nicole Meyer is a victim/survivor of Malka Leifer. She is committed to raising awareness of the impact of sexual abuse and supporting survivors both in and out of the community. She uses her own lived experience to support others and feels it’s of absolute importance that communities, especially religious or insular communities realise how abuse thrives in silence. Nicole hopes that speaking out will be inspiring and helpful for other survivors to feel validated and heard, particularly those in religious communities who may not be able to speak up yet. She hopes to inspire change is the stigmatisation and the approach by community leaders to survivors of sexual abuse. Nicole lives in Melbourne, Australia and has taught for 13 years. She has been campaigning for 6 years. Breakingthesilencenow - Instagram NicoleMeyer - TikTok Nicole Meyer - Facebook NicoleYMeyer - X The BOOK: https://www.audible.com.au/author/Dassi-Erlich/B0CS1RX19L https://www.amazon.com.au/Bad-Faith-Inside-ultra-Orthodox-betrayal-ebook/dp/B0CH135LSY?ref=d6k_applink_bb_dls\u0026dplnkId=1748e30c-e467-4578-a84f-7347f1d7adef Check out: www.JewishCoffeeHouse.com for more Jewish Podcasts on our network.",
      "release": "2024-06-04T10:25:00Z",
      "duration": "01:05:14.4220000",
      "explicit": false,
      "spotifyId": "0gQUTCXc4r2DaXdtA1cxYL",
      "appleId": 1000657785589,
      "youTubeId": "DzASJfXzK0E",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0gQUTCXc4r2DaXdtA1cxYL",
        "apple": "https://podcasts.apple.com/podcast/the-silence-was-so-loud-malka-leifer-with-nicole-meyer/id1316933734?i=1000657785589",
        "youtube": "https://www.youtube.com/watch?v=DzASJfXzK0E"
      }
    }
  ]
}