{
  "id": "1f1d4e47-b8aa-4433-9ddd-7ca6853fbd4b",
  "name": "The Tennessee Informer",
  "youTubeChannelId": "UChUh-T6oMk1QxREBuN73Ofg",
  "episodes": [
    {
      "id": "7263a77a-1aad-4fd7-9d0d-9ab975dbd13d",
      "title": "New Questions Surround ISHA in Tennessee! What’s Really Happening? Updates \u0026 Allegations",
      "description": "On this episode of The Tennessee Informer, we welcome Vanessa Miller for an update on the Isha Institute of Inner-Sciences in Tennessee and new information raising serious questions.\nThe discussion focuses on:\nISHA’s real estate acquisitions and financial structures\n\nAllegations involving elder abuse and undue influence\n\nConcerns raised by families and former insiders\n\nWhy transparency and oversight matter\n\nThis episode is an investigative update intended to examine documents, claims, and patterns, not promote speculation. Viewers are encouraged to listen critically and evaluate the information presented.",
      "release": "2026-02-03T14:17:44Z",
      "duration": "01:05:25",
      "explicit": false,
      "youTubeId": "xd7FXGR3WjI",
      "subjects": [
        "Sadhguru"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xd7FXGR3WjI"
      }
    },
    {
      "id": "b08cb46d-0298-403e-acb7-f0ac54cec966",
      "title": "Faith vs. Deception: What’s Really Happening at ISHA?",
      "description": "Join The Tennessee Informer on Monday, September 8th at 7PM for a gripping investigation into ISHA (Institute of Inner Sciences), a controversial organization operating in McMinnville, Tennessee. Our guest, Vanessa Miller—a Christian, wife, mother, and community advocate—brings compelling evidence and firsthand accounts suggesting ISHA may be more cult-like than community-minded. From NDAs and IRS 1099 forms to disturbing chants and idol rituals, Vanessa lays out the facts. Don’t miss this courageous exposé.",
      "release": "2025-09-10T05:33:45Z",
      "duration": "01:06:51",
      "explicit": false,
      "youTubeId": "sgPitWUYYHc",
      "subjects": [
        "Sadhguru"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sgPitWUYYHc"
      }
    }
  ]
}