{
  "_ts": 0,
  "id": "c7952678-a889-481a-877d-038948035588",
  "name": "”The Best Podcast In Utah” Radio Daybreak",
  "spotifyId": "72lrUz5gfVnkKYaBfIqb6A",
  "appleId": 1711476420,
  "episodes": [
    {
      "id": "38310e1d-f124-460e-99d9-0d0ac0026968",
      "title": "The One With The Prophet",
      "description": "Summary In this conversation, Ben shares his experience growing up in a Mormon polygamist cult and his journey of leaving and finding healing through comedy. He discusses the challenges of leaving the compound and reconnecting with his family, as well as the restrictive beliefs and practices within the cult. Ben also highlights the importance of using comedy to raise awareness about religious trauma and the abuses in the world of Mormon polygamy. He emphasizes the need for support and resources for those who exit polygamy and the importance of addressing the systemic issues within these communities. The conversation explores personal development, growth, and the importance of experiencing new things. It also touches on gratitude, impact, charity, and giving back. The guest shares upcoming events and promotes his social media presence. Takeaways -Leaving a religious cult can be a challenging and complex process, requiring support and resources for individuals to rebuild their lives. -Comedy can be a powerful tool for healing and raising awareness about religious trauma and the abuses within religious communities. -Polygamous cults often perpetuate restrictive beliefs and practices that can lead to cycles of shame and manipulation. -There is a need for more support and resources for individuals who exit polygamy, as they often face financial, emotional, and social challenges. -Addressing the systemic issues within polygamous communities, such as child labor and labor trafficking, is crucial for creating a safer and more inclusive society. Experiencing new things and reflecting on them is a natural part of personal development and growth. -Gratitude and impact can be powerful motivators for personal growth and positive change. -Charitable giving is a way to make a positive impact on the lives of others. -Promoting and engaging with social media can help connect with others and share experiences. *DONATE TO CHERISHFAMILIES.ORG 00:00Introduction to Vibing the Apocalypse 07:21Growing Up in a Mormon Polygamist Cult 18:18Exploring Belief and Religion 30:33Escaping the Polygamist Compound 38:15Family Dynamics and Boundaries 44:59Wickedness and Restrictions in the Compound 45:46The Cycle of Shame and Manipulation 48:07Natural Development and Growth 49:31Embracing Freedom and Exploration 50:29Supporting Cherish Families 51:24Upcoming Shows and Joining the Cult 52:20Practically Magic Podcast",
      "release": "2024-01-17T07:01:00Z",
      "duration": "00:53:04.7030000",
      "explicit": false,
      "spotifyId": "3UGTxAoSybW5rC8RuSVI3m",
      "appleId": 1000641936256,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Self-Help",
        "Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3UGTxAoSybW5rC8RuSVI3m",
        "apple": "https://podcasts.apple.com/podcast/the-one-with-the-prophet/id1711476420?i=1000641936256"
      }
    }
  ]
}