{
  "_ts": 0,
  "id": "34c1ab94-b986-4732-830f-1d37d66bca4d",
  "name": "The Popaganda Podcast",
  "spotifyId": "5aulDL44rFXIohyt7Iehgv",
  "appleId": 1706922902,
  "episodes": [
    {
      "id": "fef25e76-bbfc-4178-9112-03e97a351b7f",
      "title": "Neil Gaiman: Power, Control, \u0026 Consent",
      "description": "What do Neil Gaiman, Scientology, and NDAs have in common? More than you\u0027d think—and none of it is good.\nJoin hosts Shannon Perez-Darby and Tashmica Torok as they break down the allegations, the power imbalances, and the larger cultural problem with how we talk (or don’t talk) about consent. Listen in as they unpack why we need better ways to talk about sexual violence—because the binary of \u0022totally consensual\u0022 or \u0022definitely rape\u0022 just doesn’t cut it.\nThey also get into:\nWhy we struggle to ask for what we want in relationships.The difference between \u0022sexy hitting\u0022 and just... hitting.Consent practices we can learn from BDSM.Neil Gaiman’s deep ties to Scientology (because of course).The weirdness of trying to buy your way out of accountability.\nIf you\u0027ve ever side-eyed a dude who says he\u0027s a feminist but also just happens to have a long history of dating barely legal women, or if you\u0027ve ever wondered what happens when you mix cult-like obedience structures with unchecked power... well, this one\u0027s for you.\nThis Week’s Pop Culture Homework\nThis episode of The Popaganda Podcast is inspired by the podcast Master: The Allegations Against Neil Gaiman. \nSubscribe and listen everywhere you get your podcasts. Come for the pop culture. Stay for the abolition.\nTo learn more, visit: www.popagandapod.com\nLeave a 5-star review for The Popaganda Podcast, and we might feature it in an upcoming episode!\nYou can also send us love or suggest show topics by emailing us at: popagandapod@gmail.com.\nSponsored in part by: The Accountable Communities Consortium\nAccess: Transcript now available on Apple Podcasts",
      "release": "2025-02-05T21:24:53Z",
      "duration": "01:06:12",
      "explicit": false,
      "spotifyId": "0D4ket2VLxRcHE2mlbo4au",
      "appleId": 1000689452743,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0D4ket2VLxRcHE2mlbo4au",
        "apple": "https://podcasts.apple.com/podcast/neil-gaiman-power-control-consent/id1706922902?i=1000689452743"
      }
    },
    {
      "id": "8ffa367c-729d-4dcd-a454-589625a39ab5",
      "title": "Tom Cruise \u0026 Scientology",
      "description": "Tom Cruise once claimed Scientology had solved humanity’s greatest challenges. To which Shannon and Tashmica say, “What now?” The Popaganda Podcast kicks off season 2 with a conversation about “Tom Cruise on Tom Cruise, Scientologist”. An American actor, producer, and celebrity Scientologist, Tom Cruise is the lead in major blockbuster films like Top Gun and the spy series Mission: Impossible. As latchkey kids, we will never forget him jumping on Oprah’s couch over his love for Katie Holmes. Long since divorced under questionable circumstances, Cruise has given millions to a religious organization despite repeated accusations of abuse and he’s never been canceled. How does he do it? *insert Kate Bornstein \u0026#43; Leah Remini sideeye* Tune in as cohosts Shannon Perez-Darby and Tashmica Torok discuss how cults, communes, and even nonprofit organizations can use power and control dynamics to hurt people. Could a healthy practice of accountability change everything? Let\u0027s talk about it! Come for the pop culture. Stay for the abolition. For more information, visit www.popagandapod.com. Pop Culture Homework: Tom Cruise on Tom Cruise, Scientologist Mission: Impossible Kate Bornstein My Scientology Movie Going Clear: Scientology \u0026 the Prison of Belief Leah Remini, Troublemaker: Surviving Hollywood and Scientology Are our Movements Cults? Just Sex: Mapping Your Desire Podcast with Jamie Grant featuring Shannon Perez Darby People \u0026#43; Practices We Love: BEAM: Healing and Accountability Wheel Power and Control Wheel Leave a 5-star review for The Popaganda Podcast and we might feature it in an upcoming episode! You can also send us love or suggest show topics by emailing us at popagandapod@gmail.com. Follow us on Social media! TikTok - @Popaganda_Pod YouTube - The Popaganda Podcast Instagram - @popagandapod Sponsored in part by: Accountable Communities Consortium and The Firecracker Foundation. Access: Transcript now available on Apple Podcasts! Content Warning: The Popaganda Podcast explores the intersections of transformative justice, prison abolition, and pop culture. We will be talking in general about the existence of domestic violence, sexual violence, and state violence and our experiences with these forms of violence throughout the season. In this episode in particular, we will be talking about these themes and our own survivorship. We will not be talking in high levels of detail about specific experiences of violence. We invite everyone to use this information to make choices about what is right for you. Credits: Executive Producers: Shannon Perez-Darby and Tashmica Torok Audio Production: Shannon Perez-Darby Show Notes \u0026#43; Art: Tashmica Torok",
      "release": "2024-04-22T04:21:00Z",
      "duration": "00:59:32.8450000",
      "explicit": false,
      "spotifyId": "6NPgs6VFia0kxT47pCfGot",
      "appleId": 1000653162797,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6NPgs6VFia0kxT47pCfGot",
        "apple": "https://podcasts.apple.com/podcast/tom-cruise-scientology/id1706922902?i=1000653162797"
      }
    }
  ]
}