{
  "_ts": 0,
  "id": "5b4618b2-505f-40ec-be00-2c7242e33967",
  "name": "The Church Hurt Recovery Podcast",
  "spotifyId": "4UQK3Ie1UAY2imtLT4prOL",
  "youTubeChannelId": "UCT_aXUT1I6BSh-zSKOXjfXA",
  "youTubePlaylistId": "PLxqgmspByvxMeEIR6rFxUgXzTFHjWXMcJ",
  "episodes": [
    {
      "id": "49b0ca01-0ed6-4ae3-9c6e-5a127149f796",
      "title": "Ep #16 How to Recognize Spiritual Abuse (Trigger Warning) video podcast",
      "description": "In this episode of the Church Hurt Recovery Podcast, host Soneakqua J. White delves into the complexities of spiritual abuse, particularly within the context of cults and religious trauma. She emphasizes the importance of understanding the Word of God to avoid manipulation and misinterpretation by leaders. The episode provides insights into recognizing spiritual abuse, the significance of self-awareness, and the necessity of seeking professional help for recovery.",
      "release": "2025-03-12T17:00:44Z",
      "duration": "00:25:30",
      "explicit": false,
      "youTubeId": "fQ-tOJ04Wrc",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fQ-tOJ04Wrc"
      }
    },
    {
      "id": "dd16dfb4-cd3f-443d-a9ea-68ac9912f85b",
      "title": "Ep #15 Are You in a Church or a Cult? (Trigger Warning) video podcast",
      "description": "In this episode of the Church Hurt Recovery Podcast, host Soneakqua J. White delves into the serious topic of cults within religious settings. She provides a trigger warning for sensitive content and outlines the categories of church hurt. The discussion focuses on understanding what constitutes a cult, the signs of being in one, the types of abuse that can occur, and the importance of seeking help to escape such situations. Soneakqua emphasizes the need for self-awareness and social awareness when navigating these complex issues, and she encourages listeners to reach out for support if they or someone they know is in danger.",
      "release": "2025-02-10T17:40:14Z",
      "duration": "00:24:36",
      "explicit": false,
      "youTubeId": "jMG_FjlUNo8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jMG_FjlUNo8"
      }
    },
    {
      "id": "3c6247fe-5bd2-4c78-8f0d-5e8666a12224",
      "title": "Emotional Giving: A Hard Lesson | Ep 8",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White discusses the complexities of giving in church settings, particularly focusing on a scenario involving a woman named Sasha. Sasha experiences emotional pressure to give during a church service led by a guest preacher, which leads to feelings of manipulation and distrust towards her pastor. The episode emphasizes the importance of social awareness, personal discernment, and the need to consult God before making financial decisions in a church environment. Soneakqua encourages listeners to be mindful of their emotions and the influence of their surroundings when it comes to giving, and highlights the importance of seeking professional help if needed. Chapters 00:00 Introduction to Church Hurt Recovery 07:41 Understanding Social Awareness in Giving 13:49 Distinguishing Motivation from Manipulation 19:32 The Role of Music in Emotional Decision-Making 22:07 Podcast Outro.wav Watch on YouTube Visit My Website Take a Course! Soneakqua J. White, M.A.,LPC is the owner of cathARTic Coaching \u0026 Consulting. She received her Bachelor of Arts in Psychology from Baylor University in 1998 and completed her Master of Arts in Counseling from Amberton University in 2002. Soneakqua is a Licensed Professional Counselor in the states of Texas and Ohio. She counsels with adults experiencing anxiety, depression, and religious trauma. Soneakqua is also a Social and Emotional Learning strategist who works with teens and adults to improve their social and emotional intelligence through skills and strategies. church, giving, manipulation, social awareness, emotional decisions, trust, church hurt, mental health, relationship skills, spiritual growth",
      "release": "2025-01-15T00:00:00",
      "duration": "00:22:35.7660000",
      "explicit": false,
      "spotifyId": "0Z03nnBUkc7WdUWktZgrhV",
      "youTubeId": "gIab5ujpvpM",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Z03nnBUkc7WdUWktZgrhV",
        "youtube": "https://www.youtube.com/watch?v=gIab5ujpvpM"
      }
    },
    {
      "id": "f78e0ef9-0c1c-4ee0-9650-7283a5dea8e9",
      "title": "Managing Your Finances in the Church: A Case Study | Ep 7",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White explores the theme of church hurt related to giving, using a real-life scenario involving a church member named Cadence. The discussion emphasizes the importance of self-management, emotional regulation, and understanding one\u0027s financial decisions within the church context. The episode aims to help listeners navigate their feelings and experiences related to church hurt, encouraging them to take responsibility for their emotional well-being and financial choices. Chapters 00:00 Introduction to Church Hurt and Giving 02:57 The Case of Cadence: A Real-Life Scenario 07:37 Understanding Self-Management in Financial Situations 12:07 Navigating Emotions and Church Relationships 18:31 Conclusion: Preparing for Future Situations 21:20 Podcast Outro.wav Watch on YouTube Visit My Website Take a Course Soneakqua J. White, M.A.,LPC is the owner of cathARTic Coaching \u0026 Consulting. She received her Bachelor of Arts in Psychology from Baylor University in 1998 and completed her Master of Arts in Counseling from Amberton University in 2002. Soneakqua is a Licensed Professional Counselor in the states of Texas and Ohio. She counsels with adults experiencing anxiety, depression, and religious trauma. Soneakqua is also a Social and Emotional Learning strategist who works with teens and adults to improve their social and emotional intelligence through skills and strategies. church hurt, self-management, emotional learning, financial systems, giving, manipulation, mental health, church relationships, self-awareness, emotional regulation",
      "release": "2025-01-08T00:00:00",
      "duration": "00:21:48.3510000",
      "explicit": false,
      "spotifyId": "1DWTzE20gtu3ZuYeKh6M4A",
      "youTubeId": "CjDg5Z84OAI",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1DWTzE20gtu3ZuYeKh6M4A",
        "youtube": "https://www.youtube.com/watch?v=CjDg5Z84OAI"
      }
    },
    {
      "id": "687e2c76-5701-4aec-80ac-97eebabcf622",
      "title": "Ep #13 Are You Hurting Yourself to PLEASE Others? video podcast",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White discusses the critical relationship between self-esteem and self-care, particularly within the church context. She highlights common issues such as people-pleasing and false humility that can undermine self-esteem and, consequently, self-care. The conversation emphasizes the importance of recognizing these patterns and making conscious efforts to improve self-esteem as a means to enhance overall self-care. Soneakqua encourages listeners to reflect on their behaviors and consider professional help if needed, advocating for a proactive approach to mental health.",
      "release": "2025-01-02T23:57:40Z",
      "duration": "00:22:59",
      "explicit": false,
      "youTubeId": "luHIBIx5lWE",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=luHIBIx5lWE"
      }
    },
    {
      "id": "e0eeef60-8fc3-4988-b4da-f3b6fd84dabc",
      "title": "Ep #14 Do We Need a Zero Tolerance BULLYING Policy in the Church? video podcast",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White discusses the presence of bullying within church communities, emphasizing that bullies exist in the church just as they do in everyday life. She identifies three types of bullies: title tyrants, attention seekers, and puppets, and stresses the importance of recognizing and addressing bullying behavior. The episode also highlights the need for church leadership to implement anti-bullying policies and encourages listeners to engage in self-awareness and responsible decision-making regarding their church environment.",
      "release": "2025-01-02T23:24:23Z",
      "duration": "00:31:30",
      "explicit": false,
      "youTubeId": "0fRsfSs-rzs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0fRsfSs-rzs"
      }
    },
    {
      "id": "3fd32e3f-2a6c-4b7c-8337-b149b8315163",
      "title": "Ep #12 Manage Your Self-ESTEEM using SEL video podcast",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White explores the theme of self-esteem, particularly how it manifests within the church context. The discussion emphasizes the importance of self-awareness, understanding the roots of self-esteem issues, and the role of social environments and relationships in shaping one\u0027s self-esteem. Soneakqua provides practical strategies for building and rebuilding self-esteem, including grounding oneself in faith and making responsible decisions that prioritize mental health and well-being.",
      "release": "2025-01-02T22:40:31Z",
      "duration": "00:23:53",
      "explicit": false,
      "youTubeId": "7Z5vCueZK9Q",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7Z5vCueZK9Q"
      }
    },
    {
      "id": "c6a10337-0747-4eb8-8bf5-4670f49f4f9a",
      "title": "Ep #11 Why Your Self-Esteem is Suffering Even in CHRIST video podcast",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White delves into the critical themes of self-esteem and its impact on individuals, particularly within the church context. She discusses how self-esteem is formed, the importance of self-encouragement, and introduces the concept of \u0027Christ esteem\u0027—understanding one\u0027s worth through the lens of Christian beliefs. The episode emphasizes the need for self-awareness, social awareness, and responsible decision-making in building self-esteem, while also highlighting the role of scripture in this process.",
      "release": "2025-01-02T18:17:55Z",
      "duration": "00:27:52",
      "explicit": false,
      "youTubeId": "8E0T12h3wRw",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8E0T12h3wRw"
      }
    },
    {
      "id": "3d838f48-998f-4d0e-9519-d123ab192253",
      "title": "Strengthening Faith: Beyond Vague Resolutions | Ep 6",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White reflects on the New Year and emphasizes the importance of setting meaningful goals and resolutions, particularly in the context of strengthening one\u0027s faith. She challenges listeners to move beyond vague aspirations of getting closer to God and instead focus on actionable steps, such as engaging with scripture and being part of a supportive community. The discussion incorporates the Social and Emotional Learning (SEL) framework to guide listeners in self-awareness, self-management, social awareness, relationship skills, and responsible decision-making as they embark on their spiritual journeys. Chapters 00:00 Welcome and New Year Reflections 07:19 The Importance of Scripture 19:36 Responsible Decision Making and Commitment 23:06 Podcast Outro.wav Watch on YouTube Visit My Website Soneakqua J. White, M.A.,LPC is the owner of cathARTic Coaching \u0026 Consulting. She received her Bachelor of Arts in Psychology from Baylor University in 1998 and completed her Master of Arts in Counseling from Amberton University in 2002. Soneakqua is a Licensed Professional Counselor in the states of Texas and Ohio. She counsels with adults experiencing anxiety, depression, and religious trauma. Soneakqua is also a Social and Emotional Learning strategist who works with teens and adults to improve their social and emotional intelligence through skills and strategies. Keywords Church Hurt, Recovery, Goals, Resolutions, Faith, Scripture, SEL, Mental Health, Spiritual Growth, Community",
      "release": "2025-01-01T00:00:00",
      "duration": "00:23:34.6750000",
      "explicit": false,
      "spotifyId": "0Zmy4UNbnccAdOTTBxdIOG",
      "youTubeId": "0WNNp_AWFm8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Zmy4UNbnccAdOTTBxdIOG",
        "youtube": "https://www.youtube.com/watch?v=0WNNp_AWFm8"
      }
    },
    {
      "id": "8ddf8b3c-030e-4869-a46a-bf67f9ab59e7",
      "title": "The Emotional Toll of Financial Decisions in Church | Ep 5",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White discusses the complex issue of money manipulation within the church, illustrated through a real-life scenario involving a church member named Cadence. The conversation emphasizes the importance of self-awareness and emotional intelligence in navigating financial decisions and church experiences. Soneakqua encourages listeners to reflect on their own feelings and reactions to similar situations, advocating for proactive mental health management and the potential need for therapy. Chapters 00:00 Introduction to Church Hurt and Money Manipulation 07:03 Understanding Self-Awareness in Financial Decisions 12:54 Emotional Responses and Their Impact 19:04 The Importance of Communication and Problem Solving 27:51 Conclusion and Call to Action 31:05 Podcast Outro.wav Watch on YouTube Visit My Website Soneakqua J. White, M.A.,LPC is the owner of cathARTic Coaching \u0026 Consulting. She received her Bachelor of Arts in Psychology from Baylor University in 1998 and completed her Master of Arts in Counseling from Amberton University in 2002. Soneakqua is a Licensed Professional Counselor in the states of Texas and Ohio. She counsels with adults experiencing anxiety, depression, and religious trauma. Soneakqua is also a Social and Emotional Learning strategist who works with teens and adults to improve their social and emotional intelligence through skills and strategies. church hurt, money manipulation, self-awareness, emotional intelligence, financial decisions, church experiences, social emotional learning, mental health, decision-making, personal finance",
      "release": "2024-12-18T00:00:00",
      "duration": "00:31:34.0980000",
      "explicit": false,
      "spotifyId": "6vz7sZGg1kxqDXzHcnVB23",
      "youTubeId": "rFkcw5eX44I",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6vz7sZGg1kxqDXzHcnVB23",
        "youtube": "https://www.youtube.com/watch?v=rFkcw5eX44I"
      }
    },
    {
      "id": "a49fd3f7-5cd5-4799-842f-786eaae6dfc7",
      "title": "Ep #10 Does FOMO Effect Your Decision-Making at Church? video podcast",
      "description": "In this episode of the Church Hurt Recovery Podcast, host Soneakqua J. White delves into the themes of financial manipulation within the church, using Sasha\u0027s story as a case study. The discussion emphasizes the importance of responsible decision-making, particularly in financial matters related to church giving. Soneakqua outlines a structured decision-making process that includes identifying the situation, exploring options, weighing consequences, and evaluating outcomes. The episode concludes with a focus on the Social Emotional Learning (SEL) scale, highlighting the need for self-awareness and responsible decision-making in financial contexts.",
      "release": "2024-12-13T00:23:54Z",
      "duration": "00:29:52",
      "explicit": false,
      "youTubeId": "CVBfV4uNuGs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CVBfV4uNuGs"
      }
    },
    {
      "id": "d6f1fbef-4540-4816-86d2-583753b633dc",
      "title": "Ep #9 Who Can You Trust with Your MONEY? video podcast",
      "description": "In this episode of the Church Hurt Recovery Podcast, host Soneakqua J. White delves into the themes of finances and manipulation within the church, using the story of a woman named Sasha as a case study. The discussion emphasizes the importance of relationship skills, particularly in the context of faith and giving. Soneakqua highlights the need for individuals to maintain a strong relationship with God to avoid manipulation and make informed decisions about their finances. The episode concludes with a reminder to work through any offenses that may hinder one\u0027s spiritual growth and connection with God.",
      "release": "2024-12-12T17:08:26Z",
      "duration": "00:26:18",
      "explicit": false,
      "youTubeId": "lGmqhM6RCKo",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lGmqhM6RCKo"
      }
    },
    {
      "id": "31d45412-2870-4c28-bb93-d58c56763c6d",
      "title": "Navigating Giving: Avoiding Manipulation | Ep 4",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White introduces the concept of church hurt and outlines five categories of individuals who experience it. The focus then shifts to the topic of money and manipulation within the church, emphasizing the importance of self-awareness and personal decision-making in financial contributions. The episode sets the stage for future discussions on how to navigate these challenges using the Social and Emotional Learning (SEL) scale. Chapters 00:00 Introduction to Church Hurt Recovery 04:47 Categories of Church Hurt 07:34 Exploring Money and Manipulation in the Church 13:14 Understanding the SEL Scale for Decision Making 16:10 Podcast Outro.wav Subscribe on YouTube Visit My Website Soneakqua J. White, M.A.,LPC is the owner of cathARTic Coaching \u0026 Consulting. She received her Bachelor of Arts in Psychology from Baylor University in 1998 and completed her Master of Arts in Counseling from Amberton University in 2002. Soneakqua is a Licensed Professional Counselor in the states of Texas and Ohio. She counsels with adults experiencing anxiety, depression, and religious trauma. Soneakqua is also a Social and Emotional Learning strategist who works with teens and adults to improve their social and emotional intelligence through skills and strategies. church hurt, emotional healing, manipulation, money in church, giving, tithing, social emotional learning, mental health, faith, spirituality",
      "release": "2024-12-11T00:00:00",
      "duration": "00:16:38.7590000",
      "explicit": false,
      "spotifyId": "5TnXEf3IzlIaG44Clzqmzx",
      "youTubeId": "U_toGcwU4YA",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TnXEf3IzlIaG44Clzqmzx",
        "youtube": "https://www.youtube.com/watch?v=U_toGcwU4YA"
      }
    },
    {
      "id": "ec12e193-b5bd-47c9-8805-5fe1db2841d8",
      "title": "Understanding the Depths of Church Hurt | Ep 2",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White explores the concept of church hurt, defining it as events or situations within the church that cause emotional pain. The discussion delves into the various dimensions of church hurt, including its sources and manifestations, and emphasizes the importance of understanding the multi-directional nature of hurt within church communities. The episode also addresses the categories of church hurt, the interplay between spiritual and natural attacks, and the urgent need for unity against issues like racism within the church. Chapters 00:00 Understanding Church Hurt 08:33 The Spectrum of Church Hurt 11:50 Spiritual vs. Natural Attacks 16:03 The Call to Unity Against Racism 18:04 Podcast Outro.wav Subscribe on YouTube Visit My Website Soneakqua J. White, M.A.,LPC is the owner of cathARTic Coaching \u0026 Consulting. She received her Bachelor of Arts in Psychology from Baylor University in 1998 and completed her Master of Arts in Counseling from Amberton University in 2002. Soneakqua is a Licensed Professional Counselor in the states of Texas and Ohio. She counsels with adults experiencing anxiety, depression, and religious trauma. Soneakqua is also a Social and Emotional Learning strategist who works with teens and adults to improve their social and emotional intelligence through skills and strategies. church hurt, religious trauma, spiritual attacks, community, mental health, emotional learning, racism, church community, healing, relationships",
      "release": "2024-12-04T00:00:00",
      "duration": "00:18:32.8850000",
      "explicit": false,
      "spotifyId": "3BIyiCVrVS4I0htBKUhIHE",
      "youTubeId": "cJqZPfabVwQ",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BIyiCVrVS4I0htBKUhIHE",
        "youtube": "https://www.youtube.com/watch?v=cJqZPfabVwQ"
      }
    },
    {
      "id": "7ff76ca0-2cf3-4ceb-aadb-a765b4ede079",
      "title": "Healing from Church Hurt: A New Beginning | Ep 1",
      "description": "In the inaugural episode of the Church Hurt Recovery Podcast, host Soneakqua J. White introduces the concept of church hurt and its impact on individuals. She outlines the purpose of the podcast, which is to provide social and emotional learning strategies to help listeners navigate their feelings and experiences related to church hurt. The episode categorizes different types of church hurt, discusses the importance of social and emotional learning, and addresses the issue of racism within the church. Soneakqua emphasizes the need for self-awareness, relationship skills, and responsible decision-making as part of the healing process. Chapters 00:00 Introduction to Church Hurt Recovery Podcast 02:23 Understanding Church Hurt and Religious Trauma 04:15 Categories of Church Hurt 09:15 Social and Emotional Learning in the Church 12:05 The SEL Scale Explained 22:48 Conclusion and Future Directions 24:07 Podcast Outro.wav Subscribe on YouTube Visit my Website Soneakqua J. White, M.A.,LPC is the owner of cathARTic Coaching \u0026 Consulting. She received her Bachelor of Arts in Psychology from Baylor University in 1998 and completed her Master of Arts in Counseling from Amberton University in 2002. Soneakqua is a Licensed Professional Counselor in the states of Texas and Ohio. She counsels with adults experiencing anxiety, depression, and religious trauma. Soneakqua is also a Social and Emotional Learning strategist who works with teens and adults to improve their social and emotional intelligence through skills and strategies. church hurt, recovery, social emotional learning, mental health, faith, counseling, emotional trauma, church community, racism, spiritual growth",
      "release": "2024-12-04T00:00:00",
      "duration": "00:24:35.8830000",
      "explicit": false,
      "spotifyId": "0PaUCm6x4VEH5VrxEbaOI5",
      "youTubeId": "EF1aSY9mrrI",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PaUCm6x4VEH5VrxEbaOI5",
        "youtube": "https://www.youtube.com/watch?v=EF1aSY9mrrI"
      }
    },
    {
      "id": "9aa8ff74-faa2-4f8a-abcb-cf6e93118c87",
      "title": "Healing from Church Hurt: A Personal Journey | Ep 3",
      "description": "In this episode of the Church Hurt Recovery Podcast, Soneakqua J. White shares her personal journey of church hurt, exploring themes of grief, anxiety, and the importance of social and emotional learning (SEL) in recovery. She discusses the impact of losing her pastor, the subsequent trauma and anxiety she experienced, and how she navigated these challenges through self-awareness and support from her community. Soneakqua emphasizes the need for professional help when necessary and encourages listeners to maintain their faith despite past hurts. Chapters 00:00 Introduction to Church Hurt Recovery 07:37 Navigating Grief and Anxiety 13:49 The Role of Social and Emotional Learning 19:50 Strategies for Managing Emotions 23:34 Podcast Outro.wav Subscribe on YouTube Visit My Website Soneakqua J. White, M.A.,LPC is the owner of cathARTic Coaching \u0026 Consulting. She received her Bachelor of Arts in Psychology from Baylor University in 1998 and completed her Master of Arts in Counseling from Amberton University in 2002. Soneakqua is a Licensed Professional Counselor in the states of Texas and Ohio. She counsels with adults experiencing anxiety, depression, and religious trauma. Soneakqua is also a Social and Emotional Learning strategist who works with teens and adults to improve their social and emotional intelligence through skills and strategies. church hurt, trauma, anxiety, grief, mental health, social emotional learning, faith, recovery, support, healing",
      "release": "2024-11-22T00:00:00",
      "duration": "00:24:03.3050000",
      "explicit": false,
      "spotifyId": "31Hf3HI3g61SRWa0gR5b4b",
      "youTubeId": "SZtQmaGjTrI",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/31Hf3HI3g61SRWa0gR5b4b",
        "youtube": "https://www.youtube.com/watch?v=SZtQmaGjTrI"
      }
    }
  ]
}