{
  "_ts": 0,
  "id": "4419ea48-95b9-4919-b66b-b1b9efdb8543",
  "name": "The Colorado Switchblade",
  "spotifyId": "1Y0BdFGyE2zHlLA8GcbWd9",
  "appleId": 1615672690,
  "episodes": [
    {
      "id": "82126f0b-8e38-4d05-9933-e50482e8db08",
      "title": "Navigating the Maze of Mind Control with Dr. Steven Hassan",
      "description": "Welcome to a special edition of The Colorado Switchblade Podcast. In this episode, we\u0027re peeling back the layers on a subject that\u0027s as intriguing as it is critical in today\u0027s discourse: the psychology of cults and the mechanisms of mind control, with a particular focus on the political landscape that surrounds us. Our guest, Dr. Steven Hassan, is a towering figure in the study of coercive persuasion and cult dynamics. With a history that spans from being a former member of the Unification Church to becoming one of the most authoritative voices on cults and mind control, Dr. Hassan brings a wealth of knowledge and personal experience to the table. His latest book, \u0022The Cult of Trump,\u0022 serves as a cornerstone for our conversation, drawing parallels between the former president and the manipulative tactics of cult leaders. Highlights from Our Conversation: * From Moonie to Expert: Dr. Hassan shares his compelling journey, shedding light on his transition from a cult member to a leading expert on mind control, emphasizing the importance of understanding and combating coercive influence. * The Cult of Trump Analyzed: We delve into the core arguments of Dr. Hassan\u0027s book, discussing how Donald Trump employs mind control techniques akin to those used by cult leaders, fostering a fanatical loyalty among his followers. * Mechanisms of Mind Control: Dr. Hassan breaks down the social psychology methods and mind control tactics at play, offering insights into how individuals are persuaded to adopt and defend extreme beliefs. * The Role of Media: Our discussion extends to the impact of cable news and social media in amplifying cult-like dynamics, exploring the challenges these platforms pose to democratic discourse and individual autonomy. * Combatting Destructive Influence: Dr. Hassan provides a nuanced view on distinguishing between constructive and destructive influences in society, highlighting strategies for individuals and communities to foster positive change and resist manipulation. * A Call to Action: The conversation concludes with a powerful message of hope and resilience. Dr. Hassan offers guidance on healing from divisiveness and building a more informed, critically thinking society. Why This Matters: In an era where the lines between truth and manipulation often blur, understanding the tools and tactics of mind control is more crucial than ever. Our dialogue with Dr. Hassan not only illuminates these mechanisms but also empowers us to recognize and resist undue influence in our lives and broader society. This episode is a must-listen for anyone looking to navigate the complexities of influence in the modern world, offering a beacon of hope for those seeking to reclaim their autonomy and contribute to a healthier, more discerning community. Listen to the full episode here on The Colorado Switchblade, and join the conversation in the Substack Thread or Notes. Whether you\u0027re grappling with the implications of political cultism or seeking ways to support loved ones affected by undue influence, this episode offers valuable insights and practical advice. Here are the links to the recent interviews I mentioned in the show that have been in the media cycle recently: KUNC’s in the NoCo an interview with Erin O’Toole My video interview with Jessica Denson’s show ‘Lights on’ My interview with Dr. Hassan on his Freedom of Mind (isn’t out quite yet, but will be able to found here.) You can find more information on Dr. Hassan and the important work he is doing here. Jason Van Tatenhove, an acclaimed author and consultant, intricately blends his writing and political activism expertise. He penned the non-fiction work ‘The Perils of Extremism’ and several fictional titles set amidst the scenic backdrop of Estes Park, Colorado, such as ‘Colorado’s Chance: The Firewalker.’ As a consultant with Georgetown Law’s Institute for Constitutional Advocacy and Protection and a vocal contributor to MSNBC and CNN, Jason casts a discerning eye on violent political extremism and misinformation, even testifying before Congress on these pressing issues. His writings have found a home in various publications, including Newsweek, Salon, Giant Freakin Robot, and Estes Park Trail-Gazette, seamlessly traversing through diverse media landscapes across Colorado. This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit www.coloradoswitchblade.com/subscribe",
      "release": "2024-02-15T22:51:14Z",
      "duration": "01:09:49.3090000",
      "explicit": false,
      "spotifyId": "6Y7MnaDObE3dJMRsjxBurD",
      "appleId": 1000645511740,
      "subjects": [
        "Cult Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Y7MnaDObE3dJMRsjxBurD",
        "apple": "https://podcasts.apple.com/podcast/navigating-the-maze-of-mind-control-with-dr-steven-hassan/id1615672690?i=1000645511740"
      }
    }
  ]
}