{
  "_ts": 0,
  "id": "4be54081-e543-4da1-aa1f-79b936b9e410",
  "name": "The I\u0027m Not Dumb But Podcast",
  "spotifyId": "2YSU0cLBPgVgYD5r2W79Nw",
  "appleId": 1676721541,
  "youTubeChannelId": "UCJt_ruQcPwP8pEwd_Ia2cAA",
  "episodes": [
    {
      "id": "b27620e2-3296-47da-9096-bf7835af3469",
      "title": "What is a Cult?",
      "description": "Dive into a thought-provoking exploration of cults and the mechanisms of control that often keep individuals bound to them. In this engaging episode, we connect with Gavri\u0027el HaCohen, co-host of the Leaving Eden podcast, as we unpack the complexities of cult dynamics through the lens of the BITE model developed by cult expert Dr. Stephen Hassan. Discover what truly defines a cult, the psychological tactics they employ, and learn how even seemingly benign organizations can exert control over their members. We also delve into personal narratives, illustrating the challenges faced by those who navigate life post-cult and the hurdles of rebuilding their identities. From exploring the critical differences between organized religions and cults to understanding the emotional toll coerced beliefs can have, our conversation highlights the essential takeaway: awareness and critical thinking are paramount. Cult-like influences linger in various aspects of our lives, making it crucial to discern where the line is drawn between supportive community and oppressive control. Join us on this enlightening journey of curiosity as we unravel the nuances of belief, community, and self-empowerment. Subscribe now for insightful discussions and remember to share this episode with someone who could benefit from it! Follow these links to check out Leaving Eden podcast: www.youtube.com/@leaving_eden instagram.com/LeavingEdenPodcast https://open.spotify.com/show/6jh5cAYRXAoqBSIQ1OckG5?si=327fa267496b4390 Support the show Follow The I\u0027m Not Dumb But Podcast https://www.youtube.com/@ImNotDumbButPodcast https://twitter.com/ImNotDumbBut https://www.instagram.com/imnotdumbbutpod/",
      "release": "2025-03-05T11:00:00Z",
      "duration": "00:59:03.4570000",
      "explicit": true,
      "spotifyId": "2JfzIvdpL2nhK3dacByrrV",
      "appleId": 1000697850700,
      "youTubeId": "lSjtxZiIlmM",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2JfzIvdpL2nhK3dacByrrV",
        "apple": "https://podcasts.apple.com/podcast/what-is-a-cult/id1676721541?i=1000697850700",
        "youtube": "https://www.youtube.com/watch?v=lSjtxZiIlmM"
      }
    }
  ]
}