{
  "_ts": 0,
  "id": "6f42dd86-5c9a-486b-8fee-01f7ef47a40a",
  "name": "The Unapologetic T.R.U.T.H.H.",
  "spotifyId": "3OBb0YB54uB3JkfDNvZg6q",
  "appleId": 1813442334,
  "episodes": [
    {
      "id": "b3482e0f-999a-428e-880b-af42dbdd80cc",
      "title": "Ep 4 : Rebuilding Your Identity After Emotional Abuse",
      "description": "Naomi opens up about her experience of walking away from a religious cult and the real challenge of dealing with the beliefs, shame, and fears that stuck around after she left. She talks about the sadness of realizing she hadn’t been living as her true self, and how brave it is to ask the question, “Who am I?” for the first time, and the slow process of remembering who you’ve always been underneath the survival mode.\n\n\nAbout the host, Naomi Sparks: \nNaomi Sparks is a mom, wife, healing coach, and a cult survivor. She grew up in a tightly controlled religious cult in Northern California and spent years disconnected from her true self. Her work now centers around helping others reclaim their voice, heal generational pain, and step into wholeness without apology.\n\n\nQuote of the episode:\n“Reclaiming who you are isn’t about starting over. It’s about remembering what was always true underneath the noise.”\n\n\nQuestions to think about:\nWho told me who I was before I ever got to decide?What beliefs do I still carry that no longer feel true?\n\n❤️‍🩹Healing starts by getting curious. You don’t need all the answers. You only need space to begin. \n\n\nConnect with Naomi:\nInstagram: @theunapologetictruthh\n\n\nLet’s keep the conversation going…If this episode spoke to you, please share it with someone who needs to hear it. Your voice helps more people find the space to heal.\n\n\n❤ Thank you for being here. This space is yours too.\nHealing isn’t linear. Identity takes time. You’re doing it beautifully.\n\n\nThis podcast is produced by AOLI.fm.",
      "release": "2025-06-04T21:22:00Z",
      "duration": "00:16:23",
      "explicit": false,
      "spotifyId": "2go972FQAw1fZBUlb1bj1o",
      "appleId": 1000711214309,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2go972FQAw1fZBUlb1bj1o",
        "apple": "https://podcasts.apple.com/podcast/ep-4-rebuilding-your-identity-after-emotional-abuse/id1813442334?i=1000711214309"
      }
    },
    {
      "id": "cca716ca-d3aa-4a3c-9278-b2e05b2c9b0b",
      "title": "Ep 3: See It, Name It, Begin to Heal From It",
      "description": "In this episode, Naomi speaks honestly about the pain of being raised in an environment where love felt conditional and safety was never promised. She explains how emotional abuse often goes unseen but leaves a deep impact that lasts for years. Through her story, she shows how trauma can affect your thoughts, your body, and your sense of self. She also shares what it looks like to start healing by naming the truth, reconnecting with your voice, and slowly building a life that feels safe and real. About the host, Naomi Sparks: Naomi Sparks is a mom, wife, healing coach, and a cult survivor. She grew up in a tightly controlled religious cult in Northern California and spent years disconnected from her true self. Her work now centres around helping others reclaim their voice, heal generational pain, and step into wholeness without apology. Quote of the episode: “Minimising your pain doesn\u0027t make you stronger. It makes your healing harder.” Questions to think about: Have I ever felt like my feelings were too much for someone else? Do I stay quiet to avoid conflict or rejection? Was I taught that love had to be earned? \u0026#x1f450; Healing takes time, but it begins when you tell the truth, feel what you need to feel, find safe support, learn what safety feels like in your body, and treat yourself with care as you grow. Connect with Naomi: Instagram: @theunapologetictruthh Let’s keep the conversation going… ..if this episode resonated with you, share it with someone who needs to hear this. Your support helps more people find this space for healing. ❤ Thank you for being here. This space is yours too. Healing is messy. Speaking the truth is brave. You’re right on time. This podcast is produced by AOLI.fm .",
      "release": "2025-05-28T21:22:00Z",
      "duration": "00:22:12.3370000",
      "explicit": false,
      "spotifyId": "6LlMABRf112WRtlsmI8NDd",
      "appleId": 1000710343039,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6LlMABRf112WRtlsmI8NDd",
        "apple": "https://podcasts.apple.com/podcast/ep-3-see-it-name-it-begin-to-heal-from-it/id1813442334?i=1000710343039"
      }
    }
  ]
}