{
  "id": "f64d0d17-a1c2-47dc-ab0f-ee88811ac36f",
  "name": "The Trial Of Chad Daybell | The Story Of Lori Vallow Daybell \u0026 Chad Daybell",
  "spotifyId": "3mke7Yw3cS1gMrS7wZlvH7",
  "appleId": 1669999934,
  "episodes": [
    {
      "id": "e507199a-2a47-4aa0-a995-a7cd1a60f20b",
      "title": "Lori Vallow Daybell Appeal Update: Prosecutors File DEVASTATING Response — Will She Get a New Trial?",
      "description": "Lori Vallow Daybell wants a new trial. Prosecutors just explained why she\u0027ll never get one. The Idaho Attorney General\u0027s office filed a 59-page brief this week responding to the \u0022Cult Mom\u0027s\u0022 appeal, and it\u0027s a comprehensive takedown of all five constitutional claims. Her attorney conflict argument? Mark Means represented both Lori and Chad Daybell at the same time — co-conspirators in a capital murder case. Chad paid for the representation. The court had no choice but to disqualify him. Her speedy trial claim? She was found incompetent twice, resulting in 353 days of delays. She requested the venue change. You don\u0027t get to cause delays and then complain about them. The Arizona evidence showing the \u0022dark spirit\u0022 pattern was properly admitted because it proved intent, plan, and modus operandi. Charles Vallow was declared \u0022dark\u0022 and killed. Brandon Boudreaux was declared \u0022dark\u0022 and shot at. Tammy Daybell was declared \u0022dark\u0022 and died. JJ and Tylee were declared \u0022dark\u0022 — and their bodies were found buried in Chad\u0027s backyard. Seven-year-old JJ was suffocated with a plastic bag taped over his head. Tylee\u0027s remains were burned. Lori spent those months collecting their Social Security in Hawaii. The Idaho Supreme Court will hear this appeal eventually. But the state\u0027s response makes clear: there\u0027s no constitutional violation here. Just a convicted murderer looking for an exit. #LoriVallowDaybell #Appeal #IdahoSupremeCourt #TrueCrime #ChadDaybell #JJVallow #TyleeRyan #CultMom #DoomsdayMom #CourtUpdate Join Our SubStack For AD-FREE ADVANCE EPISDOES \u0026 EXTRAS!: https://hiddenkillers.substack.com/ Want to comment and watch this podcast as a video? Check out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod Instagram https://www.instagram.com/hiddenkillerspod/ Facebook https://www.facebook.com/hiddenkillerspod/ Tik-Tok https://www.tiktok.com/@hiddenkillerspod X Twitter https://x.com/tonybpod Listen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872 This publication contains commentary and opinion based on publicly available information. All individuals are presumed innocent until proven guilty in a court of law. Nothing published here should be taken as a statement of fact, health or legal advice.",
      "release": "2026-01-14T05:00:00Z",
      "duration": "00:14:45.2370000",
      "explicit": false,
      "spotifyId": "3cDr6eQcPQewulYf7A1Xda",
      "appleId": 1000745088736,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3cDr6eQcPQewulYf7A1Xda",
        "apple": "https://podcasts.apple.com/podcast/lori-vallow-daybell-appeal-update-prosecutors-file/id1669999934?i=1000745088736"
      }
    },
    {
      "id": "2f0f3637-cadd-459f-8708-9ff431622b57",
      "title": "Why Do So Many Cults Start As Offshoots Of The LDS Church?",
      "description": "Tony Brueski and Psychotherapist and Author Shavaun Scott engage in a thought-provoking discussion about the tendency for cults to originate as offshoots of The Church of Jesus Christ of Latter-day Saints (LDS Church). They consider the LDS Church\u0027s doctrinal uniqueness, organizational structure, and history as possible factors that can foster such splinter groups. They also delve into the psychological aspects, explaining why certain individuals might be drawn to these more extreme interpretations and practices. Their dialogue illuminates the complex sociological and psychological dynamics that can lead to the creation of cults. Want to listen to ALL our Podcasts Ad-Free? Subscribe through Apple Podcasts, and try it for 3 days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: Hidden Killers With Tony Brueski (All Cases) - https://audioboom.com/channels/5040505-hidden-killers-with-tony-brueski-breaking-news-commentary Chad \u0026 Lori Daybell - https://audioboom.com/channels/5098105-demise-of-the-daybells-the-lori-chad-daybell-story The Murder of Ana Walshe - https://audioboom.com/channels/5093967-finding-ana-this-disappearance-of-ana-walshe Alex Murdaugh - https://audioboom.com/channels/5097527-the-trial-of-alex-murdaugh The Idaho Murders, The Case Against Bryan Kohberger - https://audioboom.com/channels/5098223-the-idaho-murders-the-case-against-bryan-kohberger Lucy Letby - https://audioboom.com/channels/5099406-nurse-of-death-the-lucy-letby-story",
      "release": "2023-06-05T20:00:00Z",
      "duration": "00:10:45.2760000",
      "explicit": false,
      "spotifyId": "5gmxuprIq7Kqou6Cm12Jt5",
      "appleId": 1000615769515,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5gmxuprIq7Kqou6Cm12Jt5",
        "apple": "https://podcasts.apple.com/podcast/why-do-so-many-cults-start-as-offshoots-of-the-lds-church/id1669999934?i=1000615769515"
      }
    }
  ]
}