{
  "id": "a84772a5-cfe1-41de-81cc-a34cefe57054",
  "name": "The Secret Society of Strangers Podcast",
  "spotifyId": "2G0aAYQPPp1wqnqJYetOcZ",
  "appleId": 1735210698,
  "episodes": [
    {
      "id": "59c15cdf-085b-48ed-aa12-3c613aa9458a",
      "title": "Inside Heaven\u0027s Gate Cult Part 4 : A RECIPE FOR DEATH",
      "description": "March 1997. A mansion in Rancho Santa Fe. 39 bodies in matching Nike sneakers and purple shrouds. The largest mass suicide on U.S. soil.\n\nThis is the finale of our Heaven\u0027s Gate series - the story of how Marshall Applewhite convinced 38 people that a comet was their spaceship home.\n\n⚠️ Content Warning: Suicide, cult manipulation, death. Call 988 if you\u0027re struggling.\n\nNational Suicide Prevention Lifeline: 988\n\nIN THIS EPISODE:\n\n\nThe Hale-Bopp comet discovery (665 million miles away, visible for 18 months)\nHeaven\u0027s Gate as internet pioneers (they were web developers before Amazon existed)\nChuck Shramek\u0027s Art Bell appearance that validated the UFO hysteria\nInside the \u0022Monastery\u0022 - the final months of preparation\nThe three-wave suicide protocol (March 22-26, 1997)\nRio DiAngelo discovers his 39 dead classmates\nWhy heavensgate.com still runs today\n\nTHE SHOCKING TRUTH: Before they were a death cult, Heaven\u0027s Gate was a cutting-edge web design company. Their clients included Hollywood production companies and the San Diego Polo Club. They used Java, VRML, streaming video, and advanced HTML in 1996 - years before most corporations.\n\nMarshall Applewhite didn\u0027t just see the internet as a tool. He saw it as theological proof that humanity had completed its experiment. Time to graduate.\n\nSeries Conclusion: 25 years. Two leaders. 39 deaths. One comet.\n\nThis is what happens when the search for meaning meets a broken teacher with absolute certainty.\n\nPrevious episodes: Part I (The Two), Part II (The Cult), Part III (The Castration)\n\nResearch sources include FBI files, medical examiner reports, survivor interviews, documentary footage, and archived Heaven\u0027s Gate materials.\n\nHosted by Lee, Josh, and Jen.\nAudio/Video: Jeremy of Schroeder Audio\n\n🕯️ Come Curious. Stay Strange.\n\n\n\n\n\nIf you would like to contact The SSOS\nE mail: SSOSpodcast@gmail.com \nTikTok : @SSODPodcast\nInstagram @Secretsocietyofstrangerspod\nFacebook: Secret Society of Strangers\nPodcast Merch available -  check out our linktree\nFull video episodes on our SSOS YouTube\n\n\n\n\n\n \n\nNational Suicide Prevention Lifeline: 988",
      "release": "2025-11-11T12:00:00Z",
      "duration": "01:05:42",
      "explicit": false,
      "spotifyId": "6LylyIVmw2PIr14q79xyeg",
      "appleId": 1000736257000,
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6LylyIVmw2PIr14q79xyeg",
        "apple": "https://podcasts.apple.com/podcast/inside-heavens-gate-cult-part-4-a-recipe-for-death/id1735210698?i=1000736257000"
      }
    }
  ]
}