{
  "_ts": 0,
  "id": "fbcdc7d0-3182-401a-b9af-dd56df241724",
  "name": "The ChangeRoom",
  "spotifyId": "0FDSZipuMP6DjRff8sJ2Y3",
  "appleId": 1747505171,
  "episodes": [
    {
      "id": "50c8b5cb-b4f8-4da5-90ef-7fe697e2849b",
      "title": "Being A Straight, Cis, Het Man in a Yoga Studio with Dennis Van Dine -",
      "description": "What does it feel like to be a straight, cis-man in a yoga studio? To advance conversations on gender, patriarchy, consent and privilege, it’s really fascinating to explore how wellness spaces might actually be one of few spaces where there are risks for men who attend. It’s a space that is really dominated by powerful women moving in ways that are unapologetically their own…it’s a place where the male gaze is not prioritized even though there are a lot of ways that it could be. Dennis Van Dine has been a lot of things in his life. A mathematician, an amazing musician, a tech start-up mastermind and probably most importantly, my friend for more than twenty years. Dennis is a student but not a teacher of yoga, bringing a different perspective to the table. @dvandine",
      "release": "2024-07-15T00:00:00",
      "duration": "00:42:28.1760000",
      "explicit": false,
      "spotifyId": "09Hab9GxjoBxhqqwcPm26h",
      "appleId": 1000662258909,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09Hab9GxjoBxhqqwcPm26h",
        "apple": "https://podcasts.apple.com/us/podcast/being-a-straight-cis-het-man-in-a-yoga-studio/id1747505171?i=1000662258909"
      }
    },
    {
      "id": "e94c7de0-186e-4360-b9ea-035255d33d47",
      "title": "Activism in Yoga with Indu Vashist",
      "description": "In this week’s episode, we discuss the intersections (past and present) between activism and yoga. In this wide-ranging discussion with Indu Vashist, our brilliant guest, we dig into big topics like the deliberate Scandi-whitewashed aesthetic of yoga studios, white feminine fragility, fascism, the cost of radical politiics and more. It’s a juicy one (and funnier than you would think too). Indu Vashist is a second generation settler in Canada and is of Punjabi ancestry. As a teacher, Indu shares tools like guided meditation, breathwork, movement and stillness that help us ride out our thoughts, feelings and experiences as they arise. In addition to being a movement teacher, Indu is also a trained historian. @indu_geita http://induvashist.com",
      "release": "2024-07-08T05:08:00Z",
      "duration": "00:49:40.0560000",
      "explicit": false,
      "spotifyId": "5zQkEcXP1urO9BY8ZbrjTe",
      "appleId": 1000661493990,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5zQkEcXP1urO9BY8ZbrjTe",
        "apple": "https://podcasts.apple.com/podcast/activism-in-yoga-with-indu-vashist/id1747505171?i=1000661493990"
      }
    },
    {
      "id": "ccfdb4b1-d703-4a23-90ac-845a628396b9",
      "title": "Scope of Practice with Lisa Messina",
      "description": "Ever notice the creep between physiotherapy, psychotherapy and yoga teaching? Ever felt pressured as a teacher to teach from a modality that you are not actually trained in? In this episode with the highly skilled and hilarious Capricorn-poster child, Lisa Messina, we explore what we are really trained for when we leave a 200-hour and how to make sure to serve our students in the most beneficial ways! Lisa is a somatic (body-based) and relational therapy practitioner, a trauma recovery coach, educator, group facilitator, yoga and pilates teacher, and mobility specialist with over a decade of training and experience in somatic therapy and over two decades of training in a variety of movement modalities.offers thirty minute complimentary online consultations for anyone interested in somatic work. The Messina Movement offers an online eight week small group program called The Process which is an integrative and experiential journey toward embodied wholeness. @messinamovement themessinamovement.com",
      "release": "2024-07-02T04:15:00Z",
      "duration": "00:37:26.2510000",
      "explicit": false,
      "spotifyId": "0o14NupcJlcodyJU7YM2Vq",
      "appleId": 1000660874484,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0o14NupcJlcodyJU7YM2Vq",
        "apple": "https://podcasts.apple.com/podcast/scope-of-practice-with-lisa-messina/id1747505171?i=1000660874484"
      }
    },
    {
      "id": "2387b67d-2b33-4b44-bde0-e130d0bd3036",
      "title": "Black Resilience in White Supremacist Culture with Nya Daley",
      "description": "As the incredibly insightful Nya Daley points out very succinctly in this interview, if you didn’t notice a difference in the way that Black people were treated in most studios in North America (and maybe beyond) after the summer of 2020, then you really weren’t paying attention. In this episode, Nya skillfully unpacks the position of Black movement and meditation teachers in studios and paths to creating the right opportunities for all teachers and practitioners. Nya Daley is an Atlanta, Georgia based social worker, community builder, yoga teacher and equity, diversity and belongingness educator, equipped with over 15 years of experience working in the wellness and social service sectors. Nya is the founder and lead facilitator of Soulga Yoga, a wellness collective that is rooted in empowering, highlighting and supporting BBIMP* wellness professionals by facilitating accessible and culturally relevant movement, mentorship and educational offerings. https://www.soulgawellness.com/",
      "release": "2024-06-24T00:00:00",
      "duration": "00:35:20.5390000",
      "explicit": false,
      "spotifyId": "1Mogqs6yIkQ5w6dCtrjmgV",
      "appleId": 1000656260993,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Mogqs6yIkQ5w6dCtrjmgV",
        "apple": "https://podcasts.apple.com/us/podcast/black-resilience-in-white-supremacist-culture-with-nya/id1747505171?i=1000656260993"
      }
    },
    {
      "id": "990641b6-75d2-4b74-a6bb-7d4cd03a7a8e",
      "title": "Neurodiversity, Unmasking and Inclusion with Becky Aten",
      "description": "Becky Aten discusses neurodiversity in wellness spaces and ways that creating intelligent design benefits all beings, whether they are neuro-typical or neuro-diverse. Be prepared to unravel myths, dismantle stereotypes and chuck unintentionally inaccessible practices out the window with Becky’s super clear, thoughtful and easy approach in this amazing interview. Becky is an openly neurodivergent/neuroqueer yoga practitioner and teacher, human resources professional, neurodiversity advocate, and a community space-holder and bridge-builder for the Neurodivergent community. They are passionate about cultivating welcoming, affirming, and neuro-inclusive environments that honor each individual’s experiences and intersecting identities. https://www.yogaforneurodiversity.com/",
      "release": "2024-06-17T04:01:00Z",
      "duration": "00:39:02.0110000",
      "explicit": false,
      "spotifyId": "7sRodkLe3t6lrOZGtmbYjM",
      "appleId": 1000656261075,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7sRodkLe3t6lrOZGtmbYjM",
        "apple": "https://podcasts.apple.com/podcast/neurodiversity-unmasking-and-inclusion-with-becky-aten/id1747505171?i=1000656261075"
      }
    },
    {
      "id": "468a1c72-1840-4ee6-8aad-9ed53ebb75d5",
      "title": "Studio Culture and the Cult of Personality Part 2 with Taryn Diamond",
      "description": "The Cult of Personality shows up all OVAH the place from politics to celebrity to…wellness spaces. Taryn Diamond digs into the pitfalls of centering practice spaces around the celebrity of one charismatic leader and the cult-like drama that ensues. Taryn is just as smart as she is hilarious which is why we made this one a two-part episode. Taryn Diamond is an energetic and inclusive instructor, drawing from experience in facilitation, gender analysis, and a commitment to social justice. Her entry to yoga was through movement, but her passion ruminates in studying its roots in Eastern philosophy. She is unabashed in her commitment to cheesy jokes and not taking this thing called \u0027life\u0027 too seriously. Taryn is most passionate about teaching movement that breeds self-inquiry and compassion. https://www.taryndiamond.com/",
      "release": "2024-06-10T04:01:00Z",
      "duration": "00:27:21.0470000",
      "explicit": false,
      "spotifyId": "1EeO5NP9bgjQtY25d73tnY",
      "appleId": 1000656261074,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1EeO5NP9bgjQtY25d73tnY",
        "apple": "https://podcasts.apple.com/podcast/studio-culture-and-the-cult-of-personality-part/id1747505171?i=1000656261074"
      }
    },
    {
      "id": "fbfac4be-e44b-4f6b-8d7f-09bcdf23ff1b",
      "title": "Studio Culture and the Cult of Personality Part 1 with Taryn Diamond",
      "description": "The Cult of Personality shows up all OVAH the place from politics to celebrity to…wellness spaces. Taryn Diamond digs into the pitfalls of centering practice spaces around the celebrity of one charismatic leader and the cult-like drama that ensues. Taryn is just as smart as she is hilarious which is why we made this one a two-part episode. Taryn Diamond is an energetic and inclusive instructor, drawing from experience in facilitation, gender analysis, and a commitment to social justice. Her entry to yoga was through movement, but her passion ruminates in studying its roots in Eastern philosophy. She is unabashed in her commitment to cheesy jokes and not taking this thing called \u0027life\u0027 too seriously. Taryn is most passionate about teaching movement that breeds self-inquiry and compassion. https://www.taryndiamond.com/",
      "release": "2024-06-03T04:01:00Z",
      "duration": "00:42:41.2530000",
      "explicit": false,
      "spotifyId": "7FydaZqapAIFJcVtjlFfaQ",
      "appleId": 1000656260935,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7FydaZqapAIFJcVtjlFfaQ",
        "apple": "https://podcasts.apple.com/podcast/studio-culture-and-the-cult-of-personality-part/id1747505171?i=1000656260935"
      }
    },
    {
      "id": "8ef1eeea-9d6e-4860-8d26-9b2f6cbdeaa8",
      "title": "Mental Health and Spiritual Bypassing with Jeff Warren",
      "description": "In this episode, author and meditation teacher Jeff Warren discusses how spiritual practices can either help individuals recognize, accept and connect with their particular mental health and neuro-identities (best case!) or (worst case!) lead to a disconnection and denial. Jeff Warren is a meditation instructor and journalist, known for his dynamic and accessible style of teaching. He’s co-author of The New York Times bestselling Meditation for Fidgety Skeptics, author of The Head Trip – a travel guide to sleeping, dreaming and waking – and founder of The Consciousness Explorers Club, a nonprofit meditation adventure group based in Toronto. His mission is to empower people to care for their own mental health, through the realistic, intelligent and sometimes irreverent exploration of meditation and personal growth practices. jeffwarren.org",
      "release": "2024-05-27T04:01:00Z",
      "duration": "00:35:14.2000000",
      "explicit": false,
      "spotifyId": "1q80nKcRZCuEL1Im5P0cGm",
      "appleId": 1000656260875,
      "subjects": [
        "Cult Psychology",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1q80nKcRZCuEL1Im5P0cGm",
        "apple": "https://podcasts.apple.com/podcast/mental-health-and-spiritual-bypassing-with-jeff-warren/id1747505171?i=1000656260875"
      }
    }
  ]
}