{
  "id": "d91907ec-918e-45a4-a052-b85a7f2bb29a",
  "name": "The Seneca Project",
  "youTubeChannelId": "UCbB-OXTpxu75x6SdBLen8Fg",
  "episodes": [
    {
      "id": "5c75014e-6078-4b2c-8498-35da9b1c52d3",
      "title": "Guest  Dr. Steven Hassan | World Renowned Cult Expert",
      "description": "LIVE at 7:30 PM ET: The Stakes with Dr. Steven Hassan | World Renowned Cult Expert\n\nThis week on The Stakes, Tara Setmayer and Michelle Kinney sit down with Dr. Steven Hassan, one of the world’s foremost experts on cults. As America faces growing extremism and political radicalization, Dr. Hassan helps us understand the psychology behind cult-like devotion, how manipulation spreads, and what it takes to break free.\n\nFrom his personal story as a former cult member to his decades of research and activism, Dr. Hassan brings unmatched insight into the dangers of authoritarian control—and how we can fight back with truth, compassion, and resilience.\n\n📺 Watch The Stakes with Tara Setmayer and Michelle Kinney every Thursday live at 7:30 PM ET.\n\n👉 The Seneca Project is one of the few groups unafraid to stand our ground, and we cannot continue this fight without you. Are you with us?\nSUPPORT THE SENECA PROJECT: https://www.SenecaProject.Us\n\n📺 Subscribe to The Seneca Project and hit the notification bell to stay updated on all our latest broadcasts, content, and new ads.\n\nThe Seneca Project is an unapologetic movement—by women, for women—driven by the relentless power of our collective voice. We are galvanizing voters to rise up against the assault on women’s freedoms, the erosion of democracy, and the dangerous threat posed by Donald Trump’s presidency. With courage and conviction, we transform our outrage into action, using compelling content, rapid-response videos, and impactful ads to spark the emotional urgency that drives change.\n\n🎙️ New to streaming or looking to level up? Check out StreamYard and get $10 discount! 😍 https://streamyard.com/pal/d/5704774491439104",
      "release": "2025-09-26T00:47:43Z",
      "duration": "01:07:45",
      "explicit": false,
      "youTubeId": "IkGNGMF6_2s",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IkGNGMF6_2s"
      }
    }
  ]
}