{
  "id": "f6d24631-bea3-4cec-a804-62ac8859eb21",
  "name": "The Graceful Warrior",
  "spotifyId": "6pYEmQfd7CaC6GXUwccExl",
  "appleId": 1696204454,
  "youTubeChannelId": "UCPb9V8kz6ivYXdb1KSHAgng",
  "episodes": [
    {
      "id": "a4cd2eca-8604-4eb4-94c8-ad199ed0478d",
      "title": "Exclusive Interview with Bestselling Author and Broadcaster Peter Young: Insights and Inspirations into the Cult",
      "description": "Welcome Back to the Graceful Warrior! This may have TRIGGER WARNINGS FOR SOME CHAPTERS: (00:00) Navigating Spiritual Battles (12:25) Escaping the Grip of a Cult (19:29) Betrayal in a Destructive Cult (25:09) Surviving a Destructive Cult (37:41) Unraveling Cult Dynamics and Writing Journeys Peter Young, a bestselling Christian author, once found himself ensnared in a world where love and family were overshadowed by a cult\u0027s influence. He shares his remarkable journey to freedom, revealing the steps he took to escape the grip of a manipulative figure known as Uncle Robert. Tune in to hear about Peter\u0027s personal battles and triumphs, the profound lessons he learned, and how he now uses his experience to help others recognize warning signs and strategies for liberation. Our episode wraps up with Peter’s insights on the characteristics of cult leaders and their manipulative tactics, along with his unwavering dedication to helping those still caught in similar situations. Join us for an episode that promises to inspire and educate, leaving you with a deeper understanding of spiritual battles and the strength needed to overcome them. Connection Corner- New episodes are released every Tuesday, Thursdays and Saturdays. Make sure to SUBSCRIBE and hit the notification bell to never miss an update! Follow Me on my website- https://TheGracefulWarrior.com . Youtube-https://www.youtube.com/@TheGracefulwarrior Want to be a guest on The Graceful Warrior? Send Monica Hansen a message on PodMatch here: https://www.podmatch.com/hostdetailpreview/gracefulwarrior Please Help Me! Hey Graceful Warriors! If you love our podcast and want to see it grow, consider donating to help us keep the lights on and continue bringing you the content you love. Donate here- buymeacoffee.com/GracefulWarrior #Cults, #CultLeaders, #Manipulation, #SpiritualBattles, #Love, #Family, #Escape, #Resilience, #Hope, #WarningSigns, #Liberation, #Marriage, #ParentalAlienation, #Writing, #Montana, #RealEstate, #Brainwashing, #ToxicEnvironment, #Isolation, #Recovery, #Healing",
      "release": "2025-01-09T13:00:00Z",
      "duration": "00:49:52.6670000",
      "explicit": false,
      "spotifyId": "0sty50SZ0eQgRzfx0Lien0",
      "appleId": 1000683314257,
      "youTubeId": "HBesYk3t9D4",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0sty50SZ0eQgRzfx0Lien0",
        "apple": "https://podcasts.apple.com/podcast/bestselling-author-peter-young-exposes-shocking-cult/id1696204454?i=1000683314257",
        "youtube": "https://www.youtube.com/watch?v=HBesYk3t9D4"
      }
    }
  ]
}