{
  "_ts": 0,
  "id": "984b3a19-aaf3-4eba-a7ad-f35e7873ef36",
  "name": "The Shanny Pants Show",
  "spotifyId": "6iQdHKrThhwmlzj5c1CIhE",
  "appleId": 1618657682,
  "episodes": [
    {
      "id": "f6f390d7-fbd8-4da9-8e9c-00262cbdbf80",
      "title": "Lisa Kohn",
      "description": "In this conversation, Lisa Kohn shares her profound journey growing up in the Unification Church, detailing the complexities of her childhood, the impact of her family dynamics, and her path to healing and self-discovery after leaving the cult. She reflects on the duality of her life, navigating between the cult\u0027s teachings and her father\u0027s contrasting lifestyle, and how these experiences shaped her understanding of self-worth and personal growth. In this conversation, Shanny Payton and Lisa Kohn delve into the complexities of growing up in a cult, the impact of codependency, and the long-lasting effects on mental health and relationships. They explore the challenges of navigating identity, acceptance, and the struggle to break free from the ingrained beliefs of their upbringing. The discussion highlights the emotional trauma associated with cult dynamics and the journey towards self-discovery and healing. In this conversation, Lisa Kohn shares her experiences growing up in a cult, the complexities of her family\u0027s legacy, and her journey towards healing and self-discovery. She discusses the impact of her upbringing on her life, the challenges she faced after leaving the cult, and the therapeutic processes that helped her navigate her trauma. Lisa emphasizes the importance of self-love and the ongoing nature of recovery, highlighting that it\u0027s never too late to change and grow. Lisa Kohn grew up in the Unification Church, known as the Moonies. Her childhood was marked by a stark contrast between her mother\u0027s cult and her father\u0027s lifestyle. Kohn\u0027s mother joined the cult when she was 10, leading to a tumultuous family dynamic. She often felt terrified and clung to her mother for security. Ultimately, she believes in the importance of self-acceptance and understanding that others\u0027 opinions are not her responsibility. Codependency is a deeply ingrained issue that can affect relationships. Cult upbringing can lead to significant mental health challenges. Realizing the impact of past experiences is a continuous journey. The struggle for identity often stems from childhood experiences in a cult. Understanding the beliefs of the Moonies provides insight into their cult dynamics. Healing from cult experiences requires addressing feelings of shame and guilt. The Moon family has a complex and troubling legacy. Growing up in a cult can lead to deep psychological scars. Find out more about LISA here Connect with Us: - Follow 〰️〰️Shanny \u0026#x1f456;〰️〰️ YouTube Facebook Instagram TikTok www.ShannyPantsShow.com - Subscribe to our podcast for more stories of hope and healing If you or someone you know is struggling with similar experiences, don’t hesitate to reach out for support. Healing is possible, and you are not alone. Visit Living Cult Free to find some amazing resources. I am so happy to be a board director of this wonderful non-profit. Thank you for listening! Your support helps us share these important stories with the world. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-11-15T07:29:39Z",
      "duration": "01:15:14.2460000",
      "explicit": true,
      "spotifyId": "4DBATKvYYWNpBpgi6yAoTx",
      "appleId": 1000677055428,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4DBATKvYYWNpBpgi6yAoTx",
        "apple": "https://podcasts.apple.com/podcast/lisa-kohn/id1618657682?i=1000677055428"
      }
    },
    {
      "id": "2543c6de-602f-45a7-b141-287411efc01e",
      "title": "Katrina Ford Part 2",
      "description": "In this episode of the Shanny Pants Show, host Shanny Payton welcomes Katrina Ford, a religious abuse life coach and author, to share her journey of overcoming religious trauma and facing stage three breast cancer. The conversation explores themes of vulnerability, community support, and the importance of maintaining faith amidst adversity. Katrina\u0027s story highlights the challenges of navigating life after leaving a cult, the power of love and kindness from unexpected sources, and the ongoing quest for authenticity in her faith. The episode concludes with reflections on the importance of creating space for vulnerability and the healing power of community.\n\n\nThe journey of recovery from religious trauma is ongoing.\nVulnerability is essential for healing and connection.\nCommunity support can come from unexpected places.\nFaith can coexist with doubt and struggle.\nKatrina emphasizes the importance of authenticity in faith.\nLove is a central theme in overcoming trauma.\nFacing cancer brings new challenges and insights.\nThe importance of creating space for vulnerability in communities.\nKatrina\u0027s story is a testament to resilience and hope.\n\nConnect with Katrina\nIG @katrinaford_speaker\nConnect with Us:\n- Follow 〰️〰️Shanny 👖〰️〰️\nYouTube\nFacebook\nInstagram\nTikTok\nwww.ShannyPantsShow.com-\nSubscribe to our podcast for more stories of hope and healing\n\nIf you or someone you know is struggling with similar experiences, don’t hesitate to reach out for support. Healing is possible, and you are not alone. \nVisit Living Cult Free to find some amazing resources. I am so happy to be a board director of this wonderful non-profit.\nThank you for listening! Your support helps us share these important stories with the world.\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-11-08T08:34:46Z",
      "duration": "01:02:17",
      "explicit": false,
      "spotifyId": "2S9S9nvvocjs6WnltSzLSH",
      "appleId": 1000676186027,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2S9S9nvvocjs6WnltSzLSH",
        "apple": "https://podcasts.apple.com/podcast/katrina-ford-part-2/id1618657682?i=1000676186027"
      }
    },
    {
      "id": "eb4d1b3a-8d90-487f-b60c-91cfeb5c0df6",
      "title": "Katrina Ford",
      "description": "In this conversation, Shanny Payton interviews Katrina Ford, a life coach specializing in religious abuse, academic sabotage, and the \u0027good girl syndrome.\u0027 Katrina shares her journey, including her recent book project titled \u0027Religious Black Sheep.\u0027 The discussion delves into the complexities of religious trauma and the diverse paths individuals take after experiencing high control backgrounds.\nKatrina Ford is a multifaceted life coach.\nShe specializes in religious abuse and academic sabotage.\nKatrina has written a book titled \u0027Religious Black Sheep.\u0027\nThe book is currently in the publishing process.\nKatrina emphasizes the importance of diverse perspectives on trauma.\nHigh control backgrounds can lead to various outcomes in faith.\nShanny appreciates the different viewpoints of her guests.\nKatrina\u0027s recent book cover photo shoot was a significant milestone.\nThe conversation highlights the challenges of religious trauma recovery.\nKatrina\u0027s coaching focuses on empowering individuals to reclaim their narratives.\nConnect with Katrina\nIG @katrinaford_speaker\nConnect with Us:\n- Follow 〰️〰️Shanny 👖〰️〰️\nYouTube\nFacebook\nInstagram\nTikTok\nwww.ShannyPantsShow.com-\nSubscribe to our podcast for more stories of hope and healing\n\nIf you or someone you know is struggling with similar experiences, don’t hesitate to reach out for support. Healing is possible, and you are not alone. \nVisit Living Cult Free to find some amazing resources. I am so happy to be a board director of this wonderful non-profit.\nThank you for listening! Your support helps us share these important stories with the world.\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-11-08T08:20:37Z",
      "duration": "01:07:20",
      "explicit": false,
      "spotifyId": "73y7wpxeYiQNnW0nxk2hA3",
      "appleId": 1000676185140,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/73y7wpxeYiQNnW0nxk2hA3",
        "apple": "https://podcasts.apple.com/podcast/katrina-ford/id1618657682?i=1000676185140"
      }
    },
    {
      "id": "ad3b2e3f-638a-4b73-905f-5b0dba6198f8",
      "title": "Carrie PART 2",
      "description": "In this episode of the Shanny Pants Show, Shanny and her guest Carrie Bowin delve into their experiences growing up in a cult, discussing the challenges of leaving, the humor found in their past, and the impact of their upbringing on their current lives. They share personal stories, reflect on childhood memories, and explore the complexities of relationships formed in a cult environment. The conversation is filled with laughter, nostalgia, and a deep understanding of resilience and recovery.\n\nThe importance of community and shared experiences in recovery.\nHumor plays a significant role in processing past trauma.\nChildhood memories are often tied to the cult experience.\nThe concept of \u0027Christian poof\u0027 highlights the absurdity of their past.\nSkating rinks were a place of both fun and strict rules.\nSinging in church was a serious affair, devoid of joy.\nThe pressure to conform created a culture of pretending.\nWomen in the cult had specific roles and expectations.\nReflecting on the past helps in understanding present relationships.\n\n- Follow 〰️〰️Shanny 👖〰️〰️\nYouTube\nFacebook\nInstagram\nTikTok\nwww.ShannyPantsShow.com-\nSubscribe to our podcast for more stories of hope and healing\n\nIf you or someone you know is struggling with similar experiences, don’t hesitate to reach out for support. Healing is possible, and you are not alone. \nVisit Living Cult Free to find some amazing resources. I am so happy to be a board director of this wonderful non-profit.\nThank you for listening! Your support helps us share these important stories with the world.\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-10-24T18:37:02Z",
      "duration": "00:46:32",
      "explicit": false,
      "spotifyId": "6PSk3sjdwijq00PPfOXABy",
      "appleId": 1000674342936,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6PSk3sjdwijq00PPfOXABy",
        "apple": "https://podcasts.apple.com/podcast/carrie-part-2/id1618657682?i=1000674342936"
      }
    },
    {
      "id": "ae21a96e-9358-4e61-950a-7599007db3c2",
      "title": "Carrie PART 1",
      "description": "In this conversation, Shanny Payton and Carrie Bowin delve into their experiences growing up in a cult, discussing the challenges of recovery, the impact of strict dress codes, and the journey towards self-discovery and authenticity. They reflect on the shame associated with their upbringing, the importance of family dynamics, and the power of forgiveness and change. The conversation highlights the struggles of navigating childhood and adolescence within a high-control environment and emphasizes the potential for personal growth and transformation.\nThe importance of sharing stories from the cult experience.\nShame should not be a part of anyone\u0027s childhood experience.\nThe impact of strict dress codes on self-image and confidence.\nNavigating family relationships post-cult can be challenging.\nForgiveness is possible, even after years of hurt.\nPeople can change, regardless of age or past actions.\nAuthenticity is crucial for personal growth and self-acceptance.\nThe conversation emphasizes the need for open discussions about cult experiences.\nIt\u0027s important to acknowledge the trauma caused by cults. \n\n- Follow 〰️〰️Shanny 👖〰️〰️\nYouTube\nFacebook\nInstagram\nTikTok\nwww.ShannyPantsShow.com-\nSubscribe to our podcast for more stories of hope and healing\n\nIf you or someone you know is struggling with similar experiences, don’t hesitate to reach out for support. Healing is possible, and you are not alone. \nVisit Living Cult Free to find some amazing resources. I am so happy to be a board director of this wonderful non-profit.\nThank you for listening! Your support helps us share these important stories with the world.\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-10-24T17:57:40Z",
      "duration": "00:39:53",
      "explicit": false,
      "spotifyId": "464N2bCUwFz6PFxaLmA9At",
      "appleId": 1000674338480,
      "urls": {
        "spotify": "https://open.spotify.com/episode/464N2bCUwFz6PFxaLmA9At",
        "apple": "https://podcasts.apple.com/podcast/carrie-part-1/id1618657682?i=1000674338480"
      }
    },
    {
      "id": "5305e8b6-34b0-44dc-a3a9-641956794cdb",
      "title": "Lyn Smith Gregory",
      "description": "Lyn Smith Gregory In this conversation, Lynn Smith Gregory shares her profound journey of leaving the Mormon Church, exploring the impact of her upbringing, the challenges of navigating life outside a high-control group, and the complexities of maintaining family relationships. She discusses her spiritual awakening, the role of women in the church, and the ongoing struggles faced by those who leave. The conversation highlights the importance of communication, the crisis of faith among younger generations, and the need for healing and understanding in the aftermath of religious trauma. Takeaways Lynn\u0027s family has a long history with the Mormon Church. Leaving the church can lead to feelings of shame and isolation. Spiritual awakening can occur after leaving a high-control group. Maintaining family connections can be challenging after leaving. Women in the Mormon Church often face restrictive roles. Toxic positivity is prevalent in high-control religions. Younger generations are leaving the church in record numbers. Communication barriers exist between those who leave and their families. The church\u0027s teachings can lead to internalized sexism. Healing from religious trauma is a complex process. Chapters 00:00 Introduction to Lynn\u0027s Journey 03:10 The Impact of Leaving the Mormon Church 05:46 Navigating Life After Leaving 09:03 Spiritual Awakening and Exploration 11:59 Family Dynamics and Relationships 15:00 The Role of Women in Mormon Culture 17:58 The Struggles of Leaving a High-Control Group 21:00 The Challenge of Maintaining Family Connections 24:07 The Hypocrisy of Mormon Culture 26:45 The Impact of Toxic Positivity 30:08 The Crisis of Faith in the Younger Generation 32:50 The Role of Communication in Family Dynamics 36:02 The Future of the Mormon Church 39:04 Conclusion and Reflections on Healing Find Lyn Website Instagram -Follow 〰️〰️Shanny \u0026#x1f456;〰️〰️ YouTube Facebook Instagram TikTok www.ShannyPantsShow.com - Subscribe to our podcast for more stories of hope and healing If you or someone you know is struggling with similar experiences, don’t hesitate to reach out for support. Healing is possible, and you are not alone. Visit Living Cult Free to find some amazing resources. I am so happy to be a board director of this wonderful non-profit. Thank you for listening! Your support helps us share these important stories with the world. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-10-17T07:37:00Z",
      "duration": "01:07:05.5730000",
      "explicit": false,
      "spotifyId": "6RRwWeZNTPMQbKJNUkawQR",
      "appleId": 1000673410565,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RRwWeZNTPMQbKJNUkawQR",
        "apple": "https://podcasts.apple.com/podcast/lyn-smith-gregory/id1618657682?i=1000673410565"
      }
    },
    {
      "id": "c752dbd2-0acd-4e60-98bd-fdce6ce8f24f",
      "title": "Kacey",
      "description": "The Shanny Pants Show Podcast: Kacey \nEpisode Title: Cults, Survivors, and Storytelling with Kacey\nGuest: Kacey\n- Background: Creator and host of *The Cult Vault* podcast\n- Podcast Origin: Launched during the COVID-19 lockdown\n- Initial Focus: Researching and presenting historical cult cases\n- Evolution: Transitioned to a platform for survivors to share their personal stories\n Podcast Overview: \n- Theme: Focuses on cults and the experiences of cult survivors\n - Interviews with survivors and experts in the field\n - Coverage of current events related to cults\n- Production: Kacey handles all aspects—planning, research, scripting, editing, and uploading\n- Mission: Raise awareness about cults and provide support to survivors\nKacey\u0027s Vision\n- Financial Viability: Aims to make *The Cult Vault* sustainable to support survivor charities\n- Support for Cult Victims: Interested in developing more resources and initiatives for those affected by cults\n Key Discussion Points\n- The importance of storytelling in healing for survivors\n- How *The Cult Vault* has evolved since its inception\n- Challenges and triumphs in creating a survivor-centered platform\n- Current events that highlight the ongoing issues surrounding cults\n- Future plans for *The Cult Vault* and collaborations with survivor organizations\nTakeaways\n- The significance of raising awareness about cults and their impact on individuals\n- Encouragement for survivors to share their stories and seek support\n- The potential of podcasts as a medium for education and advocacy\n Where to Find Kacey\n- Listen to *The Cult Vault* wherever you get your podcasts\n- Follow Kacey on social media for updates and insights\n\n I thank Kacey for her invaluable insights and contributions to the conversation on cults and survivor support.\nI encourage listeners to share the episode and support Kacey\u0027s mission.\nFind out more about Kacey and The Cult Vault\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-10-10T14:03:31Z",
      "duration": "01:03:40",
      "explicit": false,
      "spotifyId": "3o2jkVLmSSeKmlOfnTuH8a",
      "appleId": 1000672518051,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3o2jkVLmSSeKmlOfnTuH8a",
        "apple": "https://podcasts.apple.com/podcast/kacey/id1618657682?i=1000672518051"
      }
    },
    {
      "id": "bb3c1dcf-3d31-4d7d-a991-bad2b739ef11",
      "title": "Jerald Kimble",
      "description": "In this episode of The Shanny Pants Show, Shanny Payton engages in a heartfelt conversation with Jerald, who shares his journey from growing up in a strict Baptist church to navigating life after leaving the ministry. They discuss the challenges of childhood experiences in a cult, the impact of religious trauma, and the importance of breaking the cycle for their children. The conversation also touches on evolving beliefs, the complexities of family relationships, and the journey towards personal growth and healing. Takeaways Jerald\u0027s upbringing in a strict Baptist church influenced his life choices. Leaving the church led to a significant personal transformation for Jerald. The importance of addressing childhood trauma in adulthood. Parenting styles have evolved to break the cycle of trauma. The significance of open communication in family relationships. Navigating the complexities of in-law relationships post-cult. The struggle of reconciling past beliefs with current values. The journey of self-discovery is ongoing and necessary. Spirituality can evolve and change over time. Connect with Us: 〰️〰️Shanny \u0026#x1f456;〰️〰️ YouTube Facebook Instagram TikTok www.ShannyPantsShow.com - Subscribe to our podcast for more stories of hope and healing If you or someone you know is struggling with similar experiences, don’t hesitate to reach out for support. Healing is possible, and you are not alone. Visit Living Cult Free to find some amazing resources. I am so happy to be a board director of this wonderful non-profit. Thank you for listening! Your support helps us share these important stories with the world. The views, thoughts, and opinions expressed are the speaker’s own and do not represent the views, thoughts, and opinions of the host. The material and information presented here is for general information purposes only. The Shanny Pants Show name and all forms and abbreviations are the property of its owner and its use does not imply endorsement of or opposition to any specific organization, product, or service. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-10-03T13:00:06Z",
      "duration": "01:05:47.1540000",
      "explicit": false,
      "spotifyId": "1cT1kig7qH5jZins3xnhXU",
      "appleId": 1000671669117,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cT1kig7qH5jZins3xnhXU",
        "apple": "https://podcasts.apple.com/podcast/jerald-kimble/id1618657682?i=1000671669117"
      }
    },
    {
      "id": "6aa393c4-1f11-48f9-82db-a1247658b9d1",
      "title": "Shelly Snow Pordea",
      "description": "In this engaging podcast episode, Shanny Payton interviews Shelly Snow Pordea, a novelist and screenwriter, about her journey of writing a new book that explores themes of abuse, control, and the role of the church in personal narratives. They discuss the emotional process of writing, the importance of storytelling in healing, and the target audience for the book. Shelly shares insights on the complexities of her characters and the societal issues they represent, while also providing resources for cult survivors. The conversation highlights the significance of asking questions and sparking discussions around difficult topics. Shelly\u0027s book aims to empower women who have experienced manipulation and control. The church plays a significant role in shaping societal views on women and relationships. Writing can be a therapeutic process that aids in personal healing. It\u0027s important to address the complexities of abuse and not oversimplify the narrative. Shelly hopes her book will spark conversations about difficult topics. The target audience for the book includes women in conservative circles who have faced abuse. Validation from others can help in recognizing past trauma and abuse. Exploring different therapeutic methods can aid in healing from cult experiences. The importance of storytelling in processing personal experiences and trauma. Shelly emphasizes the need for open discussions about the impact of cults and abusive relationships. Connect with Shelly: Instagram Facebook The Cheating Wife Website Connect with Us: - Follow 〰️〰️Shanny \u0026#x1f456;〰️〰️ YouTube Facebook Instagram TikTok www.ShannyPantsShow.com - Subscribe to our podcast for more stories of hope and healing If you or someone you know is struggling with similar experiences, don’t hesitate to reach out for support. Healing is possible, and you are not alone. Visit Living Cult Free to find some amazing resources. I am so happy to be a board member of this wonderful non-profit. Thank you for listening! Your support helps us share these important stories with the world. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-09-26T06:51:58Z",
      "duration": "00:55:14.4160000",
      "explicit": false,
      "spotifyId": "21CcC4mIfah8nDpsFcgrZ5",
      "appleId": 1000670752145,
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21CcC4mIfah8nDpsFcgrZ5",
        "apple": "https://podcasts.apple.com/podcast/shelly-snow-pordea/id1618657682?i=1000670752145"
      }
    },
    {
      "id": "c5530e7e-beb0-4a8f-be9d-e76a8a68de03",
      "title": "Hurt and healed by the Church",
      "description": "Episode with Ryan George\nHost: Shanny  \nGuest:Ryan George  \nEpisode Title: Hurt and healed by the Church: Ryan George\u0027s Journey of Hope\n\nIn this powerful episode, host Shanny sits down with Ryan George, author and survivor of an abusive childhood rooted in religious trauma. Ryan shares his deeply personal story of resilience after facing unimaginable challenges, including the shocking revelation of his father\u0027s predatory behavior as a pastor.\nWhat would you do if you learned from a podcast that your dad—a pastor—was a serial sexual abuser? For Ryan, this wasn’t a hypothetical scenario; it was a painful reality that forced him to confront the faces behind the stories he had heard. As he delved into the dysfunction and abuse within the cult of his youth, Ryan recognized that such predatory behavior was often woven into the very fabric of his former faith.\nRather than allowing this trauma to destroy his spirit, Ryan found solace in a different understanding of Jesus—one that is tender and redemptive. In his new book, *Hurt and Healed by the Church*, he recounts how he separated his faith from the harmful doctrines of American fundamentalism. Through candid reflections, Ryan illustrates the mental shifts and restorative relationships that guided him toward healing from church trauma and spiritual manipulation.\nIf you\u0027ve experienced church hurt or are grappling with your faith in light of past abuse, Ryan’s insights offer a path to rebuild your faith without feeling like you’re abandoning it. His story serves as a beacon of hope and inspiration, demonstrating that unorthodox redemption is possible.\nKey Takeaways:\n- Understanding the reality of abuse within religious institutions\n- The journey of separating faith from harmful beliefs\n- Finding healing and restoration after church trauma\n- The importance of community and supportive relationships in recovery\n- How rebuilding faith can lead to a more compassionate and loving understanding of spirituality\nResources Mentioned:\n- Ryan George’s new book: *Hurt and Healed by the Church*\nSee Book Here\nFind out more about Ryan Here\nConnect with Us:\n- Follow 〰️〰️Shanny 👖〰️〰️\nYouTube\nFacebook\nInstagram\nTikTok\nwww.ShannyPantsShow.com-\nSubscribe to our podcast for more stories of hope and healing\nCall to Action:\nIf you or someone you know is struggling with similar experiences, don’t hesitate to reach out for support. Healing is possible, and you are not alone. \nVisit Living Cult Free to find some amazing resources. I am so happy to be a board member of this wonderful non-profit.\nThank you for listening! Your support helps us share these important stories with the world.\n\nYouTube audio codes: WKUPCL5WQNESFGSW \nRXVBMJG5WCAJUYES\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-09-20T05:57:09Z",
      "duration": "00:58:33",
      "explicit": false,
      "spotifyId": "3JoxB35E0IeD5U1pMgIuMX",
      "appleId": 1000670137652,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3JoxB35E0IeD5U1pMgIuMX",
        "apple": "https://podcasts.apple.com/us/podcast/hurt-and-healed-by-the-church/id1618657682?i=1000670137652"
      }
    },
    {
      "id": "9ec9587d-59ad-47e0-b2c0-43c4eefebeb3",
      "title": "Katherine Spearing",
      "description": "Katherine Spearing MA, CTRC is the founder of Tears of Eden , a nonprofit supporting survivors of spiritual abuse, and the host of Tears\u0027 affiliate podcast Uncertain. She also hosts the podcast Trauma \u0026 Pop Culture and is a Certified Trauma Recovery Coach working primarily with clients who have survived cults, high-control environments, spiritual abuse, and sexual abuse. She also provides specialized trauma informed career coaching , as folks with trauma often need extra support for interviewing and networking. Katherine is the author of a historical romantic comedy, Hartfords , a novel that challenges gender roles in a patriarchal society that will appeal to fans of Jane Austen. She has been a guest on a number of podcasts, including IndoctriNation and That’s So Fcked Up, is the author of several nonfiction articles, and writes regularly at katherinespearing.com and tearsofeden.org - 〰️〰️Shanny \u0026#x1f456;〰️〰️ YouTube Facebook Instagram TikTok www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-16T08:26:17Z",
      "duration": "01:06:49.7170000",
      "explicit": false,
      "spotifyId": "6X4oSRFPFEaz4dt5uHLFD2",
      "appleId": 1000645552619,
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6X4oSRFPFEaz4dt5uHLFD2",
        "apple": "https://podcasts.apple.com/podcast/katherine-spearing/id1618657682?i=1000645552619"
      }
    },
    {
      "id": "df988ab5-50eb-48c4-b925-afad1cf52054",
      "title": "Cait West",
      "description": "Cait was such a lovely guest! We have so much in common and I had to edit our talk down a ton because we chatted for such a long time. If you were a part of my cult/group, you will see lots of similarities in Cait\u0027s story. From Cait:When I left home at the age of twenty-five, I had no idea what my path would look like. I had no story to tell. I had spent my entire life in the Christian Patriarchy and Stay-at-Home-Daughter Movements, only to realize that I didn’t belong. My story had always been written for me, and now I was taking over the pen for the first time.In the words of Maya Angelou, “There is no greater agony than bearing an untold story inside you.”I used to think I could rewrite my whole life, come clean somehow, and pretend I never had a past of oppression and abuse. I didn’t want to be the victim, the pitied, the weak. But the years have taught me that there is no easy way to delete bitter memories or old scars. I can’t separate the good from the bad. So, I’m moving forward, not chained to the past, but liberated from it, carrying with me the old stories, if only as a preface to the new.After I got out, I studied creative writing and publishing at Michigan State University and served on the editorial team for Fourth Genre: Explorations in Nonfiction. My work has been featured in 3288 Review, Dunes Review, Fourth Genre, Hawai\u0060i Pacific Review, The Revealer, and Religion Dispatches.I work full time as a book editor, and I also serve on the editorial board for Tears of Eden, a nonprofit providing resources for survivors of spiritual abuse, and cohost the podcast Survivors Discuss.My debut memoir, Rift: A Memoir of Breaking Away from Christian Patriarchy, will be available on April 30, 2024.www.caitwest.com〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-09T07:02:36Z",
      "duration": "00:58:55.6990000",
      "explicit": false,
      "spotifyId": "79Edv7E9edPe2alYnv8iLy",
      "appleId": 1000644729066,
      "subjects": [
        "Quiverfull",
        "Christian Fundamentalist",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/79Edv7E9edPe2alYnv8iLy",
        "apple": "https://podcasts.apple.com/podcast/cait-west/id1618657682?i=1000644729066"
      }
    },
    {
      "id": "86850cb5-05ff-47f6-89cd-aecb201ab645",
      "title": "Eric Skwarczynski",
      "description": "Eric Skwarczynski Featured in Let us Prey Documentary Host, Preacher Boys PodcastEXPOSINGThe Preacher Boys podcast exists to shed a bright spotlight on the very real subject of mental, physical, and sexual abuse within Independent Fundamental Baptist (IFB) churches.While IFB churches do not have a monopoly on abuse – it is an undeniable problem within the movement and must be addressed.ENGAGINGThe Preacher Boys podcast exists to engage thoughtfully on the subject of abuse.The Preacher Boys podcast is not a satire site, nor is it a reflection of a personal vendetta against all who identify with the movement.We must look objectively at the issues at hand, using relevant data and dialoguing with survivors to better understand and deconstruct the religious sub-cultures that lend themselves to abuse.Every survivor\u0027s story is worthy to be told, and every survivor has equal value, regardless of their gender, ethnicity, current religious affiliation, sexual orientation, age, or any other factor.EQUIPPINGThe Preacher Boys Podcast exists not only to rally not only survivors and advocates now outside the movement, but also to spark a fire of change within – leading current congregants, leaders, and pastors to effect change in their own churches.Through interviews and contributed resources from trauma therapists, mental health experts, law enforcement, clergy, and other specialists, the Preacher Boys podcast should be a growing library of information for the pastor hoping to strengthen the security of their church, their capacity to minister to the hurting, and their ability to be what the church should have been – a place of refuge and safety.Find Eric HereInstagramFacebookPodcast〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-01T22:40:35Z",
      "duration": "01:02:36.9040000",
      "explicit": false,
      "spotifyId": "5aLxjZtMWZRzH5fkxwHgR0",
      "appleId": 1000643865758,
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5aLxjZtMWZRzH5fkxwHgR0",
        "apple": "https://podcasts.apple.com/podcast/eric-skwarczynski/id1618657682?i=1000643865758"
      }
    },
    {
      "id": "d3bc01f2-c45e-4d03-b812-21864a9756e6",
      "title": "Jon Snow and Shelly Snow Pordea Part TWO",
      "description": "ABOUT Jon Jon Snow is an actor and writer, but he is first and foremost the survivor of both a cult, and of sexual abuse. Raised primarily in St. Louis, Missouri, Jon ran away from home and the cult when he was just 17 years old, between his junior and senior year of high school. The cult, the sexual assault, and the physical abuse endured from his mother, left Jon feeling powerless. A young man without a voice. Not long after running away, acting came calling in the form of a mostly paid for tuition at Southern Methodist University in Dallas, Texas. But even that was no walk in the park. He promptly failed out of college during his freshman year, after which he sheepishly returned to St. Louis.  Through hustle and hard work, Jon was able to find a coveted position as a reader for multiple casting offices around Los Angeles. And now, having been a participant in over 10,000 auditions to date, he has started teaching other actors the insights he has gleaned during his time as a reader.​Today, Jon\u0027s larger mission is to continue to find ways to deepen the connection to his voice, and to reach back out to those who feel powerless, voiceless, alone and afraid. Having walked that path, Jon can think of no better way than to shine a light in the darkness for others to follow. Even if it\u0027s just a single person, he knows it\u0027s all well worth the effort. ALL ABOUT JONAbout ShellyShelly Snow Pordea is a dynamic figure, renowned as a speaker, publishing consultant, and author of the captivating Tracing Time trilogy. This trilogy, a compelling narrative of women navigating the complexities of life while endeavoring to protect themselves and their loved ones, has consistently ranked among the top one hundred Time Travel Romance books on Amazon Kindle, attesting to its widespread popularity.​Beyond her literary achievements, Shelly is a courageous advocate for survivors of spiritual, sexual, and institutional abuse. Drawing from her own experiences as a cult survivor and victim of childhood sexual abuse, she utilizes the power of storytelling to effect change. Her forthcoming memoir and screenplay shed light on her journey, amplifying the voices of those who have faced similar challenges.​As a screenwriter, Shelly collaborates with her brother, actor Jon Snow, in the production of a fictional adaptation for a series drama based on her personal story. Shelly Snow Pordea invites you to join her journey on social media, where she shares her insights and creative endeavors. Follow her @shellysnowpordea for a glimpse into the world of a multifaceted storyteller and advocate. ALL ABOUT SHELLY〰️〰️Shanny 👖〰️〰️Instagram TikTokYouTube www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-01-25T08:22:13Z",
      "duration": "01:09:14.1480000",
      "explicit": false,
      "spotifyId": "5X55vmFcrr1sVE4cEZ0aNo",
      "appleId": 1000642883956,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5X55vmFcrr1sVE4cEZ0aNo",
        "apple": "https://podcasts.apple.com/podcast/jon-snow-and-shelly-snow-pordea-part-two/id1618657682?i=1000642883956"
      }
    },
    {
      "id": "53fd703a-cc69-474c-977e-942b64d04a88",
      "title": "Jon Snow and Shelly Snow Pordea Part ONE",
      "description": "ABOUT Jon Jon Snow is an actor and writer, but he is first and foremost the survivor of both a cult, and of sexual abuse. Raised primarily in St. Louis, Missouri, Jon ran away from home and the cult when he was just 17 years old, between his junior and senior year of high school. The cult, the sexual assault, and the physical abuse endured from his mother, left Jon feeling powerless. A young man without a voice. Not long after running away, acting came calling in the form of a mostly paid for tuition at Southern Methodist University in Dallas, Texas. But even that was no walk in the park. He promptly failed out of college during his freshman year, after which he sheepishly returned to St. Louis.  Through hustle and hard work, Jon was able to find a coveted position as a reader for multiple casting offices around Los Angeles. And now, having been a participant in over 10,000 auditions to date, he has started teaching other actors the insights he has gleaned during his time as a reader.​Today, Jon\u0027s larger mission is to continue to find ways to deepen the connection to his voice, and to reach back out to those who feel powerless, voiceless, alone and afraid. Having walked that path, Jon can think of no better way than to shine a light in the darkness for others to follow. Even if it\u0027s just a single person, he knows it\u0027s all well worth the effort. ALL ABOUT JONAbout ShellyShelly Snow Pordea is a dynamic figure, renowned as a speaker, publishing consultant, and author of the captivating Tracing Time trilogy. This trilogy, a compelling narrative of women navigating the complexities of life while endeavoring to protect themselves and their loved ones, has consistently ranked among the top one hundred Time Travel Romance books on Amazon Kindle, attesting to its widespread popularity.​Beyond her literary achievements, Shelly is a courageous advocate for survivors of spiritual, sexual, and institutional abuse. Drawing from her own experiences as a cult survivor and victim of childhood sexual abuse, she utilizes the power of storytelling to effect change. Her forthcoming memoir and screenplay shed light on her journey, amplifying the voices of those who have faced similar challenges.​As a screenwriter, Shelly collaborates with her brother, actor Jon Snow, in the production of a fictional adaptation for a series drama based on her personal story. Shelly Snow Pordea invites you to join her journey on social media, where she shares her insights and creative endeavors. Follow her @shellysnowpordea for a glimpse into the world of a multifaceted storyteller and advocate. ALL ABOUT SHELLY〰️〰️Shanny 👖〰️〰️Instagram TikTokYouTube www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-01-25T08:20:51Z",
      "duration": "00:51:25.5570000",
      "explicit": false,
      "spotifyId": "4Tj77bVfantVS0EUMJBDTE",
      "appleId": 1000642883868,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Tj77bVfantVS0EUMJBDTE",
        "apple": "https://podcasts.apple.com/podcast/jon-snow-and-shelly-snow-pordea-part-one/id1618657682?i=1000642883868"
      }
    },
    {
      "id": "dc8dc1bf-726f-4883-bc25-c482be55a0a5",
      "title": "Jessica Willis Fisher",
      "description": "Jessica Willis Fisher is a singer/songwriter, performing artist, speaker, and author who believes that sharing our stories with one another will change the world. Growing up the eldest daughter in a controlling and abusive household, she performed with her family band, The Willis Clan, until her departure in 2016 at the age of 23. Her first book, Unspeakable, narrates her harrowing struggle to both articulate her childhood experience and find her true voice on the other side of emotional, physical, and sexual abuse. A passionate advocate for survivors, Jessica lives in Nashville, TN.UNSPEAKABLE:Surviving My Childhood and Finding My VoiceBrought up under the strange philosophies of her controlling father, young Jessica Willis was curious about the outside world. She wondered if other girls were forbidden to disagree with their elders. If other mothers feared their husbands. If other daddies came into their daughters’ bedrooms at night. In Unspeakable, her debut memoir, Jessica Willis Fisher gives a lacerating portrait of a girl who was famous yet unknown, dreaming of freedom and terrified of finding it. Stunning in its detailed, poetic prose, Unspeakable takes us on a journey through a chaotic and crowded childhood, first kisses and first love, an electrifying court case that brings new losses to the surface, and a tumultuous journey of a faith so different from the one Jessica first knew.WebsiteYOUTUBE〰️〰️Shanny 👖〰️〰️LinkTreeTikTokYouTube www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-12-21T20:45:03Z",
      "duration": "01:19:55.6370000",
      "explicit": false,
      "spotifyId": "1zra0hJj8dS3ijsNcykKpe",
      "appleId": 1000639377155,
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zra0hJj8dS3ijsNcykKpe",
        "apple": "https://podcasts.apple.com/podcast/jessica-willis-fisher/id1618657682?i=1000639377155"
      }
    },
    {
      "id": "ab2d26fc-8f42-418f-bb68-bcae2cb6a543",
      "title": "Mike Boyd",
      "description": "SummaryIn this episode of the Shanny Pants Show, Shanny interviews Mike Boyd, a former cult member, about his experiences and recovery. Mike shares how he joined the cult and the challenges he faced within it, including the amplification of destructive behavior and struggles with love, value, and acceptance. He discusses his journey of anger and healing, including his experience with therapy and the importance of community in the recovery process. Mike also talks about writing a book on cult recovery and offers advice for those still in the cult.TakeawaysJoining a cult can lead to amplified destructive behavior and struggles with love, value, and acceptance.Recovery from cult experiences may require addressing anger and seeking healing through therapy and community support.Writing and sharing personal stories can help others in their own recovery journeys.It is important to find trusted individuals and communities who can provide support and understanding during the recovery process.As many people begin their quest of seeking God, they all too often can overlook the destructive force of a church or religion that may not be readily visible. These destructive forces can sometimes be overshadowed by the things that are positive about their newly found religious journey. These destructive forces can sometimes come in the form of physical abuse but can oftentimes come through emotional abuse. These disturbances can overpower a person\u0027s life and they can also feel all alone with their religiously oppressive experience. With the author\u0027s own personal experience of being a part of an abusive cult church for 26 years, he offers understanding, hope, healing, and a way through the trauma through a twelve-step process. -CULT CANDYCult Candy-Youtube Links:Introduction https://youtu.be/PIhJcggFqa8?si=BNpj33whC-4M8_CzElitismhttps://youtu.be/12fxb3LCsdo?si=JE2nY1iInimL6lIUIsolationismhttps://youtu.be/sGUq43Ovde0?si=Nl7Z2P2CdEgt-2pjTotalismhttps://youtu.be/Th8WNlsprlw?si=Wvr7yqtafQJneN_ULegalismhttps://youtu.be/EBILT1h7ffc?si=H3dg4dR4M8yuwT3DFace Book Linkhttps://www.facebook.com/cultcandyinfo Contact Mike cult.candi@gmail.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-12-14T14:00:16Z",
      "duration": "00:47:13.3970000",
      "explicit": false,
      "spotifyId": "1SioopQZGSNuBI9HpB0TwG",
      "appleId": 1000638567214,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1SioopQZGSNuBI9HpB0TwG",
        "apple": "https://podcasts.apple.com/podcast/mike-boyd/id1618657682?i=1000638567214"
      }
    },
    {
      "id": "a28178cf-59aa-444c-a96f-dd743f28e2ca",
      "title": "Rebekah Drumsta",
      "description": "For over two decades, Rebekah has held a global presence through devoting her efforts to various nonprofits and organizations.  Her background is diverse, including educational and mental health content development, international relations, and public speaking.Currently, Rebekah is the Interim Chief Executive Officer of NPE Friends Fellowship, an international non-profit organization which assists individuals, and their families, who have received unexpected results from an at-home DNA test.Rebekah is also a consultant, writer, and advocate at RebekahDrumsta.com with the mission of supporting survivors of spiritual abuse and religious trauma by providing resources to educate and equip not only  survivors, but the public as well. Sharing her own story to help others who have had similar life experiences is at the heart of Rebekah’s purpose.  She is a board member with two non-profit organizations The Vashti Initiative and the Attachment and Trauma Network. Rebekah’s hobbies include binge watching riveting shows, thrifting with her family, international travel, and dabbling in all things creative and artistic. Rebekah and her family reside in Texas.   Rebekah holds undergraduate and advanced degrees in: Urban Ministry and Family Crisis, Counseling, and Religious Education and is also a Certified Professional Life Coach. She has made appearances on and consulted with sources including BBC, NBC and ABC, and a variety of other platforms such as podcasts and film projects. Rebekah’s book, When Family Hurts: 30 Days to Finding Healing and Clarity, was released in December of 2021. She is a co-author of the research paper, Percentage of U.S. Adults Suffering from Religious Trauma: A Sociological Study, as well as an author in the 2023 collaborative book, Hope in the 2020s: Encouragement for our time.Credit: www.rebekahdrumsta.com/aboutInstagram: rebekahdrumstaFacebook: DrumstaRebekahTwitter: DrumstaRebekahWebsite: rebekahdrumsta.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-12-07T14:00:26Z",
      "duration": "01:03:43.5160000",
      "explicit": false,
      "spotifyId": "4LBdoFWNKuroiJwnkcHoKi",
      "appleId": 1000637818030,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LBdoFWNKuroiJwnkcHoKi",
        "apple": "https://podcasts.apple.com/podcast/rebekah-drumsta/id1618657682?i=1000637818030"
      }
    },
    {
      "id": "c6d6c2c7-28fb-4d72-a919-c97f9cff455f",
      "title": "Session with A Sister",
      "description": "Shanny and sister Carrie discuss how they were never allowed to Celebrate Christmas until they left the cult they were raised in. Ready for some laughs. We have them for you! Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-12-06T07:57:27Z",
      "duration": "01:35:02.4260000",
      "explicit": false,
      "spotifyId": "5dAoAZKMWl3A0Kd1QobUkv",
      "appleId": 1000637656949,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5dAoAZKMWl3A0Kd1QobUkv",
        "apple": "https://podcasts.apple.com/podcast/session-with-a-sister/id1618657682?i=1000637656949"
      }
    },
    {
      "id": "dac7c9df-2dd0-45cb-8869-407257233c61",
      "title": "Session with A Sister",
      "description": "My sister Carrie and I laugh so much during this episode. We talk about the ridiculous rules that we put up with growing up in a cult. 〰️〰️Shanny 👖〰️〰️LinkTreeInstagram TikTokYouTube Facebook www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-12-06T07:57:27Z",
      "duration": "01:16:01.5800000",
      "explicit": false,
      "spotifyId": "2ul05KcA97RX7jUn0ca7Wh",
      "appleId": 1000637656949,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ul05KcA97RX7jUn0ca7Wh",
        "apple": "https://podcasts.apple.com/podcast/session-with-a-sister/id1618657682?i=1000637656949"
      }
    },
    {
      "id": "5edac982-824f-44d0-8ef2-3ed2229804ed",
      "title": "Elisa Flores",
      "description": "🎙️ Join us on the Shanny Pants Show Podcast as we sit down with the incredible Elisa Flores!  Formerly devoted to La Luz del Mundo, Elisa courageously opens up about her journey of breaking free from the manipulative clutches of the cult. In this gripping episode, Elisa shares the challenges she faced after escaping the isolating grip of the sect. Step by step, she reclaimed her freedom, bringing vibrant colors back into her life. Tune in for a powerful conversation that sheds light on resilience, strength, and the indomitable human spirit. 🎧✨ Don\u0027t miss this inspiring episode of triumph over manipulation! 💪 #ShannyPantsShow #BreakFree #Resilience #Survivor #Inspiration ✨Elisa on Instagram Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-11-23T18:32:13Z",
      "duration": "01:03:21.0770000",
      "explicit": false,
      "spotifyId": "1slSNY3GAMYA7wBtRPNqqv",
      "appleId": 1000636355949,
      "subjects": [
        "La Luz Del Mundo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1slSNY3GAMYA7wBtRPNqqv",
        "apple": "https://podcasts.apple.com/podcast/elisa-flores/id1618657682?i=1000636355949"
      }
    },
    {
      "id": "6c1c44ab-1bff-4ebb-84e0-5470f83b9c0f",
      "title": "Pony Jean Parker",
      "description": "Pony Jean ParkerPony and I had such a great candid conversation about the similarities between our cults and the healing that we are both experiencing now. I am starting to read her book today!!! I can\u0027t wait.You should definitely read it too! HOAXHoax is the story of a woman born and raised in the Jehovah\u0027s Witness cult. Her journey from self-realization of the indoctrination she was born into to self-acceptance as she struggles to belong in a world where things are not as they seem. Finding the courage to leave, she loses her entire family and children in the process.A story of battling Alcohol Addiction, Mental Health Diagnoses, and the journey to becoming her true self in the wake of the loss she struggles with. A powerful story of strength, vulnerability, and redemption leaves readers with hope and conviction to embrace their truth as well. When you\u0027re raised in a cult it is hard to escape indoctrination but even harder to find yourself. Follow Pony Jean\u0027s journey of self-realization through loss, addiction, and mental health diagnoses as she allows herself to become vulnerable and worthy of becoming her true self. Instagram Hoax The Book Hoax Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-11-16T14:00:41Z",
      "duration": "00:49:56.9500000",
      "explicit": false,
      "spotifyId": "1sNB4f6OpxipDaEfx0lbUT",
      "appleId": 1000635047590,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1sNB4f6OpxipDaEfx0lbUT",
        "apple": "https://podcasts.apple.com/podcast/pony-jean-parker/id1618657682?i=1000635047590"
      }
    },
    {
      "id": "96dfc452-dd75-4044-ae50-538a79b3bcac",
      "title": "Gerette Buglion Part 2",
      "description": "Part 2 of a 2 part episodeBorn a middle child of seven, it’s not surprising Gerette Buglion became a lifelong educator. From parent-child programs, to Special Ed and Primary School, she’s played many teacherly roles. She has found her sweet spot as a cult recovery educator and facilitator of her signature Writing to Reckon classes that support survivors to create coherent narratives out of the chaos of coercive control. Her memoir An Everyday Cult details her master’s-level training in undue influence. Her greatest professional achievement to date is being co-founder of igotout.org and co-managing the #igotout movement whose mission of education, healing and prevention makes her heart sing. Email: gerette@gerettebuglion.comWebsite: Gerettebuglion.comInstagram: gerette.buglionBook: An Everyday Cult Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-10-20T02:56:14Z",
      "duration": "00:54:01.3250000",
      "explicit": false,
      "spotifyId": "6DQxZorcisunP1djmZYN5Z",
      "appleId": 1000631962233,
      "subjects": [
        "Center For Transformational Learning"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6DQxZorcisunP1djmZYN5Z",
        "apple": "https://podcasts.apple.com/podcast/gerette-buglion-part-2/id1618657682?i=1000631962233"
      }
    },
    {
      "id": "08fe2ad6-ee62-4654-a2e5-88330d567de0",
      "title": "Gerette Buglion Part 1",
      "description": "Part 1 of a 2 part episode Born a middle child of seven, it’s not surprising Gerette Buglion became a lifelong educator. From parent-child programs, to Special Ed and Primary School, she’s played many teacherly roles. She has found her sweet spot as a cult recovery educator and facilitator of her signature Writing to Reckon classes that support survivors to create coherent narratives out of the chaos of coercive control. Her memoir An Everyday Cult details her master’s-level training in undue influence. Her greatest professional achievement to date is being co-founder of igotout.org and co-managing the #igotout movement whose mission of education, healing and prevention makes her heart sing. Email: gerette@gerettebuglion.comWebsite: Gerettebuglion.comInstagram: gerette.buglionBook: An Everyday Cult Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-10-20T02:19:27Z",
      "duration": "00:43:31.0170000",
      "explicit": false,
      "spotifyId": "1fp4MWqPfQBI84tPRMGNJR",
      "appleId": 1000631958810,
      "subjects": [
        "Center For Transformational Learning"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1fp4MWqPfQBI84tPRMGNJR",
        "apple": "https://podcasts.apple.com/podcast/gerette-buglion-part-1/id1618657682?i=1000631958810"
      }
    },
    {
      "id": "2c3f63cc-6307-410e-9d5f-66b42d5c3f96",
      "title": "Andrew Pledger-Religious Abuse",
      "description": "Published March 22, 2022 from https://andrewpledger.mypixieset.com/my-story/(*Trigger Warning - Topics of depression, trauma, abuse and suicidal ideation) Hello, my name is Andrew Pledger, and this is my story of religious trauma. My story is long and complex which is why I’ve been working on a book. This entry will leave out many details and cover the general overview of my experiences, and help people understand how I got here.   \u0022Religious trauma is similar in symptoms to Complex-PTSD. Symptoms of RT Negative beliefs about others Low self-esteem Struggle with emotional regulation Depression, anxiety, grief, and anger NightmaresDisassociation, flashbacks Lack of pleasureFeeling isolated Feeling empty, lost, or directionless Reduced critical thinking Feeling out of place or like you don’t belong  According to Restoration Counseling, Religious Trauma Syndrome is often caused for several reasons by different people. Many people experience RTS as a result of an authoritarian religion or faith community. Individuals suffering from RTS may be struggling with black-and-white thinking, irrational beliefs, difficulty trusting themselves, low self-esteem, or feeling indebted to a group of people. Skewed views of sex, discipline, emotional regulation, relationships, and self-expression are usually present in toxic religious environments\u0022 (Source: Restoration Counseling).- Andrew Pledger(Excerpt taken from https://andrewpledger.mypixieset.com/my-story/)Find AndrewFacebookWebsiteInstagram〰️〰️Shanny 👖〰️〰️YouTubeInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-04-13T07:00:00Z",
      "duration": "01:10:33.2210000",
      "explicit": false,
      "spotifyId": "2NeqKt2E1JjOqSmBNWeoRT",
      "appleId": 1000608744801,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NeqKt2E1JjOqSmBNWeoRT",
        "apple": "https://podcasts.apple.com/podcast/andrew-pledger-religious-abuse/id1618657682?i=1000608744801"
      }
    },
    {
      "id": "8972f09a-b819-4399-97c4-52dbe29731f4",
      "title": "Life gets Better after Devastating Loss",
      "description": "I turned to writing after George, my partner of 32 years, died of cancer in April 2013, and I found myself living alone for the first time at age 50.I needed to know I still existed after a year of being his caregiver, watching him disintegrate, feeling deep in my bones that somehow I was failing him. He was in denial so he thought he was going to recover even as his body abandoned him.I couldn’t fix his illness, not could I jolt him into reality, nor get him to agree to palliative care, nor to involve his parents who were going to lose their only child. I thought I was crawling out of my skin. Through grief therapy, I found out I had post-traumatic stress disorder.Over the next few years, I sort of got better, in dribs and drabs, but the loneliness enveloped me. For 32 years, George and I had eaten dinner together almost every night, then curled up in bed to wake up beside each other each morning. I still wonder, where does all that love go? Is it transmuted into protective energy or is it just gone?I was a practicing attorney for over ten years which lends my writing an acrid tone of bitterness and irony. In an effort to work on that, I also earned an MFA in creative nonfiction from Saint Mary’s College of California in May of 2020.My essays have been published in The New York Times’ “Modern Love” column, HuffPost, Woman’s Day, Good Housekeeping, Elle Decor, and Reader’s Digest, among other publications. My award-winning blog, debbieweissauthor.com dispenses empathy and advice on grief and dating after loss.I’ve been in the California Bay Area since I was six, and currently live in Benicia, CA. I can usually be found walking by the water, on a hiking trail, in a yoga class, or discussing the virtues of cheese with my second life partner, Randal.DebbieFind Debbie here Instagram Website FacebookTikTok〰️〰️Shanny 👖〰️〰️LinkTreeInstagram TikTokYouTube Facebook www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-04-07T06:16:23Z",
      "duration": "00:47:29.0440000",
      "explicit": false,
      "spotifyId": "4sgEXGvIjOFQjCEcxpTTSY",
      "appleId": 1000607817982,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4sgEXGvIjOFQjCEcxpTTSY",
        "apple": "https://podcasts.apple.com/podcast/life-gets-better-after-devastating-loss/id1618657682?i=1000607817982"
      }
    },
    {
      "id": "cb8985a8-f32e-4173-a1fa-a189418fb227",
      "title": "Hospice Nurse Julie",
      "description": "I am editing this episode as I sit next to my Grandpa’s bedside. He was put on hospice a few days ago. I feel so incredibly grateful to have the opportunity to come be with him during his last days on earth. It is absolutely beautiful as I look at his wristband boasting \u002297 yrs\u0022 and think back on how much life he has experienced. It\u0027s been emotional but mostly comforting being here with him. He is ready to see Jesus and many loved ones who are waiting for him. When I interviewed Julie I had no idea that within a few months I would be experiencing so many things she talked about. Thank you Julie for preparing me with this podcast episode and your amazing videos without even knowing what you were doing.I love you Grandpa. You were the greatest example of love I have ever witnessed. You will be missed but I\u0027m so happy you will be at peace soon.https://www.youtube.com/@hospicenursejuliehttps://www.tiktok.com/@hospicenursejulie?lang=enhttps://www.instagram.com/hospicenursejulie/?hl=en〰️〰️Shanny 👖〰️〰️YouTubeInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-03-16T10:19:19Z",
      "duration": "00:42:58.6510000",
      "explicit": false,
      "spotifyId": "3KQo6eVk3YguvFQI39XO9N",
      "appleId": 1000604468346,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3KQo6eVk3YguvFQI39XO9N",
        "apple": "https://podcasts.apple.com/podcast/hospice-nurse-julie/id1618657682?i=1000604468346"
      }
    },
    {
      "id": "83a2ed9e-120c-41cb-8e01-556cd4d780d7",
      "title": "Tyler Measom",
      "description": "Award-winning filmmaker Tyler Measom specializes in high profile, character-based nonfiction films and series.Measom is the co-director of the hit Netflix series Murder Among the Mormons. He also co-directed the documentaries In The Balance: Ballet’s Lost Year and I Want My MTV (Tribeca, A\u0026E), An Honest Liar (Tribeca, ITVS) and Sons of Perdition (Tribeca, Oprah Documentary Club). He has produced the films TAKE (Tribeca, Showtime), the Showtime doc Jesus Town, USA, and the NYTimes documentary ELDER. Measom is the producer and host of the Webby Award winning documentary podcast Was I In a Cult?Tyler is currently directing the three-part documentary series I Wanna Rock: Chasing the 80’s Metal Dream for Paramount\u002B and the music documentary Lost and Found for Boardwalk Pictures.Murder Among the MormonsTyler co-directed, with Jared Hess (Napoleon Dynamite), the Netflix true-crime documentary series Murder Among the Mormons. Produced by: Jannat GargiExecutive producer: Joe Berlinger Sons of Perditionfollows three teenage boys after they escape from the secretive FLDS polygamist sect and must fend for themselves in mainstream America.After premiering at the 2010 Tribeca Film Festival, Sons of Perdition went on to play at over 60 film festivals worldwide and in 20 U.S. theaters. It is part of the OWN Network and is currently on Netflix.Tyler Measom co-directed the film with Jennilyn MertenI Want my MTVco-director, producer, cinematographerI Want My MTV details the implausible genesis of MTV, the rapid rise of the brand, and the global revolution that followed. Features interviews with Sting, Billy Idol, Pat Benatar, Run DMC, Dee Snider, Eurythmics, Tori Amos, Bret Michaels, Norman Lear and many moreThe film  had its World Premiere at the Tribeca Film Festival and is playing on A\u0026E.Variety Review  - “The first thing you want from a history of  MTV is to get dunked in the hot-but-cool nostalgia of it, and the fast, fleet documentary “I Want My MTV” delivers those 1980s goods about as good as you can get.”Was I in a Cult PodcastHosted by Tyler Measom and Liz Iacuzzi, Was I In A Cult? is a documentary-style podcast showcasing individuals who have been in, and most importantly, successfully left a cult. Told first-hand by the experiencer themself, these are raw, riveting and inspirational tales of what it means to be a survivor. ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-02-03T05:34:55Z",
      "duration": "01:05:28.3980000",
      "explicit": false,
      "spotifyId": "58nG6dMSmnp1BoWsWCtQv6",
      "appleId": 1000597816607,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/58nG6dMSmnp1BoWsWCtQv6",
        "apple": "https://podcasts.apple.com/podcast/tyler-measom/id1618657682?i=1000597816607"
      }
    },
    {
      "id": "bde23d2b-6640-4193-9e00-9248a8f61cf3",
      "title": "HELP me HELP my child!",
      "description": "I had the most wonderful time chatting with Lori, Katie and Mallory. These ladies have helped me so much and that was only from following their instagram account. I cannot wait for them to start their podcast! It is going to be packed with so much information to consume! Thank you ladies for making my day by spending some time with me! Taken from: The Childhood Collective WebsiteWe are Lori, Katie, \u0026 Mallory.Lori (left) and Mallory (right) are both child psychologists and Katie (center) is a speech language pathologist. Most importantly, we are moms, just like you.After working with families over a combined total of 40 years, we saw a need to provide ongoing support and education to parents raising children with ADHD. IT\u0027S A LITTLE BIT OF SCIENCE AND A LOT OF HEARThey there!Most of the time, you have a sweet, happy child with ADHD. But when you tell them \u0022no\u0022… cue the hour-long meltdown! It is exhausting to feel like you are walking on egg shells ALL...THE...TIME.On top of that, you are giving your child one million reminders to do simple tasks... things like taking a shower, getting dressed, and doing homework. And the more you remind, the more frustrated they become!At school, your child is receiving poor grades and discipline referrals, and you are getting constant calls from the teacher about behavior problems. No one seems to know what to do or how to help.Are You Ready to Go From Surviving to Thriving?PARENTING YOUR CHILD WITH ADHDDOESN\u0027T HAVE TO BE THIS HARD.Let\u0027s get started!Find THE CHILDHOOD COLLECTIVE:Website Instagram BlogFind Shanny Pants YouTubeInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-01-21T07:44:37Z",
      "duration": "00:53:23.8660000",
      "explicit": false,
      "spotifyId": "1EqPdil3JqxwMwFLF0j4EN",
      "appleId": 1000595849932,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1EqPdil3JqxwMwFLF0j4EN",
        "apple": "https://podcasts.apple.com/podcast/help-me-help-my-child/id1618657682?i=1000595849932"
      }
    },
    {
      "id": "ab9a67b4-513f-491e-8475-3e8bd8d6bbba",
      "title": "Rachel Bernstein",
      "description": "Well Oh My Gosh! What a wonderful conversation I was honored to be a part of. Please don\u0027t miss this conversation where I am able to chat with the amazing Cult specialist Rachel Bernstein. So much goodness!!!! And please go subscribe to her podcast RIGHT NOW!!! She has so much to share.Rachel Bernstein, therapist, and world-renowned cult expert shares her story for the first time. Rachel is the host of the “IndoctriNation” podcast. For 30 years, she has helped former cult members and those who have loved ones in cults and highly manipulative relationships. Rachel has helped people from over 300 cults throughout her career. She provides individual counseling, family counseling, and, when possible, group therapy for former cult members. She also helps families trying to reach out to their loved ones in the cult.She has led workshops and classes at USC in the School of Social Work and the Department of Psychiatry, at California State University at Northridge, and at various colleges and universities in the New York area. She is also a yearly presenter at the International Cultic Studies Association conferences and was a guest lecturer for the Clergy Emergency League and Wisconsin Council of Churches. She has presented at the Pacific Rim Conference for people in Australia, New Zealand, Japan, South Korea, and China who are affected by cults and relationships with narcissists, and, with colleagues, developed the program \u0022Stronger After\u0022, a free 5-session program for initial support and education for people newly out of highly controlling, abusive, and restrictive environments.Connect with Rachel BernsteinWebsite Her Podcast: Support Her Work: LinktreeInstagram〰️〰️Shanny Pants〰️〰️YouTubeTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-01-13T20:46:00Z",
      "duration": "01:19:29.5930000",
      "explicit": false,
      "spotifyId": "7DRGZEvH6bZPb4wLDHWw1c",
      "appleId": 1000594374590,
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7DRGZEvH6bZPb4wLDHWw1c",
        "apple": "https://podcasts.apple.com/podcast/rachel-bernstein/id1618657682?i=1000594374590"
      }
    },
    {
      "id": "1be4ddd1-70c4-498d-a8dc-16a4f18139ea",
      "title": "HACKER update and call for help",
      "description": "If anyone is super duper smart with techy stuff send me an email if you would like to help. shannypantsshow@gmail.com You all are the BEST listeners ever! Thanks for letting me vent. I love you all. Shanny Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-12-08T04:11:20Z",
      "duration": "00:12:00.9530000",
      "explicit": false,
      "spotifyId": "3mf8eChStRnkTOBGsgCm0R",
      "appleId": 1000589334185,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mf8eChStRnkTOBGsgCm0R",
        "apple": "https://podcasts.apple.com/podcast/hacker-update-and-call-for-help/id1618657682?i=1000589334185"
      }
    },
    {
      "id": "27bda6e7-1500-4c4d-bb9e-72b87fc9834a",
      "title": "MAN I am huge!",
      "description": "“My story is long and life-changing. I was in my senior year of nursing school, 24 years old, when I told my husband, Dalton, I was ready for a baby. We had been married for almost 3 years and I was about to graduate to work in a field I loved; I thought it was the perfect time. Though it was the perfect time in our lives, there were a lot of other factors to play into this journey. I am a type-1 diabetic, and PCOS runs in my family. I always knew in the back of my mind I had PCOS due to never having a regular period. With these factors being a part of the journey, I spoke with my endocrinologist who referred me to a specialty OBGYN.I went into my appointment hoping maybe I was already pregnant because I had not had a period that month. Labs were run and an ultrasound was done. I was the furthest from pregnant—I was diagnosed with PCOS. With my diagnosis, I was immediately put on Clomid to help with infertility. I was told I ovulated maybe once a year. I thought, ‘Okay, this will help speed up the process. This will be great!’ I took three doses of Clomid before I got a positive pregnancy test, and then I couldn’t believe it so I took many pregnancy tests. I went in around 9 or 10 weeks pregnant. I thought, ‘Man, I am huge, there has to be more than one baby in there.’ Oh, was I in for a surprise…Read full story Herehttps://www.lovewhatmatters.com/man-i-am-huge-there-has-to-be-more-than-one-baby-in-here-was-i-in-for-a-surprise-type-1-diabetic-gives-birth-to-quadruplets/〰️〰️Shanny 👖〰️〰️LinkTreeInstagram TikTokYouTube Facebook www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-12-02T05:09:02Z",
      "duration": "00:47:01.3280000",
      "explicit": false,
      "spotifyId": "7qVXHdDvwPgCbCPkAX3OPp",
      "appleId": 1000588428669,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qVXHdDvwPgCbCPkAX3OPp",
        "apple": "https://podcasts.apple.com/podcast/man-i-am-huge/id1618657682?i=1000588428669"
      }
    },
    {
      "id": "f6b07e8a-6905-4aac-9c13-5f148ccea1da",
      "title": "Sarah Pashniak-Pashionate About Sleep",
      "description": "I had such an amazing conversation with Sarah. You must listen to this episode if you have toddlers or infants! We talk about mental health and I get some free therapy once again!Bio: Sarah is a busy mom of three who discovered her passion (aka pashion) for sleep when her babies slept like garbage. Sarah has an education degree with a major in psychology. She is also a certified pediatric sleep coach and she works with exhausted parents and helps them get some zzz’s in their life. She knows first hand the impact that a lack of sleep has on the infant/child as well as the parents. Sleep is essential for mental well being and Sarah helps sleep deprived parents get some much needed rest.  From Sarah:I help exhausted and sleep deprived parents give their little ones the precious sleep they need every night. Lack of sleep not only affects the development of our infants and toddlers, it also impacts everyone in the family.  As a mother of twin boys and a little girl, I understand the trickle effect that the lack of sleep has on everyone in the family. After the birth of our twin boys, I struggled with postpartum depression. I felt anxious as a new mother and I began to have difficulty sleeping.When one baby was awake, the other would be asleep. I felt like I was drowning and I was extremely sleep deprived. My husband and I decided to sleep train the boys and I finally began to sleep more!  My babies were well slept and happy. I finally felt like my true self again!\u0022When one baby was awake, the other would be asleep. I felt like I was drowning and I was extremely sleep deprived.\u0022Flash forward a few years and we have another baby!  She really struggled with sleep and so both of us ended up being sleep deprived. When she turned 16 weeks old, I hired a sleep consultant and it was a game changer! I felt so motivated to help other families in similar situations. Sleep coaching has been an investment in my children, my family, my mental health, and my marriage. I would love to help you and your family get the sleep you need and deserve!I am Pashionate about how sleep impacted our children’s lives. I am Pashionate about feeling like my true self.I am Pashionate about SLEEP! www.pashionateaboutsleep.com@pashionateaboutsleep (Instagram) Shanny PantsInstagram TikTokYouTube Facebook www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-17T08:00:04Z",
      "duration": "01:01:08.3750000",
      "explicit": false,
      "spotifyId": "05rrK7CHSUej6LN4eoit00",
      "appleId": 1000586540225,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/05rrK7CHSUej6LN4eoit00",
        "apple": "https://podcasts.apple.com/podcast/sarah-pashniak-pashionate-about-sleep/id1618657682?i=1000586540225"
      }
    },
    {
      "id": "ff805c1f-91c5-4c9b-92e0-01a96d37f2d6",
      "title": "A Rat With No Tail - Alyce Chan",
      "description": "Join me as I chat with Alyce. I learned so many things about being a stand up comedian, I\u0027m wanting to give it try so bad but also a bit freaked out by it. But more importantly I learned about LuLu the tailless rat. Alyce is truly one of a kind and keeps me laughing!Alyce Chan is a writer, producer and stand-up comedian who performs across North America.She has performed at the New York Comedy Festival at Caroline’s on Broadway, Broadway Comedy Club, Soul Joel’s and more. She has garnered over 10 million views on social media and is regularly seen on Scary Mommy. Her dry sense of humor and honest views on parenting with an authentic approach makes her one of the most relatable comedians in the parent stratosphere.Alyce has been featured on CBC Radio, Today Parents and NBC New York.Alyce founded one of the biggest parenting platforms, MOMCOMNYC, which Vogue named among the top 6 funniest parenting Instagram accounts. When she’s not sipping hot coffee, she is probably chasing after her kids slugging cold coffee that was once warm.Alyce on InstagramWebsite 〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-26T07:13:53Z",
      "duration": "00:55:01.1200000",
      "explicit": false,
      "spotifyId": "26ErawlkRM2oO6hbz3sUi3",
      "appleId": 1000583923803,
      "urls": {
        "spotify": "https://open.spotify.com/episode/26ErawlkRM2oO6hbz3sUi3",
        "apple": "https://podcasts.apple.com/podcast/a-rat-with-no-tail-alyce-chan/id1618657682?i=1000583923803"
      }
    },
    {
      "id": "616daf73-d99e-449f-8993-a0139573b1dc",
      "title": "Mallary Hope American Singer-Songwriter",
      "description": "Enjoy my conversation with Mallary Hope where we talk about her beginnings in the music industry and some highlights along the way. We also have some good laughs talking about our families and crazy kiddos. \u0022Mallary Hope is a Georgia-born storyteller who uses music to convey her experiences, and the world around her. At 9-years old, Hope – aptly named by her mom – began to understand that music is at the core of her being, as the sweet sound of Karen Carpenter’s voice on The Carpenters’ “Superstar” brought her to tears. A short couple of years later, Amy Grant’s “El Shaddai” was the first song she learned to play on the guitar, followed by Dolly Parton’s “Coat of Many Colors.” Mallary’s childhood church provided her the first stage where she was able to share her captivating vocals with others. With supporting parents willing to give their daughter every opportunity they could, they moved the family to Nashville, where it didn’t take long for Hope to meet plenty of supporters in the music industry, and for her to make it to one of the most legendary stages the world over – the Grand Ole Opry – where she has performed many times since. “I love Jesus and Johnny Cash,” shares Hope, exemplifying everything about her personal faith she wants to share with the world, along with her deep love and appreciation of music that knows no boundaries. “People want to be encouraged. My songs evoke emotion. It is my desire that my songs can bring meaning and clarity to the various things we all go through in our lives.”Hope, who has been covered by The New York Times, performed on Fox \u0026 Friends, receives airplay from both Christian and Country radio stations, and whose music videos are supported by CMT, has toured alongside artists as varied as Skillet and Darius Rucker, and has written songs for fellow artists like Lauren Alaina, Danny Gokey, Sara Evans, and Faith Hill. And as for the beginning of one of her life’s dearest and most important relationships, her thoughtful boyfriend (at the time) proposed to her on the stage of the Grand Ole Opry House, in one moment marrying multiple things dearest to Hope: her faith, her (future) husband, and of course, music. From the early and lasting influences of Karen Carpenter to Amy Grant to Dolly Parton, Mallary is using that beautiful voice with forever echoes of her deep American South upbringing, along with her overall inescapable platform of music, to share what inspires her, and encourage others along the way.\u0022 Source: https://www.klove.com/music/artists/mallary-hopeFind more information about Mallary Hopehttps://mallaryhopemusic.com/Mallary on Instagram 〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-16T07:08:31Z",
      "duration": "01:02:02.0570000",
      "explicit": false,
      "spotifyId": "3m5WZk6SaS7iL805iyxBGY",
      "appleId": 1000582777155,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3m5WZk6SaS7iL805iyxBGY",
        "apple": "https://podcasts.apple.com/podcast/mallary-hope-american-singer-songwriter/id1618657682?i=1000582777155"
      }
    },
    {
      "id": "66ce7d9e-f7c8-45f3-8b7f-d28d3e533f08",
      "title": "Rescripting the conversation around fertility, infertility, and pregnancy loss",
      "description": "Join Kristyn and I as we discuss our infertility journey\u0027s!Kristyn Hodgdon, is a proud mom of IVF twins. After her own battle with infertility, Kristyn Co-Founded Rescripted, the #1 global media platform for fertility, providing technology tools and resources for wherever you are on your family-building journey. Rescripted is changing the narrative around fertility and burning the word ’normal’ when it comes to what a family is and how one comes to be. Listen into this espiode to gain insight on how to navigate your fertility journey and to know that you are not alone and there are options.WEBSITEINSTAGRAMDear Infertility: Finding Calm When Trying Is Trying PODCAST〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-06T07:01:21Z",
      "duration": "00:56:57.5470000",
      "explicit": false,
      "spotifyId": "74BAsoKxMs3Mbbc1O1wYoJ",
      "appleId": 1000581768144,
      "urls": {
        "spotify": "https://open.spotify.com/episode/74BAsoKxMs3Mbbc1O1wYoJ",
        "apple": "https://podcasts.apple.com/podcast/rescripting-the-conversation-around-fertility/id1618657682?i=1000581768144"
      }
    },
    {
      "id": "a34b2fef-3fe4-4744-8726-842e343e4eac",
      "title": "Roberta Blevins",
      "description": "Roberta Blevins is a former Hun, who left the MLM world in 2017 and began publicly educating and speaking out against it. In her time in MLM, she was involved as a consultant for 3; It Works!, LuLaRoe and Modere, and a customer of many. Since leaving MLM, she has educated herself on the systemic structure of the business model, the psychological manipulation, the seedy underbelly and governmental ties, the cult indoctrination, and the history of Multi Level Marketing. She educates daily on TikTok, and podcasts in her \u0022free time\u0022, talking to the survivors and victims of these commercial cults, disguised as the quickest route to the American Dream. Shanny and Roberta chat about Roberta\u0027s experience with MLMs and the part she played in a lawsuit against a big MLM company. They also chat about her time on the Amazon documentary LuLaRich.www.robertablevins.comIG:therealrobertablevins〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-29T20:59:09Z",
      "duration": "01:08:16.3910000",
      "explicit": false,
      "spotifyId": "0tZgqBj2wGefKyCkLGH2a4",
      "appleId": 1000581078329,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0tZgqBj2wGefKyCkLGH2a4",
        "apple": "https://podcasts.apple.com/podcast/roberta-blevins/id1618657682?i=1000581078329"
      }
    },
    {
      "id": "cc77d6bd-bdf9-447a-af95-4dee7632ecc9",
      "title": "Rebecca from DEVOUR POWER in NYC",
      "description": "\u0022At first glance, Remmey, 28, and West, 31, may look like your average food-obsessed couple, but Devour Power is actually their full-time job: They oversee not only the Instagram account but also Devour Media, a content-creation studio that runs social-media accounts and produces original content for more than 25 restaurants across the U.S. It started in 2012 as Meals and Reels, a blog and Instagram handle where the couple, who were modeling at the time, shared short movie reviews on the Web site and drool-worthy food photos on Instagram. They quickly realized the Instagram account was growing faster than the site, due to their ultra close-up shots of tacos, burgers, and cheesy delights, and by 2015 they’d amassed 75,000 followers and changed their name to Devour Power. The following year, Remmey and West began charging brands for content, realized they could turn their foodie hobby into a business, and quit their day jobs to plot the groundwork for Devour Media. Here, the couple explains how they leveraged their hobby into a successful business.\u0022 Source: Cosmopolitan Link to full Article YouTubeDEVOURPOWER InstagramRebecca InstagramTikTokFacebook〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-22T08:38:10Z",
      "duration": "00:49:25.6550000",
      "explicit": false,
      "spotifyId": "0Ux5jiDg2XUfhnwudhnFsr",
      "appleId": 1000580282783,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Ux5jiDg2XUfhnwudhnFsr",
        "apple": "https://podcasts.apple.com/podcast/rebecca-from-devour-power-in-nyc/id1618657682?i=1000580282783"
      }
    },
    {
      "id": "ada4cd30-f214-4bbb-9149-77a1c116362a",
      "title": "Jordan Reid",
      "description": "About Me, Real QuickMy name is Jordan Reid, and I’m a mother of two living in Southern California. I was born in NYC, studied cognitive neuroscience at Harvard, and then did the next logical thing: I drove an ancient convertible across the country to Hollywood, and became an actress. When my acting career went down in flames a few years later (it’s a hell of a story; you should check it out), I spent a few years excelling in the fields of Feeling Sorry For Myself and Wailing. Finally, I did what any responsible adult with a stack of monthly bills should do: I decided to quit my 9-to-5 job, and started a blog.Since 2009, I’ve been writing daily about my experiments (and frequent failures) in fashion, beauty, home renovation, parenting, and decor. Ramshackle Glam has been featured in publications including Time Magazine, Cosmopolitan, the New York Observer, The Huffington Post, and Lonny, and has spun off into three web series and six books (we just put the seventh into contract!). I also write for a bunch of other outlets, including Newsweek, Romper, and Mashable. ( From the Ramshackle Glam website)THE WEBSITE Ramshackle GlamGET the BOOKS〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-15T07:00:29Z",
      "duration": "00:53:54.6120000",
      "explicit": false,
      "spotifyId": "6ErG0l9BvLrj9nDSv5ylyf",
      "appleId": 1000579547450,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ErG0l9BvLrj9nDSv5ylyf",
        "apple": "https://podcasts.apple.com/podcast/jordan-reid/id1618657682?i=1000579547450"
      }
    },
    {
      "id": "bcf3ba08-9c2d-44c6-b8cf-4f3ab10b16e5",
      "title": "Chauntee\u0027 Pitts ~Life after Trauma",
      "description": "⚠️Trigger warning Abuse, suicide, self harm, ⚠️Don\u0027t miss my conversation with Chauntee\u0027 Pitts. We were both raised in the same religious cult but in different \u0022assemblies\u0022. We had a great time chatting for the first time and reminiscing about what life on the inside was like, how it differed for us and how recovery is going. I am so honored that she shared her story with me. Chauntee receiving her Teacher of the Year award https://youtu.be/crXTiXtWEXgDisclaimer: Podcast guest stories are their own. I have not and will not verify information that my podcast guests share. They are free to share their story from their point of view with no judgment from me. 〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-08T07:00:00Z",
      "duration": "01:00:28.0680000",
      "explicit": false,
      "spotifyId": "3GArSi9q70G8cqrX63kybe",
      "appleId": 1000578796383,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3GArSi9q70G8cqrX63kybe",
        "apple": "https://podcasts.apple.com/podcast/chauntee-pitts-life-after-trauma/id1618657682?i=1000578796383"
      }
    },
    {
      "id": "3fe93bc6-c72a-46a9-9980-cbe4bc836b7b",
      "title": "My Thoughts About Stuff- Tova Leigh",
      "description": "About TovaTova was born in Israel. She practiced law and worked as an Employment Attorney for two years before moving to the UK in 2006 to pursue a career in performing arts.Tova went on to write, act and produce several short films and a TV pilot. She started her successful blog - My Thoughts About Stuff - in 2015 where she shared the struggles she faced as a mother. In less than three years her blog made her into an internet sensation with her blunt rants about motherhood, marriage, sex and all things taboo. Her viral online series \u0027Mom Life Crisis\u0027 which documents her own mid life crisis resonated with millions of women across the world and later became a documentary film on Amazon Prime Video.In March 2019 Tova released her first book ‘F*cked at 40: Life Beyond Suburbia, Monogamy and Stretch Marks’. Tova takes the reader on her journey of rediscovering who she is after motherhood and beyond the norms society forces upon women, whilst encouraging them to break free and just be themselves. Tova\u0027s second book ‘You Did What?’,  a collection of funny and outrageous confessions from every day people from around the world, was released in September 2021. Tova also co-hosts a weekly podcast Till Death Do Us Pod with her husband Mike and has performed two successful one woman comedy shows around the world.Tova has created numerous viral videos about feminism and women’s rights. She is dedicated to promoting gender equality and championing women through her live performances and books, as well as her work as a podcaster and digital creator.She is a mother of three girls and lives together with her family in London.Find TovaFacebook InstagramYouTube〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-01T07:00:00Z",
      "duration": "00:48:39.0260000",
      "explicit": false,
      "spotifyId": "73IZJAEbWCgtfg9PZVzdfd",
      "appleId": 1000578003583,
      "urls": {
        "spotify": "https://open.spotify.com/episode/73IZJAEbWCgtfg9PZVzdfd",
        "apple": "https://podcasts.apple.com/podcast/my-thoughts-about-stuff-tova-leigh/id1618657682?i=1000578003583"
      }
    },
    {
      "id": "1ad5718b-9b23-4d89-9a64-f59b1e6f89e5",
      "title": "Now I Am Known, Seen, and Heard- PETER MUTABAZI Part TWO",
      "description": "Part 2 Interview with Peter MutabaziAs a child I ran away from an abusive home and was helped by the kindness of strangers. As an adult I found myself in a position of being able to help foster children, so I began taking children into my home years ago to give back what was so freely given to me. It\u0027s my mission to give back as much as I can to the vulnerable among us. That\u0027s what drives Now I Am Known: to bring a message of hope to the hopeless, the same message I needed so badly to hear as a child. That is why we will be partnering with foster care agencies to give away a plush puppy with the message \u0022Now I Am Known, Seen, and Heard\u0022 to at-risk children across the country.I WAS ONE OF THEMI am Peter Mutabazi And this is my story.As a child in Uganda, I grew up with shelter, food and clothing scarcity. But more than that, I grew up with safety scarcity. I feared for my life from a father who threatened me, and frequently called me “garbage” and “useless.” Parents are supposed to protect their children. When my father didn’t, I ran away from home to live on the streets in Kampala. Four years of doing whatever I needed to survive, a young couple:… saw me… heard me… told me I wasn’t alone… and showed me that I mattered.They sent me to school. They put a roof over my head. They clothed me. And fed me three meals a day. And allowed me to be a child. So I could grow up to do the same for others.I decided to do for other children what this one couple did for me.📒 GET THE BOOK NOW I AM KNOWN 📒Find Peter on social mediaYouTube Facebook Foster Dad FlipperInstagram @fosterdadflipper〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-08-26T08:22:00Z",
      "duration": "00:46:21.8310000",
      "explicit": false,
      "spotifyId": "47nf8v4WHKYslWfo4ar8E6",
      "appleId": 1000577418317,
      "urls": {
        "spotify": "https://open.spotify.com/episode/47nf8v4WHKYslWfo4ar8E6",
        "apple": "https://podcasts.apple.com/podcast/now-i-am-known-seen-and-heard-peter-mutabazi-part-two/id1618657682?i=1000577418317"
      }
    },
    {
      "id": "987669b5-1663-4819-970e-34cd59df92ef",
      "title": "Now I Am Known, Seen, and Heard- PETER MUTABAZI Part ONE",
      "description": "Part one of interview with Peter MutabaziAs a child I ran away from an abusive home and was helped by the kindness of strangers. As an adult I found myself in a position of being able to help foster children, so I began taking children into my home years ago to give back what was so freely given to me. It\u0027s my mission to give back as much as I can to the vulnerable among us. That\u0027s what drives Now I Am Known: to bring a message of hope to the hopeless, the same message I needed so badly to hear as a child. That is why we will be partnering with foster care agencies to give away a plush puppy with the message \u0022Now I Am Known, Seen, and Heard\u0022 to at-risk children across the country.I WAS ONE OF THEMI am Peter Mutabazi And this is my story.As a child in Uganda, I grew up with shelter, food and clothing scarcity. But more than that, I grew up with safety scarcity. I feared for my life from a father who threatened me, and frequently called me “garbage” and “useless.” Parents are supposed to protect their children. When my father didn’t, I ran away from home to live on the streets in Kampala. Four years of doing whatever I needed to survive, a young couple:… saw me… heard me… told me I wasn’t alone… and showed me that I mattered.They sent me to school. They put a roof over my head. They clothed me. And fed me three meals a day. And allowed me to be a child. So I could grow up to do the same for others.I decided to do for other children what this one couple did for me.📒 GET THE BOOK NOW I AM KNOWN 📒Find Peter on social mediaYouTube FacebookInstagram 〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-08-26T03:41:11Z",
      "duration": "00:38:38.0270000",
      "explicit": false,
      "spotifyId": "47W7hIvZMVskxZeWg9Bfkv",
      "appleId": 1000577399175,
      "urls": {
        "spotify": "https://open.spotify.com/episode/47W7hIvZMVskxZeWg9Bfkv",
        "apple": "https://podcasts.apple.com/podcast/now-i-am-known-seen-and-heard-peter-mutabazi-part-one/id1618657682?i=1000577399175"
      }
    },
    {
      "id": "c9330ea2-fcad-4575-8f1e-13467145125f",
      "title": "The One Where It\u0027s all About Me",
      "description": "Since birth, I have had the unbelievable advantage to be immersed in a very multicultural environment. Parents of different nationalities, and moving countries every couple of years opened my eyes to the world. I couldn’t wish for a richer life. I learned the art of striking a conversation from a very young age, curious about cultures and communities, questioning everything and everyone across my path, in what I believe is an attempt to understand what guides behaviors and opinions. ​As I started building a family of my own, and as a direct reflection of my life choices, I found myself settling in the Netherlands.  ​But the urge to meet new people and change surroundings had to be met. That urge manifested itself every few years through my longing for new beginnings. I temporarily satisfied this urge by moving house. When my family got larger, I changed jobs. ​With it, I found myself surrounded by people with fabulous diverse individual stories and passionately driven by their personal aspirations. ​They are my inspiration.  NagzAbout the PodcastI have always imagined life as a tree.Born from the roots you inherit and raised in a system you experience, there comes a time where you face the necessity of making choices as you grow. At each intersection, you get a number of possible branches to jump on. If you visualize  this, you can see the endless possibilities that lie ahead of you. In life though, you discover the strength and abundance of the knots, twigs, branches and leaves, only when you have chosen a path or started your journey.  And you do it with the hope that it will lead you to a place of personal flourishing, closer to blue skies and the warm shining sun.  This podcast series is all about sharing our stories. The failures, the successes, the choices we made and what we want to do next. It’s a means to inspire others and a way to be held accountable. Check out our episodes here. nagz@chroniclesofus.orgChronicles Of Us Instagram〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-08-05T04:46:59Z",
      "duration": "01:16:30.0270000",
      "explicit": false,
      "spotifyId": "5ZdEQFcmq2XJoq5L1IuN9W",
      "appleId": 1000575088514,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZdEQFcmq2XJoq5L1IuN9W",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-its-all-about-me/id1618657682?i=1000575088514"
      }
    },
    {
      "id": "1bd344e5-5b62-4ac3-b16d-f69dc43d56c7",
      "title": "The One Where Our Teens need Jobs",
      "description": "Vanessa and I have a great conversation about her idea to to start the business CHATBOOKS! She has children ranging for the ages 14-27 so she shares how motherhood has been for her and I beg her for all the advice! I need to listen to her advice in this podcast over and over again every day and possibly tattoo it to my forehead.  \u0022We started Chatbooks in 2014 as a small family affair. I didn’t have time to make scrapbooks–or even print photos!–of my seven kids. But I was reminded of how much children love photos of their everyday lives when a preschool teacher gave my youngest son an album of the year. Each night, when I went to tuck him in, he was looking at the photos. I didn’t have time for another project, but I did post photos on Instagram for my family and friends to see. Could I turn those into photo books—automatically? And that’s why my husband, Nate, and I started Chatbooks.\u0022VANESSA QUIGLEY, CO-FOUNDEROur Mission is to Strengthen Families“Today, there are more than 135 of us working at Chatbooks, but we’re never going to let ourselves become a faceless big company—no matter how much we grow, we’re determined to “stay small.” We hope you’ll think of us the way we think of you: Not as \u0022a company\u0022 and \u0022a bunch of customers” but as real people and individuals. From the part-time, stay-at-home moms and dads all around the country (like Heather in Chicago, Megan in Portland, and Katie in Alaska) who provide customer support, to the hard-working crews in the print shop and our talented software developers, we love building something that matters to you. Our team has been thinking a lot about what motivates us, and it comes down to this:Our mission is to strengthen families.This is really important to us and we hope you can sense it in everything we do. Thank you once again for letting us do this work we love and believe in. It’s a huge privilege and we’re grateful for you everyday.\u0022NATE QUIGLEY, CEO \u0026 CO-FOUNDERFind out all things about Chatbooks and Vanessa at The MomForce Podcast@vanessaquigleyCHATBOOKS.comUse Code podcast20 for 20% off at chatbooks.com〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-07-22T04:31:03Z",
      "duration": "01:02:25.0970000",
      "explicit": false,
      "spotifyId": "2VdhTIkRdMLyCRrcNKqJKV",
      "appleId": 1000570769537,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2VdhTIkRdMLyCRrcNKqJKV",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-our-teens-need-jobs/id1618657682?i=1000570769537"
      }
    },
    {
      "id": "195692e1-8fd8-41f6-aa33-6957b9da53c1",
      "title": "The One Where He Goes from NOBODY to FAMOUS",
      "description": "I had such a fun time chatting with this amazing artist! I am so fascinated by the music industry and I got a peek into what that looks like for AJ Smith! Go listen to his music, it\u0027s fantastic! My favorite songs of his are NOBODY and FAMOUS!Denver-born, and recently relocated from NYC to Nashville, AJ Smith’s unconventional path to becoming a pop artist is reflected throughout his music, which has the uncanny ability to evoke a nostalgic desire for dramatic pop of decades past while sounding modern, fresh, and in-the-moment emotional. A flare for the dramatic is likely written into his DNA - AJ’s father ran away and literally joined the circus (as a promoter who was unafraid to step into the ring or even the “Globe of Death” for the sake of the show), while his Great Great Uncle was famed Cuban pianist Ernesto Lecuona, who composed the famed standard “Malagueña”. It\u0027s no surprise then, that Smith’s songwriting and performance abilities have earned multiple awards, including the prestigious Abe Olman Scholarship from the Songwriters Hall of Fame and a semi-finalist ranking in the 2020 International Songwriting Contest. Recent highlights include making his national TV debut on The Kelly Clarkson show, consistent airplay on SiriusXM, the cover feature as Performer Magazine’s Artist of the Month, collaborating with Martin Guitar’s launch of a new line of ukuleles (which included teaching a SpaceX astronaut how to play a Black Pumas song in space!)...and stories in American Songwriter, Good Morning America, CBS Radio, Spin Magazine, and more. AJ Smith YOUTUBEAJ Smith FacebookAJ Smith Instagram AJ Smith Website〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-07-14T08:00:14Z",
      "duration": "00:52:59.0750000",
      "explicit": false,
      "spotifyId": "4fUSmxJjEbRSL8aiLvTQwh",
      "appleId": 1000569872555,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fUSmxJjEbRSL8aiLvTQwh",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-he-goes-from-nobody-to-famous/id1618657682?i=1000569872555"
      }
    },
    {
      "id": "ead410d2-c108-4099-8036-3f56653abfb1",
      "title": "The One Where She Escapes The CULT Children of God PART TWO",
      "description": "⚠️TRIGGER WARNING⚠️ Verity speaks of physical, sexual and mental abuse as well as suicide attempts ⚠️I am a survivor who was born into the abusive cult formerly known as The Children Of God (currently known as The Family International) and am seeking justice - Verity CarterWho are the Children of God? The cult rampant with sexual abuse with communes around the world and celebrity members   The Children of God sect was founded in 1968 by minister David Brandt Berg. Originally known as Teens of Christ, Berg soon changed the name to Children of God in the hopes of appealing to a wider crowd that included vulnerable youths looking for a support and comfort. By targeting these groups, Berg was able to quickly expand his \u0027religion\u0027 and by 1969, he had more than 50 members in his \u0027family\u0027. Communes were soon set up around the world, with members moving in together to form their own \u0027families\u0027 of Children of God converts - and by 1972, there were 130 \u0027communities\u0027 of full-time members around the globe.  The Children of God were asked to give up their jobs and devote themselves full time to preaching Berg\u0027s teachings and proselytizing for additional members - while Berg himself lived in seclusion, sharing his prophecies through written letters known as \u0027MO\u0027s Letters\u0027. But while on the outside, the group claimed to be spreading the world of God - and of Berg - internally, members were encouraged to partake in incestuous sexual relationships with minors.  In 1976, female members began being urged to take part in a practice known as \u0027flirty fishing\u0027, which saw them forced to \u0027show God\u0027s love\u0027 by having sexual relations with potential members in order to lure them into the group as full-time converts. Hollywood actors Rose McGowan and Joaquin Phoenix have both shared details of their own early childhood experiences in the sect.Source: Timeline Twitter @VerityCarter22Instagram @verity.carter.22Children of God Survivors @cogtfisurvivorsBring The Family International (aka The Children of God) and Karen Zerby to JusticeSafe Passage FoundationResourcesChildren of The Cult Documentary 〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-07-07T08:25:29Z",
      "duration": "00:48:31.2680000",
      "explicit": false,
      "spotifyId": "6hvlxoq8b8Wyt03bwql3iF",
      "appleId": 1000569119282,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6hvlxoq8b8Wyt03bwql3iF",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-she-escapes-the-cult-children-of-god-part-two/id1618657682?i=1000569119282"
      }
    },
    {
      "id": "696a9e08-f8d0-4b8a-b2f8-da1b578f2784",
      "title": "The One Where She Escapes The CULT Children of God PART ONE",
      "description": "⚠️TRIGGER WARNING⚠️ Verity speaks of physical, sexual and mental abuse as well as suicide attempts ⚠️ I am a survivor who was born into the abusive cult formerly known as The Children Of God (currently known as The Family International) and am seeking justice - Verity CarterWho are the Children of God? The cult rampant with sexual abuse with communes around the world and celebrity memebrs  The Children of God sect was founded in 1968 by minister David Brandt Berg. Originally known as Teens of Christ, Berg soon changed the name to Children of God in the hopes of appealing to a wider crowd that included vulnerable youths looking for a support and comfort. By targeting these groups, Berg was able to quickly expand his \u0027religion\u0027 and by 1969, he had more than 50 members in his \u0027family\u0027. Communes were soon set up around the world, with members moving in together to form their own \u0027families\u0027 of Children of God converts - and by 1972, there were 130 \u0027communities\u0027 of full-time members around the globe.  The Children of God were asked to give up their jobs and devote themselves full time to preaching Berg\u0027s teachings and proselytizing for additional members - while Berg himself lived in seclusion, sharing his prophecies through written letters known as \u0027MO\u0027s Letters\u0027. But while on the outside, the group claimed to be spreading the world of God - and of Berg - internally, members were encouraged to partake in incestuous sexual relationships with minors.  In 1976, female members began being urged to take part in a practice known as \u0027flirty fishing\u0027, which saw them forced to \u0027show God\u0027s love\u0027 by having sexual relations with potential members in order to lure them into the group as full-time converts. Hollywood actors Rose McGowan and Joaquin Phoenix have both shared details of their own early childhood experiences in the sect.Source: Timeline Twitter @VerityCarter22Instagram @verity.carter.22Children of God Survivors @cogtfisurvivors Bring The Family International (aka The Children of God) and Karen Zerby to JusticeSafe Passage FoundationResources Children of The Cult Documentary 〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-06-30T08:29:13Z",
      "duration": "00:42:36.3950000",
      "explicit": false,
      "spotifyId": "0qLLJZRM0Ur2BRhOaWawSs",
      "appleId": 1000568242258,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0qLLJZRM0Ur2BRhOaWawSs",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-she-escapes-the-cult-children-of-god-part-one/id1618657682?i=1000568242258"
      }
    },
    {
      "id": "8a14bb1e-f24b-4ad7-a8c6-c02e4107076a",
      "title": "The One Where She is The Black Fairy Godmother",
      "description": "Fairy Dust Isn\u0027t Always Shiny...The Black Fairy Godmother Foundation, founded by Simone Gordon, is a 501(c)(3) non-profit organization created to help Black and Brown marginalized families. Our foundation uses the power of networking, social media, and influence to connect families in need with people that can help.We have a variety of programs to meet the needs of those who need assistance. Our goal is to not only provide relief but help them to get to a place of stability and equip them with the proper tools and support so they may sustain themselves going forward.https://www.theblackfairygodmother.org/https://www.facebook.com/theblackfairygodmotherofficialhttps://www.instagram.com/theblackfairygodmotherofficial/〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-06-23T19:31:48Z",
      "duration": "00:47:05.2730000",
      "explicit": false,
      "spotifyId": "4frf58rfbEMIdpPIKUvx4F",
      "appleId": 1000567533844,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4frf58rfbEMIdpPIKUvx4F",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-she-is-the-black-fairy-godmother/id1618657682?i=1000567533844"
      }
    },
    {
      "id": "1fc5dc75-73a2-40c7-8324-c530bb952b02",
      "title": "The One Where I Get All The Therapy",
      "description": "Dr. Stephanie Caine joins me today to chat about mental health and parenting. I had so much fun and gained so much from our conversation! Dr. Caine has worked in education as a high school counselor for 14 years in both public and Christian school settings in Atlanta, Georgia. During her time in education, Dr. Caine served in various leadership roles including Department head, Director of Diversity, and College Counseling. Dr. Caine previously taught in the Master’s in Counseling program at Richmont Graduate University in Atlanta, Georgia. Additionally, Dr. Caine is a licensed professional counselor in the state of Georgia. Dr. Caine has led several trainings to school faculty and multiple conferences in the areas of equity and diversity, parenting skills, suicide prevention, relationships, and bullying prevention.Find Dr. Caine Website www.renewcc.netEmaildrsteph@renewcc.netInstagram@drsteph.renewcc〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-06-17T04:17:19Z",
      "duration": "01:01:22.7160000",
      "explicit": false,
      "spotifyId": "4SE9nJYUc5atfdMKMHCX7s",
      "appleId": 1000566721870,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4SE9nJYUc5atfdMKMHCX7s",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-i-get-all-the-therapy/id1618657682?i=1000566721870"
      }
    },
    {
      "id": "f9d879fe-297e-485c-806b-753ab891a538",
      "title": "The One Where He Brings all the Hope",
      "description": "Carlos Whittaker is a People’s Choice Award winner, a former recording artist signed to a major label, a social media maven, and currently spends the majority of his time writing books and speaking on stages around the world. It really began when the Whittaker’s found their family in America’s spotlight with appearances on shows like CBS Early Morning, The Today Show and more when their viral video “Single Ladies Devastation” went viral. But for Carlos, his wife Heather and their three children, this viral moment was just a snapshot of the bigger picture.HUMAN HOPE PODCASTIn a time where humanity is desperate to find hope, Carlos leads us in conversations that bring us just that. From fun discussions about everyday joy to polarizing and challenging topics, Carlos shows even the most calloused heart that there is still hope in humanity.Instagram @loswhitBOOKSMoment MakerEnter WildKill The SpiderPress PlayFor more on Carlos and his books visit www.CarlosWhittaker.com〰️〰️Shanny 👖〰️〰️YouTubeFacebookInstagramTikTokwww.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-06-09T07:08:00Z",
      "duration": "00:46:11.1470000",
      "explicit": false,
      "spotifyId": "3D42o2xydlXe8gwMHM1IVH",
      "appleId": 1000565746945,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3D42o2xydlXe8gwMHM1IVH",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-he-brings-all-the-hope/id1618657682?i=1000565746945"
      }
    },
    {
      "id": "a5551094-4560-4d9f-af58-e6442546b82e",
      "title": "The One With the Yellow Butterfly",
      "description": "⚠️ Trigger warning* ⚠️  Suicide/Mental health ⚠️ Rachel Baribeau brings positivity and purpose to students, professionals and parents across the country through her movement I\u0027m Changing the Narrative.Presented in an encouraging and supportive environment, Rachel speaks about the power to change the narrative and to find purpose in life.In 55 minutes, Rachel covers themes such as leadership, mental health, self-care, domestic violence prevention, social justice and interpersonal relationships. Everyone is challenged to live a life of Purpose, Passion and Platform.In 2016, sports broadcaster, Rachel Baribeau, penned a piece for GridironNow.com entitled, “College Football is Breaking My Heart.” The game she loved was becoming unrecognizable. Negative news stories dominated the game and no campus seemed immune. Most broadcasters would have left it at that. Not Rachel.Rachel developed I\u0027m Changing the Narrative with student athletes in mind and a belief that one crooked course made straight is everything. One misstep not taken means one less victim in the world. And one less life thrown away because of a split second bad decision. She challenges each person to respect, protect and cherish others. to serve as a role model, and to value themselves with self-love. She encourages each person to leave a legacy by using their platform to make a difference in this world.Find Rachel on instagram and facebook @imchangingthenarrativeTwitter @RachelBaribeauhttps://www.imchangingthenarrative.org/https://www.youtube.com/channel/UCeNbrK5Qeze6eowBbCjQfKgSuicidePreventionLifeline.orgDrugHelpLine.orgMentalHealth.govGiveAnHour.orgMentalHealth.VA.gov〰️〰️Shanny 👖〰️〰️LinkTreeInstagram TikTokYouTube Facebook www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-06-02T07:11:32Z",
      "duration": "01:00:56.0450000",
      "explicit": false,
      "spotifyId": "3ufOXUHKiMCUmULDxlYEPZ",
      "appleId": 1000564933452,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ufOXUHKiMCUmULDxlYEPZ",
        "apple": "https://podcasts.apple.com/podcast/the-one-with-the-yellow-butterfly/id1618657682?i=1000564933452"
      }
    },
    {
      "id": "7ecfa1fc-51a3-4f0e-a931-a9aa8c108d6e",
      "title": "The One Where He Is Called a Cult Leader",
      "description": "Can you be a softie and tough as nails? YES! Can you pound nails by day while hammering good values? YES! Can you turn being bullied as a kid, into a Be Better campaign as an adult? YES! Scott. D. Henry does all that and more.  Dad, husband, construction worker, Tik Tok sensation, ambassador for the non-profit Stomp Out Bullying and now, the winner of season two “Tough as Nails.\u0022 Scott D. Henry turned a simple favor for his step daughter into over 2 million followers on social media platforms. And he\u0027s using his power, for good.  \u0022Be Better\u0022 is Scott\u0027s mantra. He lives it. He teaches it. He markets it on his website ScottDHenryBeBetter.com. And he hopes to change the world with it.  As social media popularity rises, so does online bullying. Scott gives kids, and adults, something else to strive for. His \u0022Be Better\u0022 campaign gives hope, coping tools, and a smile to people searching for something positive. You can find Scott D. Henry www.ScottDHenryBeBetter.com  TikTok @scottdhenryInstagram @scottdhenry31〰️〰️Shanny 👖〰️〰️ @officialshannypants on Instagram and TikTok Shanny Pants on YouTube and Facebook www.ShannyPantsShow.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-05-26T12:00:53Z",
      "duration": "00:53:02.1840000",
      "explicit": false,
      "spotifyId": "6g5QaM0k6jUQS974uzLz2Y",
      "appleId": 1000563991970,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6g5QaM0k6jUQS974uzLz2Y",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-he-is-called-a-cult-leader/id1618657682?i=1000563991970"
      }
    },
    {
      "id": "219d7864-38f7-4d50-94e3-387ed4e6a50b",
      "title": "The One Where She Escaped NXIVM the Cult",
      "description": "*TRIGGER WARNING* This episode includes subjects of sexual, mental and physical abuse. Join me today as Sarah shares with us her story of escaping NXIVM and exposing the cult leader. Sarah Edmondson is a Canadian actress and playwright who has starred in the CBS series Salvation and more than twelve films for the Hallmark Channel and Lifetime. She is also a well-established voice-over artist for popular series such as Transformers: Cybertron and My Little Pony: Friendship Is Magic. In 2005, when NXIVM, a personal and professional development company, promised to provide the tools and insight Sarah needed to reach her potential, she was intrigued. Over her twelve-year tenure, she went from student to coach and eventually operated her own NXIVM center in Vancouver. Questions kept coming up about the organization’s rules and practices, which came to a head in 2017 when she accepted an invitation from her best friend to join DOS, a “secret sisterhood” within NXIVM.In 2019, Sarah published Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life, with Kristine Gasbarre. In this tell-all memoir, she shares her story from the moment she takes her first seminar to her harrowing fight to get out of NXIVM, collaborate with the FBI, help others, and heal.Sarah’s full story as a whistleblower is featured in the CBC podcast “Uncover: Escaping NXIVM” (downloaded over 25 million times) and “The Vow”, the critically acclaimed HBO documentary series on NXIVM.Now with the launch of her own podcast, “A Little Bit Culty,” Sarah is keeping the conversation going by exploring the fads, beliefs, and trends that blur the line between devotion and dysfunction. Co-hosted by her husband and fellow NXIVM whistleblower Anthony “Nippy” Ames, the podcast is part conversational coffee date and part deep dive on everything from Waco to lululemon. And while there was nothing small about Sarah’s cult experience, “A Little Bit Culty” is grounded in her mission to help people understand, heal from, and avoid abusive situations, one little red flag at a time.Find Sarah on IG @sarahedmondson @alittlebitculty @igotout_org Follow the #igotout❇️Get her book here https://www.sarahedmondson.com/book✳️Check out her amazing list of resources https://www.sarahedmondson.com/resources❇️ Listen to her Podcast https://www.alittlebitculty.com/ Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-05-19T07:01:26Z",
      "duration": "01:03:48.0880000",
      "explicit": false,
      "spotifyId": "0oJzQToOF5BKhPU57GoIpJ",
      "appleId": 1000562467952,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0oJzQToOF5BKhPU57GoIpJ",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-she-escaped-nxivm-the-cult/id1618657682?i=1000562467952"
      }
    },
    {
      "id": "c9e511d4-356c-4e3d-b9c3-79ce1b8613be",
      "title": "The One Where an Adoption Journey Gets Messy",
      "description": "On this episode I become a mom! But it never really is that simple is it? My son\u0027s birth mom joins me today as we discuss the highs and very low lows of our adoption journey from each of our perspectives. Every adoption story is so different, each one is unique. I am blessed that Patricia and I can now call each other friends. But it definitely didn’t start that way.Patricia is a 37 year old mother and wife. She is raising her daughter and two stepson’s. She is also the mother of two adopted children. Find Shanny on the following platforms:https://www.instagram.com/officialshannypants/?hl=enhttps://www.tiktok.com/@officialshannypants?lang=enhttps://www.facebook.com/officialshannypantshttps://www.youtube.com/channel/UCDK_2Yk_aYNw6LExW5jlT0ghttps://linktr.ee/officialshannypantsShannon is a 41 year old wife and mom of three kiddos ages 14, 10 and 8. Shannon has enjoyed a social media account for years sharing her humor with friends and family. When one of her videos went viral it opened up a whole new world for her. She now has many viral videos and hundreds of thousands of social media followers. She shares her struggles of growing up in a cult, battles through years of infertility that ended in a hysterectomy and finally her journey to parenthood through foster care and adoption. Shannon is currently writing a memoir and her very own podcast is now available. She has created a platform where she shares the struggles of life in a humorous way as part of her self prescribed therapy and is excited to share even more through her book and podcast. Her podcast is interview style with interviews including people who have left cults, suffered with infertility, been involved with the foster care or adoption systems and those who have suffered with physical or mental health disorders. She absolutely loves learning from others\u0027 life experiences and is enjoying bringing those stories to a larger audience.  Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-05-12T07:52:59Z",
      "duration": "01:00:11.6370000",
      "explicit": false,
      "spotifyId": "4LtcYnQOIwTGhUbsSfE20B",
      "appleId": 1000560718134,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LtcYnQOIwTGhUbsSfE20B",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-an-adoption-journey-gets-messy/id1618657682?i=1000560718134"
      }
    },
    {
      "id": "811538be-a2e3-43c1-ae0f-7395434772a5",
      "title": "The One Where Kay Starts the Show",
      "description": "Kayla Cotten shares her story with us today. She was born with mitochondrial, raised in a cult, is a rape survivor and has become a huge voice in antirape advocating. She is now living her last days in hospice where she is finally pain free for the first time in her life. She has so much joy and was such a huge encouragement to me during our conversations. She hopes to feel up to another interview soon. Please go give her a bit of encouragement on TikTok and Instagram @negukay I know she has been loving all the messages she receives.The following is an update from Kay\u0027s instagram post the week she was put on hospice.•My pain has been controlled. My longest stretch of control pain in I don’t know how many years. Amazing win•New medicine to help with memory, speech, \u0026 hallucinations has been worth everything•My hospice team has told me my body will experience a bit of a “perk” as my body adjusts to comfort after so long of discomfort. They cautioned me not to get excited but to enjoy the good days that will come with that time•All the comfort meds knock me out. We are adjusting so hoping this won’t be the normal, but 20-22 hours of sleep a day is a normal. My friends \u0026 family help me make posts \u0026 tiktoks which helps me feel useful while I still have a coherent brain💕•From now on I don’t know how much I’ll be responding to DMs. Feel free to still send them, even if I see them weeks \u0026 weeks later. The love is so felt❤️•My family, friends, \u0026 tiktok family have blown away with the love \u0026 support. Y’all have me in tears multiple times a DAY. I wish I had the energy to personally thank each one of you, but know I see comments \u0026 messages \u0026 they mean the worldBeing that I’m still relatively drugged there’s a good chance I left something out or forgot something lol. But y’all know my heart.Love yall \u0026 NEGU (never ever give up)Kay Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-05-05T07:12:48Z",
      "duration": "00:53:00.6170000",
      "explicit": false,
      "spotifyId": "6UkSx8eRop8dyDD5tncdm8",
      "appleId": 1000559675792,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6UkSx8eRop8dyDD5tncdm8",
        "apple": "https://podcasts.apple.com/podcast/the-one-where-kay-starts-the-show/id1618657682?i=1000559675792"
      }
    },
    {
      "id": "69ab2c48-26df-4edc-9763-39dbba91aab6",
      "title": "The Trailer",
      "description": "What if we took the time to get to know a person? Not just the first impressions but their story. I’m Shanny Payton and Each week I will bring to you stories from experts, survivors, people from my past and all around incredible humans! We will cover many topics that I myself have traveled through including living in a cult, infertility, foster care, adoption and mental health struggles. These interview style stories are full of heartbreak, laughter, bravery and healing, sometimes all in the same episode. We will learn of struggles that often go unseen and the hope and joy that many live with despite their trials. Thank you for being along on my journey as I continue to rewrite my own story and heal with lots of humor along the way. Now let’s dive in to some emotional, scary, humorous and heroic stories!!QlR9ekosQEXVKOtKU0NI Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-04-23T06:23:49Z",
      "duration": "00:05:09.7070000",
      "explicit": false,
      "spotifyId": "75gAsbQJGgGg7OxQJrOJt9",
      "appleId": 1000558558264,
      "urls": {
        "spotify": "https://open.spotify.com/episode/75gAsbQJGgGg7OxQJrOJt9",
        "apple": "https://podcasts.apple.com/podcast/the-trailer/id1618657682?i=1000558558264"
      }
    }
  ]
}