{
  "_ts": 0,
  "id": "039c1a37-0b76-4506-ac0d-bfea17468851",
  "name": "The Flying Kitchen by Shannon Vavich",
  "youTubeChannelId": "UCUHqhyuOo_uztDjiWOal6zQ",
  "episodes": [
    {
      "id": "fa80b3d4-c03f-4905-b53c-8bc1f29e5108",
      "title": "Catholic Women Have Benefited from Reproductive Rights for Decades",
      "description": "Catholic women (and their families) have benefited from reproductive rights, whether they acknowledge it or not.  My response to a snarky commenter. Links to the podcast episode I mentioned, last week’s Zoom replay and the sign up to this week’s live Zoom class are on my linktree.",
      "release": "2025-05-02T20:01:43Z",
      "duration": "00:09:15",
      "explicit": false,
      "youTubeId": "NcTQahvn0Jw",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NcTQahvn0Jw"
      }
    },
    {
      "id": "e39bc363-df79-4f20-921b-0ef3131ec78f",
      "title": "Opus Dei’s Plan to Indoctrinate Your Children",
      "description": "Opus Dei’s plan to indoctrinate your children and rechristianize the world. Need a new crop of crusaders?  No problem. Leonard Leo has a plan, and his bought-and-paid-for SCOTUS is following suit, no matter if it’s unconstitutional. https://www.instagram.com/reel/DJHalmcta7V/?igsh=bzI0Z2ZoY2R3MTlh",
      "release": "2025-05-01T19:06:56Z",
      "duration": "00:08:27",
      "explicit": false,
      "youTubeId": "rQ2TCqdqBpM",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rQ2TCqdqBpM"
      }
    },
    {
      "id": "36ddd175-999a-4f2c-b411-e87a5643a1b0",
      "title": "At What Cost?  The Real Implications of Catholic Integralism and Doctrinal Purity over People",
      "description": "In this live zoom class we endeavor to answer the questions:\n\nIs the fascist far right element of The Catholic Church the very epitome of fascism; and can their viewpoint ever be changed from their interpretation of “natural law”; which is that theocracy is the goal, and unless you WANT a theocracy, you’re a heretic?\n\nDo you believe that unless you are striving to install a religious-led government with the eventuality of installing a Catholic King, you are living in a heretical nation and are taking part in heresy, personally? \n\nFollow my socials by clicking on this link, then clicking to your favorite socials and follow me there: https://linktr.ee/TheFlyingKitchen",
      "release": "2025-04-28T14:57:16Z",
      "duration": "02:22:59",
      "explicit": false,
      "youTubeId": "jjGqs95ADBE",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jjGqs95ADBE"
      }
    },
    {
      "id": "953d6a2f-abeb-41eb-8fc0-94e023240039",
      "title": "They want a Catholic Government in the United States",
      "release": "2025-04-27T08:41:11Z",
      "duration": "00:01:00",
      "explicit": false,
      "youTubeId": "l1jF5rbB6ME",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=l1jF5rbB6ME"
      }
    },
    {
      "id": "52820ec7-d93c-4175-a729-2c5795a1b4bd",
      "title": "Immigrant Priest Murdered in Cold Blood by \u0026quot;Trad\u0026quot; Catholic",
      "description": "LIVE ZOOM CALL REPLAY.  If empathy is the new sin, is violence the new virtue?  According to fascist far right Catholics, it appears so.  There is a growing schism in The Church - with crusader-like violence idealized as part of their far-right \u0022bro\u0022 culture under the false narrative of \u0022defending the faith\u0022.  There are more of them than most know, and I\u0027m here to connect the dots and explain where this all comes from, why it\u0027s happening, and what they really want.  Buckle up. #murderedpriest #fathercarasala #frarulcarasala \n\nJoin us for our next meeting on the 27 of April here:  https://us06web.zoom.us/meeting/register/KXPNlgvlTJOg4teb-fM9mA\n\n\nPlease follow me on all my socials by going to my link tree and clicking on each social media icon, and hitting \u0022follow\u0022 or \u0022subscribe\u0022 once you get to the app.  https://linktr.ee/admin",
      "release": "2025-04-14T10:24:01Z",
      "duration": "01:52:07",
      "explicit": false,
      "youTubeId": "0rGwHBi6KH4",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0rGwHBi6KH4"
      }
    },
    {
      "id": "6beae413-4153-471b-acc4-63f4e786d8cd",
      "title": "Are \u0026quot;Modern Crusaders\u0026quot; Behind Project 2025? And more. Live Zoom Class April 6, 2025",
      "description": "Are \u0022modern crusaders\u0022 behind Project 2025? Our culture has softened the truth of what the crusades of the middle ages was really about.  I\u0027m a Catholic and I do not believe we should be glorifying the crusades.  The truth of what these \u0022modern crusaders\u0022 really want is becoming clear.  All opinions are my own. For entertainment and educational purposes only. \n\nFollow me on all my socials.\nGo to my linktree to find icons of all my socials, and links to other videos, content, etc.  Be sure to click on the social links then follow me on each social media app:  https://linktr.ee/TheFlyingKitchen",
      "release": "2025-04-08T09:06:11Z",
      "duration": "02:08:28",
      "explicit": false,
      "youTubeId": "EjxKbbRWoho",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EjxKbbRWoho"
      }
    },
    {
      "id": "2dc4e831-edc8-4d7d-b20b-dbba16cb5e54",
      "title": "Oven fried chicken thighs",
      "release": "2025-04-02T14:54:10Z",
      "duration": "00:09:54",
      "explicit": false,
      "youTubeId": "fx2_Jz1TsBk",
      "subjects": [
        "Opus Dei",
        "Catholicism",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fx2_Jz1TsBk"
      }
    },
    {
      "id": "10404db0-7da7-4c9a-a1ea-ece611e1a2cd",
      "title": "Opus Dei, the Russians, Project 2025 and the Mission to “rechristianze the world”",
      "description": "You might want to sit down for this one. The Russians, Opus DEI, The Heritage Foundation, Project 2025, JD Vance, the T administration, and how they all fit together. The videos pictured (and many more) can be found on my YouTube. \nPlease keep asking questions. I can answer!  \n\n\nLinks\n\nProject 2025, Opus Dei and the Russians: long video: https://youtu.be/QPS61JXDYmU?si=ni2lUcphKRTNuFFO\n\nTurkey Krasnov Tradwife Parody Video: \n\nhttps://youtu.be/dkHwX3tz15A?si=MgqexXeYG37NIyO-\n\n\nFascism in the American Catholic Church: \n\nhttps://youtu.be/MYC_RZSCTis?si=iRnVlKfngSzp3gl0",
      "release": "2025-03-26T22:36:58Z",
      "duration": "00:09:41",
      "explicit": false,
      "youTubeId": "5ejFG9gDpZU",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5ejFG9gDpZU"
      }
    },
    {
      "id": "c2f960fb-b490-412b-938c-b42c19fa774d",
      "title": "JD Vance is an Opus Dei plant. I think they’ve chosen him to usher in a theocracy. Troll him.",
      "release": "2025-03-21T23:21:23Z",
      "duration": "00:01:00",
      "explicit": false,
      "youTubeId": "9KOQsJbnbQE",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9KOQsJbnbQE"
      }
    },
    {
      "id": "e2c560c3-422b-413e-8e51-51bd5d7857a8",
      "title": "Nazi Catholics - how will you know one in your parish?",
      "description": "How will you know a fascist-far-right Catholic in your parish?  I may have some answers.  Not all Catholics are fascists, in fact, most just want to practice their faith in peace and are not interested in forcing anyone into their beliefs.  However, the fascist far right Catholics have infected our entire culture with their nazi beliefs and hard line Catholicism that ALL PEOPLE should think and believe like them.  This has grave implications on Catholicism worldwide and is causing many Catholics to leave a faith they really cherish because they cannot stand the hatred we are experiencing now.  Thank you for your question, keep em coming!  Remember, YOU ARE NOT ALONE and there are more people like us than there are of them.  -Shannon Vavich",
      "release": "2025-03-21T13:57:03Z",
      "duration": "00:05:17",
      "explicit": false,
      "youTubeId": "Uo6qJf9umT0",
      "subjects": [
        "Catholicism",
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Uo6qJf9umT0"
      }
    },
    {
      "id": "f598c44a-9779-4b27-a5f6-813ee282300d",
      "title": "Opus Dei, Leonard Leo and Your Kids #departmentofeducation #doe #opusdei",
      "release": "2025-03-20T06:15:43Z",
      "duration": "00:01:49",
      "explicit": false,
      "youTubeId": "2lWId5-A8Ok",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2lWId5-A8Ok"
      }
    },
    {
      "id": "db77f472-7132-4175-84a5-39d26ea730a9",
      "title": "Her Marriage Was Destroyed by Her Husband’s Far-Right Catholic Cult",
      "description": "Religion brought out the worst in him, and her marriage was destroyed.  “American Needs Fatima put the final nail in a marital coffin”.  Names have been changed to protect identities and to protect her family. A warning from MJ for sincere people who may find themselves caught up in a fascist-far-right-Catholic-cult.  You are not alone.  \nThank you MJ, for writing to me.  I hope this message finds the person or people who need it most.  Thank you so much for your vulnerability and bravery. I’m so sorry this happened to you and your children.  \nViewers, please show your best kindness and support for MJ. And please send this message to anyone who you think needs to hear this.  No one should have to go through this.  \n- Shannon Vavich #cult #cults #extremism",
      "release": "2025-03-19T20:48:55Z",
      "duration": "00:09:05",
      "explicit": false,
      "youTubeId": "wKu3m3P7P9w",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wKu3m3P7P9w"
      }
    },
    {
      "id": "2023da7c-a2cc-4e85-8229-4c53bed1ffb2",
      "title": "The coup is upon us. Opus Dei wants a theocracy. #opusdei #project2025 #coup",
      "description": "The coup is upon us. This is it. DOGE broke into the United States Institute of Peace, an independent organization, with the unlawful help of the FBI, and the DC police allowed this illegal break-in to happen.  DOGE is paving the way for The Heritage Foundation, the Heritage Foundation is controlled by Opus Dei. Opus Dei is a worldwide cult that is known for attempting to overthrow democracies all over the world. This is it. Follow my content. Send me your stories and information. Project 2025 is happening fast.",
      "release": "2025-03-18T14:02:10Z",
      "duration": "00:04:27",
      "explicit": false,
      "youTubeId": "GeM27f32_F8",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GeM27f32_F8"
      }
    },
    {
      "id": "c4f3172a-f461-4ba5-9c19-56280922915f",
      "title": "The Bullies of Opus Dei Are Just Trying to SAVE YOUR SOUL and Rule Over Your Children",
      "description": "Fascist Far Right Catholic troll of the week:  Fascist Far Right Catholics hate ANYONE who doesn’t think like them. Especially other Catholics. These are the people who want to rule over us by way of Project 2025. They are the powerhouse behind Project 2025.  Look at my content to learn about Leonard Leo, Kevin Roberts, JD Vance. Read Opus by Gareth Gore. It’s not enough anymore to \njust ignore or avoid these people. They want dominance, they want to force people to live like them, and unless\nProject 2025 is stopped, they will \nrule over us and our children. Thanks MAGA!🖕MAGA, they’re coming for you too! Say goodbye to religious freedom!  You’ll all be forced into Catholicism soon. Even you, Baptists and LDS. Have fun!",
      "release": "2025-03-17T16:04:34Z",
      "duration": "00:08:31",
      "explicit": false,
      "youTubeId": "hoqkf3xxOjY",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hoqkf3xxOjY"
      }
    },
    {
      "id": "4f5cfd7e-43c4-423e-ba8c-9e0ce578483e",
      "title": "LONG HAUL RESISTANCE - LEONARD LEO - MORE FASCIST TROLLS",
      "description": "We continue our study of Opus by Gareth Gore!  Opus Dei, the fascist far right Catholic cult is the POWERHOUSE behind Project 2025.  Arm yourself with knowledge, community and fine-tune your habits and routines so you will remain of strong mind and body in the long run.  RESIST\n#theresistance #opusdei #leonardleo \n\nConnect with Shannon on her socials: https://linktr.ee/TheFlyingKitchen\n\nJoin us live next week:   March 23: Bishop Robert Barron, Cardinal Raymond Burke, Leonard Leo want to pick the next Pope....\n\nRegister here, it\u0027s free:  https://us06web.zoom.us/meeting/register/KXPNlgvlTJOg4teb-fM9mA\n\nrecipes:\nChocolate Cake Recipe: \nhttps://theflyingkitchen.com/classic-american-chocolate-layer-cake/\n\nMiso Glazed Potroast:\nhttps://theflyingkitchen.com/miso-glazed-pot-roast/\n\nChicken and Dumplings: \nhttps://theflyingkitchen.com/authentic-from-scratch-chicken-and-dumplings/",
      "release": "2025-03-17T12:55:54Z",
      "duration": "01:02:30",
      "explicit": false,
      "youTubeId": "KwwP5Dg1yuA",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KwwP5Dg1yuA"
      }
    },
    {
      "id": "8c2a713b-09e0-4fde-94d6-0a8b4aecc5b8",
      "title": "REMEMBER HIS NAME - LEONARD LEO. Book club update!! #leonardleo #opus #opusdei",
      "release": "2025-03-14T17:38:12Z",
      "duration": "00:02:18",
      "explicit": false,
      "youTubeId": "6JJB0Che5kU",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6JJB0Che5kU"
      }
    },
    {
      "id": "bf36d88b-2ed3-41b8-b3fb-87f723d4f857",
      "title": "The Dark Money, Secrecy and Influence of Leonard Leo with Tom Carter",
      "description": "In this episode, Shannon Vavich and Tom Carter delve into the controversial influence of Leonard Leo and Opus Dei within the American judiciary and political landscape. They discuss Leo\u0027s role in shaping the Supreme Court, the intertwining of far-right Catholicism with evangelical movements, and the implications for democracy and religious freedom. The conversation highlights the contradictions in Leo\u0027s actions, the web of influence he has created, and the challenges facing mainstream Catholicism in America today. In this conversation, Shannon Vavich and Tom Carter delve into the controversial activities of the Red Hat group, the influence of Leonard Leo in shaping a theocratic agenda in America, and the ongoing efforts to build community against fascism. They discuss the implications of a potential theocratic America, the role of humor and hope in activism, and the importance of awareness and education in combating extremist ideologies. #leonardleo #opusdei #scotus \n\nThe Leo-influenced website hoping to influence the Post-Francis Papacy:\nhttps://collegeofcardinalsreport.com/\n\nConnect with Tom Carter:  \n\nMedium:\nhttps://medium.com/@thcarter123\n\nBluesky: \nhttps://thcarter123.bsky.social\n\nInstagram:\nhttps://www.instagram.com/thcarter123?igsh=ZXVpZ3h5ZWF2Z2c5\n\nConnect with Shannon - includes links to book club: \nhttps://linktr.ee/TheFlyingKitchen\n\nTAKEAWAYS:\n- Shannon Vavich discusses her encounter with Opus Dei 25 years ago.\n-Tom Carter shares his experience working with Leonard Leo.\n-Leonard Leo is known for his significant influence on the judiciary.\n-The Federalist Society plays a crucial role in conservative judicial appointments.\n-Contradictions exist in Leonard Leo\u0027s actions regarding religious freedom.\n-The relationship between evangelicals and Catholics has evolved over time.\n-Leonard Leo\u0027s network is extensive and influential in politics.\n-Far-right Catholicism is on the rise in America.\n-The future of Catholicism in America is uncertain with many leaving the church.\n-The motivations behind conversions to Catholicism are questioned. The Red Hat Society has been linked to creating opposition files on potential popes.\n-Leonard Leo\u0027s influence is pervasive in shaping the current political landscape.\n-There is a push among certain factions for a theocratic America.\n-Community building is essential in resisting fascist ideologies.\n-Humor and hope are powerful tools in activism.\n-The far-right is becoming more vocal and open about their intentions.\n-Awareness and education are crucial in combating extremist ideologies.\n-The concept of \u0027Church Militant\u0027 reflects a dangerous blend of religion and politics.\n-The importance of grassroots movements in creating change.\n-The conversation highlights the need for unity among those opposing fascism.\n\n00:00\nIntroduction to Opus Dei and Leonard Leo\n02:56\nLeonard Leo\u0027s Influence on the Judiciary\n06:01\nThe Role of the Federalist Society\n09:08\nContradictions in Leonard Leo\u0027s Actions\n12:11\nThe Web of Influence and Control\n15:08\nThe Relationship Between Evangelicals and Catholics\n18:04\nThe Rise of Far-Right Catholicism\n21:01\nThe Impact of Leonard Leo\u0027s Network\n23:57\nThe Future of Catholicism in America\n26:58\nConclusion and Reflections on Faith\n42:37\nThe Red Hat Society and Its Controversies\n48:21\nThe Influence of Leonard Leo and the Long Game\n56:55\nThe Push for a Theocratic America\n01:02:37\nCommunity Building Against Fascism\n01:12:24\nThe Role of Humor and Hope in Activism",
      "release": "2025-03-14T15:50:46Z",
      "duration": "01:21:16",
      "explicit": false,
      "youTubeId": "NX-JfuvG3IQ",
      "subjects": [
        "Opus Dei",
        "Catholicism",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NX-JfuvG3IQ"
      }
    },
    {
      "id": "eb4cbaa9-738f-4041-a242-39324cd6e662",
      "title": "A Beginner\u0026#39;s Guide to Leonard Leo - Continuing Study of Opus by Gareth Gore",
      "description": "In this replay of our live zoom book club studying Opus by Gareth Gore, I\u0027m giving the basics on Leonard Leo. Leonard is the man no one talks about but who has the most influence of anyone in the political sphere today.  Join us every week on Zoom, Sunday 6pm Berlin, 12 noon Easter, 9 am Pacific.  Link to register below! \n\nhttps://us06web.zoom.us/meeting/register/KXPNlgvlTJOg4teb-fM9mA",
      "release": "2025-03-10T14:03:01Z",
      "duration": "01:18:14",
      "explicit": false,
      "youTubeId": "SKrF_WNdDgY",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SKrF_WNdDgY"
      }
    },
    {
      "id": "f7d7f1de-7041-432c-832b-7a33675d6e42",
      "title": "Leonard Leo deep dive, live zoom class!",
      "release": "2025-03-08T17:27:53Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "3rlD2HDaQoE",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3rlD2HDaQoE"
      }
    },
    {
      "id": "b35a3ebf-8b53-40bf-b264-8ac9b07fef84",
      "title": "Russia and Project 2025 - the Vision of Opus Dei",
      "description": "Tradwife Parody video! Opus Dei, fascist far right Catholics, Russia, the Protestants and Project 2025!! What do they all have in common?  I’ll tell you! Plus, I’m making a brand new recipe…Turkey Krasnov!! It’s delicious!  For a more scholarly version of my analysis, go to my YouTube and watch the replay of my live zoom class. Join us every week for our book study of Opus by Gareth Gore! Thanks so much, darlings! Until next time, Shannon Vavich 💋💋💋 #project2025 #antifascist #opus",
      "release": "2025-03-06T21:02:50Z",
      "duration": "00:08:02",
      "explicit": false,
      "youTubeId": "dkHwX3tz15A",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dkHwX3tz15A"
      }
    },
    {
      "id": "fb73b77a-355b-4685-900e-acd828454a60",
      "title": "Russia and Project 2025 - Healing \u0022The Great Schism\u0022 and Uniting the Superpowers for \u0022CHRISTENDOM\u0022",
      "description": "The Russian - Project 2025 connection and my theory of how Opus Dei is working in concert with Russia to heal the “Great Schism of 1054” between the Roman Catholics and the Eastern Orthodox, to unite the two superpowers (Russia and the United States) to bring about “Christendom”: One world religion under individual nation theocracies. This is a replay of my live weekly zoom bookclub meeting: \u0022The Shitshow Pirates\u0022.  #project2025 #opusdei #putin_zelensky \n\nRead: Opus by Gareth Gore\n\nJoin our book club \u0022The Shitshow Pirates\u0022! We meet every Sunday on Zoom:\nIn our next meeting (3/9/25) we\u0027ll be taking a deep dive on Leonard Leo. \n\nhttps://us06web.zoom.us/meeting/register/KXPNlgvlTJOg4teb-fM9mA",
      "release": "2025-03-03T10:39:27Z",
      "duration": "01:40:12",
      "explicit": false,
      "youTubeId": "QPS61JXDYmU",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QPS61JXDYmU"
      }
    },
    {
      "id": "5807d421-0a4c-452e-8947-3c21f86befab",
      "title": "The Kremlin and Opus Dei? Shocker!!!",
      "description": "Join us for a riotous good time on Zoom tomorrow!  We are THE SHITSHOW PIRATES!  Tomorrow we’ll be continuing our study of Opus by Gareth Gore and I’ll be sharing some cozy stories of the Opus Dei - Kremlin link!! Fun! Sunday!!! See you soon, pirates!!\n\nhttps://us06web.zoom.us/meeting/register/KXPNlgvlTJOg4teb-fM9mA?fbclid=IwZXh0bgNhZW0CMTEAAR0YjdN62eY6kj6bcUc4BadAZdqR72JrIobQMQmuIQfIdHhDyhqklO_EcEY_aem_2tBO7icMl2qAx_HMzahAiA#/registration",
      "release": "2025-03-01T16:03:19Z",
      "duration": "00:03:32",
      "explicit": false,
      "youTubeId": "uPOo5xxtz8A",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uPOo5xxtz8A"
      }
    },
    {
      "id": "61e0e013-8667-4ebb-95b0-5f3462a51e98",
      "title": "Why Do MAGA Catholics HATE Pope Francis So Much???",
      "description": "In this episode, Shannon Vavich engages with Mark Shea to explore the complex relationship between MAGA Catholics and Pope Francis. They discuss the historical context of the pro-life movement, the concept of heresy within Catholicism, and the implications of nationalism and tribalism in faith. The conversation delves into how political agendas have shaped Catholic beliefs and practices, particularly regarding abortion and social justice. Shea emphasizes the need for a holistic understanding of Catholic teaching that transcends partisan divides, advocating for a faith that prioritizes the dignity of all human life. In this conversation, Shannon Vavich and Mark Shea explore the complexities of contemporary Christianity, particularly in relation to the MAGA movement, the pro-life stance, and the broader implications of legalism and cruelty in society. They discuss the absurdity of imposing law as a means of salvation, the mystery of evil, and the dangers of a culture that promotes scarcity and fear. The dialogue emphasizes the importance of empathy, the need to address victims of cruelty, and the role of laypeople in evangelism. Ultimately, they highlight the revolutionary force of Christianity and the hope that persists amidst historical challenges, advocating for a return to the core teachings of the Gospel and Catholic social teaching.\n\nShannon\u0027s Socials can be found here:\nhttps://linktr.ee/TheFlyingKitchen\n\nFind Mark on Facebook: https://www.facebook.com/share/12KTEEYCRWR/?mibextid=wwXIfr\n\nTakeaways\nMAGA Catholics harbor significant discontent towards Pope Francis due to his inclusive approach to social issues.\nThe pro-life movement has evolved into a heretical interpretation of Catholic teaching, focusing narrowly on abortion.\nHeresy is defined as a monomania, where one aspect of faith is emphasized to the exclusion of others.\nFamily and nation are often idolized in conservative Catholic circles, overshadowing the kingdom of God.\nEconomic policies significantly impact abortion rates, challenging the narrative that solely focuses on legal restrictions.\nMedia plays a crucial role in shaping Catholic beliefs, often simplifying complex teachings into sound bites.\nThe Church\u0027s stance on war and torture has been compromised by political agendas, particularly among conservative Catholics.\nThe election of Pope Francis marked a shift towards a more inclusive and socially aware Catholicism, which has faced backlash.\nRacial and national identities have become intertwined with religious beliefs, complicating the Church\u0027s universal message.\nThe Church\u0027s teachings are intended for all humanity, not just specific tribes or nations. Imposing law as a means of salvation is absurd.\nLegalism leads to failure in understanding salvation.\nCruelty and judgment are prevalent in contemporary Christianity.\nEvil is a mystery that often defies logic.\nGrave evil disguises itself as courage.\nEmpathy is increasingly labeled as a sin.\nA culture of scarcity breeds fear and hostility.\nThe Great Replacement Theory fuels racism and xenophobia.\nThe pro-life movement has strayed into moral heresy.\nHope exists in the revolutionary force of Christianity.\n\nChapters\n00:00\nIntroduction to the Conversation\n03:21\nUnderstanding MAGA Catholics\u0027 Discontent with Pope Francis\n09:10\nThe Concept of Heresy in Catholicism\n10:08\nThe Two Greatest Commandments and Their Implications\n15:28\nThe Idolatry of Family and Nation\n17:21\nThe Pro-Life Movement\u0027s Evolution and Misconceptions\n25:33\nPolitical Manipulation of the Pro-Life Movement\n31:05\nConsequences of a Narrow Focus on Abortion\n39:22\nThe Role of Media in Shaping Catholic Perspectives\n50:40\nThe Impact of Republican Policies on Abortion Rates\n51:48\nThe Evolving Non-Negotiables of Catholicism\n58:27\nEuthanasia and the Death Penalty: A Catholic Dilemma\n01:03:51\nPolitical Dynamics: Obama, Abortion, and the Pro-Life Movement\n01:10:07\nPope Francis vs. American Nationalism\n01:19:54\nThe Culture of Cruelty and the Sin of Empathy\n01:39:18\nReturning to the Gospel: A Path Forward\n01:42:08\nConfronting Cruelty and Intimidation\n01:44:56\nThe Role of Prudence in Faith\n01:47:50\nAddressing Victims of Injustice\n01:52:06\nThe Importance of Community and Safety\n01:55:59\nThe Power of Personal Witness\n02:00:13\nHope Amidst Historical Challenges\n02:02:57\nThe Revolutionary Force of Christianity\n02:07:08\nRecognizing Goodness in a Divided World\n02:10:50\nThe Call for Unity and Understanding",
      "release": "2025-02-19T15:31:17Z",
      "duration": "02:19:58",
      "explicit": false,
      "youTubeId": "Mss0TUjsms0",
      "subjects": [
        "Catholicism",
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Mss0TUjsms0"
      }
    },
    {
      "id": "6a799bc5-a432-4516-a8f1-b9b303528a9c",
      "title": "Groomed \u0026 Abused by Opus Dei",
      "description": "My story of Catholicism, Opus Dei and Democracy. Plus my explanation of how Opus Dei became the real power behind Project 2025, and what they intend to do with that power.  #catholicking \n#project2025 #opusdei",
      "release": "2025-02-11T22:17:18Z",
      "duration": "02:05:55",
      "explicit": false,
      "youTubeId": "6yV0EAade9o",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6yV0EAade9o"
      }
    },
    {
      "id": "4aee2a92-5c8f-4ccc-aebc-013e93dca30f",
      "title": "Fascism in The Church - Our Experiences Watching Opus Dei and MAGA Infiltrate and Divide",
      "description": "First Episode of \u0022opus deiNOT GONNA GET AWAY WITH IT\u0022 - Exposing the hidden powers behind Project 2025.  Episode 1: From Catholicism to Deconstruction: Michele\u0027s Story\n\nIn this episode, Shannon Vavich and Michele Quigley delve into the complexities of Project 2025, exploring its implications on democracy and the influence of far-right Catholic ideologies. Michele shares her personal journey from a Methodist upbringing to deep involvement in Catholicism, discussing the impact of strict teachings on family life, contraception, and the challenges faced when questioning authority within the church. The conversation also touches on the political polarization within religious communities and the fallout experienced after leaving the church, highlighting the intersection of faith and fascism in contemporary society. In this conversation, Michele Quigley and Shannon Vavich explore the complexities of motherhood, societal expectations, and the value of women beyond childbearing. They discuss the impact of patriarchy, the importance of religious freedom, and the role of artistic expression in personal healing. The dialogue emphasizes the need for community support, resilience in the face of judgment, and the power of individuality. Through their shared experiences, they highlight the significance of finding joy and beauty in everyday life, encouraging listeners to embrace their unique paths and foster connections with like-minded individuals.\n\nChapters\n00:00\nIntroduction to Project 2025\n06:56\nThe Impact of Catholic Teachings on Family Life\n14:31\nThe Role of Diocesan and Religious Orders\n22:47\nCultural Practices and Personal Choices in Faith\n30:43\nPublic Revelation and Community Response\n36:00\nThe Impact of Abuse Scandals on Faith\n41:51\nPolitical Polarization and Faith\n46:04\nPrivilege in Parenting Choices\n49:35\nRacism and Representation in Faith Communities\n52:59\nThe Challenges of Homeschooling in a Conservative Context\n55:12\nThe Harsh Reality of Religious Judgment\n57:53\nDeconstructing Faith and Identity\n01:00:40\nThe Burden of Perfectionism in Faith\n01:01:36\nPublic Perception and Scandal in Faith Communities\n01:02:47\nThe Impact of Social Media on Personal Narratives\n01:04:31\nThe Intersection of Faith and Feminism\n01:06:23\nConfronting Extremism in Religious Circles\n01:09:41\nThe Role of Women in Religious Narratives\n01:12:54\nMaternal Health and Reproductive Rights\n01:15:14\nThe Value of Women Beyond Childbearing\n01:18:11\nThe Dangers of Religious Dogma\n01:20:45\nCommunity Pressure and Individual Faith\n01:25:29\nReflections on Leadership and Responsibility\n01:27:22\nThe Role of Women in Society\n01:28:59\nArtistic Expression as a Means of Liberation\n01:32:06\nNavigating Community Expectations\n01:36:31\nFinding Compassion in a Divided World\n01:39:46\nEmpowerment Through Agency and Resources\n01:43:31\nThe Universal Desire for Connection and Understanding\n01:52:14\nCreating a Personal Studio Space\n01:55:28\nThe Impact of Historical Events on Fashion\n01:58:41\nPhotography as a Means of Empowerment\n02:02:04\nFinding Joy in Art and Community\n02:05:21\nBreaking Free from Restrictive Norms\n02:12:05\nThe Role of Community in Personal Growth\n\n#Project2025 \n#catholicism\n#MicheleQuigley\n#ShannonVavich \n#ReligiousIdentity\n#familyplanning\n#politicalpolarization\n#deconstruction\n#faith\n#fascism\n#community\n#motherhood\n#societalexpectations\n#womensvalue\n#religious\n#artisticfreedom\n#patriarchy\n#communitypressure\n#artisticexpression\n#selfdiscovery\n#resilience\n#individuality\n\nAudio version coming to all podcast streaming platforms.  \n\nThank you so much Michele.  It was an absolute heartwarming joy conversing with you.\n\nSincerely,\nShannon Vavich\n\nMichele’s Socials: \n\nhttps://www.instagram.com/michelequigley\n\nFacebook: \n\nhttps://www.facebook.com/share/14s9sDawmh/?mibextid=wwXIfr\n\nWebsite (BEAUTIFUL PORTRAITURE PHOTOGRAPHY) \n\nhttps://michelequigley.com/\n\nShannon’s Socials: \n\nYouTube: https://youtube.com/@TheFlyingKitchen\n\nFacebook: https://www.facebook.com/profile.php?id=100057690218799\n\nIG: https://www.instagram.com/shannonvavich_theflyingkitchen?igsh=eWM1bDJ4cHp5eXVq\u0026utm_source=qr\n\nThreads: https://www.threads.net/@shannonvavich_theflyingkitchen?igshid=NTc4MTIwNjQ2YQ==\n\nTiktok: https://www.tiktok.com/@theflyingkitchen?_t=ZN-8tgbYjQpoWc\u0026_r=1\n\nSubstack: https://shannonvavich.substack.com?r=u71n9\u0026utm_medium=ios\n\nBluesky: https://bsky.app/profile/theflyingkitchen.bsky.social\n\nLinked In:  https://www.linkedin.com/in/shannon-vavich-087290172?utm_source=share\u0026utm_campaign=share_via\u0026utm_content=profile\u0026utm_medium=ios_app",
      "release": "2025-02-06T22:54:09Z",
      "duration": "02:18:16",
      "explicit": false,
      "youTubeId": "MYC_RZSCTis",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MYC_RZSCTis"
      }
    },
    {
      "id": "25a6886c-7249-419c-b921-13ca963ee535",
      "title": "Project 2025, A Catholic King, Christendom, and a Holy War",
      "description": "After America is a Christian nation, the Christians will war for as long as it takes until the Far Right Catholics achieve “Christendom”. I was pulled into this cult 25 years so. See what I learned.",
      "release": "2025-01-28T19:31:02Z",
      "duration": "00:09:51",
      "explicit": false,
      "youTubeId": "0Z5_-1lzGKs",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0Z5_-1lzGKs"
      }
    },
    {
      "id": "7951059a-a015-4eea-a66b-e3a595c56a59",
      "title": "My Escape From a Far Right Catholic Cult, Part 2: Kathie Socks it to The Apostate (me)",
      "release": "2025-01-26T17:42:33Z",
      "duration": "00:09:55",
      "explicit": false,
      "youTubeId": "HhbuNbvHfZ4",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HhbuNbvHfZ4"
      }
    },
    {
      "id": "58e34a3d-5b0e-41be-9790-16ac98203471",
      "title": "My Escape From A Far Right Catholic Cult part 1: Troll Hunting",
      "description": "My escape from a far right Catholic cult, Part 1.  Sorry, we’re talking about a decades long plan to bring “Christendom” to America and demand compliance. There will be more than 1 part, cause I’ve got a lot to spill.",
      "release": "2025-01-25T12:54:48Z",
      "duration": "00:09:54",
      "explicit": false,
      "youTubeId": "dgdOiIn3_Uo",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dgdOiIn3_Uo"
      }
    }
  ]
}