{
  "_ts": 0,
  "id": "6a8e4b17-4692-4f12-a59e-acb18b848345",
  "name": "The Crafty Narrative",
  "spotifyId": "1a2oH2JJyvyRt3FjSYFB6C",
  "appleId": 1779199387,
  "episodes": [
    {
      "id": "59f49583-f0d6-43b3-aeb0-9c3b104e6b2a",
      "title": "Aum",
      "description": "Hello and thanks for joining me, Lori Kay, on the Crafty Narrative. Today I will be telling you about the cult that would go down in Japan\u0027s history book. Aum Shinrikyo Music thanks to Kevin Mac Leod for his song: Southern Gothic Sources: Aum Shinrikyo: The Japanese cult behind the Tokyo Sarin attack - BBC News III. Background of the Cult - A Case Study on the Aum Shinrikyo Deadly Doomsday Cult: How a False Messiah Changed Japan Forever | ENDEVR Documentary A Brief History of: The Tokyo subway Sarin attack (Short Documentary) Japan\u0027s Most Dangerous Cult, explained. Crazy Cult That Poisoned Tokyo",
      "release": "2025-01-26T23:47:23Z",
      "duration": "00:28:08.3380000",
      "explicit": false,
      "spotifyId": "7djA59g0yPtXxOXU6Iwyer",
      "appleId": 1000685555152,
      "subjects": [
        "Aum Shinrikyo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7djA59g0yPtXxOXU6Iwyer",
        "apple": "https://podcasts.apple.com/podcast/aum/id1779199387?i=1000685555152"
      }
    },
    {
      "id": "fe39743c-3025-493a-addd-6cc0df352371",
      "title": "Jesus Army",
      "description": "While trying to find a safe place for some they put everyone in danger. Music thanks to: Kevin Mac Leod- Southern Gothic Behind the happy, clappy Jesus Army Jesus Fellowship Community Trust Jesus Fellowship Church – WRSP Jesus Army: Biography, Songs \u0026 Lyrics Jesus Army Redress Scheme pays out £7.7m over abuse claims Jesus Army abuse \u0027worse than anybody realises\u0027 article by Jesus Army Documentary What Is Neo-Charismatic | Christian.net Battlecentre (Jesus Army Documentary) Jesus Army Cult : the Public Hearing Cults in the UK: The Truth About the Jesus Army | UK Crime Diaries BBC Look East - The Jesus Army Scandal [Northampton] (Jul 2019) SHOCKING British Cults: REVEALED | Documentary exploring cults in the UK | Jesus Army, Satanic Cults Jesus Fellowship Redress Scheme Launch - Jesus Fellowship Community Trust Jesus-Fellowship-Redress-Scheme-Final-Report.pdf Jesus Army Survivors group on \u0027mixed\u0027 emotions to final redress report What The Bible Has to Teach Us About Community - Church.org",
      "release": "2025-01-12T22:35:25Z",
      "duration": "00:30:17.7180000",
      "explicit": false,
      "spotifyId": "5nZlEYmSsD13C0RCrbwnJ5",
      "appleId": 1000683701806,
      "subjects": [
        "Jesus Army"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5nZlEYmSsD13C0RCrbwnJ5",
        "apple": "https://podcasts.apple.com/podcast/jesus-army/id1779199387?i=1000683701806"
      }
    },
    {
      "id": "ef63353f-c262-4de1-9405-b5eed1048a9a",
      "title": "Father Divine",
      "description": "Mad man the proclaimed himself God or a man that should be honored for his activism in the Civil Rights movement. Thanks for joining me Lori Kay on the Crafty Narrative as we explore the life and times of Father Divine SOURCE SHEET -Music by Kevin Mac Leod with the song Southern Gothic Y History of Slavery in Maryland by Christine Wondoloski Azusa Street Revival 1906 (revival-library.org) Speaking In Tongues | Meaning and History – Dictionary.com Faithful Heroes: Samuel Morris, from Prince to Missionary ⋆ Diana Leagh Matthews Why Could you be Sent to an ‘Insane Asylum\u0027 in 19th Century America? — History is Now Magazine, Podcasts, Blog and Books | Modern International and American history History.com Jim Crow Laws Hsmcpa.org A virtual tour of Father Divine\u0027s Ulster County ‘Heavens\u0027 | My Hudson Valley (timeshudsonvalley.com) Pbs.org- Father Divine\u0027s Peace Mission: Hope for the Impoverished The Times-Mother Divine, Who Took Over Her Husband\u0027s Cult, Dies at 91 by William Grimes Interracial Marriage Laws History and Timeline (thoughtco.com) Mint House at The Divine Lorraine Hotel Reviews, Deals \u0026 Photos 2024 - Expedia The Divine Lorraine Hotel is More Than a Curiousity - Guide to Philly Mint House at The Divine Lorraine | Apartment Hotel, Philly",
      "release": "2024-12-22T22:02:22Z",
      "duration": "00:29:50.4990000",
      "explicit": false,
      "spotifyId": "7gE5tzaltuMOflNAqPQ6JY",
      "appleId": 1000681341439,
      "subjects": [
        "International Peace Mission movement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7gE5tzaltuMOflNAqPQ6JY",
        "apple": "https://podcasts.apple.com/podcast/father-divine/id1779199387?i=1000681341439"
      }
    },
    {
      "id": "be4e19a5-27bd-4f15-8801-58123e47db63",
      "title": "Universal Medicine",
      "description": "Let me tell you about the deadliest cult in Australia, Universal Medicine. Music Credit: Kevin Mac Leod- Southern Gothic Sources: Youtube- Esther Rockett- On Unversal Medicine ABC.net.au/news- Clinic Associated with Cult Teaches that People with Disability are Experiencing “Karma” receives thousands in NDIS Funds by Josh Roberson NDIS.gov.au Britannica.com-Pran http://epa-international.com http://www.theschoolofthelivingness.com The Sydney Morning Herald- Self-Styled Healer Serge Benhayon Leads “Socially Harmful Cult”: jury by Michaela Whitbourn YouTube- Serge Benhayon TV BBC-Mother “lost” to Serge Benhayon\u0027s Universal Medicine Stroke.org Esotericwomenshealth.com The Esoteric diet – more lethal than ever | UNIVERSAL MEDICINE ACCOUNTABILITY (wordpress.com) YouTube – Prana-Explained Like Never Before by SamatvamSimplified ABC news- Clinic associated with cult that teaches that people with disability are experiencing \u0027karma\u0027 receives thousands in NDIS funds by Josh Robertson Forbes.com https://www.abc.net.au/news/2023-08-02/universal-medicine-clinic-ndis-funds-730/102576660?utm_campaign=abc_news_web\u0026utm_content=link\u0026utm_medium=content_shared\u0026utm_source=abc_news_web Rolling Stones-Serge Benhayon\u0027s Universal Medicine by Poppy Reid Abundancetherapycenter.com Sea.museum:Austrailia\u0027s Immigration History Mhnsw.au Esotericwomenshealth.com Nominahealth.ca-The Psychology Behind Love Bombing Science Daily- New Study Highlights the Benefit of Touch on Mental and Physical Health Clinic associated with cult that teaches that people with disability are experiencing \u0027karma\u0027 receives thousands in NDIS funds - ABC News",
      "release": "2024-12-15T23:00:37Z",
      "duration": "00:32:09.7120000",
      "explicit": false,
      "spotifyId": "0obIcEmNVRFA8jkOwR0Brr",
      "appleId": 1000680468485,
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0obIcEmNVRFA8jkOwR0Brr",
        "apple": "https://podcasts.apple.com/podcast/universal-medicine/id1779199387?i=1000680468485"
      }
    }
  ]
}