{
  "id": "e3c4e22f-57f5-4fb1-a798-70d147228a42",
  "name": "The Royals",
  "spotifyId": "2I2pneMy3s0GxuQ7Alhl5e",
  "appleId": 1745117658,
  "youTubeChannelId": "UCTjDhFuGXlhx9Us0gq0VK2w",
  "youTubePlaylistId": "PLGeQKoGUstRCkdzXrxYipNHvIO-z4hhy3",
  "episodes": [
    {
      "id": "301b0784-5eaa-47fa-a950-e2d34e9a7876",
      "title": "Andrew \u0026 Epstein - The King acts",
      "description": "He will now be known simply as Andrew Mountbatten Windsor. The man formerly known as Prince Andrew is being stripped of his titles and removed from his mansion, Royal Lodge, on the Windsor estate. Last month The Times obtained a copy of the leasehold agreement for Royal Lodge which showed that while the prince paid £1 million for the lease plus at least £7.5 million for refurbishments completed in 2005, he has paid “one peppercorn (if demanded)” in rent per year, since 2003. Andrew\u0027s links with convicted sex offender Jeffrey Epstein brought increasing public and political demands for action. It is a seismic moment in royal history – but is it enough? Roya is joined on the podcast by Aubrey Allegretti, the paper\u0027s chief political correspondent and George Greenwood, investigations reporter for The Times. Presenter: Roya Nikkhah Contributors: Aubrey Allegretti, Times chief political correspondent and George Greenwood, Investigations Reporter for The Times Producers: Sophie McNulty, Priyanka Deladia, Robert Wallace, Stephen Titherington Photo: Getty Images Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-10-31T15:00:00Z",
      "duration": "00:28:53.4070000",
      "explicit": false,
      "spotifyId": "2v3NLQpInEnjBBxGAFvxmk",
      "appleId": 1000734454130,
      "youTubeId": "fE8uXgRpGi0",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2v3NLQpInEnjBBxGAFvxmk",
        "apple": "https://podcasts.apple.com/podcast/andrew-epstein-the-king-acts/id1745117658?i=1000734454130",
        "youtube": "https://www.youtube.com/watch?v=fE8uXgRpGi0"
      }
    }
  ]
}