{
  "_ts": 0,
  "id": "1de5c269-d410-46ec-b670-b38dbdce1bfc",
  "name": "The Hidden Truth: Breaking the Silence",
  "spotifyId": "3TppfvmACFZ2TvwDwoyS9T",
  "appleId": 1705834603,
  "youTubeChannelId": "UCvl3HMCl1rXnxy1mcAmZIXA",
  "episodes": [
    {
      "id": "ede5cbde-8278-4bdd-a0cd-89306c904ead",
      "title": "011 - Isabel Chung: the complex face of abuse",
      "description": "Need Help? Are you at Risk? For Depression Screening, Call or Text 988\n\nChat at 988Lifeline.org\n\nNational Suicide Prevent Lifeline at 1-800-273-8255, or via Text at 741741, both open 24/7.  \n\nNational Domestic Violence Hotline at 1-800-799-SAFE, or via Text at 88788, both open 24/7. You can also find them online at https://www.thehotline.org/.",
      "release": "2023-12-23T19:02:37Z",
      "duration": "01:35:31",
      "explicit": false,
      "youTubeId": "xDV4SBOxNsU",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xDV4SBOxNsU"
      }
    },
    {
      "id": "8f100c61-8bd1-42bf-836a-62efa64c84de",
      "title": "Episode 009 - Grooming, Satanic Evil and Jesus with a Whip.  Spineless Overseers (revised)",
      "description": "I was challenged about my statements regarding the court case involving Jerome Frandle (and the ensuing overseers\u0027 lack of response).  \n\nFor the sake of the bigger picture, it\u0027s important that I conduct myself with integrity and keep my word that I would issue a correction if I misspoke. \n\nI\u0027ve read the 65 page court transcript.  While I strongly dislike how his lawyer handled this, and how Jerome made no effort to correct his lawyer on his legal arguments,  I also want to make sure that I can firmly back up what I say, and in the case of Jerome Frandle, I can\u0027t unequivocally do so.\n\nWhat has been established is that when it is convenient, overseers are free to act with authority over their \u0022clergy\u0022.\n\nAnd when it is inconvenient (such as in court proceedings), to deny the authority exists. \n\nIf anything, the transcript highlights the level of uncomfortable secrecy that exists within this ministry and organization.  \n\nNonetheless, I trimmed out a 20s segment that involved statements about Jerome Frandle\u0027s court case.",
      "release": "2023-12-18T08:32:11Z",
      "duration": "00:41:20",
      "explicit": false,
      "youTubeId": "ClCF053FWdw",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ClCF053FWdw"
      }
    },
    {
      "id": "d6206664-073e-4d76-80b8-017af6c425b6",
      "title": "009 - Laura Glantz on surviving grooming, abuse, trafficking, and betrayal on her healing journey",
      "description": "This is Laura\u0027s story.",
      "release": "2023-12-16T23:17:48Z",
      "duration": "01:22:13",
      "explicit": false,
      "youTubeId": "iFFsG_26s64",
      "subjects": [
        "Two By Twos",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iFFsG_26s64"
      }
    },
    {
      "id": "8c357f88-08e1-429b-8a3e-c4b19119e2a4",
      "title": "010 - Grooming, Satanic Evil and Jesus with a Whip.  Spineless Overseers",
      "description": "A \u0022bonus\u0022 solocast.",
      "release": "2023-12-15T16:40:51Z",
      "duration": "00:41:44",
      "explicit": false,
      "youTubeId": "KMLbZR-bsi0",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KMLbZR-bsi0"
      }
    },
    {
      "id": "6ef4494a-b9ed-4f3e-af47-5380cd0a9b7d",
      "title": "008   Hod Allen   Former 2x2 Minister Tells his story of being inside the ministry",
      "description": "Hod is a longtime friend, and a former worker (2x2 minister).  As a part of his story, he shares the very significant toll that being an itinerant minister takes on an individual.",
      "release": "2023-12-13T06:16:03Z",
      "duration": "01:33:06",
      "explicit": false,
      "spotifyId": "3PVTs06vInLhDJjDJUvfEA",
      "appleId": 1000638457008,
      "youTubeId": "yddnZGXiClk",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3PVTs06vInLhDJjDJUvfEA",
        "apple": "https://podcasts.apple.com/podcast/008-hod-allen-former-2x2-minister-tells-his-story-of/id1705834603?i=1000638457008",
        "youtube": "https://www.youtube.com/watch?v=yddnZGXiClk"
      }
    },
    {
      "id": "8907411c-f2ff-4597-abc5-1c3e1330c51e",
      "title": "007   Grooming, Sex Trafficking and Abuse  A journey complicated by faith",
      "description": "Chapters: 00:00:32 Megan\u0027s Remarkable Story and Hiatus Recovery  00:05:38 Manipulation and Control: Unhealthy Aspects of Cults  00:06:36 The Complexity of Positive and Negative Experiences in Cults  00:11:07 The Corrupting Power of Leadership Positions in Religious Organizations  00:13:52 Maintaining a Pristine Image and Covering up Abuse in Religious Organizations  00:16:35 Tylenol Scandal: A Lesson in Crisis Management  00:21:45 Generational Mormonism and the Fear of Questioning  00:27:23 Indoctrination and the Difficulty of Breaking Free  00:30:53 The psychological impact of childhood indoctrination and abuse  00:34:01 Parents\u0027 awareness of the abuse and their response  00:37:26 Understanding the low rate of false reporting  00:40:34 The Devastating Impact of False Accusations  00:49:51 Struggle with Church\u0027s Treatment of LGBTQ Community  00:53:15 COVID as a Catalyst for Leaving the Church  00:59:08 A gradual separation from the church  00:59:57 Recent and rapid disconnection from the church in February  01:05:08 Making peace with our past and self-perception  01:05:45 Beginning of an Intense Discussion  01:05:47 Embracing the Shadow and Warrior Within",
      "release": "2023-12-04T22:41:00Z",
      "duration": "01:07:44.1040000",
      "explicit": false,
      "spotifyId": "5hgP9eAqpJmGLEkKG8IhhM",
      "appleId": 1000637489111,
      "youTubeId": "wAdv5zHwid0",
      "subjects": [
        "Two By Twos",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5hgP9eAqpJmGLEkKG8IhhM",
        "apple": "https://podcasts.apple.com/podcast/007-grooming-sex-trafficking-and-abuse-a/id1705834603?i=1000637489111",
        "youtube": "https://www.youtube.com/watch?v=wAdv5zHwid0"
      }
    },
    {
      "id": "20560198-5c1e-4bd5-9a60-a31fdd204742",
      "title": "006 - Abused by an ex-worker as a child;  overseers covered it up for years in the 2x2 fellowship",
      "description": "Dale believes his initial profession of faith was more out of obligation than genuine belief. He mentions that at a young age, he didn\u0027t have a deep connection with God. Jonathan explores the pressure and expectations placed on young individuals to profess within the fellowship. He notes that Dale also experienced abuse from Herb Erickson, a predator who had been moved around due to his actions. Dale continues his story by sharing that the abuse started when Herb began grooming his family.  The abuse deeply impacted Dale, who was introverted and bashful as a child, with speaking and meeting being terrifying experiences for him. He expresses his frustration at the lack of individual conversations within his family and wonders if predators know how to pick their victims. Dale shares about the long-lasting impact of abuse. In 2023, Dale felt prompted to write his own story and release the burden of the secret, highlighting the healing process that comes with sharing stories publicly and acknowledging the wrongdoing.",
      "release": "2023-10-23T23:33:54Z",
      "duration": "01:10:15.7710000",
      "explicit": false,
      "spotifyId": "6x0mDZEL9z0e93cClkPkV5",
      "appleId": 1000632344528,
      "youTubeId": "g3iSCogIpE4",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6x0mDZEL9z0e93cClkPkV5",
        "apple": "https://podcasts.apple.com/podcast/006-abused-by-an-ex-worker-as-a-child/id1705834603?i=1000632344528",
        "youtube": "https://www.youtube.com/watch?v=g3iSCogIpE4"
      }
    },
    {
      "id": "157bb899-4f3f-4c91-a453-dc966fa25d5c",
      "title": "Grooming, Child Sex Trafficking and Abuse: Former LDS Member Megan Conner",
      "description": "For those who have been affected by the 2x2 Fellowship, Megan Conner\u0027s story will have a lot of uncomfortable parallels.  She is an ex-LDS member and has been on a powerful healing journey. \n\n(The Oct 15th, 2023 THT interview needs to be re-recorded, so I\u0027m crossposting a relevant interview from my other podcast called \u0022Between The Before \u0026 After\u0022) \n\nYouTube: https://www.youtube.com/@btbapodcast  \nWebsite: https://www.betweenthebeforeandafter.com/ \nApple: https://podcasts.apple.com/us/podcast/between-the-before-after-the-stories-that-shape-us/id1435974463 \nSpotify: https://open.spotify.com/show/60fkweUASdZWXisYIlbpx3 \n\nMegan shares her personal story of being abused as a child. Megan also dives into her upbringing in the Mormon church and the pressures placed on its members. \n\nDuring our discussion, we explore the concept of grooming and how victims often don\u0027t realize they are being manipulated until it\u0027s too late. She also shares the challenges she faced in forming relationships and dealing with the lingering trauma throughout her life. We touch upon the harmful teachings and victim-blaming prevalent in the Mormon church, shedding light on the damaging effects they have on survivors. \n\nCONNECT WITH MEGAN: \nhttps://third-verse.com/",
      "release": "2023-10-15T19:56:03Z",
      "duration": "01:12:45",
      "explicit": false,
      "youTubeId": "9Z-VxSzms_I",
      "subjects": [
        "Two By Twos",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9Z-VxSzms_I"
      }
    },
    {
      "id": "b50b7217-7d3f-4ffc-b0c1-5cade63b5cd6",
      "title": "005   A victim of terrifying abuse Rhonda is resilient, courageous and a powerful advocate",
      "description": "In this episode of \u0022The Hidden Truth,\u0022 Rhonda shares her personal history, being raised in the fellowship and professing her faith at a young age. She also opens up about her traumatic experiences as a victim, including incidents of abuse by a babysitter and an elder in the fellowship. Rhonda explains that she had initially minimized the impact of these experiences due to her abusive childhood with her father. However, after learning about other survivors through recent revelations, she has come to recognize the widespread nature of the issue within the fellowship. The conversation delves into the challenges of addressing these traumas and the importance of support for survivors. Rhonda discusses her research on how childhood sexual abuse affects the brain and one\u0027s overall life. She reveals that she suffered from chronic diseases at a young age and struggled to find healing. They share the importance of setting boundaries and the struggles of trust and forgiveness that arise from abusive relationships.",
      "release": "2023-10-08T19:00:00Z",
      "duration": "00:52:12.8390000",
      "explicit": false,
      "spotifyId": "70pEJsK9KfZKOWeeDYNWbM",
      "appleId": 1000630614263,
      "youTubeId": "KZX2sr2TsnM",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/70pEJsK9KfZKOWeeDYNWbM",
        "apple": "https://podcasts.apple.com/podcast/005-a-victim-of-terrifying-abuse-rhonda-is/id1705834603?i=1000630614263",
        "youtube": "https://www.youtube.com/watch?v=KZX2sr2TsnM"
      }
    },
    {
      "id": "8e975f38-510e-4853-8a04-bb4a73cd2e47",
      "title": "004   Cherie spent 30 YEARS researching the 2x2 Truth Church she grew up in   here s what she uncovered",
      "description": "On this episode of \u0022The Hidden Truth, Breaking the Silence,\u0022 our guest today is Cherie Kropp, author of \u0022Preserving the Truth,\u0022 who shares her personal journey within the fellowship and her extensive research on the subject. Cherie, a third-generation member, grew up on convention grounds in Mississippi, providing her with a unique perspective on the inner workings of the fellowship. Leaving home, Cherie got married and lived in Dallas for a while. As she did not have a university education, questions started to form in her mind regarding the strict rules enforced within the fellowship. These questions, along with a desire for personal freedom, eventually led her to leave the fellowship. Cherie explains that she began questioning the teachings of the church and sought scriptural support, but could not find any. She recalls asking a worker about the biblical basis for there being only one way to heaven, but the worker was unable to provide any scripture to support the claim. This realization made her question the true nature of the church. Cherie\u0027s research on the fellowship led her to start a website called tellingthetruth.info, where she collected documents and photos related to the fellowship. Eventually, she decided to turn her research into a book, spending 30 years on her research, including trips to the UK to gather more documents. Cherie sent an exit letter to many friends and family during her journey and received few responses, feeling somewhat shunned. During the conversation, Cherie and the host discuss their ongoing research into the origins and growth of the fellowship. They touch upon interesting documents and court cases related to allegations of human trafficking and child sexual abuse within the fellowship. Cherie\u0027s passion for preserving historical information drives her to continue her work, as she believes that everyone associated with the church has the right to know the truth and make informed decisions about their involvement.  I encourage our listeners to read Cherie\u0027s book, \u0022Preserving the Truth,\u0022 for a deeper understanding of the fellowship. Until next time, thank you for joining us on \u0022The Hidden Truth, Breaking the Silence.\u0022",
      "release": "2023-10-01T07:02:00Z",
      "duration": "00:58:03.4540000",
      "explicit": false,
      "spotifyId": "3cxkJIIcE4m1ClSKG8rT6e",
      "appleId": 1000629782438,
      "youTubeId": "zfoPYqQ46BM",
      "subjects": [
        "Two By Twos",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3cxkJIIcE4m1ClSKG8rT6e",
        "apple": "https://podcasts.apple.com/podcast/004-cherie-spent-30-years-researching-the-2x2-truth/id1705834603?i=1000629782438",
        "youtube": "https://www.youtube.com/watch?v=zfoPYqQ46BM"
      }
    },
    {
      "id": "5313ec7c-da55-408e-a8da-9481e1652a53",
      "title": "003   Lauren Rohs and The Height of Complicity in the 2x2 Truth Church CSA/SA Scandal",
      "description": "In this episode of The Hidden Truth, we dive deep into the Christian fellowship that has maintained a painful silence for years. Lauren Rohs joins us as our guest, sharing her experiences growing up in the fellowship and shedding light on its strict beliefs and lack of meaningful friendships. We explore the evolution of the fellowship from her great-grandparents\u0027 era to the present day, and Lauren takes us on her personal journey of questioning and eventually leaving the community. We delve into the unsettling aspects of control and the fear of asking questions that pervade the community. Lauren also shares her passion for playing the piano and her admiration for Rachmaninoff. Moving beyond her life within the fellowship, Lauren discusses her experiences as a stripper and the difficult decision to give her child up for adoption. We explore her attempts to reconcile with her family and the shocking revelations she uncovered about her father\u0027s abusive behavior. Throughout the conversation, I stress the importance of storytelling and the urgent need for radical change and reparations within the community. We discuss the fear and avoidance that prevent people from facing the truth and the devastating consequences of maintaining the status quo, particularly in cases of child sex abuse. As the main speakers, we emphasize the significance of breaking the silence and exposing the harmful behavior that persists within the fellowship. We liken the secrecy to a form of \u0022child sacrifice,\u0022 as it allows the abuse to continue unchecked. We express our outrage at those who dismiss these crimes due to their occurrence in the past, highlighting the ignorance and disrespect towards survivors. Drawing parallels to commemoration events like 9/11, we stress that the ongoing impact of these crimes necessitates support for survivors and a refusal to uphold appearances. Quoting Jesus\u0027 teachings on the consequences of harming children, we condemn those who enable and cover up the abuse in the fellowship. We discuss the trauma triangle and the critical step of removing oneself from enabling abusive behavior. We highlight the magnitude of the problem, likening it to the reputation of the Catholic Church for enabling and covering up abuse. We encourage listeners feeling overwhelmed to recognize their role and take action, promoting awareness and change. Expressing the need to stop being complicit and withdraw support from the system that enables child sex abuse, we acknowledge that making a change will take time but is absolutely possible. We express perplexity over the failure of educated individuals to recognize child sex abuse as a crime, perhaps due to flawed theology or doctrine that prioritizes personal salvation over speaking up against the institution. As the main speakers, we point out the dangerous dynamics of a system where overseers are complicit with perpetrators. We reflect on our decision to write a letter to the overseers, knowing it wouldn\u0027t result in their stepping down but hoping to set a precedent for speaking out against those in power. We acknowledge that while some people may still idolize these individuals, survivors\u0027 stories and the accompanying data should be enough to wake people up. Despite the recognition that survivors shouldn\u0027t have to repeatedly share their stories to be taken seriously, we discuss the importance of their narratives in leaving a lasting impact on listeners. We express a willingness to watch the organization implode if it means justice for survivors. As an outsider looking in, we share the mixed response we\u0027ve received, ranging from praise to vilification, but state that we\u0027ve become immune to both. We express frustration at encountering individuals who should know better, such as a lawyer who wants survivors to come to him for information despite being close friends with a perpetrator. We emphasize the need for policy changes in light of the crisis, underscoring the lack of protection for children within the community. Expressing concern for educated individuals who refuse to acknowledge the need for systemic change, I share my personal frustration, particularly within my own family who dismiss my efforts and label me as crazy. I stress that those who speak out against abuse are not the ones condemned to hell; rather, it is the actions of the child predators themselves. I call on others to focus their anger on the perpetrators and take action by not supporting them financially or granting them authority. As the main speaker, I urge fence sitters to reckon with the issue and take an active role in the fight against abuse. I emphasize that survivors are not obligated to share their stories, placing the responsibility on the complicit community to take action and disrupt the status quo. In conclusion, we express our gratitude to Lauren for sharing her time and her important work. We stress that the focus should be on the thousands of survivors who need support and justice. As a community, we owe them our love, support, and assistance. Thank you for tuning in to The Hidden Truth, and please remember to subscribe and share to help us reach and inspire more people. It is crucial that these stories are heard to raise awareness and support the survival of victims.",
      "release": "2023-09-24T22:30:00Z",
      "duration": "01:04:59.6630000",
      "explicit": false,
      "spotifyId": "7qYRREt0GArXaWgbOx9yZC",
      "appleId": 1000628045324,
      "youTubeId": "idr3jOtvqug",
      "subjects": [
        "Two By Twos",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qYRREt0GArXaWgbOx9yZC",
        "apple": "https://podcasts.apple.com/podcast/003-lauren-rohs-and-the-height-of-complicity-in/id1705834603?i=1000628045324",
        "youtube": "https://www.youtube.com/watch?v=idr3jOtvqug"
      }
    },
    {
      "id": "df7ba4fc-b66c-4551-9b61-87bb230d5afc",
      "title": "002   Cynthia Liles Private Investigator of Institutional Abuse in 2x2 Truth Church",
      "description": "Cynthia Liles is a private investigator spearheading efforts to address sexual abuse within a Christian fellowship.   They discuss Institutional protection preventing open discussion about abuse and the importance of making information about perpetrators public for safety, highlighting the difficulties faced by those trying to report abuse within religious institutions.   Why do those in authority in religious organizations cover up these crimes instead of pursuing justice?",
      "release": "2023-09-17T22:30:00Z",
      "duration": "01:06:18.2400000",
      "explicit": false,
      "spotifyId": "6KrznOu3rFtFIHoRkwXESg",
      "appleId": 1000628045400,
      "youTubeId": "xGcme6BK5uU",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KrznOu3rFtFIHoRkwXESg",
        "apple": "https://podcasts.apple.com/podcast/002-cynthia-liles-private-investigator-of/id1705834603?i=1000628045400",
        "youtube": "https://www.youtube.com/watch?v=xGcme6BK5uU"
      }
    },
    {
      "id": "ea66a30c-36a6-4409-b7ce-717c704c6f9c",
      "title": "📹My Thoughts on the Ontario CSA SA Meeting Guidelines within the 2x2 Truth Church",
      "release": "2023-09-15T20:28:16Z",
      "duration": "00:16:18",
      "explicit": false,
      "youTubeId": "UjKHZklUWn0",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UjKHZklUWn0"
      }
    },
    {
      "id": "a0b167eb-3e54-43ad-aa61-83071cff6c7c",
      "title": "My Unfiltered Thoughts on Recent Overseers Letter",
      "release": "2023-09-15T20:28:00Z",
      "duration": "00:16:30",
      "explicit": false,
      "youTubeId": "jlOAvRLebfk",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jlOAvRLebfk"
      }
    },
    {
      "id": "8dc5cae4-3be5-4e5b-86db-defbb986b412",
      "title": "Accountability and Corruption in Leadership 👥within the 2x2 Truth Church",
      "description": "This is my unfiltered reaction video.  While, at this time, I\u0027m still a part of the fellowship, I continue to be a very vocal critic of leadership.",
      "release": "2023-09-15T19:51:15Z",
      "duration": "00:17:48",
      "explicit": false,
      "youTubeId": "yI6MA1Pe2PY",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yI6MA1Pe2PY"
      }
    },
    {
      "id": "23588770-8fe8-4b37-a3e2-60323a97b4d4",
      "title": "001   Sheri   Rebellious Teen leaves church her abuser was a minister in",
      "description": "In this episode we welcome Sheri as the guest. Sheri, a former member of the Christian fellowship that Jonathan is currently a part of, shares her experiences and her work as one of the co-founders of Advocates for the Truth. Sherry reveals that she has been on a path of exposing the abuse she suffered 40 years ago.  The conversation between Jonathan and Sheri sheds light on the experiences of an abuse survivor and their journey towards healing, justice, and advocacy.",
      "release": "2023-09-11T06:32:14Z",
      "duration": "01:06:26.3370000",
      "explicit": false,
      "spotifyId": "0fTFYNk7v83j0pvxAiEY3b",
      "appleId": 1000627430352,
      "youTubeId": "eAmLnep8auw",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0fTFYNk7v83j0pvxAiEY3b",
        "apple": "https://podcasts.apple.com/podcast/001-sheri-rebellious-teen-leaves-church-her-abuser/id1705834603?i=1000627430352",
        "youtube": "https://www.youtube.com/watch?v=eAmLnep8auw"
      }
    },
    {
      "id": "bb5fe56d-867e-45b2-94e9-89cb8085d05b",
      "title": "The Hidden Truth Podcast Trailer",
      "description": "As a member of this Christian fellowship for most of my life, I never really questioned things until (9 months) after the death of DB, in March 2023, the floodgates opened. And now, I\u0027m looking for answers which aren\u0027t forthcoming from \u0022the inside\u0022 so I\u0027ll be interviewing ex-members and ex-ministers to learn about their experiences and what led them to where they are today. This docuseries may discuss potentially triggering topics of an adult nature, so be forewarned",
      "release": "2023-09-08T21:32:58Z",
      "duration": "00:02:44.4140000",
      "explicit": false,
      "spotifyId": "5PXOqJeNzRFnyDVvdbmJ3B",
      "appleId": 1000627251486,
      "youTubeId": "WH6RkEa1er4",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5PXOqJeNzRFnyDVvdbmJ3B",
        "apple": "https://podcasts.apple.com/podcast/the-hidden-truth-podcast-trailer/id1705834603?i=1000627251486",
        "youtube": "https://www.youtube.com/watch?v=WH6RkEa1er4"
      }
    }
  ]
}