{
  "id": "545a1e3a-e1b8-40b0-8fa4-4b9f540fe1d6",
  "name": "The Life After Leaving Podcast: An Ex-Christadelphian Podcast",
  "spotifyId": "5Fd0eW3vMCt1w5MfqD0jgJ",
  "appleId": 1775771759,
  "episodes": [
    {
      "id": "1a21d90d-ef15-4d26-91d2-f6fbf1a42bd4",
      "title": "S3 Ep. 31 Biblical Studies 101 for Ex-Christadelphians with Steve",
      "description": "Today we’re chatting with Steve about one of his favorite topics, Biblical Studies! In this episode, we learn about the Bible from a former Christadelphian brother who left behind Christadelphian dogma for an open-minded scholarly approach to the Bible. In this episode, Dr. Steve reframes and explores many topics that we thought we knew about to see how context, translation, and history play a part in truly understanding the Bible. We learn that the Dead Sea Scrolls do *not* prove that the Bible hasn’t changed (like some of us were told), that the Bible underwent editing, redaction, and other changes throughout history (rather than being the perfect, unchangeable word of God), and that numerous passages in the Bible actually quote texts that are not found in the KJV Bible we read at all (and we never noticed?!) Steve’s expertise also brings about interesting discussion about the evolution of the doctrine of resurrection, the idea of atonement, whether God forbids homosexuality in Leviticus, and whether “Paul” actually wrote that women should be silent in the ecclesia. We also had fun exploring “sex, drugs, and rock n’ roll” in the Bible, reading “Solomon’s top ten pick-up lines”, and listening to Steve’s memory of a satirical prayer given at a Christadelphian ecclesia. Be warned, you’ll need to leave your Strongs Concordance at home for this episode, otherwise you’ll fail this class! Listener discretion advised. If you’re interested in coming on the podcast or have comments or questions, you can contact Zinnia at lifeafterleavingpodcast@gmail.com Resources and References: Reading the Bible Again For the First Time by Marcus Borg Grimms’ Fairy Tales The Documentary Hypothesis Who wrote the Bible? By Richard Elliot Friedman Redaction Criticism National Treasure Pseudopigrapha Catholic Bible Orthodox Bible Coptic Bible Ethiopic Bible Testament of Moses Testament of the 12 patriarchs The Wisdom of Solomon Solomon\u0027s Top Ten Pick-Up Lines 3 books of Isaiah Wisdom of Sirach/ Ben Sira The Birmingham Amended Statement of Faith Hapax legomenon (a word that occurs in only one place) Apocryphon of Jannes and Jambres Testament of Job Strong’s concordance The Book of Judith Judith beheading Holofernes (Caravaggio) Judith Slaying Holofernes (Artemisia Gentileschi) The Talmud Cult Bride: How I was Brainwashed- and How I Broke Free by Liz Cameron Book of Enoch Instagram video on pseudepigrapha The Ancient Greeks and Quotation Marks The Bible: Leviticus 18:22 \u0026 20:13, James 5:11, Ezekiel 18:20, 2 Tim 3:16, Song of Solomon 1:9, Isaiah 26:19, Daniel 12:2, 1 Timothy 2:11-12, 1 Corinthians 11:2-16",
      "release": "2025-11-02T13:00:00Z",
      "duration": "02:08:01.2080000",
      "explicit": true,
      "spotifyId": "38PGEVesdDUHpzhTa9zLIj",
      "appleId": 1000734842030,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38PGEVesdDUHpzhTa9zLIj",
        "apple": "https://podcasts.apple.com/podcast/s3-ep-31-biblical-studies-101-for-ex-christadelphians/id1775771759?i=1000734842030"
      }
    },
    {
      "id": "ebc1ee3f-ae67-438a-af04-42b9961138f5",
      "title": "S3 Ep. 30 Pies, Theft, and Murder: More Christadelphian True Crime with Zinnia \u0026 Pete",
      "description": "In today’s episode, Zinnia and Pete discuss six more historical examples of criminality among the Christadelphians that were not covered in our first true crime episode- from investigations into meat pies and hate speech, to missing charitable funds, and even murder! Let’s get into the spirit of spooky season as we discuss childhood medical neglect and speculate on why religious communities are so skeptical of modern medicine and vaccines, the passivity of believers who follow a “Jesus take the wheel” approach to their life, and about how the “punishment” for embezzlement looks a lot like a reward, or even condoning theft of charitable funds! We also look at how criminal investigations were handled during the early days of Christadelphia under Robert Roberts compared to the present day (hint: there were no secret meetings or letters). And we also have a few laughs as we learn about the Christadelphian view on sex toys, contrast modern medicine with biblical medicine, and discover (while recording!) that the thisisyourbible.com website was apparently hacked years ago and no one noticed! \n\n \n\nAlso, please don’t send me your opinions on vaccines. However, feel free to send me your favorite “biblical loopholes” or additional information relating to any of these stories to lifeafterleavingpodcast@gmail.com! Thanks in advance! \n\n \n\nListener discretion advised.\n\n \n\nTW: Childhood Medical Neglect, Manslaughter Charges, Domestic Violence, Violent Murder\n\n \n\nResources and References:\n\n \n\nSpooky Intro Music Inspired by The Addams Family Theme Song\n\nThank you to the ex-CD who snapped with me for this!\n\n \n\nJohn Thomas, honorary mention:\n\n \n\nThe Life After Leaving Podcast: Episode 6 True Crime with Keturah\n\n \n\nAnatomy: A Love Story by Dana Schwartz\n\n \n\nThe Life After Leaving Podcast: Episode 26 Liar, Liar\n\n \n\nThe Case of the Bad Meat:\n\n \n\n“The History of the Christadelphians 1864-1885” by Andrew Wilson\n\n \n\nThe Christadelphian Magazine: November 1881, December 1881, and January 1882\n\n \n\nThe Christadelphian Ecclesial Guide by Robert Roberts (1883)\n\n \n\nMid-Atlantic Christadelphian Bible School History Skit Performance \n\n \n\nNaegleria fowleri  \n\n \n\nSweeney Todd\n\n \n\nEast Kilbride Scandal:\n\n \n\nNational Secular Society: NSS refers Christian charity to regulator for anti-vax memes\n\n \n\nDaily Record in February 2022 \n\n \n\nAnother Daily Record Article in February 2022\n\n \n\nDaily Record in June 2022\n\n \n\nEast Kilbride Christadelphians Facebook\n\n \n\nMedicine in the Bible\n\n \n\nThe Satanic Temple\n\n \n\nSatanists Unveil Lucifer Statue Design for Oklahoma Capitol (2014)\n\n \n\nOne Christadelphian on the East Kilbride Christadelphians\n\n \n\nDoes the rainbow “belong only to God”? (IG)\n\n \n\nCan Christadelphians Use Sex Toys?\n\n \n\nCharity or Hate Group?\n\n \n\n2019 Article investigating hate group claims/ This Is Your Bible \n\n \n\n NSS Dossier on Christadelphian Charities\n\n \n\nThisIsYourBible.com on Human Rights\n\n \n\nUnited Nations Universal Declaration of Human Rights\n\n \n\nCambridge University: Autistic Individuals More Likely to be LGBTQ\u002B\n\n \n\nCambridge University: Autistic Individuals have increased risk of Physical Health Conditions\n\n \n\nAutism Unemployment Rate\n\n \n\nTIME Magazine: Asperger’s Syndrome, the Nazi Regime, and the Dangerous Power of Labeling People\n\n \n\nAutism and Disability in Nazi Vienna\n\n \n\nDescribing neurotypicals like they describe autistic people (FB)\n\n \n\n“Neurotypical Spectrum Disorder” (Reddit)\n\n \n\nAnti-Defamation League Definition of a Hate Group\n\n \n\nChristadelphian Care Homes Report\n\n \n\nThis is Your Bible Website shares bizarre (broken?) link under “Human Rights”\n\n \n\nWayback Machine: The Christadelphian Daily Journal on Human Rights\n\n“[1] In passing, we remark that God has not given anyone demandable rights of any sort.” \n\n \n\nReport of Charity Commissions Investigation and Compliance Case Work: 2012-2013\n\n \n\nThe Paradox of Tolerance \n\n \n\nMichael Ashton Embezzlement:\n\n \n\nBirmingham Christian charity faces probe over alleged disappearance of hundreds of thousands of pounds Feb 2012\n\n \n\nChristadelphian Research Web Archive June 2015\n\n \n\nThe Christadelphian Magazine, January 2012, April 2016, July 2022\n\n \n\nEx-Christadelphians.com Michael Ashton Books\n\n \n\nEx-Christadelphians.com Forgiving Your Brother\n\n \n\nEcclesial Guide by Robert Roberts\n\n \n\nThe Danger of Cults by Michael Ashton\n\n \n\nMedical Neglect and Death of a Child:\n\n \n\n“Girl Dies on Water Diet” November 1975\n\n \n\nThe Lancet ‘A Case of Imperforate Anus’ by John Thomas\n\n \n\nJoe Dispenza, chiropractor\n\n \n\n2023 study of the Followers of Christ church\n\n \n\nThe Guardian article on Religious Medical Neglect\n\n \n\n1998 Study on Medical Neglect Deaths\n\n \n\n2011 Study on Faith Healing Deaths\n\n \n\nDr. Alec Burton- HealthScience.org\n\n \n\nFasting For Health and Recovery (Video) by Alec Burton\n\n \n\nAlec Burton Obituary\n\n \n\nThank you God- Tim Minchin (Youtube)\n\n \n\nBrother Brian Murder, Murder Plots, and Attempted Prison Escape:\n\n \n\nBBC News Jealous Man Gets Life For Murder\n\n \n\nBBC News: Isle of Wight Prison Helicopter Escape Foiled\n\n \n\nHeraldNet UK murderers outlandish jail escape plot foiled\n\n \n\nHelicopter Prison Escapes\n\n \n\nMurderers Isle of Wight Escape Plot Foiled\n\n \n\nBBC News Isle of Wight Prison Security Lapse Let Drugs In \n\n \n\nThe Guardian ‘Blindsided wife of Long Island serial killer suspect files for divorce’\n\n \n\nThe Telegraph ‘Teacher So Jealous He Tried to Kill All His Rivals’\n\n \n\nThe Telegraph ‘Jealous ex-teacher convicted of murder’\n\n \n\nBerkshire Live ‘Obsessed Teacher Guilty of Murder’\n\n \n\nBBC News ‘Jealous ex killed lover’s friend’\n\n \n\nThe Guardian ‘Murderer’s Isle of Wight escape plot foiled’\n\n \n\nBBC News ‘Isle of Wight Prison Helicopter Escape Foiled’\n\n \n\nHerald Net ‘Murderer’s Outlandish Prison Escape Plot Foiled’\n\n \n\nIsle of Wight prison security lapse ‘let drugs in’",
      "release": "2025-10-26T12:00:00Z",
      "duration": "03:21:54",
      "explicit": false,
      "spotifyId": "1IFFcZRWpp4VBmPY6bbolb",
      "appleId": 1000733546965,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IFFcZRWpp4VBmPY6bbolb",
        "apple": "https://podcasts.apple.com/podcast/s3-ep-30-pies-theft-and-murder-more-christadelphian/id1775771759?i=1000733546965"
      }
    },
    {
      "id": "f51de1cd-254c-44ae-8f6c-a58772204e33",
      "title": "S3 Ep. 29 Fellowship with Tim",
      "description": "Today we’re chatting with Tim! In today’s episode, we hear from a survivor of the movement of a small group of Christadelphians who traveled to Israel because of an article in a Christadelphian magazine in order to meet Jesus, who they believed had returned but was living “in cognito” as an Israeli politician. Tim tells us about when his family prayed to a literal burning bush they believed was a sign from God, about his sister becoming a shepherdess in the Promised Land, and about the repeated abuse, attempted murders, and other traumatic experiences that marked his childhood in Israel. This episode is a doozy… we discuss “bullets for Jesus”, severe PTSD, and the difficulty Tim experienced trying to escape the nightmare that his family\u0027s beliefs in Christadelphian doctrines had led him and his siblings into… \n\n \n\nListener Discretion Advised.\n\n \n\nTW: Emotional, Physical, Psychological and Sexual Child Abuse, Kidnapping, Physical Assault, Murder-Suicide Attempts, Gun Violence, PTSD\n\n \n\nResources and References:\n\n \n\n“Who is this…?” by Charles J. Hall of Boise, Idaho in Testimony Magazine. Email lifeafterleavingpodcast@gmail.com to request a PDF\n\n \n\nThe Branch Davidians at Waco and David Koresh\n\n \n\nThe Jonestown Massacre and Jim Jones\n\n \n\nMoshe Dayan \n\n \n\nSylvia Plath\n\n \n\nThe Ecclesial Guide (1883)\n\n \n\nBranhamites\n\n \n\nPoseidon Adventure (1972 Movie)\n\n \n\n\u0022High Demand Group Recovery Group.\u0022  Hosted by Mary Moore via Zoom. Email lifeafterleavingpodcast@gmail.com for Mary’s email address.",
      "release": "2025-10-19T12:00:00Z",
      "duration": "02:02:16",
      "explicit": false,
      "spotifyId": "7l1aaqSD7whB0XOE7Xb1U0",
      "appleId": 1000732513485,
      "subjects": [
        "Christadelphians",
        "Branch Davidians",
        "Peoples Temple",
        "William M. Branham",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7l1aaqSD7whB0XOE7Xb1U0",
        "apple": "https://podcasts.apple.com/podcast/s3-ep-29-fellowship-with-tim/id1775771759?i=1000732513485"
      }
    },
    {
      "id": "2ffef446-a0cb-4bd0-b61b-e34dbdf85f06",
      "title": "S3 Ep. 28 Fellowship with Peter",
      "description": "Today we’re chatting with Peter! In this episode, we hear from a former brother about the difficulties of growing up in a family perpetually changing ecclesias, of struggling to build friendships within the Christadelphian community, and of trying to meet the complicated standards for public prayers and bible readings. Peter shares how he had felt so mentally immobilized by fear that he had never questioned any of the doctrines until he met a Christadelphian who did, setting Peter on a path of asking questions, fact checking Christadelphian teachings, and eventually realizing that some Christadelphians share incorrect information (sometimes knowingly!) Peter also speaks up against the harmful views he was taught about “marital rights”, the intense schedule of attendance that was expected of Christadelphians every week in England, and of his struggles to create his own identity, beliefs, and community as an ex-Christadelphian adult. \n\nListener discretion advised.\n\n \n\nResources and References:\n\n \n\nWiki mentioning Central Name Change based on location \n\n“Birmingham Temperance Hall ecclesia (so known after the location of their rented rooms)... In 1952 the majority of the Berean Christadelphian Fellowship rejoined the \u0022Birmingham Central\u0022 body of Christadelphians (\u0022Temperance Hall\u0022 was now known as the \u0022Central Fellowship\u0022, since Birmingham Central had ceased renting rooms at Temperance Hall in 1932”\n\n \n\nThou, Thee, and Archaic Grammar\n\n \n\nThou Grammer Wikipedia\n\n \n\nWho wrote the Bible by Richard Elliot Friedman\n\n \n\nGenie the feral child article\n\n \n\nMount Tabor and the Jezreel Valley\n\n \n\nCosmic Skeptic with Alex O’Connor on Youtube\n\n \n\nHoly Koolaid on Youtube\n\n \n\nGood Omens (TV Show)\n\n \n\nChimp Paradox: How Our Impulses and Emotions Can Determine Success and Happiness and How We Can Control Them by Steve Peters\n\n \n\nComplex PTSD books\n\n \n\nYour logical fallacy is website\n\n \n\nYour bias is website",
      "release": "2025-10-12T12:00:00Z",
      "duration": "02:37:17",
      "explicit": false,
      "spotifyId": "5rOF0PJjEzt3BahWCYiTLK",
      "appleId": 1000731446764,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rOF0PJjEzt3BahWCYiTLK",
        "apple": "https://podcasts.apple.com/podcast/s3-ep-28-fellowship-with-peter/id1775771759?i=1000731446764"
      }
    },
    {
      "id": "0766f3d2-ea18-4757-8841-299914e5fef9",
      "title": "S3 Ep 27. Fellowship with Sarah",
      "description": "TW: child sexual abuse, pedophilia, depression, attempted suicide\n\n \n\nToday we’re chatting with Sarah! In this episode, Sarah answers all of my questions about the subgroup of Christadelphians called the “Bereans”, shares her experience of growing up in a small ecclesia as a victim of child m*lestation by Christadelphian brothers, and the story of how the Berean Christadelphian community discovered and responded to the abuse (Surprise! NOT WELL!) We also learn about Sarah’s second baptism, the revelations that shocked her as she learned more about the outside world, and discuss the harmful consequences of some of the Berean-specific Christadelphian beliefs for victims of child abuse. Sarah also shares the positives in her life now that she left the Christadelphian community, the lessons she’s learned about trying to heal, and about the joy and freedom she has in her adult life.\n\n \n\nListener discretion advised.\n\n \n\nResources and References:\n\n \n\nWikipedia on Berean Christadelphians\n\n \n\nBerean Christadelphian Website\n\n \n\nChurch law and tax website: “Minimizing the Risks of Child Molestation in Churches”\n\n \n\nAmerican Mandatory Reporting Laws\n\n \n\n“KidFlix” platform busted news article\n\n \n\nWrested Scriptures by Ron Abel (Book- PDF Link)\n\n \n\nAccidental Saints by Nadia Bolz-Weber (Book)\n\n \n\nTattoos on the Heart: The Power of Boundless Compassion by Gregory Boyle\n\n \n\nSearching for Sunday by Rachel Held Evans\n\n \n\nThe Gnostic Gospels by Elaine Pagels \n\n \n\nJim Palmer Substack “Deconstructionology”\n\n \n\nThe End of Faith by Sam Harris\n\n \n\nSupernatural: What the Bible Teaches About the Unseen World and Why it Matters by Dr. Michael Heiser\n\n \n\nOn The Origin of Time by Stephen Hawking \n\n \n\nDonald Hoffman (Author)\n\n \n\nConscious: A Brief Guide to the Fundamental Mystery of the Mind by Annaka Harris\n\n \n\nFrederico Faggin on Consciousness\n\n \n\nDr. Tara Swart\n\n \n\nDr. Gabor Mate\n\n \n\nDawn Smith: TedX “Why I Left an Evangelical Cult”",
      "release": "2025-09-28T12:00:00Z",
      "duration": "02:52:37",
      "explicit": false,
      "spotifyId": "6tRcEBzORVk44hyqVikIGn",
      "appleId": 1000728881789,
      "subjects": [
        "Christadelphians",
        "Christian Fundamentalist",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6tRcEBzORVk44hyqVikIGn",
        "apple": "https://podcasts.apple.com/podcast/s3-ep-27-fellowship-with-sarah/id1775771759?i=1000728881789"
      }
    },
    {
      "id": "9408aaf9-f65b-4c89-bd31-443de2a8b592",
      "title": "S3 Ep. 26: Liar, Liar, M.D. on Fire: Dr. John Thomas’ Medical Qualifications with Zinnia",
      "description": "Today we’re investigating the medical qualifications of “Doctor” John Thomas, the founder of the Christadelphians. In this episode, we’ll debunk some questionable claims allegedly recorded in mysterious letters, examine damning evidence hidden in plain sight regarding Thomas’ medical education, and explore the shocking reason why John Thomas really left England to pursue a medical career in the United States. We also deep dive into John Thomas’ background in “male midwifery”, his forgotten role as a teacher for the Royal Western Hospital School, and his published treatment plan for cholera. Zinnia also uncovered a new biography of John Thomas’ medical background while researching this episode and unveils brand new information and insights about his medical background for this episode! Please join us for another exciting history episode as John Thomas’ lies and criminal activity get exposed by Zinnia, namely, a woman.\n\n \n\nMany thanks to Dr. Craig Fairweather of Sydney, Australia, to the other ex-Christadelphians who have reached out to share resources, and to the amazing archivists and librarians who helped me uncover an amazing new resource for this episode!\n\n \n\nPlease stay tuned for Part Two!\n\n \n\nListener discretion advised.\n\n\n\n\n\nResources and References:\n\n*Please email me at lifeafterleavingpodcast@gmail.com if interested in seeing a resource that isn\u0027t readily available that is listed here.\n\nDr. Thomas: His Family and the Background of His Times’ by Charles Blore (1982)\n\nJohn Thomas: His Friend and His Faith” by Peter Hemingray\n\nThe Life After Leaving Podcast, Episode 6\n\nThe Life After Leaving Podcast, Episode 2\n\nThe Life of Dr. Thomas\n\nArchives: Royal College of Surgeons of England, Hackney Archives, \u0026 Southwark Archives\n\nThe Christadelphian Magazine, April 1886 edition\n\nDr. Thomas: His Life \u0026 Work By Robert Roberts 1873\n\n“Dr. John Thomas - the man and his work” by S. M. Algar from \u0027The Dawn Ecclesial Magazine\u0027 September 1969, from the Hackney, London Archives\n\nThe Lancet articles by John Thomas:\n\n\n“On the Immateriality of the Mind” by John Thomas\nImprovements on Civiale’s Lithoniritic Instruments by John Thomas\nSynopsis of the Treatment of the Malignant Cholera by John Thomas\nESSAY ON ASPHYXIA ;OR AN ATTEMPT TO Illustrate the Pathology, and to simplify the Treatment, of SUSPENDED ANIMATION by John Thomas\nCase of Imperforate Anus by John Thomas\n\nAnatomy Act of 1832\n\n“Medical Training in the United States Prior to the Civil War” by Robert Slawson\n\nBritish Newspaper Archive: Evidence for the Existence of the Royal Western Hospital in 1830\n\nThomas Leigh Blundell Source 1 and Source 2\n\nBody Snatching in the UK\n\nThe Real Mr Frankenstein - Sir Anthony Carlisle, Medical Murders, and the Social Genesis of Frankenstein by Donald Shelton (2020)\n\nPhysician, Apothecary, or Surgeon?\n\nWhy are male surgeons still addressed as Mr? - PMC\n\nCatholic Controversy by John Thomas in the Millennial Harbinger\n\nApostalic Advocate Vol 1 1834\n\nApostalic Advocate in 1836 M.D. Not D.D.\n\nOctober 1850 edition of New England Botanic Medical and Surgical Journal\n\nJohn Thomas M.D. in the St Charles Patriot Newspaper\n\nJimmy Neutron Brain Blast\n\n“The History of Medicine” by Alexander Wilder (1901)\n\nCatch Me If You Can (2002)\n\n“The New England Botanic Medical and Surgical Journal” by Calvin Newton Vol 2, No 8, Page 122, April 16, 1848\n\nThe Independents\n\nOliver Cromwell\n\nTrail of Tears\n\nCholera Statistics\n\nCholera in England\n\nAmerican Heritage- Doctors of the Frontier\n\nAlanis Morissette- Ironic\n\nCalomel\n\nTidings Devotional by Alan Eyre (2005)(Why Dr. Thomas Really Left England)\n\nBritish Health and Medicine\n\nHistorically Speaking: Victorian-era doctors lacked tools to help patients\n\nHackney, London - Wikipedia",
      "release": "2025-09-21T12:00:00Z",
      "duration": "02:50:38",
      "explicit": false,
      "spotifyId": "2znJErIzoYkK7W0dXoegpa",
      "appleId": 1000727725221,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2znJErIzoYkK7W0dXoegpa",
        "apple": "https://podcasts.apple.com/podcast/s3-ep-26-liar-liar-m-d-on-fire-dr-john-thomas-medical/id1775771759?i=1000727725221"
      }
    },
    {
      "id": "bf839bec-0fe6-42f6-a108-becdd7fb3531",
      "title": "S3 Ep. 25 Fellowship with Vanessa R",
      "description": "Today we’re chatting with (another) Vanessa! In this episode, we interview our first ex-Christadelphian raised in the “Old Paths” sub-group of the Christadelphian sect. Vanessa shares some stories from their community such as their caravan tent version of Bible School, the strict rules baptized members were required to agree to such as never going to the movies, and about how her family refused to fellowship with “Central” Christadelphians while visiting. However, Vanessa was always excited to learn and even startled her Sunday School teacher with the surprising facts she shared from reading Malcolm X. Despite her then-husband’s disapproval as a young woman, she continued to read and study outside of traditional domestic fields, eventually getting her PhD (and divorcing her Christadelphian husband). We also chat about wine so watered down that even thieves returned it, people pleasing and abusive relationships after being raised in high control religion, and the therapeutic creative project she undertook after leaving. Also, this episode is dedicated to our new podcast patron saint Keanu Reeves. \n\nPlease join us for another episode of fellowship among the Heathens!\n\nListener discretion advised. \n\n \n\nResources and References:\n\n \n\nSpeed (1994 Film):\n\nhttps://www.imdb.com/title/tt0111257/\n\n \n\nKeanu Reeves:\n\nhttps://en.wikipedia.org/wiki/Keanu_Reeves\n\n \n\nGoodreads- Cult Memoirs:\n\nhttps://www.goodreads.com/shelf/show/cult-memoirs\n\n \n\nVanessa’s first book ‘Holy Bible:\n\nhttps://www.amazon.com/Holy-Bible-Vanessa-Russell-ebook/dp/B085DLDJWF/ref=sr_1_1?crid=12PM33O8KXBTM\u0026dib=eyJ2IjoiMSJ9.P2UQqnx3tzVC00lQZU8J1A.UwnyG3mR0ZIKtTEP206TUR3FytgSL6LAFRXG5D6N6jg\u0026dib_tag=se\u0026keywords=vanessa\u002Brussell\u002Bholy\u002Bbible\u0026qid=1746401165\u0026s=books\u0026sprefix=vanessa\u002Brussell\u002Bholy\u002Bbible%2Cstripbooks%2C87\u0026sr=1-1\n\n \n\nVanessa\u0027s second book ‘The World is Not Big Enough’\n\nhttps://www.amazon.com/World-Is-Not-Big-Enough/dp/1743796838\n\n \n\nNetflix: American Murder: Gabby Petito (2025)\n\nhttps://www.imdb.com/title/tt35590630/\n\n \n\nNetflix: American Murder: Laci Peterson (2024)\nhttps://www.imdb.com/title/tt33079160/\n\n \n\nGary Schaefer (1951-2023), Christadelphian Serial Killer:\n\nhttps://en.wikipedia.org/wiki/Gary_Schaefer\n\n \n\nEMDR Therapy (Eye Movement Desensitization and Reprocessing): \n\nhttps://www.apa.org/ptsd-guideline/treatments/eye-movement-reprocessing",
      "release": "2025-09-14T12:00:00Z",
      "duration": "01:47:37",
      "explicit": false,
      "spotifyId": "3K3piQlElwPoDIWsPOdLTC",
      "appleId": 1000726753129,
      "subjects": [
        "Christadelphians",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3K3piQlElwPoDIWsPOdLTC",
        "apple": "https://podcasts.apple.com/podcast/s3-ep-25-fellowship-with-vanessa-r/id1775771759?i=1000726753129"
      }
    },
    {
      "id": "e3bf69b2-9d00-40a5-85de-790fb9ee8181",
      "title": "Ep. 24 Fellowship with Mako",
      "description": "Today we’re chatting with Mako! In this episode, Mako shares his experience traveling the world as a (white, male) Christadelphian before spending the years following his baptism serving in Jamaica as a missionary. After marrying his (Jamaican) wife and settling in America, his eyes were opened to racism \u0026 sexism among the Christadelphians when it became directed towards his family and as Christadelphians grappled with the Black Lives Matter movement. Mako also shares the story of how his small ecclesia split, how white Christadelphians online refused to even acknowledge racism in the Christadelphian community, and how he struggled to get distance from the Christadelphian community when they held the memorial service in his house every week! We also learn about his epic baptism, that time a Sunday School teacher crushed his dreams, and about his enduring love for the beach and ocean. Towards the end of the episode we also get philosophical as we speculate about ghosts, the Kingdom of God, and on the impact on society if everyone simply decided to “let God fix it”.\nPlease join us for another episode of fellowship among the heathens!\n \nListener discretion advised.\n \nWhite Savior Complex:\nhttps://en.wikipedia.org/wiki/White_savior\nhttps://www.health.com/mind-body/health-diversity-inclusion/white-savior-complex\n \nMicroaggressions:\nhttps://en.wikipedia.org/wiki/Microaggression\nhttps://www.npr.org/2020/06/08/872371063/microaggressions-are-a-big-deal-how-to-talk-them-out-and-when-to-walk-away\n \nBlack Lives Matter Movement:\nhttps://en.wikipedia.org/wiki/Black_Lives_Matter\nhttps://library.law.howard.edu/civilrightshistory/BLM\nhttps://blacklivesmatter.com/\n \nPascal’s wager\nhttps://en.wikipedia.org/wiki/Pascal%27s_wager#The_wager\n \nBarbie Movie (2023)\nhttps://www.imdb.com/title/tt1517268/\n \nMako’s exhortation on Love: \nAvailable on our Facebook Page (too long for the show notes!)",
      "release": "2025-03-30T12:00:00Z",
      "duration": "01:58:19",
      "explicit": false,
      "spotifyId": "5ga0XP4wXBrL13qVHtcKfU",
      "appleId": 1000701437646,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ga0XP4wXBrL13qVHtcKfU",
        "apple": "https://podcasts.apple.com/podcast/ep-24-fellowship-with-mako/id1775771759?i=1000701437646"
      }
    },
    {
      "id": "81f66e0f-8da5-4e3d-a9e2-9c4a57989e94",
      "title": "Ep. 23 Fellowship with Chloe",
      "description": "Today we’re chatting with Chloe! In this episode, Chloe shares her experience being raised to be homeschooled by Christadelphians and sent to a Canadian Christadelphian Heritage College before being discouraged from pursuing higher education and having to learn how to navigate the “outside world” once she hit adulthood. We also discuss mental health issues she experienced while she was a Christadelphian, how the Arranging Brothers refused to accept her resignation, and her method of using note taking to lure in a godly man. Chloe also shares her childhood ghost stories, discusses the anxious thoughts she had about the “Kingdom of God”, and opens up about the peer pressure around her baptism. We also ask, why would we ever want to be like the angels? Why is it so hard to develop close relationships as a Christadelphian? And how can we get the best roast dinner recipes now that we’ve left? \n \nPlease join us for another episode of fellowship among the Heathens!\n \n*Please note that we had a technical difficulty about 58 minutes in which interrupted the conversation, whoops!\n \nListener discretion advised. \n \nResources and References:\n \nGay the Pray Away by Natalie Naudus\nhttps://www.goodreads.com/book/show/209563856-gay-the-pray-away\n \nCultish: The Language of Fanaticism by Amanda Montell\nhttps://www.goodreads.com/book/show/55338982-cultish\n \nThought Terminating Cliches: \nhttps://en.wikipedia.org/wiki/Thought-terminating_clich%C3%A9\n \nhttps://psychology.org.au/about-us/news-and-media/aps-in-the-media/2024/explaining-thought-terminating-cliches-and-why-we\n \nCult Signs- Keeping Members Busy and Exhausted:\n“#11 Time Domination- Members are kept constantly busy to prevent independent thinking”\nhttps://blog.earkick.com/25-signs-youre-in-a-cult-how-cult-leaders-keep-you-hooked/\n \n“If you experience pressure to take part in any (or all) services, rites or rituals, and feel it would be socially costly not to take part (i.e. you might be excluded from other things, disapproved of or left out of friendship groups), you should be concerned.”\nhttps://secularliturgies.wordpress.com/2020/02/24/the-25-signs-youre-in-a-high-control-group-or-cult-by-anastasia-somerville-wong/\n \nNeville Goddard\nhttps://en.wikipedia.org/wiki/Neville_Goddard\n \nHarry Potter and Apparating:\nhttps://harrypotter.fandom.com/wiki/Apparition\n \nHistory episode mentioning ‘being like the angels’: Episode 13: Hypnosis, Telepathy and Ghosts\nhttps://open.spotify.com/episode/6s3SJuLRYSk1QNWK8vY7fm?si=4d187dddb9f147e3\n \nEx-Christadelphian website:\nhttps://www.ex-christadelphians.com/p/ex-christadelphians-support.html\n \nEar Biscuits Podcast: Rhett’s Spiritual Deconstruction (2020):\nhttps://open.spotify.com/episode/7hVSkiyffPFDL5IDud26kw?si=JDtFjlrYTuafnm6fyuNOhw\n \nEar Biscuits Playlist on Spiritual Deconstruction:\nhttps://www.youtube.com/playlist?list=PLLxmqs8vQskUbE_KnXQhA2gXmEg5dVMp3",
      "release": "2025-03-23T12:00:00Z",
      "duration": "02:22:33",
      "explicit": false,
      "spotifyId": "1MG5i9bOu2szwsgETb3oCh",
      "appleId": 1000700467359,
      "subjects": [
        "Christadelphians",
        "Cult Psychology",
        "Neville Lancelot Goddard"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MG5i9bOu2szwsgETb3oCh",
        "apple": "https://podcasts.apple.com/podcast/ep-23-fellowship-with-chloe/id1775771759?i=1000700467359"
      }
    },
    {
      "id": "0245acc5-06da-49c4-8672-d96fd5278b07",
      "title": "Ep. 22 Fellowship with Sylvia",
      "description": "Today we’re chatting with Sylvia! In this episode, Sylvia tells us about growing up in a family that read (and debated) the Bible together every day as ‘a little hippie kid’. She discusses her ‘radical’ experience as a Christadelphian starting in the 1960’s and ‘70’s in Canada where she helped found a new ecclesia, create a new bible school, and push for women to teach. She also turned heads in her meeting when her parents approved her underage marriage to an unbaptized First Nations “outsider”. Zinnia and Sylvia also discuss how her ideas were plagiarized for exhortations, the beliefs of First Nations people, and how David is definitely the sexiest Bible character! We also speculate about what we would want to see at an Ex-Christadelphian event. Come join us for another fellowship among the heathens and to hear about the ecclesia that was created to be “just a lot more fun”!\nListener discretion is advised. \n \nResources and References:\n \nSylvia’s Website:\nhttps://sylviaolsen.com/\n \nSylvia’s Blog:\nhttps://sylviaolsen.com/blog/\n \nSylvia’s Blog Post on being “The Zealot’s Daughter”\nhttps://sylviaolsen.com/2024/11/04/more-from-the-zealots-daughter-2/?fbclid=IwY2xjawI8Vk5leHRuA2FlbQIxMAABHU9phq2FI6_3u1oi_vJNicsdYh5YgKL7jLVfQndNS-okYYaf0RPK_P0f2g_aem_zOKOmP6BS84u2oVdl_07cw\n \nChristadelphian “Truth Corps” via the Christadelphian Bible Mission of the Americas and Canada\nhttps://cbma.net/the-mission-field/truth-corps/\n \nWrested Scriptures by Ron Abel (1990)\nhttps://www.amazon.com/Wrested-Scriptures-Christadelphian-Suggested-Explanations/dp/B000BT11GW\n \nChristendom Astray by Robert Roberts\nhttps://www.antipas.org/pdf_files/astray.pdf\n \nBraiding Sweet Grass by Robin Wall Kimmerer\nhttps://en.wikipedia.org/wiki/Braiding_Sweetgrass",
      "release": "2025-03-16T12:00:00Z",
      "duration": "01:45:27",
      "explicit": false,
      "spotifyId": "560r0ZkQlNtuSyDh0V4FyR",
      "appleId": 1000699369236,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/560r0ZkQlNtuSyDh0V4FyR",
        "apple": "https://podcasts.apple.com/podcast/ep-22-fellowship-with-sylvia/id1775771759?i=1000699369236"
      }
    },
    {
      "id": "36bf73f1-178f-4de5-8bf9-dc466769fbd7",
      "title": "Ep. 21 The History of Christadelphian Bible Prophecy with Zinnia",
      "description": "In today’s episode, Zinnia does a deep dive on the history of Christadelphian “prophecies” and apocalyptic predictions! She starts with the origins of the “prophetic arithmetic” methods by a rather infamous American in the 1840’s, follows the early prophecies by John Thomas and Robert Roberts, and leads into conversations around prophecies, high control groups, and cognitive dissonance in the modern era. We also chat about aliens, people on Instagram talking about the modern feelings of doom, and some incriminating definitions around their prophetic beliefs that make the Christadelphians look more than just a little bit culty. Ready to learn some Christadelphian history? Let’s get into it! Listener Discretion Advised. Resources and References: Toy Story (1995) “The Claw”: https://www.youtube.com/watch?v=atUUjSLMSiM William Miller and the Great Disappointment: https://en.wikipedia.org/wiki/Great_Disappointment The Great Disappointment of William Miller: https://www.patheos.com/blogs/thereligioushistorynerd/2024/04/the-great-disappointment-of-willliam-miller/ Millerism: https://en.wikipedia.org/wiki/Millerism The Seekers: https://en.wikipedia.org/wiki/The_Seekers_(rapturists) The Theory of Cognitive Dissonance and the book “When Prophecy Fails” https://en.wikipedia.org/wiki/When_Prophecy_Fails Wikipedia: History of the Seventh-day Adventists Church: https://en.wikipedia.org/wiki/History_of_the_Seventh-day_Adventist_Church#:~:text=The%20Seventh%2Dday%20Adventist%20Church%20formed%20out%20of%20the,known%20today%20as%20the%20Millerites . More Millerite History: https://st.network/analysis/top/the-second-coming-files-a-2000-year-investigation-part-vii-adventism-after-the-great-disappointment-adventist.html https://lineagejourney.com/read/the-advent-movement-beyond-the-great-disappointment/ The Disappointed: Millerite Adventists and Their “New World” https://adventistdigitallibrary.org/features/the-disappointed The Advent Movement Beyond the Great Disappointment: https://lineagejourney.com/read/the-advent-movement-beyond-the-great-disappointment/ The Christadelphian Magazine/ The Ambassador of the Coming Age: January 1866, October 1893, May 1893, October 1897 https://thechristadelphianlibrary.com/category/digital-library/magazines/ John Thomas: His Friends \u0026 His Faith by Peter Hemingray https://www.amazon.com/John-Thomas-Friends-Christadelphian-Tidings/dp/B0CJSQFWF9 Joseph Marsh: https://en.wikipedia.org/wiki/Joseph_Marsh_(Adventist) Eureka: An Exposition of the Apocalypse by John Thomas https://www.antipas.org/pdf_files/eureka_vol_1_lg.pdf https://en.wikipedia.org/wiki/Eureka:_An_Exposition_of_the_Apocalypse Elpis Israel, 7th edition 1897 https://coggc.org/wp-content/uploads/2023/07/Elpis-Israel-John-Thomas-1897.pdf Elpis Israel with Publishers Comments (2000) https://antipas.org/pdf_files/elpis_israel_1.pdf “My Days and My Ways” by Robert Roberts https://www.antipas.org/pdf_files/my_days_and_my_ways.pdf “Robert Roberts: A Study of Life and Character” by Islip Collyer https://www.amazon.com/Robert-Roberts-Study-Life-Character/dp/B002IA7KJE Whose line is it anyways “The show where everything’s made up and the points don’t matter” https://www.imdb.com/title/tt0163507/taglines/#:~:text=It\u0027s%20the%20show%20where%20everything\u0027s,the%20points%20don\u0027t%20matter ! Waiting for Godot by Samuel Beckett https://en.wikipedia.org/wiki/Waiting_for_Godot Christendom Astray by Robert Roberts (including Chapter 16 and the prophecy on page 271) https://www.antipas.org/pdf_files/astray.pdf Wikipedia: ‘Christendom Astray from the Bible” “In the 1951 edition published by The Christadelphian Office, chapter 16 entitled \u0027Evidence that the End is Near\u0027 was deleted because the start of the millennium age did not start as predicted by 1910.” https://en.wikipedia.org/wiki/Christendom_Astray_from_the_Bible “What They Said Would Happen: A Review of Christadelphians Predictions” by John Hutchinson, January 2000 https://ed5015.tripod.com/ReligChristadelphianPredictions70.htm Emperor Nicholas I: https://en.wikipedia.org/wiki/Nicholas_I_of_Russia The Princess Bride (1987 ) “Have fun storming the castle!” https://en.wikipedia.org/wiki/The_Princess_Bride_(film) World War I Timeline: https://www.loc.gov/collections/stars-and-stripes/articles-and-essays/a-world-at-war/timeline-1914-1921/#:~:text=July%2028%2C%201914,Serbia%2C%20beginning%20World%20War%20I . Scooby Doo: https://en.wikipedia.org/wiki/Scooby-Doo Godzilla: https://en.wikipedia.org/wiki/Godzilla Keep Sweet: Pray and Obey (Netflix) https://en.wikipedia.org/wiki/Keep_Sweet:_Pray_and_Obey Clifford the Big Red Dog: https://en.wikipedia.org/wiki/Clifford_the_Big_Red_Dog The Bible, Matthew 24:34: \u0022Verily I say unto you, this generation shall not pass till all these things be fulfilled\u0022 Willy Wonka Golden Ticket: https://en.wikipedia.org/wiki/Golden_Ticket The Princess Bride (1987): https://en.wikipedia.org/wiki/The_Princess_Bride_(film) “Have fun storming the castle!” Finding Nemo (2003) https://www.youtube.com/watch?v=bZ1KDf3O-qU https://en.wikipedia.org/wiki/Finding_Nemo https://www.dictionary.com/browse/christadelphian Dictionary.com definition of a Christadelphian: a member of a Christian millenarian sect founded in the US about 1848, holding that only the just will enter eternal life, that the wicked will be annihilated, and that the ignorant, the unconverted, and infants will not be raised from the dead Millenarianism: “Millenarianism is the belief by a religious, social, or political group or movement in a coming fundamental transformation of society, after which \u0022all things will be changed\u0022 https://en.wikipedia.org/wiki/Millenarianism Apocalypticism: “Apocalypticism is the religious belief that the end of the world is imminent, even within one\u0027s own lifetime” https://en.wikipedia.org/wiki/Apocalypticism Doomsday Cult: “A doomsday cult is a cult that believes in apocalypticism and millenarianism” https://en.wikipedia.org/wiki/Doomsday_cult Instagram: video by abbiesr https://www.instagram.com/reel/DElSF0gv3DC/?igsh=ejExYnRsZ21kaTl2",
      "release": "2025-03-09T12:00:00Z",
      "duration": "01:48:47",
      "explicit": true,
      "spotifyId": "0fBBDtdQBEIeF7s130o6Vo",
      "appleId": 1000698456239,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0fBBDtdQBEIeF7s130o6Vo",
        "apple": "https://podcasts.apple.com/podcast/ep-21-the-history-of-christadelphian-bible/id1775771759?i=1000698456239"
      }
    },
    {
      "id": "f5125731-86cc-40d0-818a-44e92880ed61",
      "title": "Ep. 20 Bible Prophecy with Rob and Steve",
      "description": "Today we’re chatting about Bible Prophecy! In this episode I’m joined by Rob, a Professor of Statistics \u0026 Statistical Forecasting, and Steve, a Professor of Biblical Studies to explore the prophecies they learned (and even taught!) from their time as Christadelphians. Now as ex-Christadelphians, we discuss what they’ve learned about history, statistics, and biblical literature to explore non-Christadelphian perspectives on some common prophecies related to the Bible and Christadelphian culture. We explore prophecies that were supported by a selective view of history, unfulfilled prophecies, and even prophecies that were wrong in the Bible! In this episode we also learn about Rob’s attempt to have his fortune told in India, Steve’s thoughts on satire in the Bible, and learn about the relationship between the Bible and Tarot Cards! Please enjoy another week of fellowship among the heathens! Listener discretion is advised. Resources and References: Unbelievable: A Journey from Faith Via Evidence. Why A University Professor Gave up Religion and Became an Unbeliever by Rob Hyndman Excerpt from Rob’s Book: Chapter 8- The biblical crystal ball: https://robjhyndman.com/unbelievable/ch8.html Eureka by John Thomas https://en.wikipedia.org/wiki/Eureka:_An_Exposition_of_the_Apocalypse https://www.antipas.org/pdf_files/eureka_vol_1_lg.pdf Revelation: A Biblical Approach by Harry Whittaker 1976 https://www.amazon.com/Revelation-Biblical-Approach-H-Whittaker/dp/B007PYEBZY The first book of Enoch https://en.wikipedia.org/wiki/Book_of_Enoch Fourth Book of Esdra/ 4 Ezra https://en.wikipedia.org/wiki/2_Esdras The Second Book of Baruch https://en.wikipedia.org/wiki/2_Baruch The Bible, Ezekiel 26 A Prophecy Against Tyre National Treasure (2004) https://en.wikipedia.org/wiki/National_Treasure_(film) The Anchor Bible Series: https://en.wikipedia.org/wiki/Anchor_Bible_Series The Anchor Yale Bible Dictionary: https://www.theologyandreligiononline.com/anchor-yale-bible-dictionary The Anchor Bible Commentary: https://www.theologyandreligiononline.com/anchor-yale-bible-commentaries International Standard Bible Encyclopedia: https://www.internationalstandardbible.com/",
      "release": "2025-03-02T13:00:00Z",
      "duration": "01:14:51.9160000",
      "explicit": true,
      "spotifyId": "6ZtOaTJ3SG3bRFE7sVliNm",
      "appleId": 1000697161621,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ZtOaTJ3SG3bRFE7sVliNm",
        "apple": "https://podcasts.apple.com/podcast/ep-20-bible-prophecy-with-rob-and-steve/id1775771759?i=1000697161621"
      }
    },
    {
      "id": "fe404dc3-25e8-4129-9119-3b73b3260513",
      "title": "Ep. 19 Religious Trauma with Brian",
      "description": "Today we’re chatting with Brian about religious trauma! After hearing so many guests discuss traumatizing events that they experienced within the Christadelphian community, we decided to bring in a licensed religious trauma therapist to explore what religious trauma is and what we can do about it. We started with discussing some key definitions and concepts to understand, exploring what modalities Brian uses with clients, and talking about some things to consider when trying to find a therapist to work with, including knowing the difference between searching for a therapist with a specialty in “spirituality” compared to “religious trauma”. We also ask some thought provoking questions such as, is pressuring minors to be baptized truly consensual? Why doesn’t the group have an exit plan for members and why is that important to have? And is holding Christadelphian beliefs a cure for mental health struggles? Let’s talk about it! Please enjoy another week of fellowship among the heathens! If you enjoy this episode and would like us to have another episode on religious trauma, please submit your comments and questions to lifeafterleavingpodcast@gmail.com Listener discretion is advised. Resources and References: Marlene Winell\u0027s website who coined \u0022Religious Trauma Syndrome\u0022 https://www.journeyfree.org/rts/ Reclamation Collective (religious trauma directory/support groups/trainings) - https://www.reclamationcollective.com Spiritual Power Inventory Tool - https://www.reclamationcollective.com/spiritual-power-inventory-tool Secular Therapy Project (directory) - https://www.seculartherapy.org/ Religious Trauma Institute (research/trainings, mostly for therapists) - www.religioustraumainstitute.com IFS Institute (Internal Family Systems directory) - https://ifs-institute.com/practitioners \u0022No Bad Parts\u0022 by Richard Schwarz (Client-friendly intro book to IFS) - https://ifs-institute.com/nobadparts Terror, Love, and Brainwashing: Attachment in Cults and Totalitarian Systems by Alexandra Stein https://www.amazon.com/Terror-Love-Brainwashing-Attachment-Totalitarian/dp/1138677973 Alexandra Stein Talking About Cults - https://youtu.be/26ozOHPADSw?si=vH-OOqEV6M8OQlJ5 Adult Children of Emotionally Immature Parents https://www.newharbinger.com/9781626251700/adult-children-of-emotionally-immature-parents/ Ex-christian subreddit (discussion, support, and tons of extra resources) - https://www.reddit.com/r/exchristian/wiki/faq/ Adverse Childhood Experiences (ACE’s) Test: https://www.npr.org/sections/health-shots/2015/03/02/387007941/take-the-ace-quiz-and-learn-what-it-does-and-doesnt-mean ACE Aware: https://www.acesaware.org/ace-fundamentals/ EFT Tapping: What Is EFT Tapping? 5-Step Technique for Anxiety Relief “How to Start Deconstructing your Christian Faith” with Kristi Burke https://youtu.be/G4ROPDr7Hgo?si=JIhSOT6WIU_E5w9K “When a Relationship with God Turns Unhealthy” with Kristi Burke https://youtu.be/0Nu8KIAQl50?si=HuEVR1Yc4oM8IqyQ Take Back Your Life: Recovering from Cults and Abusive Relationships by Janja Lalich What My Bones Know: A Memoir of Healing From Complex Trauma by Stephanie Foo Escaping Twin Flames, Netflix The 25 Signs you’re in a High-Control Group or Cult by Anastasia Somerville-Wong https://secularliturgies.wordpress.com/2020/02/24/the-25-signs-youre-in-a-high-control-group-or-cult-by-anastasia-somerville-wong/ What is a High Control Group? https://medium.com/@shariwoodbury/what-is-a-high-control-group-887839bd26c5 How to Recognize a High-Control Church https://theglorioustable.wordpress.com/2022/03/21/how-to-recognize-a-high-control-church/",
      "release": "2025-02-23T13:00:00Z",
      "duration": "02:09:26.3330000",
      "explicit": true,
      "spotifyId": "18vc2s8BKN4KzR1do164OZ",
      "appleId": 1000695271354,
      "subjects": [
        "Christadelphians",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18vc2s8BKN4KzR1do164OZ",
        "apple": "https://podcasts.apple.com/podcast/ep-19-religious-trauma-with-brian/id1775771759?i=1000695271354"
      }
    },
    {
      "id": "56175b2b-5d52-4850-9ba3-d53578e92c40",
      "title": "Ep. 18 Fellowship with Kelli",
      "description": "Today we’re chatting with Kelli! In this episode, Kelli shares her experience preparing for what she thought would be the hardest test in her life (the baptismal exam!), learning that playing hymns on guitars would qualify as “stumbling blocks” for some sisters in Christ, and sharing her experience as a woman who was able to have more of a role when growing up associated with the COGAF group. She also shares some funny stories of sleeping in a pool floaty at a Bible weekend, an unexpected insect encounter during a church service, and shares the joke that ended her involvement in her church newsletter! Zinnia and Kelli also reminisce on long denim skirts, reading Harry Potter as religious children (scandalous!), and on how gross the term “seed” is! (Bleh!) Please join us for another episode of fellowship among those who have left the fold! Listener discretion is advised. Resources and References: Cultish: The Language of Fanaticism by Amanda Montell The Joke That Got Taylor Tomlinson Fired From a Church Comedy Gig Youtube: The Late Show with Stephen Colbert https://www.youtube.com/watch?v=1pQVshDcE28 The Golden Compass by Phillip Pullman Reading the Bible Again for the First Time by Marcus Borg Shattered Dreams: My Life as a Polygamist’s Wife by Irene Spencer Deconversion Therapy podcast (last episode aired 7/2024) https://www.deconversiontherapypodcast.com/about Misquoting Jesus by Bart Ehrman The Gnostic Gospels by Elaine Pagels The United Nations: Universal Declaration of Human Rights Article 18: Everyone has the right to freedom of thought, conscience and religion; this right includes freedom to change his religion or belief, and freedom, either alone or in community with others and in public or private, to manifest his religion or belief in teaching, practice, worship and observance. https://www.un.org/en/about-us/universal-declaration-of-human-rights The Book: On the Taboo Against Knowing Who You Are by Alan Watts",
      "release": "2025-02-16T13:00:00Z",
      "duration": "01:30:40.6250000",
      "explicit": true,
      "spotifyId": "4YECneSx0VOLwSGoEFPHFN",
      "appleId": 1000692763596,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4YECneSx0VOLwSGoEFPHFN",
        "apple": "https://podcasts.apple.com/podcast/ep-18-fellowship-with-kelli/id1775771759?i=1000692763596"
      }
    },
    {
      "id": "ad9ed0fd-0a99-4450-a68c-a300927ec1a7",
      "title": "Ep. 17 Fellowship with Vanessa",
      "description": "Today we’re chatting with Vanessa! Vanessa shares her experience of growing up feeling supported as a neurodivergent child in the Christadelphian community with her family. Over time though, she had a feminist awakening and found that her views on women\u0027s roles within the ecclesia didn’t quite fit. Eventually she began studying psychology and realized that she was in a high control religion! After pressure to bring her children in for instruction and hearing explicitly that they wanted to brainwash the children, she decided she wanted better for her family and left the group. Since leaving, Vanessa’s found a sense of purpose that she hadn’t experienced as a Christadelphian and she has finally embraced her authentic self. Please join us for another episode of fellowship among those who have left the fold! Listener discretion advised. Resources and References What So Amazing About Grace by Philip Yancey The God Delusion by Richard Dawkins Religious Harm Recovery Newsletter: https://www.religiousharmrecovery.com/links Cultish: The Language of Fanaticism by Amanda Montell Podcast: It’s A Little Bit Culty Podcast with Sarah and Nippy Podcast: Trust Me: Cults, Extreme Belief, and Manipulation hosted by Lola and Meagan Clementine Morgan on Instagram and host of the Fucking Cancelled Podcast The Little Book of Attachment: Theory to Practice in Child Mental Health with Dyadic Developmental Psychotherapy by Daniel Hughes and Ben Gurney-Smith Raising a Secure Child: How Circle of Security Parenting Can Help You Nurture Your Child\u0027s Attachment, Emotional Resilience, and Freedom to Explore by Kent Hoffman, Glenn Cooper, and Bert Powell",
      "release": "2025-02-09T13:00:00Z",
      "duration": "02:25:41.3750000",
      "explicit": true,
      "spotifyId": "4KFgnVeuMe22SXeq9mpdL4",
      "appleId": 1000690572667,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4KFgnVeuMe22SXeq9mpdL4",
        "apple": "https://podcasts.apple.com/podcast/ep-17-fellowship-with-vanessa/id1775771759?i=1000690572667"
      }
    },
    {
      "id": "f352fe59-e917-4e11-9f41-a9e96e304868",
      "title": "Ep. 16 Fellowship with Steve",
      "description": "Today we’re chatting with Steve! Steve’s story takes us from his childhood reading the works of Dr. Thomas and Robert Roberts through his slow departure from the Christadelphians and finally into his current position teaching Biblical Studies! Steve shares the important lessons his father taught him about character and standing up for your beliefs (even if that includes refusing to hide the Christmas tree), the punitive response of his former ecclesia when he asked questions about Revelation and ultimately joined another ecclesia, and his ultimate realization that some members of the Christadelphians “were prepared to lie in defense of The Truth”. Please join us for another episode of fellowship among those who have left the fold! Listener discretion advised. Resources and References: Steve’s Biblical Studies Blog, Mikra: https://stephencook.com.au/ Biblical Humor on Steve’s Blog: https://stephencook.com.au/category/biblical-humour/ Revelation: A Biblical Approach by Harry Whittaker Life From Scratch: A memoir of Food, Family, and Forgiveness by Sasha Martin http://sashamartin.com/book/",
      "release": "2025-02-02T13:00:00Z",
      "duration": "01:36:21.7910000",
      "explicit": true,
      "spotifyId": "6x6DuSxsdxPVjpqN6nCJj7",
      "appleId": 1000688205385,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6x6DuSxsdxPVjpqN6nCJj7",
        "apple": "https://podcasts.apple.com/podcast/ep-16-fellowship-with-steve/id1775771759?i=1000688205385"
      }
    },
    {
      "id": "240195f0-d6a0-4a85-9c88-af3be631fc7c",
      "title": "Ep. 15 Fellowship with Brian",
      "description": "Today we’re chatting with Brian! Brian is our first guest to come on the podcast from the Church of God of the Abrahamic Faith (COGAF). While they technically have a different name than Christadelphians, the groups were founded by former associates at about the same time. Members of COGAF hold the same beliefs as Christadelphians, fellowship with them, and even attend Christadelphian activities, camps, and bible schools! In today’s episode, we hear about Brian’s former ecclesia using pancakes to convince people to attend services, about that time he was brought to Jamaica for a school project to learn about the life of Christadelphian missionaries as a teenager, and about the “wave theory” of doubt and faith that eventually washed him ashore to solid ground without faith in God. We also chat about surprise ambushes by Christadelphians who create confrontations about faith and church attendance in the most unexpected times and places. Please join us for another episode of fellowship among those who have left the fold! If you have any questions that you would like addressed in the upcoming episode on religious trauma, please email ⁠lifeafterleavingpodcast@gmail.com⁠ Listener discretion advised. Resources and References: Church of God of the Abrahamic Faith (COGAF)/Church of the Blessed Hope: ⁠https://en.m.wikipedia.org/wiki/Church_of_the_Blessed_Hope⁠ Church of the Blessed Hope Beliefs: https://www.cotbh.org/Our-Belief/our-belief.html ⁠https://www.cotbh.org/Who-Are-We/who-are-we.html⁠ John Thomas: His Friends and His Faith by Peter Hemingray Page 132, 153-154, 189, pages 197-207 “Chapter 21: Dr. Thomas, Marsh, and Wilson- Founders of COGAF” Netflix: Keep Sweet: Pray and Obey Terror, Love, and Brainwashing: Attachment in Cults and Totalitarian Systems by Alexandra Stein ⁠https://www.amazon.com/Terror-Love-Brainwashing-Attachment-Totalitarian/dp/1138677973⁠",
      "release": "2025-01-26T13:00:00Z",
      "duration": "02:18:19.3330000",
      "explicit": true,
      "spotifyId": "5ioubBE294Sm5CSR5vIq8L",
      "appleId": 1000685502667,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ioubBE294Sm5CSR5vIq8L",
        "apple": "https://podcasts.apple.com/podcast/ep-15-fellowship-with-brian/id1775771759?i=1000685502667"
      }
    },
    {
      "id": "f05f5395-3cc0-4015-9c34-d544cbd0d510",
      "title": "Ep. 14 Fellowship with Zinnia",
      "description": "Today we’re flipping the script and Heather is chatting with Zinnia! Zinnia shares her story of growing up as an undiagnosed neurodivergent child and being bullied during her childhood inside and outside of the ecclesia. The first half of this episode is a bit heavy as Zinnia discusses how her environment contributed to severe depression and how growing up in a high control environment among other factors may have groomed her for domestic violence in her relationships. However, things took a turn for the better when Zinnia chose to leave the group, shut down their harassment, reported perpetrators to the police. She also reclaimed her life and her voice by changing her name, moving out on her own, creating a new environment where she could thrive in secular friendships and relationships, and connecting with other ex-Christadelphians in the Facebook community. She also shares her story of living in a haunted apartment, explains why she is skeptical of Christadelphians claiming that they’ll report the criminal activity of other Christadelphians, and about the circumstances that led her to create this podcast. This episode was also released alongside Episode 13 on Spiritualism due to some overlapping themes and topics. We hope you enjoy this podcast double feature! See you in 2025! Also, thank you to Heather for editing this episode! Resources: Vibe Music: If I die young Pt 2 by Kimberly Perry https://open.spotify.com/track/7LjN25ppKfSfjIPOJxbH7v?si=yHeXK6SBQZuXw-hRbuyfzw And The Wolves by Madeline Edwards https://open.spotify.com/wrapped/share/share-9077a96b07504179b35f468201191afb?si=sK7wgMTERAeOTj8EutWLmw\u0026track-id=2v71B92AHjGB0FgfIB4bch On Leaving Cults \u0026 High Control Groups: Take Back Your Life: Recovering from Cults and Abusive Relationships by Janja Lalich https://www.goodreads.com/book/show/234869.Take_Back_Your_Life Unfollow: A Memoir of Loving and Leaving the Westboro Baptist Church by Megan Phelps-Roper https://www.amazon.com/Unfollow-Memoir-Leaving-Westboro-Baptist/dp/0374275831 The Sound of Gravel: A Memoir by Ruth Wariner https://www.ruthwariner.com/the-sound-of-gravel/ Educated by Tara Westover https://www.goodreads.com/book/show/35133922-educated Pure: Inside the Evangelical Movement That Shamed a Generation of Women and How I Broke Free by Linda Kay Klein https://lindakayklein.com/pure/ Chocolat by Joanne Harris (Okay, this one is more of a role model for living outside religious influence, not bending to that pressure, and embracing the more magical side of life) https://www.goodreads.com/book/show/47401.Chocolat Quarter Life Crisis Netflix special, Taylor Tomlinson The Holy Bible: The Best Damned Version by Steve Ebling https://www.goodreads.com/book/show/21218494-holy-bible---best-god-damned-version---genesis Instagram: religious.harm.recovery https://www.instagram.com/religious.harm.recovery?igsh=ZTc1amo2OWFicXpv On Sexual Assault: Know My Name by Chanel Miller https://www.goodreads.com/book/show/50196744-know-my-name On Childhood Trauma \u0026 Relationships: Recovering from Emotionally Immature Parents by Lindsay Gibson (And Adult Children of Emotionally Immature Parents) https://www.goodreads.com/book/show/40890214-recovering-from-emotionally-immature-parents Running on Empty: Overcome your Childhood Emotional Neglect by Jonice Webb (Sequel: Running on Empty No More) https://drjonicewebb.com/the-book/ The Journey from Abandonment to Healing by Susan Anderson https://www.goodreads.com/book/show/77805.The_Journey_from_Abandonment_to_Healing Healing Your Aloneness: Finding Love and Wholeness Through Your Inner Child by Erika Chopich and Margaret Paul https://www.amazon.com/Healing-Your-Aloneness-Finding-Wholeness/dp/0062501496 Attached by Amir Levine and Rachel Heller https://www.goodreads.com/book/show/9547888-attached The Emotionally Absent Mother: A Guide to Self-Healing and Getting the Love You Missed by Jasmin Lee Cori https://www.goodreads.com/book/show/9268619-the-emotionally-absent-mother Mothers Who Can’t Love: A Healing Guide for Daughters by Susan Forward https://www.goodreads.com/book/show/17331330-mothers-who-can-t-love When the Body Says No by Gabor Mate https://drgabormate.com/book/when-the-body-says-no/ On Embracing Neurodivergence, Masking, and Susceptibility to Abuse: Hayley Honeyman Ted Talk “Unmasking ADHD” https://youtu.be/fRUkPHnltuI?si=foRFIm5fEK2NumuO On the impact of growing up undiagnosed Neurodivergent: https://medium.com/@nikkibutler_autisticjoyologist/the-negative-narrative-and-the-impact-on-being-autistic-adhd-61ce7d4c1d6b And https://medium.com/@nikkibutler_autisticjoyologist/bullying-and-autism-adhd-the-shocking-truth-dc9383d5d7b8 Feminism \u0026 Politics: Rage becomes her: The Power of Women\u0027s Anger by Soraya Chemaly https://www.goodreads.com/book/show/38532207-rage-becomes-her On Healing through Humor: https://www.scientificamerican.com/article/how-humor-can-help-you-get-through-hard-times/ On the Paranormal: Life with the Afterlife: 13 Truths I Learned About Ghosts by Amy Bruni https://www.amazon.com/Life-Afterlife-Truths-Learned-Ghosts/dp/1538754142 Do Dead People Watch You Shower? By Concetta Bertoldi https://www.goodreads.com/book/show/1245993.Do_Dead_People_Watch_You_Shower_ “Ecclesia Safe” Initiative: https://tidings.ecclesiasafe.org/resources-for-elders/ecclesiasafe-consultation-group-engagement/ https://tidings.ecclesiasafe.org/ https://tidings.org/articles/caring-for-the-vulnerable/",
      "release": "2024-12-22T19:39:51Z",
      "duration": "04:22:08.5090000",
      "explicit": true,
      "spotifyId": "2qHfO9cr6qqvhyWFCQr1FP",
      "appleId": 1000681330006,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qHfO9cr6qqvhyWFCQr1FP",
        "apple": "https://podcasts.apple.com/podcast/ep-14-fellowship-with-zinnia/id1775771759?i=1000681330006"
      }
    },
    {
      "id": "dd8b4489-d778-40b6-b7c5-b6a8a440ab56",
      "title": "Ep. 13 Hypnosis, Telepathy, and Ghosts: The History of Spiritualism and the Christadelphians",
      "description": "Today we’re chatting about ghosts! More specifically, about how the Christadelphians have historically tried to disprove the existence of ghosts and the beliefs of Spiritualists to their followers! It’s time for science class with John Thomas as he explains the (now considered pseudoscience) \u0022science\u0022 of odology, explains how Jesus Christ (electric medium) used hypnosis on his disciples, speculates on whether followers will be able to be invisible and teleport when they’re resurrected (sorry, you can only hold eyeballs), and how God’s Holy Spirit is actually… electricity. We discover the story of a Christadelphian with psychic abilities and end the episode with the most legendary ghost story to ever be told in Christadelphia! It’s going to get spoooooooky! This episode was also released alongside Episode 14, Fellowship with Zinnia, due to some overlapping themes and topics. We hope you enjoy this podcast double feature! See you in 2025! Resources and References “Other Powers: The Age of Suffrage, Spiritualism, and the Scandalous Victoria Woodhull” by Barbara Goldsmith, Page 78 Some background information on Spiritualism in the Britannica: ⁠https://www.britannica.com/topic/spiritualism-religion⁠ Dr. Thomas: His Life and His Work by Robert Roberts Popular Figures who were Spiritualists: ⁠https://www.history.com/news/spiritualism-communication-dead-figures⁠ The First Woman to Run for President in the US, Victoria Woodhull: ⁠https://www.nps.gov/articles/the-first-woman-to-run-for-president-victoria-woodhull.htm⁠ Talking to the Dead: Kate and Maggie Fox and the Rise of Spiritualism by Barbara Weisberg The Birmingham Amended Statement of Faith: ⁠https://christadelphianvideo.org/wp-content/uploads/2021/10/BASF.pdf⁠ The Oprah Winfrey Show Herald of the Kingdom and Age to Come, July 1852 ⁠https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald52.PDF⁠ 2023 Pew Research: ⁠https://www.pewresearch.org/religion/2023/12/07/spiritual-beliefs/⁠ 2024 Article: ⁠https://thehill.com/blogs/blog-briefing-room/4400922-americans-ghosts-aliens-devil-survey/⁠ Last Week Tonight: Psychics ⁠https://www.youtube.com/watch?v=WhMGcp9xIhY⁠ Harry Houdini: ⁠https://www.smithsonianmag.com/history/for-harry-houdini-seances-and-spiritualism-were-just-an-illusion-180978944/⁠ The Ambassador of the Coming Age: July 1868, Aug1868 and Sept 1868 The Herald of the Kingdom and Age to Come by John Thomas, July and August 1852 A Demon’s Guide to Wooing a Witch by Sarah Hawley Twilight by Stephenie Meyer The Princess Bride Movie, 1987 Prosopagnosia, medical condition Jim Jones Healings ⁠https://people.com/crime/jim-jones-jonestown-massacre-demagogue-biography-jeff-guinn/⁠ Rapidash Pokemon ⁠https://pokemondb.net/pokedex/rapidash⁠ The Bible: 1 Kings 19 2 Corinthians 12 Habakkuk 2:2-3 Joel 2:28 Job 33 Acts 10 Revelation 1 Matthew 22 1 Samuel 28 Odology: ⁠https://en.wikipedia.org/wiki/Odic_force⁠ Louis Cahagnet’s “Celestial Telegraph, or Secrets of the Life to Come revealed through Magnestism” Robert Roberts: A Study of Life And Character by Islip Collyer The Christadelphian: April 1869 February 1895 February 1888 May 1887 June 1876 January 1877 May 1955 November 1919 August 1913 November 1926 Spiritualists’ Association Bookstore: ⁠https://nsac.org/bookstore/⁠ The Girl with Silver Eyes by Willo Davis Roberts The Wizard of Oz (movie), 1939 Spiritualism by Michael Ashton Read Online at: ⁠https://thisisyourbible.com/library/show/175⁠ The Christadelphian, Nov1871 The Christadelphian, January 1872 Medium and Daybreak, Nov 24 1871 edition Full article provided from the University of Oxford Bodleian Library and from the Hamilton College. The Church of the Flying Spaghetti Monster Lily Dale: The True Story of the Town That Talks to the Dead by Christine Wicker Life with the Afterlife: 13 Truths I learned about Ghosts by Amy Bruni Other Resources: If you want to learn more about Spiritualism, check out the Dig Podcast: ⁠https://digpodcast.org/category/spiritualism/⁠",
      "release": "2024-12-22T13:00:00Z",
      "duration": "02:42:31.4160000",
      "explicit": true,
      "spotifyId": "7vRpnlnnhR0643HkClitoa",
      "appleId": 1000681301292,
      "subjects": [
        "Christadelphians",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vRpnlnnhR0643HkClitoa",
        "apple": "https://podcasts.apple.com/podcast/ep-13-hypnosis-telepathy-and-ghosts-the/id1775771759?i=1000681301292"
      }
    },
    {
      "id": "4079a894-b672-4bdf-a497-782ac116f11f",
      "title": "Ep. 12 Fellowship with Paul",
      "description": "Today we’re chatting with Paul! In this episode, Paul shares his story of joining the Christadelphians with his parents as a young convert, to stirring up trouble in the capital city as a young man handing out pamphlets on the Holy Spirit, to eventually not only leaving the Christadelphians, but eventually becoming an atheist studying theology! Paul also shares his controversial experience giving his one and only public lecture as a Christadelphian, his time as part of a group of Christadelphians nicknamed “the four horsemen of the apocalypse”, and about his thesis project on the roots of Christianity which he started after going back to school *again*. There’s no box big enough to fit Paul into as he’s explored careers, countries, and theology throughout his lifetime. I hope you enjoy this episode and hearing about the twists and turns of his fascinating life! Resources and References Harry Whittaker, Author List of Books here: https://bibliabooks.org.uk/harry-whittaker-books/ Carl Sagan; astronomer, scientist, author, and science educator: https://en.wikipedia.org/wiki/Carl_Sagan Richard Dawkins; biologist, author, prominent atheist: https://en.wikipedia.org/wiki/Richard_Dawkins Christopher Hitchens, Author https://en.wikipedia.org/wiki/Christopher_Hitchens Paul’s website, “Religion Free World”: https://religionfreeworld.org/ A link to Paul’s Book “On Christian Origins”: https://religionfreeworld.org/books/",
      "release": "2024-12-15T13:00:00Z",
      "duration": "01:28:33.3740000",
      "explicit": true,
      "spotifyId": "0iEBGR9mNGrwzSsDzaKBUg",
      "appleId": 1000680426306,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0iEBGR9mNGrwzSsDzaKBUg",
        "apple": "https://podcasts.apple.com/podcast/ep-12-fellowship-with-paul/id1775771759?i=1000680426306"
      }
    },
    {
      "id": "a1c54478-39d3-4727-9904-18d613f37620",
      "title": "Ep. 11 Fellowship with Luke",
      "description": "Today we’re chatting with Luke! Luke shares his experience growing up in a small, insular ecclesia disconnected from the wider community of Christadelphians and singing the same hymns every week. In this episode, we’ll hear about his process of trying to fit into the wider Christadelphian world after growing up in isolation, about his first experience attending an ecclesia that drank Christ’s blood from a shared cup (ew), and on the pressure to leave his new ecclesia and to end his relationship with a non-Christadelphian. We also speculate on his prospects of an American speaking tour, argue for Australia to have its own major winter holiday, and wonder if Christadelphian music will ever be a topic for a pub trivia night at last!? And remember… watch out because the “Christadelphian Police” can be anywhere! Please join us for yet another fun episode of fellowship among the heathens! Listener discretion is advised. Resources and References: Seven Brides for Seven Brothers (Movie)",
      "release": "2024-12-08T13:51:54Z",
      "duration": "01:56:59.7910000",
      "explicit": true,
      "spotifyId": "00MGyF4XNnGLidXIgit70q",
      "appleId": 1000679646049,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/00MGyF4XNnGLidXIgit70q",
        "apple": "https://podcasts.apple.com/podcast/ep-11-fellowship-with-luke/id1775771759?i=1000679646049"
      }
    },
    {
      "id": "7b221409-14d3-40f4-a5f3-c2facbbf0223",
      "title": "Ep. 10 The Bearded Wisdom of Christadelphians: Talking Masculinity and Facial Hair with Mako",
      "description": "Today we’re chatting with Mako in this “mini-episode” on beards and their cultural history within Christadelphia. Mako and Zinnia discuss the experiences shared by some ex-Christadelphians about beards and compare it to the historical views of Christadelphians during the time of Doctor John Thomas and Robert Roberts. We also joke about drag names, the British slang for penis, and moustaches on firemen! Please join us for a chat about this hairy topic! As a friendly reminder, please be advised that the humor in today’s episode is pretty “worldly” and this podcast is marked “explicit” across platforms. Listener discretion is advised. Resources and References: Monty Python’s The Meaning of Life: https://youtu.be/Xt53afFXbrg?t=74 Dictionary entry for “John Thomas”: https://en.wiktionary.org/wiki/John_Thomas The Bible, 2 Samuel 10 The Herald of the Kingdom and Age to Come by John Thomas, May 1856, Page 113 “The Gentile and the Jew” https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald56.PDF The Herald of the Kingdom and Age to Come by John Thomas, March 1852, Page 62 (782 if using link below) https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald%20Jan1851%20through%20Feb1854%20-%20Text.pdf Herald of the Kingdom and Age to Come by John Thomas December 1851 Page 280-281(Page 626 if using the link below) https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald%20Jan1851%20through%20Feb1854%20-%20Text.pdf The Herald of the Kingdom and Age to Come, May 1853, page 119 by John Thomas reprinting “Why Israelites were Forbidden to Shave” from the “Journal of Sacred Literature pp. 65, 66” https://antipas.org/library/Magazines/The%20Herald%20of%20the%20Kingdom%20and%20Age%20to%20Come%20(JT)/Herald53.pdf My Days and My Ways by Robert Roberts, page 5, 67, 139 https://www.antipas.org/pdf_files/my_days_and_my_ways.pdf “Robert Roberts: A Study of the Life and Character” by Islip Collyer https://christadelphianlibrary.com/products/robertroberts-collyer Drag Name Inspo and the name “Lourdes Prayer” https://chelseacommunitynews.com/2021/01/12/the-150-best-new-drag-names-try-one-on/ On my comments on Leviticus: https://www.jpost.com/jerusalem-report/article-700876 https://www.nytimes.com/2007/04/03/world/africa/03iht-moses.4.5130043.html On some religions using beards as a statement: https://dralun.wordpress.com/2014/01/07/the-medical-case-for-beards-in-the-19th-century/ https://credomag.com/2016/07/they-will-know-we-are-calvinists-by-our-beards-timothy-raymond/ The Christadelphian July 1871 https://www.antipas.org/library/Magazines/The%20Christadelphian%20Magazine/The%20Christadelphian%20-%201871.pdf July edition starting page 199, quote on page 219 On the Victorians using hair from the dead for mementos: https://www.orderofthegooddeath.com/article/theyre-not-morbid-theyre-about-love-the-hair-relics-of-the-midwest/#:~:text=Hair%20was%20sometimes%20taken%20from,a%20year%20and%20a%20day . Misc Research into Beards: https://www.theenglishshavingcompany.com/en_gb/blog/beard-psychology-science/#:~:text=Beards%20also%20impact%20perceptions%20of,than%20the%20clean%2Dshaven%20men",
      "release": "2024-12-01T13:00:00Z",
      "duration": "00:44:06.8860000",
      "explicit": true,
      "spotifyId": "4xEBmQZ98qjwBD30gcUhvh",
      "appleId": 1000678782552,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xEBmQZ98qjwBD30gcUhvh",
        "apple": "https://podcasts.apple.com/podcast/ep-10-the-bearded-wisdom-of-christadelphians/id1775771759?i=1000678782552"
      }
    },
    {
      "id": "dce3fd5c-04c4-4fa4-930f-66a8dd914836",
      "title": "Ep. 9 Fellowship with Mike",
      "description": "Today we’re chatting with Mike! Mike shares his story of growing up in the Brotherhood with many surprises including sourcing bootleg copies of the Simpsons for the Christadelphian youth group, finding a wife at the Christadelphian nursing home, and about his path to eventually becoming “unequally yoked” before leaving the group. Mike also shares his experience of unintentionally framing the Editor of the Christadelphian magazine for vandalism (whoops) and answers whether or not he saw any unattached beard hair in the Christadelphian Magazine Archives. And of course, he asks the hard hitting questions such as ”...have you got a hat?”. Please join us for yet another fun episode of fellowship among the heathens! Resources and References: Praise the Lord Hymn Book: https://www.christadelphianbooks.com/detail/2059 Music can be listened to here: https://www.wcfoundation.org/praise-the-lord The Book of Mormon: On Broadway: https://bookofmormonbroadway.com/ Watch online at: https://archive.org/details/book.-of.-mormon.-broadway-upscale-720x-480",
      "release": "2024-11-24T15:49:48Z",
      "duration": "02:03:05.3740000",
      "explicit": true,
      "spotifyId": "6ZworPm7qc1Wk3HfNapshd",
      "appleId": 1000678072303,
      "subjects": [
        "Christadelphians",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ZworPm7qc1Wk3HfNapshd",
        "apple": "https://podcasts.apple.com/podcast/ep-9-fellowship-with-mike/id1775771759?i=1000678072303"
      }
    },
    {
      "id": "ce51113d-6440-473a-8651-fd22d61a57c4",
      "title": "Ep. 8 Robert Roberts and the Fandom of John Thomas",
      "description": "Today we’re learning about the unofficial president of the John Thomas fan club, Robert Roberts. In this episode, we’ll be taking a critical look at whether this famous Christadelphian leader was actually just a follower. I’ll be sharing with you “respectable heathens” stories about Robert Roberts’ childhood, his quirks, and the chance he missed to leave behind the drama of the Christadelphians forever. I hope you’re as surprised as I was to learn the bizarre ways that he honored John Thomas throughout his lifetime, and even in death. I’ll also share a Christadelphian exhortation drinking game, a request for the whereabouts of a lost object, and a story about a legendary exhortation at the Moorestown ecclesia. Please also stay tuned to the end for another “ad” from one of our “sponsors”. Resources and References: “My Days and My Ways” by Robert Roberts, 1894 https://www.antipas.org/pdf_files/my_days_and_my_ways.pdf “Robert Roberts: A Study of the Life and Character” by Islip Collyer https://christadelphianlibrary.com/products/robertroberts-collyer John Thomas His Friends and His Faith by Peter Hemingray, 2003 https://christadelphianlibrary.com/products/johnthomashisfriends-hisfaith-hemingray GIlmore Girls tv series, Season 6 episode 8 “Why did you drop out of Yale?” “Elpis Israel” by John Thomas https://christadelphia.net/PDF/jtEI.pdf *fourteenth edition https://ia803407.us.archive.org/7/items/elpisisraelexpos00thomiala/elpisisraelexpos00thomiala.pdf *ninth edition Goosebumps tv series, “Welcome to Dead House” Ex-Christadelphians.com, “Who was Robert Roberts?” https://www.ex-christadelphians.com/2021/02/who-was-robert-roberts.html “Escaping Twin Flames” Documentary, Netflix Jonestown, https://en.wikipedia.org/wiki/Jonestown The Christadelphian magazine,formerly The Ambassador of the Coming Age, accessed via https://thechristadelphianlibrary.com/category/digital-library/magazines/ (Subscription required) -November 1869, free version available to view at: https://www.antipas.org/library/Magazines/The%20Christadelphian%20Magazine/The%20Ambassador%20\u0026%20The%20Christadelphian%20-%201869.pdf -July 1871 edition, free version available to view at: https://www.antipas.org/library/Magazines/The%20Christadelphian%20Magazine/The%20Christadelphian%20-%201871.pdf July edition starting page 199, quotes can be found page 217 and 219 “The Early History of the Gospel of the Kingdom of God in Britain with Historical, Critical, and Social Reminiscences of Persons, Places, and Events” compiled by William Norrie, Vol III https://christadelphia.net/PDF/norrie3.pdf Ancestry.com, Roberts Family Tree https://www.ancestry.com/family-tree/tree/174807481?cfpid=272267503058\u0026dtid=100 Tidings article mentioning Roberts’ son Edward leaving the Christadelphians: https://tidings.org/articles/robert-roberts-in-north-america/ Coraline (book) by Neil Gaiman, 2002 Coraline Movie adaption 2009",
      "release": "2024-11-17T16:45:52Z",
      "duration": "02:08:00.0080000",
      "explicit": true,
      "spotifyId": "43fE28eQt2wegRXzAZJf4W",
      "appleId": 1000677235366,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/43fE28eQt2wegRXzAZJf4W",
        "apple": "https://podcasts.apple.com/podcast/ep-8-robert-roberts-and-the-fandom-of-john-thomas/id1775771759?i=1000677235366"
      }
    },
    {
      "id": "a835b49d-d371-46e8-9fe3-fbacea914702",
      "title": "Ep. 7 Fellowship with Leah",
      "description": "Today we’re chatting with Leah! Leah shares her story of pushing the boundaries of respectable behavior for a Christadelphian woman by saying prayers at the podium, giving exhortations, and pushing the community to support the fair-trade movement. Leah wasn’t about to let gender roles get her down and now she’s living her best life re-enacting Sister Act, voting in elections, and saying farewell to her good enemies in the ecclesia. Leah also shares her one rule that sets her new standard when visiting and evaluating a church. Please also enjoy a special guest appearance by Leah’s cats… meow… References \u0026 Resources: Chasing the Scream: The First and Last Days of the War on Drugs by Johann Hari I Don’t by Clementine Ford See What You Made Me Do: Power, Control, and Domestic Violence by Jess Hill Leah’s choir performance: https://www.facebook.com/share/v/18G6pRecip/ Ten Steps to Nanette by Hannah Gadsby",
      "release": "2024-11-10T13:10:02Z",
      "duration": "01:41:03.0220000",
      "explicit": true,
      "spotifyId": "3bLeVyRlF5vEvY88DoHu3X",
      "appleId": 1000676364506,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3bLeVyRlF5vEvY88DoHu3X",
        "apple": "https://podcasts.apple.com/podcast/ep-7-fellowship-with-leah/id1775771759?i=1000676364506"
      }
    },
    {
      "id": "b8306607-d3ed-497a-9e72-1238f2cd50ee",
      "title": "Ep. 6 Christadelphian True Crime",
      "description": "Today we\u0027re chatting with Keturah about true crime stories from the Christadelphians! History certainly isn\u0027t always boring with Zinnia sharing the history of five notorious Christadelphians from around the world. Just in time for spooky season, let\u0027s talk about body snatchers, poison, and even murder... References mentioned in this episode: Story One: John Thomas Story References: John Thomas: His Life and His Work by Robert Roberts John Thomas: His Friends and His Faith by Peter Hemingray, Page 90-92 John Thomas’s article in the Lancet on the Anatomy Bill in May 1829 (Full article received via email after contacting Elsevier) ⁠https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(02)98765-9/fulltext⁠ Articles on the Richards Riot: -YouTube video on Richard’s Riot \u0026 the identity of the young woman ⁠https://youtu.be/CecD1prIOZs⁠ -Patch.com ⁠https://patch.com/illinois/stcharles-il/bp--grave-robbing-riots-and-murder-the-story-of-a-st-19dfeab964⁠ -St Charles History Museum ⁠https://www.stcmuseum.org/history-news/2020/4/18/grave-robbing-gunfights-and-sances-the-story-of-the-richards-riot-of-1849⁠ -The Resurrectionists ⁠https://www.howderfamily.com/blog/resurrectionist/⁠ Story Two: Albert Chernov Kidney Stealing Story: ⁠https://www.haaretz.com/2003-11-26/ty-article/police-believe-organ-trafficking-suspect-has-fled-israel/0000017f-dbf1-df62-a9ff-dff784dd0000⁠ The report on “Jerry” is not publicly available and was sourced from a member of the Ex-Christadelphian Facebook Group. The full section of the report that was referenced is quoted here: “Albert Chernov, baptized by [“Jerry” real name redacted], was financially supported by BBFU (CCM) as a recruiter for the Brotherhood. Chernov was arrested in Jul 2003 on suspicion of rounding up Russian immigrants in Israel and compelling them, with threats and extortion, into undergoing nephrectomies (removal of a kidney). The charges detailed that the organs were sold, by Chernov and his two accomplices, on the black market. [Source: Haaretz.] He was released on bail in Nov 2003 and fled the authorities. [Source: Washington Post.]” United Nations definition of organ trafficking: ⁠https://www.unodc.org/unodc/frontpage/2024/June/explainer_-understanding-human-trafficking-for-organ-removal.html⁠ Story Three: Judith Ann Venn Murder: Article 1: ⁠https://www.theguardian.com/australia-news/2023/jul/28/queensland-woman-who-laced-husbands-soup-with-pills-pleads-guilty-to-manslaughter⁠ Article 2: ⁠ https://www.abc.net.au/news/2023-08-04/judith-ann-venn-jailed-for-killing-abusive-husband-spiked-soup/102689162 -Chicago, the musical. Song: Cell Block Tango Story Four: “Uncle Murder”/ Roger Hammond: Phoenix New Times: “Mr. Fix-it is Guilty” March 1 1989 ⁠https://www.phoenixnewtimes.com/news/mr-fix-it-is-guilty-6412893⁠ Man convicted in Arkansas in Louisville woman\u0027s death Associated Press ⁠https://www.newspapers.com/newspage/109894222/⁠ Obituary ⁠https://vermontjournal.com/obituaries/roger-hammond-1945-2022/⁠ Story Five: Gary Schaefer Murders: Book: In The Shadow of Death: The Hunt for a Serial Killer by Philip Ginsburg ⁠https://www.newspapers.com/article/the-burlington-free-press-schaefer-plea/41890009/⁠ Podcast: Haunted New England, Episode 10 Podcast: Thrice Cursed: A True Crime and Paranormal Podcast: Heavens\u0027ta Betsy aka Gary Lee Schaefer ⁠https://www.reformer.com/local-news/vermont-convicted-murderer-kidnapper-dies-in-kentucky-prison/article_ec3d2b9c-8dfe-11ee-a2f9-77f7c5811a85.html⁠ ⁠https://en.wikipedia.org/wiki/Gary_Schaefer⁠ ⁠https://www.newspapers.com/article/rutland-daily-herald-schaefer-arrested/41893267/⁠ ⁠https://murderpedia.org/male.S/s/schaefer-gary-lee.htm⁠ Book Mentioned by Keturah: To Believe In Women: What Lesbians Have Done For America - A History by Lillian Faderman https://www.amazon.com/Believe-Women-Lesbians-America-History/dp/0618056971",
      "release": "2024-10-27T12:14:27Z",
      "duration": "02:06:07.7840000",
      "explicit": true,
      "spotifyId": "1W03tdhI0vbBuLl733fjWI",
      "appleId": 1000674605820,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1W03tdhI0vbBuLl733fjWI",
        "apple": "https://podcasts.apple.com/podcast/ep-6-christadelphian-true-crime/id1775771759?i=1000674605820"
      }
    },
    {
      "id": "849fe40a-a810-406a-bb68-f64e5a80df6d",
      "title": "Ep 1. Fellowship with Heather",
      "description": "Today we\u0027re chatting with Heather! Let\u0027s cozy up by a babbling stream with our favorite transcendental books for this one! You can visit Heather\u0027s blog at: https://callunararis.com/category/religion-spirituality/",
      "release": "2024-10-24T12:50:44Z",
      "duration": "01:57:44.3510000",
      "explicit": true,
      "spotifyId": "46GgOLT7AEU3xRSnNmuJc1",
      "appleId": 1000674294350,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/46GgOLT7AEU3xRSnNmuJc1",
        "apple": "https://podcasts.apple.com/podcast/ep-1-fellowship-with-heather/id1775771759?i=1000674294350"
      }
    },
    {
      "id": "6cb37ea6-545e-437e-910a-36c826200e28",
      "title": "Ep. 5 Harbingers of Destruction! Talking with Amy about Women in Christadelphia",
      "description": "Today we\u0027re chatting with Amy! She has a master\u0027s degree in Religious Studies, and wrote her thesis using the Christadelphians as a test case for theories of conservative women. There\u0027s no need to don a skirt or headcovering this Sunday morning! Join us as we delve into the reason why nothing ever changes in Christadelphia; talk about the limited roles for women in the ecclesia; reminisce on the dramas of headcoverings and pants-wearing (that\u0027s trousers for the Brits); and much, much more. Resources: Amy’s thesis is not publicly available, but if you\u0027re interested, email lifeafterleavingpodcast@gmail.com to request a digital copy Christadelphian Moms Survey Results, May 2024 https://tidings.org/articles/the-moms-survey/ Tidings magazine, May 2024 Issue https://tidings.org/wp-content/uploads/2024/04/2024-05-May.pdf Tidings magazine, article on race from August 2020 https://tidings.org/articles/an-exploration-of-christadelphians-racism-and-activism/ The Ecclesial Guide by Robert Roberts https://gs-cd.com/wp-content/uploads/2012/08/the-ecclesial-guide.pdf Esme Louie Tradwife Video: https://www.instagram.com/reel/C8JOQkfvLGr/?igsh=MTZyZnFrcG9oenFnaw== Books referenced: The Psychology of Religious Doubt by Philip Helfaer Educated by Tara Westover The Holy Bible by Vanessa Russell (an ex-christadelphian!) Leaving the Fold by Marlene Winell",
      "release": "2024-10-24T00:22:35Z",
      "duration": "02:16:03.6310000",
      "explicit": true,
      "spotifyId": "7JLX5DeZUUZ2tb1cFqFQ34",
      "appleId": 1000674225886,
      "subjects": [
        "Christadelphians",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7JLX5DeZUUZ2tb1cFqFQ34",
        "apple": "https://podcasts.apple.com/podcast/ep-5-harbingers-of-destruction-talking-with-amy/id1775771759?i=1000674225886"
      }
    },
    {
      "id": "a6ab7cfb-8e89-4a1c-8ceb-6ed09ea4aad0",
      "title": "Ep. 4 Fellowship with Rob",
      "description": "Today we’re chatting with Rob! Rob had reached the pinnacle of success as an international Christadelphian lecturer and prominent leader in his ecclesia before his journey to explore the root of his faith took him on an unexpected “reverse road to Damascus” and to leaving religion for good. This episode is the perfect accompaniment to a leisurely Sunday morning spent sleeping in, enjoying a fresh cup of coffee, and savoring not having to rush to the Sunday morning meeting anymore. Pull on your most colorful underwear for this episode and enjoy! Resources: Unbelievable: A journey from faith via evidence. Why a university professor gave up religion and became an unbeliever by Rob Hyndman Available for free at: https://robjhyndman.com/unbelievable/ Or print copies are available at: https://www.amazon.com/Unbelievable-Rob-J-Hyndman/dp/1517363195 The bibliography from his book: https://robjhyndman.com/unbelievable/bibliography.html The Tidings article on being seekers of truth: https://tidings.org/articles/seeking-truth/ Book: Good without God by Greg Epstein https://www.amazon.com/Good-Without-God-Billion-Nonreligious/dp/006167012X Book: The Righteous Mind: Why Good People are Divided by Politics and Religion By Jonathan Haidt https://www.amazon.com/Righteous-Mind-Divided-Politics-Religion/dp/0307455777",
      "release": "2024-10-24T00:18:24Z",
      "duration": "01:34:02.0640000",
      "explicit": true,
      "spotifyId": "2QMWFIlgoOzOStV24ooWxC",
      "appleId": 1000674225861,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2QMWFIlgoOzOStV24ooWxC",
        "apple": "https://podcasts.apple.com/podcast/ep-4-fellowship-with-rob/id1775771759?i=1000674225861"
      }
    },
    {
      "id": "e3a9e3c6-602c-44d7-8f69-f7b56fe21127",
      "title": "Ep. 3 Fellowship with Keturah",
      "description": "Today we\u0027re chatting with Keturah! There are some heavy topics in today\u0027s episode but this was still so much fun! We wonder, why do Christadelphians love one room schoolhouses so much? What is the proper gender neutral term for a baptized Christadelphian? Why did tights have such a chokehold on Christadelphian women for so long? The world may never know but we can laugh about it anyway! Resources: The youtuber that Keturah mentions in this episode is linked below: https://www.youtube.com/@jezebelvibes",
      "release": "2024-10-24T00:14:58Z",
      "duration": "01:22:44.2940000",
      "explicit": true,
      "spotifyId": "3mMKn0il1eCAmpDhQIMIii",
      "appleId": 1000674225920,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mMKn0il1eCAmpDhQIMIii",
        "apple": "https://podcasts.apple.com/podcast/ep-3-fellowship-with-keturah/id1775771759?i=1000674225920"
      }
    },
    {
      "id": "450d7660-8d08-43c3-87e6-82cbb4251c89",
      "title": "Ep. 2 John Thomas: The Man, the Myth, the Founder of the Christadelphians",
      "description": "Today we\u0027re diving into the origin of the Christadelphians and taking a look at their founder/rediscover-er Doctor John Thomas! Let\u0027s count how many times he got baptized and see what lengths he went to in order to get away from the priest-ridden society of England. This story is probably a little different than the Christadelphian origin story you thought you knew... Works Cited: Appletons\u0027 Cyclopedia of American Biography, 1600-1889- Dr. Thomas entry on page 84 Dr. Thomas: His Life \u0026 Work By Robert Roberts 1873 https://www.thedailybeast.com/how-joseph-dispenza-seduced-america-with-pseudoscience/ John Thomas and his Rediscovery of Bible Truth by Norman Fadelle, 2004 https://www.christadelphianbooks.com/detail/1488 https://christadelphia.net/history.htm John Thomas His Friends and His Faith by Peter Hemingray, 2003 Ancestry.com, John Thomas in the England \u0026 Wales, Non-Conformist and Non-Parochial Registers, 1567-1936, Page 46 https://www.ancestry.com/discoveryui-content/view/143843:2972?tid=\u0026pid=\u0026queryid=9a44aaa7-e1d6-4b10-b0a1-bf26672955d8\u0026_phsrc=oGi9\u0026_phstart=success Alexander Campbell Shipwreck and Journey to Glasgow, Scotland Memoirs of Alexander Campbell, by Robert Richardson, Volume 1, Chapters 7 \u0026 8, pages 104-128. https://www.therestorationmovement.com/_international/scotland/glasgow.htm History of the Restoration Movement Christadelphian Standards by H.P. Mansfield in 1961 Page 104 “Brother Mansfield’s remarks here were primarily with regard to the Pioneer works, although we acknowledge that there are other very good works available which have been written by other brethren. However, we would sound a note of caution. During the years since Brother Mansfield penned the above words, many works have been offered to us by an ever-increasing number of writers. Experience has shown us that many of these works are of doubtful value; others, paraded as Christadelphian literature, will prove quite dangerous to the unwary. Exercise care in this regard.” “My Days and My Ways” by Robert Roberts, 1894 Eureka volume III The preface of Eureka Vol III",
      "release": "2024-10-24T00:13:04Z",
      "duration": "01:20:57.0250000",
      "explicit": true,
      "spotifyId": "2F9za1sNRGHNnXir05IMQJ",
      "appleId": 1000674225919,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2F9za1sNRGHNnXir05IMQJ",
        "apple": "https://podcasts.apple.com/podcast/ep-2-john-thomas-the-man-the-myth/id1775771759?i=1000674225919"
      }
    },
    {
      "id": "b9eb0fc2-af9d-4df1-901b-1652b50695c2",
      "title": "Welcome, Start Here!",
      "description": "Welcome to the Life After Leaving Podcast! Check out this episode to learn about who we are, what we plan to do, and get some background on who the Christadelphians are before listening to our full episodes.",
      "release": "2024-09-22T20:39:26Z",
      "duration": "00:15:59.3640000",
      "explicit": false,
      "spotifyId": "0KnWKRHgUhMcZqSaav4Sgv",
      "appleId": 1000674202305,
      "subjects": [
        "Christadelphians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0KnWKRHgUhMcZqSaav4Sgv",
        "apple": "https://podcasts.apple.com/podcast/welcome-start-here/id1775771759?i=1000674202305"
      }
    }
  ]
}