{
  "id": "b5aca40a-acd2-4db6-bcb4-7575b2fda106",
  "name": "The Dough",
  "spotifyId": "0fQqnAuaRkCTeLBRdDfISW",
  "appleId": 1708471741,
  "episodes": [
    {
      "id": "270d5f24-207b-4995-8cdb-b572119ac3c7",
      "title": "How to Get Your Aunt Out of an MLM",
      "description": "Jane Marie is an MLM’s worst nightmare. She has made a career out of exposing the inner workings of MLMs as a Peabody Award–winning journalist. She’s the host of the podcast, The Dream, and author of Selling The Dream. X and Jane talk about how MLMs work, who they target and how MLMs recruit. X even gets candid about her own experiences with MLMs, and Jane answers the age-old question: why do MLMs love Jesus?  \n\nThis series was created in partnership with Flourish Ventures, an early-stage global investment firm backing mission-driven entrepreneurs and industry influencers working toward a fair finance system for all. Learn more at flourishventures.com.\n\nStay up to date with us on Twitter, Facebook, and Instagram at @LemonadaMedia. \n\nYou can find Jane Marie on Instagram @seejanemarie. Her book Selling The Dream is available now at all major book retailers. https://www.simonandschuster.com/books/Selling-the-Dream/Jane-Marie/9781982155773. The Dream is available wherever you get your podcasts https://podcasts.apple.com/us/podcast/the-dream/id1435743296.\n\nJoining Lemonada Premium is a great way to support our show and get bonus content. Subscribe today at bit.ly/lemonadapremium. \n\nClick this link for a list of current sponsors and discount codes for this show and all Lemonada shows: lemonadamedia.com/sponsors\n\nTo follow along with a transcript, go to lemonadamedia.com/show/ shortly after the air date.\nSee omnystudio.com/listener for privacy information.",
      "release": "2024-04-11T07:30:00Z",
      "duration": "00:37:04",
      "explicit": false,
      "spotifyId": "5f1Qukh9f42PKeXVIcMvUb",
      "appleId": 1000652116499,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5f1Qukh9f42PKeXVIcMvUb",
        "apple": "https://podcasts.apple.com/podcast/how-to-get-your-aunt-out-of-an-mlm/id1708471741?i=1000652116499"
      }
    }
  ]
}