{
  "id": "ba484ac4-0187-4368-86b1-9b7b328350bd",
  "name": "The Documentary Podcast",
  "spotifyId": "64cCsH4LCyO5U52xUU4Pax",
  "appleId": 73802620,
  "episodes": [
    {
      "id": "820fef46-d990-4946-b2d9-7819d3195f17",
      "title": "Why a South Korean church bought a village in Paraguay",
      "description": "Puerto Casado is a remote village in Paraguay, in South America. It’s not dissimilar to many other rural towns in the area: red-brick houses, small grocery stores and unpaved roads. But what makes Puerto Casado an exception is that it’s at the centre of a land dispute between the Paraguayan state, local residents and the Unification Church, a controversial religious group from South Korea. Ronald Avila-Claudio from BBC Mundo has recently been there. Plus, what the re-opening of the border between Ethiopia and Eritrea means to people living there, with Girmay Gebru from BBC News Africa; and a diver swimming with a great white shark and other viral stories, with BBC Indonesian\u0027s Famega Syavira Putri. This episode of The Documentary comes to you from The Fifth Floor, the show at the heart of global storytelling, with BBC journalists from all around the world. This is an EcoAudio certified production. (Photo: Faranak Amidi. Credit: Tricia Yourkevich.)",
      "release": "2025-08-02T12:30:00Z",
      "duration": "00:17:31.8470000",
      "explicit": false,
      "spotifyId": "3pe39SNpB6uYQpC7cE2wj7",
      "appleId": 1000720407290,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3pe39SNpB6uYQpC7cE2wj7",
        "apple": "https://podcasts.apple.com/podcast/why-a-south-korean-church-bought-a-village-in-paraguay/id73802620?i=1000720407290",
        "bbc": "https://www.bbc.co.uk/sounds/play/p0lt9lkf"
      }
    },
    {
      "id": "0ce1d6eb-aa9e-44bd-ab00-112614be3a89",
      "title": "The call of Anastasia",
      "description": "Members of the new age Anastasia movement espouse strong family values, farm small plots of land and try to educate their own children outside the public school system. Originating in Russia, the quasi-religious group has now spread to Germany, where there are more than a dozen ‘Anastasia’ rural settlements. But are they more than just a harmless fringe group? Reporter Johannes Dell goes back to his native Germany to discover what the group stands for. He speaks to a former Anastasia member and to a German journalist who spent two years tracking the group. A government intelligence officer tells him why three German states have designated the group as extremist.",
      "release": "2025-04-24T00:30:00Z",
      "duration": "00:26:29",
      "explicit": false,
      "spotifyId": "7xjp2TxMe9y0AqpYluNsjd",
      "appleId": 1000704659278,
      "subjects": [
        "Anastasia"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7xjp2TxMe9y0AqpYluNsjd",
        "apple": "https://podcasts.apple.com/podcast/the-call-of-anastasia/id73802620?i=1000704659278",
        "bbc": "https://www.bbc.co.uk/sounds/play/w3ct7yw8"
      }
    },
    {
      "id": "07936bb9-0db0-4976-90b5-a9d7f7ec884f",
      "title": "Heart and Soul: Seeking justice from Opus Dei",
      "description": "Opus Dei is a controversial Catholic organisation with schools and conference centres across the globe. Close links to the Vatican mean members are highly influential within the Catholic church. Opus Dei is Latin for “Work of God” and their aim is to help people to achieve holiness through their everyday work. The vast majority of members are lay people. Within Opus Dei, “assistant numeraries” are women responsible for cooking and cleaning in Opus Dei centres. They appear to have mainly been recruited from poor or working-class backgrounds and through hospitality schools affiliated with the organisation. Former assistant numeraries say they were overworked, unpaid, isolated from their families and emotionally and spiritually abused. Journalist Antonia Cundy speaks to women from Latin America who share their stories.",
      "release": "2024-10-25T00:30:00Z",
      "duration": "00:26:30.1140000",
      "explicit": false,
      "spotifyId": "6JFsk1viZJYlJkWbPevDZk",
      "appleId": 1000674377991,
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6JFsk1viZJYlJkWbPevDZk",
        "apple": "https://podcasts.apple.com/podcast/heart-and-soul-seeking-justice-from-opus-dei/id73802620?i=1000674377991",
        "bbc": "https://www.bbc.co.uk/sounds/play/w3ct5tfs"
      }
    },
    {
      "id": "3c26e013-e182-4f65-a443-252f18d4e90a",
      "title": "Instagram\u0027s fake guru",
      "description": "Former Brazilian model, wellness influencer and spiritual life coach Kat Torres was an inspiration and a lifeline to women all over the world. More than a million people on Instagram followed her extraordinary career trajectory from extreme poverty in Brazil, to a European modelling career and a life of luxury in the US. But behind the perfectly curated posts is a story of witchcraft, sexual exploitation and human trafficking; a dark and secretive sorority that led to missing women and sent their families and the FBI on a desperate search to find them. After months of investigations, a team from BBC Eye and BBC News Brasil uncover a wellness empire built on half-truths and lies. For the documentary Hannah Price tells the story of her enslaved followers and the heavy price they paid. And for the first time - in a surreal confrontation behind the walls of a Brazilian prison - we hear from the self-proclaimed “guru” who exerted absolute control.",
      "release": "2024-07-18T17:00:00Z",
      "duration": "00:26:42.7950000",
      "explicit": false,
      "spotifyId": "4jRhe0aUit56qyqRPwiXFL",
      "appleId": 1000662659407,
      "subjects": [
        "Human Trafficking",
        "Kat Torres"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4jRhe0aUit56qyqRPwiXFL",
        "apple": "https://podcasts.apple.com/podcast/instagrams-fake-guru/id73802620?i=1000662659407",
        "bbc": "https://www.bbc.co.uk/sounds/play/w3ct6xks"
      }
    },
    {
      "id": "2f909f91-2594-449d-b090-2164197a5e74",
      "title": "Guru: A dark legacy",
      "description": "For the last year, BBC journalist and passionate yoga teacher Ishleen Kaur has been investigating allegations of sexual and emotional abuse at the heart of an organisation she once called home. Fellow practitioners share with her their stories of cruelty, rape and even the sexual assault of a child - but she wasn\u0027t prepared for what she uncovered next. Join Ishleen on her deeply personal journey into the dark legacy which haunts Sivananda Yoga, one of the world’s most revered yoga schools.",
      "release": "2021-06-22T02:00:00Z",
      "duration": "00:26:41.2360000",
      "explicit": false,
      "spotifyId": "0x55ZBPRc2FGmlU7eOs1O4",
      "appleId": 1000526634587,
      "subjects": [
        "Sivananda Yoga"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0x55ZBPRc2FGmlU7eOs1O4",
        "apple": "https://podcasts.apple.com/podcast/guru-a-dark-legacy/id73802620?i=1000526634587"
      }
    }
  ]
}