{
  "id": "0ff11bed-6383-43de-a88e-28ea99439350",
  "name": "The Ezra Klein Show",
  "spotifyId": "3oB5noYIwEB2dMAREj2F7S",
  "appleId": 1548604447,
  "youTubeChannelId": "UCnxuOd8obvLLtf5_-YKFbiQ",
  "episodes": [
    {
      "id": "42593739-4bf8-4878-ad08-baee60db8ca2",
      "title": "What the Epstein Files Reveal About How Elite Worlds Work | The Ezra Klein Show",
      "description": "At the end of January, Trump’s Justice Department released what it said was the last tranche of the Epstein files: millions of pages of emails and texts, F.B.I. documents and court records. Much was redacted and millions more pages have been withheld. There is a lot we want to know that remains unclear.\n\nBut what has come into clear view is the role Epstein played as a broker of information, connections, wealth and women and girls for a slice of the global elite. This was the infrastructure of Epstein’s power — and it reveals much about the infrastructure of elite networks more generally.\n\nAnand Giridharadas is something of a sociologist of American elites. He’s the author of, among other books, “Winners Take All: The Elite Charade of Changing the World” and the forthcoming “Man in the Mirror: Hope, Struggle and Belonging in an American City.” He also publishes the great newsletter The.Ink.\n\nBack in November, after the release of an earlier batch of Epstein files, Giridharadas wrote a great Times Opinion guest essay, taking a sociologist’s lens to the messages Epstein exchanged with his elite friends. So after the government released this latest, enormous tranche of materials, I wanted to talk to Giridharadas to help make sense of it. What do they reveal — about how Epstein operated in the world, the vulnerabilities he exploited and what that says about how power works in America today? \n\nNote: This conversation was recorded on Tuesday, Feb. 10. On Thursday, Feb. 12, Kathryn Ruemmler announced she would be resigning from her role as chief legal officer and general counsel at Goldman Sachs.\n\n00:00 Intro\n6:50 Power lies where you don’t expect \n10:40 Epstein was a broker of relationships\n15:34 Epstein’s exploitation of gaps in our culture \n27:32 Concentric circles of enablement\n38:46 Epstein’s “catch me if you can” approach\n47:14 Epstein’s cultivated mystique and the men who were drawn to it\n1:08:45 The similar genius of Trump and Epstein \n1:12:26 The cowardice of elites in Trump’s second term\n1:23:13 Book recommendations \n\nRead the full transcript here: https://www.nytimes.com/2026/02/13/opinion/ezra-klein-podcast-anand-giridharadas.html \n\nWatch more on @EzraKleinShow \n\nThoughts? Guest suggestions? Email us at ezrakleinshow@nytimes.com.\n\nYou can find transcripts (posted midday) and more episodes of “The Ezra Klein Show” at nytimes.com/ezra-klein-podcast. Book recommendations from all our guests are listed at https://www.nytimes.com/article/ezra-klein-show-book-recs.html",
      "release": "2026-02-13T16:01:02Z",
      "duration": "01:25:47",
      "explicit": false,
      "spotifyId": "0PZeTf3HgRYlXKMRhxK7eg",
      "appleId": 1000749573912,
      "youTubeId": "eBnQ6qxoMr8",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PZeTf3HgRYlXKMRhxK7eg",
        "apple": "https://podcasts.apple.com/podcast/the-infrastructure-of-jeffrey-epsteins-power/id1548604447?i=1000749573912",
        "youtube": "https://www.youtube.com/watch?v=eBnQ6qxoMr8"
      }
    }
  ]
}