{
  "_ts": 0,
  "id": "60594357-e60e-439b-adcd-0c19378cbf72",
  "name": "The Curious Atheist",
  "youTubeChannelId": "UCO3sXexrEAdLqSn7RDkdVaw",
  "episodes": [
    {
      "id": "52ac7bad-f03b-466b-9a5a-17fcc59059da",
      "title": "Deconstruction From a Cult: Becoming An Ex-JW",
      "description": "My deconconstruction led to my deconversion. \nYours might not. But it\u0027s worth the experience.\n\n♦ CLICK HERE TO SUBSCRIBE♦\nhttps://www.youtube.com/channel/UCO3sXexrEAdLqSn7RDkdVaw?sub_confirmation=1\n\nWhy do you believe what you believe? For many, beliefs are inherited from our parents. So our beliefs are often the result of where we are born more than any other factor. \nIn this channel, I make videos that examine religious beliefs in general, with an emphasis on high control groups, a.k.a.cults. I encourage everyone to always be curious about the things they believe. \n\n♦ ABOUT ME ♦\nI was Catholic from birth and became a Jehovah\u0027s Witness at eight. I was baptized at the age of nine.  When Armageddon didn\u0027t arrive in 1975 as we had been taught, I began examining how many other Watchtower teachings weren\u0027t true.\nSince then I have expanded my search to include not only JW beliefs, but those of Christianity as well. And I also examine the Bible for those things that cannot be proven true. \n\n♦ ABOUT THIS CHANNEL ♦\nMy videos are meant to provide information about a cult operated by the Watchtower corporation.\nI also try to encourage Christians to question the things they\u0027ve been taught by their church. Truth is far more important than faith, and we should always know if what we believe is true.\n\n♦ MY MUSIC SINGLE FROM BEFORE I WAS THE CURIOUS ATHEIST!☺\n:https://amzn.to/3ao3JBE\n\n♦ COPYRIGHT DISCLAIMER ♦\nUnder Section 107 of the Copyright Act 1976, allowance is made for “Fair Use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education, and research. Fair use is a use permitted by the Copyright Statute that might otherwise be infringing.\n\n♦EDITORIAL DISCLAIMER♦\nMy use of verses from the Bible should not be viewed as a personal testimonial of the Bible\u0027s legitimacy. Since Christians believe in the inerrancy of the book I cite it as a reference in pointing out inconsistencies and hypocrisies in the topics I speak about. I am just citing their source material.\n\n♦ HASHTAGS♦\n#atheism \n#Christian\n#reaction",
      "release": "2024-04-03T13:08:27Z",
      "duration": "00:07:17",
      "explicit": false,
      "youTubeId": "6Rl5lVAe-yY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6Rl5lVAe-yY"
      }
    }
  ]
}