{
  "id": "6f42dd86-5c9a-486b-8fee-01f7ef47a40a",
  "name": "The Unapologetic T.R.U.T.H.H.",
  "spotifyId": "3OBb0YB54uB3JkfDNvZg6q",
  "appleId": 1813442334,
  "episodes": [
    {
      "id": "960116eb-e89a-4b72-b614-3ac39edc3b5b",
      "title": "Ep 13: Learning How to Let Go of the Shame That Was Put On You by Someone Else or Yourself",
      "description": "Let’s talk about that quiet but powerful emotion that shows up in so many healing journeys: shame. The kind that whispers, not screams. The kind that makes you feel like you need to hide, shrink, and stay silent. Naomi explores where shame comes from and how it teaches us to hide the very parts of ourselves that need the most love. This is about naming it, feeling it, and slowly letting it go through movement, truth-telling, and self-compassion. Listen to the full episode to hear the reflective prompts to help you identify where shame still lives in your healing and what it would mean to stop carrying what was never yours. This is a space to name the weight you’ve been carrying. To stop apologising for your pain. And to remember you were never meant to hold this alone. \u0026#x1f49a; ABOUT THE HOST, NAOMI SPARKS: Naomi Sparks is a mom, wife, healing coach, and a cult survivor. She grew up in a tightly controlled religious cult in Northern California and spent years disconnected from her true self. Her work now centers around helping others reclaim their voice, heal generational pain, and step into wholeness without apology. QUOTE OF THE EPISODE: “Silence doesn’t protect your peace. It protects the pain. And healing doesn\u0027t require silence, it requires truth.“ TO ASK YOURSELF GENTLY: Where is shame hiding in your healing? What parts of yourself do you still feel like you have to hide? And who or what told you that part was shameful to begin with? \u0026#x1f49a; Connect with Naomi on IG: @theunapologetictruthh \u0026#x1f3a7; Subscribe so you don’t miss the next one. LET’S KEEP THE CONVERSATION GOING…If this episode resonated with you, please share it with someone who needs to hear it. ❤️ Thank you for being here. This space is yours too. You’re not selfish. You’re healing.",
      "release": "2025-08-06T21:22:01Z",
      "duration": "00:21:11.9660000",
      "explicit": false,
      "spotifyId": "0kVHw5b0bjrAPu4Gfuc1ze",
      "appleId": 1000720955752,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0kVHw5b0bjrAPu4Gfuc1ze",
        "apple": "https://podcasts.apple.com/podcast/ep-13-learning-how-to-let-go-of-the-shame-that-was/id1813442334?i=1000720955752"
      }
    },
    {
      "id": "9ed76c07-dc21-4a42-b8b0-5ab7a0148cc8",
      "title": "Ep 12: Healing Outloud and Why I Began Sharing My Story",
      "description": "Today, Naomi shares what it’s been like to move from silence to truth. She reflects on growing up in a world where speaking honestly wasn’t safe, and how that silence followed her into adulthood.\nIn this episode, she talks about the fear of being judged, the weight of protecting others at your own expense, and the quiet unravelling that happens when you keep your story inside for too long. Speaking out hasn’t been easy. But it’s helped her reconnect with who she is, piece by piece.\n\nABOUT THE HOST, NAOMI SPARKS:\nNaomi Sparks is a mom, wife, healing coach, and a cult survivor. She grew up in a tightly controlled religious cult in Northern California and spent years disconnected from her true self. Her work now centres around helping others reclaim their voice, heal generational pain, and step into wholeness without apology.\n\nQUOTE OF THE EPISODE: \n“Healing isn\u0027t just about what happened to you. It\u0027s about what you do with it.“\n\nJOURNAL PROMPT:\nWhat have I been keeping quiet about to keep others comfortable?\n\nLET\u0027S KEEP THE CONVERSATION GOING..If this episode resonated with you, please share it with someone who needs to hear it. \n\nCONNECT WITH NAOMI:\nInstagram: @theunapologetictruthh\n\n❤️ Thank you for being here. You are not too much. You are healing.\n\nThis podcast is produced by AOLI.fm.",
      "release": "2025-07-30T21:22:00Z",
      "duration": "00:19:04",
      "explicit": false,
      "spotifyId": "5c8L4MmD4nYinnYl2PEeqi",
      "appleId": 1000719855573,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5c8L4MmD4nYinnYl2PEeqi",
        "apple": "https://podcasts.apple.com/podcast/ep-12-healing-outloud-and-why-i-began-sharing-my-story/id1813442334?i=1000719855573"
      }
    },
    {
      "id": "dcbaab19-3f95-4f2b-8d94-2033e1dc89b6",
      "title": "Ep 10: Let’s Talk About Resentiment and How It\u0027s Necessary in Healing",
      "description": "What if resentment isn’t a setback in your healing, but a sign you’re finally safe enough to feel? In this episode, Naomi gets honest about the quiet, uncomfortable emotion many of us carry: resentment. Especially when healing from childhood trauma, it often surfaces at the most unexpected moments. Naomi explores where resentment comes from, why it matters, and how to face it without shame. This is a space to feel what you were once told to suppress. And a reminder that your resentment isn’t shameful. ABOUT THE HOST, NAOMI SPARKS: Naomi Sparks is a mom, wife, healing coach, and a cult survivor. She grew up in a tightly controlled religious cult in Northern California and spent years disconnected from her true self. Her work now centers around helping others reclaim their voice, heal generational pain, and step into wholeness without apology. QUOTE OF THE EPISODE: “Resentment is not a flaw in your character. It’s a signal. It’s your body and soul finally saying: This wasn’t fair. This hurt me. This mattered.” QUESTION TO THINK ABOUT: “What is my resentment trying to teach me about?” CONNECT WITH NAOMI: Instagram: @theunapologetictruthh LET’S KEEP THE CONVERSATION GOING…If this episode resonated with you, please share it with someone who needs to hear it. ❤️ Thank you for being here. This space is yours too. You’re not selfish. You’re healing. This podcast is produced by ⁠AOLI.fm⁠ .",
      "release": "2025-07-16T21:22:00Z",
      "duration": "00:14:54.8880000",
      "explicit": false,
      "spotifyId": "5IUX5EgadDo7w1YGwz94Zr",
      "appleId": 1000717579160,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5IUX5EgadDo7w1YGwz94Zr",
        "apple": "https://podcasts.apple.com/podcast/ep-10-lets-talk-about-resentiment-and-how-its/id1813442334?i=1000717579160"
      }
    },
    {
      "id": "798e8113-5573-4737-835d-78677a048baa",
      "title": "Ep 9: Why We Repeat Trauma and What It Really Takes to Start Breaking Generational Cycles",
      "description": "Why do we repeat the very patterns that hurt us? Today, Naomi dives into what it takes to break generational cycles, especially when you\u0027re trying to raise kids differently than you were raised.\nShe shares personal stories from her healing journey as a cult survivor and mother, including the weight of inherited pain, the grief of unmet childhood needs, and the daily work of choosing presence over pattern.\n\nABOUT THE HOST, NAOMI SPARKS: \nNaomi Sparks is a mom, wife, healing coach, and a cult survivor. She grew up in a tightly controlled religious cult in Northern California and spent years disconnected from her true self. Her work now centers around helping others reclaim their voice, heal generational pain, and step into wholeness without apology.\n\nQUOTE OF THE EPISODE:\n“You are not responsible for the pain that was passed down to you, but you are responsible for what you pass down next.”\n\nQUESTION TO THINK ABOUT: \n“What pain have I been carrying that doesn’t belong to me?”\n\nCONNECT WITH NAOMI:\nInstagram: @theunapologetictruthh\n\nLET’S KEEP THE CONVERSATION GOING… If this episode resonated with you, please share it with someone who needs to hear it. Your voice helps this space grow.\n\n❤ Thank you for being here. This space is yours too.\n You’re not selfish. You’re healing.",
      "release": "2025-07-09T21:22:00Z",
      "duration": "00:18:02",
      "explicit": false,
      "spotifyId": "4KVjKHPihYqa0E2Q8XOsLe",
      "appleId": 1000716550052,
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4KVjKHPihYqa0E2Q8XOsLe",
        "apple": "https://podcasts.apple.com/podcast/ep-9-why-we-repeat-trauma-and-what-it-really-takes-to/id1813442334?i=1000716550052"
      }
    },
    {
      "id": "1f8fafcf-bae1-4785-b940-86b118f39d26",
      "title": "Ep 5: Setting Boundaries and Why It‘s So Important For Your Healing Journey",
      "description": "This week, Naomi explores what happens when you start setting boundaries after trauma and why it often feels more painful than empowering. She breaks down the guilt, the nervous system response, and the grief that comes with choosing yourself for the first time. You’ll get self-reflection tools, calming affirmations, and reminders that boundaries are not betrayals. They are acts of self-respect. About the host, Naomi Sparks: Naomi Sparks is a mom, wife, healing coach, and a cult survivor. She grew up in a tightly controlled religious cult in Northern California and spent years disconnected from hertrue self. Her work now centers around helping others reclaim their voice, heal generational pain, and step into wholeness without apology. Quote of the episode: “Boundaries are not betrayals. They are self-respect in action.” ❤️‍\u0026#x1fa79; Validation statements:“My needs are valid, even if they make others uncomfortable.”“I am allowed to protect my peace.” “Saying no doesn\u0027t make me mean or selfish.”“It makes me honest.”“I don\u0027t have to overexplain or justify why something doesn\u0027t feel right.”“I can love people and still say, this isn\u0027t okay with me.” ‍❤️‍\u0026#x1fa79;Self-awareness questions:“What do I need right now?”“Does this feel good, or am I trying to avoid conflict?”“Am I choosing this from fear or from alignment?”“Would I still say yes if I knew they wouldn\u0027t be mad at me?”“Do I feel safe, or am I just trying to feel liked?” ❤️‍\u0026#x1fa79; Grounding statements (for new choices): “It\u0027s okay to pause before I respond.”“I don\u0027t owe anyone instant access to me.”“I can sit with discomfort.”“It\u0027s not permanent.”“I\u0027m allowed to take care of myself, even if it disappoints someone else.”“The people meant for me won\u0027t leave just because I set a boundary.” ❤️‍\u0026#x1fa79; Post-boundary support statements:“That was hard, but I\u0027m proud of myself for speaking up.”“Just because they\u0027re upset doesn\u0027t mean I did something wrong.”“Every time I choose myself, I\u0027m rewriting the story I was given.”“This gets easier the more I practice.” Connect with Naomi: Instagram: @theunapologetictruthh Let’s keep the conversation going… If this episode resonated with you, share it with someone who needs to hear it. Your healing matters. So does your voice. ❤ Thank you for being here. This space is yourstoo. You’re not selfish. You’re healing. This podcast is produced by AOLI.fm .",
      "release": "2025-06-11T21:22:00Z",
      "duration": "00:18:36.6010000",
      "explicit": false,
      "spotifyId": "3mz5Uu70JzYr6MtsuoWPl1",
      "appleId": 1000712496130,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mz5Uu70JzYr6MtsuoWPl1",
        "apple": "https://podcasts.apple.com/podcast/ep-5-setting-boundaries-and-why-it-s-so-important-for/id1813442334?i=1000712496130"
      }
    },
    {
      "id": "b3482e0f-999a-428e-880b-af42dbdd80cc",
      "title": "Ep 4 : Rebuilding Your Identity After Emotional Abuse",
      "description": "Naomi opens up about her experience of walking away from a religious cult and the real challenge of dealing with the beliefs, shame, and fears that stuck around after she left. She talks about the sadness of realizing she hadn’t been living as her true self, and how brave it is to ask the question, “Who am I?” for the first time, and the slow process of remembering who you’ve always been underneath the survival mode.\n\n\nAbout the host, Naomi Sparks: \nNaomi Sparks is a mom, wife, healing coach, and a cult survivor. She grew up in a tightly controlled religious cult in Northern California and spent years disconnected from her true self. Her work now centers around helping others reclaim their voice, heal generational pain, and step into wholeness without apology.\n\n\nQuote of the episode:\n“Reclaiming who you are isn’t about starting over. It’s about remembering what was always true underneath the noise.”\n\n\nQuestions to think about:\nWho told me who I was before I ever got to decide?What beliefs do I still carry that no longer feel true?\n\n❤️‍🩹Healing starts by getting curious. You don’t need all the answers. You only need space to begin. \n\n\nConnect with Naomi:\nInstagram: @theunapologetictruthh\n\n\nLet’s keep the conversation going…If this episode spoke to you, please share it with someone who needs to hear it. Your voice helps more people find the space to heal.\n\n\n❤ Thank you for being here. This space is yours too.\nHealing isn’t linear. Identity takes time. You’re doing it beautifully.\n\n\nThis podcast is produced by AOLI.fm.",
      "release": "2025-06-04T21:22:00Z",
      "duration": "00:16:23",
      "explicit": false,
      "spotifyId": "2go972FQAw1fZBUlb1bj1o",
      "appleId": 1000711214309,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2go972FQAw1fZBUlb1bj1o",
        "apple": "https://podcasts.apple.com/podcast/ep-4-rebuilding-your-identity-after-emotional-abuse/id1813442334?i=1000711214309"
      }
    },
    {
      "id": "cca716ca-d3aa-4a3c-9278-b2e05b2c9b0b",
      "title": "Ep 3: See It, Name It, Begin to Heal From It",
      "description": "In this episode, Naomi speaks honestly about the pain of being raised in an environment where love felt conditional and safety was never promised. She explains how emotional abuse often goes unseen but leaves a deep impact that lasts for years. Through her story, she shows how trauma can affect your thoughts, your body, and your sense of self. She also shares what it looks like to start healing by naming the truth, reconnecting with your voice, and slowly building a life that feels safe and real. About the host, Naomi Sparks: Naomi Sparks is a mom, wife, healing coach, and a cult survivor. She grew up in a tightly controlled religious cult in Northern California and spent years disconnected from her true self. Her work now centres around helping others reclaim their voice, heal generational pain, and step into wholeness without apology. Quote of the episode: “Minimising your pain doesn\u0027t make you stronger. It makes your healing harder.” Questions to think about: Have I ever felt like my feelings were too much for someone else? Do I stay quiet to avoid conflict or rejection? Was I taught that love had to be earned? \u0026#x1f450; Healing takes time, but it begins when you tell the truth, feel what you need to feel, find safe support, learn what safety feels like in your body, and treat yourself with care as you grow. Connect with Naomi: Instagram: @theunapologetictruthh Let’s keep the conversation going… ..if this episode resonated with you, share it with someone who needs to hear this. Your support helps more people find this space for healing. ❤ Thank you for being here. This space is yours too. Healing is messy. Speaking the truth is brave. You’re right on time. This podcast is produced by AOLI.fm .",
      "release": "2025-05-28T21:22:00Z",
      "duration": "00:22:12.3370000",
      "explicit": false,
      "spotifyId": "6LlMABRf112WRtlsmI8NDd",
      "appleId": 1000710343039,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6LlMABRf112WRtlsmI8NDd",
        "apple": "https://podcasts.apple.com/podcast/ep-3-see-it-name-it-begin-to-heal-from-it/id1813442334?i=1000710343039"
      }
    }
  ]
}