{
  "_ts": 0,
  "id": "10f90d64-801d-447b-a445-826e5bef7bbc",
  "name": "The Take",
  "spotifyId": "4Xpy9wOEFHmASLqKGOHHcq",
  "appleId": 1438817292,
  "episodes": [
    {
      "id": "e40360cf-603e-4bf7-8215-4ae0657a5eec",
      "title": "Another Take: Did a Kenyan cult leader convince his followers to die?",
      "description": "Every Saturday, we revisit a story that’s in the news again. This originally aired on May 3, 2023. None of the dates, titles, or other references from that time have been changed.  In a shocking discovery on a ranch hidden in Kenya’s Shakahola Forest, more than 100 people – including children – have been found dead in mass graves. Pastor Paul Mackenzie convinced followers of his Good News International Church that the world was ending, though he denies telling them to starve themselves to death. Could this have been stopped? And how did one man get hundreds of people to follow him down this path? In this episode:   Hussein Khalid (@husskhalid), executive director of HAKI Africa  Episode credits: This episode was updated by Negin Owliaei. The original production team was Ashish Malhotra with Chloe K Li and our host, Malika Bilal. Our sound designer is Alex Roldan. Our lead of audience development and engagement is Aya Elmileik. Adam Abou-Gad is our engagement producer. Alexandra Locke is The Take’s executive producer, and Ney Alvarez is Al Jazeera’s head of audio. Connect with us: @AJEPodcasts on Twitter, Instagram, Facebook, Threads and YouTube",
      "release": "2024-02-10T05:00:00Z",
      "duration": "00:23:04.7770000",
      "explicit": false,
      "spotifyId": "5qRkKsBFbqu8xBXKTjRLjC",
      "appleId": 1000644840566,
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qRkKsBFbqu8xBXKTjRLjC",
        "apple": "https://podcasts.apple.com/podcast/another-take-did-a-kenyan-cult-leader-convince-his/id1438817292?i=1000644840566"
      }
    }
  ]
}