{
  "id": "a21a62d5-f942-454c-bd67-3f82e63b7222",
  "name": "The Crazy Guy With A Lazy Eye News",
  "youTubeChannelId": "UC8kYXMpLOcCXjTkHmIAnkHQ",
  "episodes": [
    {
      "id": "6625598c-171b-473a-8b90-2ad4bf95d541",
      "title": " BREAKING NEWS: Arrests Made in Emilio Ghanem Case – Action Eye News LIVE Captures Exclusive Footage",
      "description": "🔍 BREAKING NEWS: Arrests Made in Emilio Ghanem Case – Action Eye News LIVE Captures Exclusive Footage at Hemet AMPM\n\nBy Action Eye News LIVE | August 8, 2025\n\nHEMET, CA – Major developments have surfaced in the disappearance of Emilio Salem Ghanem, a Nashville man last seen in Redlands in May 2023. What began as a missing person investigation has now escalated into a deeper probe involving a controversial Hemet-based religious group, multiple arrests, and a police raid.\n\n📍 Action Eye News LIVE was on scene at the AMPM gas station at Stetson \u0026 Gilbert in Hemet, where multiple individuals were detained and taken into custody. Our team captured the moment it happened—watch the video below for exclusive footage filmed by The Crazy Guy With The Lazy Eye.\n\n▶️ WATCH THE VIDEO BELOW\n\n⸻\n\n🚨 Who is Emilio Ghanem?\n\nEmilio Salem Ghanem disappeared on May 25, 2023, after visiting a Starbucks in Redlands. Surveillance video later showed him driving a white rented Nissan Frontier in Grand Terrace. That truck was later recovered—but Emilio has never been seen since.\n\nHe was a longtime member of His Way Spirit Led Assemblies, a Hemet-based religious organization. He also worked for their pest control business, originally called Fullshield, now known as Maxguard. Ghanem had reportedly left the group shortly before his disappearance.\n\n⸻\n\n🔎 Police Raid in Hemet\n\nJust hours after the AMPM arrests, Redlands Police served a search warrant at a residence on Pleasant Street in Hemet linked to the same religious organization. Inside, investigators uncovered evidence connected to Emilio’s disappearance, though specific details have not yet been released.\n\nAuthorities confirmed four people were detained, and two were arrested on separate charges.\n\n⸻\n\n🧩 Linked Case: Ruben Moreno\n\nInvestigators have also reopened the 2017 disappearance of Ruben Moreno, another former member of the same group, who vanished from Claremont under similar circumstances. While both cases involve former members of the organization, police have not officially connected the two—but are investigating both leads closely.\n\n⸻\n\n📢 Call for Public Assistance\n\nLaw enforcement is urging the public to come forward with any information related to Emilio Ghanem or activities surrounding the religious group.\n\n📞 Redlands Police Detective Bureau: (909) 551-4424\n📧 Email: missingperson_emilio@redlandspolice.org\n\n⸻\n\n📡 Stay with Action Eye News LIVE for continued coverage, exclusive footage, and updates on this evolving case. Follow The Crazy Guy With The Lazy Eye for more behind-the-scenes coverage and local breaking stories.\n\n#EmilioGhanem #MissingPerson #HemetNews #ActionEyeNewsLIVE #ReligiousGroupInvestigation #RedlandsPD #HemetArrests #RubenMoreno #LiveNewsCoverage",
      "release": "2025-08-08T21:25:12Z",
      "duration": "00:03:58",
      "explicit": false,
      "youTubeId": "lvUIPe7SAQQ",
      "subjects": [
        "His Way Spirit Led Assemblies"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lvUIPe7SAQQ"
      }
    }
  ]
}