{
  "_ts": 0,
  "id": "8626e846-53e9-44ad-8d94-277cbf8b44ea",
  "name": "The Truth Disciples",
  "spotifyId": "0EEAb6cisJ1uEXZbhfhJw1",
  "appleId": 1608708031,
  "episodes": [
    {
      "id": "4fb70a34-ec12-4421-95b5-8bdfd18ea0aa",
      "title": "Episode 56 - Scientology - \u0027A to Xenu\u0027 Part 1 - An Insiders View. In Conversation with Author and Cult Survivor Chris Shelton MSc",
      "description": "Join Brother Paul and special guest Chris Shelton (MSc) as they discuss everything Scientology. Most people by now have at least heard of Scientology and some may have a rough idea of what it is, but what is it really? On one hand Scientology HQ claim they are a religion, on the other hand researchers and more importantly the survivors who have escaped the clutches of L Ron Hubbards organisation say it is without doubt a very dangerous \u0026 abusive cult! Cults, their ideologies and practices can be destructive beyond ones imagination and in the worst cases can result in the ultimate price being paid by followers of the cult or those who get in the way of the cults aims. Many lose their lives to these groups. Jonestown in1978 (over 900 dead), Waco in 1993 (over 70 dead) \u0026 Heaven’s Gate 1997 (39 dead) to name just a few. Tragedies that should never have happened, but heartbreaking to say, did. Chris Shelton is a brave 2nd generation survivor who spent a large portion of his life controlled by the powerful psychological conditioning, manipulation and trauma of Scientology’s cult indoctrination program. He is now an author, podcast host and campaigner. He dedicates his life to educate those vulnerable to future cult indoctrination so they at least have informed consent when considering joining Scientology or any cult for that matter. Through his You Tube channel and podcasts he also tries to help those who have broken free from cult life to deprogram and recover and give them the best opportunity to adjust to normal life within society. Chris’s story is one to be celebrated and admired by us all. Finding that inner strength to pull away from the hellscape of the Scientology church he grew up in, coming through adversity, abuse and struggle like that to form a successful happy life afterwards is the perfect example of the hero’s journey. Chris’s excellent book ‘A-Xenu An insiders guide to what scientology is really all about’ is the perfect educational tool for researchers like you the listener when it comes to the cult of Scientology as it details the inner workings of the organisation and what it is they really worship behind closed doors in the upper levels of the bridge. After listening to the show, we urge you to visit and subscribe to Chris’s amazing You Tube channel ‘Chris Shelton MSc’ where you can find all the educational videos \u0026 podcasts he produces. To find out every aspect of Scientology you can think of, take a deep dive there. The catalogue of material he has built up is absolutely phenomenal. In this episode we cover Chris’s own experience and journey within Scientology, how he eventually broke free and what life looks like for him now out in societyposu cult life. We also take a look within the organisation, its practices, its beliefs, its ideology and it’s ultimate aims. Scientology…….is it a true religion or is it a cult? Is it all a fraud based on the lies of its founder L Ron Hubbard, or is there real science behind it? Let\u0027s dive in and find out. Enjoy the show. Chris’s You Tube Channel https://www.youtube.com/@ChrisSheltonMsc Buy Chris’s Book https://www.amazon.co.uk/stores/author/B0BWGMQLM5/allbooks?ingress=0\u0026visitId=0f46c3c8-f2f2-47cb-a2ab-e1d1e1d0e3eb\u0026ref_=ap_rdr The Scientology Personality Test Exposed https://www.youtube.com/watch?v=-5F7Tw3XmCA Cult Survivor Support Groups https://www.theaftermathfoundation.org https://www.mormonstories.org https://www.safeportland.org https://www.icsahome.com/home (International Cultic Studies Association) Intro Music ‘Mind Controlled’ by Dramaboy Outro Music ‘Operating Thetan Unknown’ by Elle Barbara PLEASE LIKE AND FOLLOW THE TRUTH DISCIPLES ON SPOTIFY, APPLE PODCASTS AND INSTAGRAM. WE WOULD ALSO APPRECIATE IT AND BE BEYOND GRATEFUL IF YOU COULD RATE OUR SHOW. IF YOU WANT TO GET IN TOUCH WITH US TO SUGGEST A TOPIC, GUEST OR JUST TO CONNECT OUR EMAIL ADDRESS IS BELOW, WE WOULD LOVE TO HEAR FROM YOU. MUCH LUV. ⁠⁠thetruthdisciples333@gmail.com @the_truth_disciples",
      "release": "2025-05-31T11:38:42Z",
      "duration": "03:10:38.0800000",
      "explicit": false,
      "spotifyId": "5ixtRe3KMpLg2JFcrUvl3A",
      "appleId": 1000710661783,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ixtRe3KMpLg2JFcrUvl3A",
        "apple": "https://podcasts.apple.com/podcast/episode-56-scientology-a-to-xenu-part-1-an/id1608708031?i=1000710661783"
      }
    }
  ]
}