{
  "_ts": 0,
  "id": "b04a48a1-97f3-4efc-baf4-c3b388c32986",
  "name": "The Truthiest Life",
  "spotifyId": "2bDQHVu9dEVcFlHPxJr5Pz",
  "appleId": 1535516122,
  "episodes": [
    {
      "id": "1e288ce8-0427-485c-9cbe-2d08bece9060",
      "title": "Surviving a Sex Cult ft. Sylvie Lloyd (Part 2)",
      "description": "In this second part, we learn about DOS, the sex cult within NXIUM. how it came to be, and the manipulating ways Sylvie got roped in. We learn how she met her husband, and Keith’s “rules” she had to follow, what her family thought, and how it eventually all fell apart. Content warning: Sexual abuse Sylvie Lloyd is now a mother to a beautiful baby girl. From ages 18-32, she was a member of NXIUM \u0026#43; DOS, described as “an American cult that engaged in sex trafficking, forced labor and racketeering.” Her brain was molded by the teachings of the convicted Keith Reineire, and she was the first witness in the federal case. She is a powerful woman we can expect A LOT from in our lifetime. Instagram: The Truthiest Life on Instagram @thetruthiestlife Host @lisahayim To support TTL, subscribe, follow, or share episodes with family and friends! If you’re loving TTL, please leave a review on Apple Podcasts https://podcasts.apple.com/us/podcast/the-truthiest-life/id1535516122?uo=2 Guest submissions, please fill out this form HERE . Edited by Houston Tilley Intro Jingle by Alyssa Chase aka @findyoursails See omnystudio.com/listener for privacy information.",
      "release": "2023-04-21T07:00:00Z",
      "duration": "00:44:35.0430000",
      "explicit": false,
      "spotifyId": "56bIgnFaDsLKKZ0SR52Tiy",
      "appleId": 1000610058757,
      "subjects": [
        "Human Trafficking",
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/56bIgnFaDsLKKZ0SR52Tiy",
        "apple": "https://podcasts.apple.com/podcast/surviving-a-sex-cult-ft-sylvie-lloyd-part-2/id1535516122?i=1000610058757"
      }
    },
    {
      "id": "1c36d208-14fd-4ea7-be7a-1dd946658d94",
      "title": "Surviving a Sex Cult ft. Sylvie Lloyd (Part 1)",
      "description": "Hi everyone. Lisa here introducing this episode with a personal life update. Thank you for your continued support and understanding that sometimes surrendering over pushing through is the only way out. big hugs!  xx, Lisa   In this first part of Surviving a Sex Cult ft. Sylvie Lloyd, we learn about the “cult” called NXIUM: how Sylvie got involved, her first introduction to Keith, and how her reality was warped by his “teachings”. Sylvie was the first witness to testify against Keith: she shares the humiliating story behind the trial and why she’s stayed away from the media since.  She also shares why she’s sharing her story with us and has a message for all victims.  Content Warning: Sexual Abuse    Sylvie Lloyd is now a mother to a beautiful baby girl. From ages 18-32, she was a member of NXIUM \u002B DOS, described as “an American cult that engaged in sex trafficking, forced labor and racketeering.”  Her brain was molded by the teachings of the convicted Keith Reineire, and she was the first witness in the federal case. She is a powerful woman we can expect A LOT from in our lifetime.   Instagram: The Truthiest Life on Instagram @thetruthiestlife Host @lisahayim   To support TTL, subscribe, follow, or share episodes with family and friends!  If you’re loving TTL, please leave a review on Apple Podcasts  https://podcasts.apple.com/us/podcast/the-truthiest-life/id1535516122?uo=2 Guest submissions, please fill out this form HERE.   Edited by Houston Tilley Intro Jingle by Alyssa Chase aka @findyoursails See omnystudio.com/listener for privacy information.",
      "release": "2023-04-14T00:00:00",
      "duration": "00:58:14.2430000",
      "explicit": false,
      "spotifyId": "49IOLcHq5XEKXd7gCtnHSj",
      "appleId": 1000608919062,
      "subjects": [
        "Human Trafficking",
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/49IOLcHq5XEKXd7gCtnHSj",
        "apple": "https://podcasts.apple.com/podcast/surviving-a-sex-cult-ft-sylvie-lloyd-part-1/id1535516122?i=1000608919062"
      }
    }
  ]
}