{
  "id": "8cb89954-4923-4d73-9bea-b1b8b1aad94a",
  "name": "The Unlearning Curve Podcast",
  "spotifyId": "1WuWFbX6XWubS6Dd39irzx",
  "appleId": 1791987663,
  "youTubeChannelId": "UCM3dq_eB5lSYSsC_7CfxGrQ",
  "episodes": [
    {
      "id": "2bc538bf-3b97-4808-ac47-5304c7a4bb29",
      "title": "Cults and Toxic Systems - Alpha Male Grifters",
      "description": "Alpha Male Grifters\n\nMen like John Eldridge, Jerry Falwell, James Dobson, and the Duck Dynasty characters greatly influenced me. I now realize these men are grifters who realize men have something primal in them left over from their evolution. The men who followed these guys are vulnerable and have a root-brain inclination to be alpha males.\n\nThe trouble with this line of thinking is that most other animals also feel this need to respond to crisis and to live their lives in this crisis mode of imagining a demon around every corner and a predator just waiting to attack their family. This thinking doesn’t consider that the rare occasion that that type of man would be required is rare, and it’s most likely another alpha male with low self-esteem like themselves that is threatening them. Since they are mostly Christian, they should remember that Jesus was not an alpha male and used his higher brain to imagine better ways of dealing with the world’s dangers by offering an alternative solution.\n\nLike anything, it’s about fear and control. These men have yet to realize that we never really control the world, and our fear motivates us, not the wisest part of ourselves. We may have needed that approach when living in caves and dealing directly with wild animals, but not now. The men who peddle fear are usually selling something else, like the $18,000 Alpha Male boot camps that are becoming popular and the NRA narrative, supported by gun manufacturers.\n\nThe Podcast \n\nCopyright 2025 - Stuart Delony \u0026 Karl Forehand\n\ntheunlearningcurvepodcast@gmail.com\n\nWhile many of us yearn for truth and understanding, the systems we participate in often prevent us from attaining genuine freedom in our everyday lives. As we move away from organized religion, we begin to recognize patterns. We believe that addressing many of these challenges requires us to examine all aspects of our lives, including:\n\n* Toxic Leaders\n\n* Toxic/Dangerous Organizations\n\n* Our Mental Well-Being\n\n* The Things We Learn on the Journey\n\nRegardless of your belief system, we encourage you to unlearn anything that doesn’t benefit you. This will lead to healing and uncover a new way forward!\n\nJD Forehand is the son of a preacher and an overseas educator. Stuart Delony is a former pastor, podcaster, and blogger for the Snarky Faith community. Karl Forehand is a former pastor who runs The Desert Sanctuary, a home for spiritual nomads, with his wife, Laura.\n\nDisclaimer: We view ourselves as practitioners on a journey of discovery rather than as experts. While we strive to transparently share our experiences and the lessons we’re unlearning, we will also refer you to professionals when necessary. Trusted guides will arrive when you need them.\n\nFeel free to send your thoughts, concerns, and necessary corrections to Karl (karl4hand@gmail.com) or Stuart (stuartdelony@gmail.com). You can also visit our Facebook page, The Unlearning Curve.",
      "release": "2025-02-19T11:00:48Z",
      "duration": "00:39:52",
      "explicit": false,
      "spotifyId": "3mC1T99F5tzuf3zx5dL13G",
      "appleId": 1000693972385,
      "youTubeId": "ZS4uCQ_MopI",
      "subjects": [
        "Thomas Road Baptist Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mC1T99F5tzuf3zx5dL13G",
        "apple": "https://podcasts.apple.com/podcast/5-alpha-male-grifters/id1791987663?i=1000693972385",
        "youtube": "https://www.youtube.com/watch?v=ZS4uCQ_MopI"
      }
    }
  ]
}