{
  "_ts": 0,
  "id": "9a48eac7-ddb2-4aa3-93fd-dc1bbb98dcd8",
  "name": "The Jordan Harbinger Show",
  "spotifyId": "5RVoEOIACQbBDZnGBJ7Ec2",
  "appleId": 1344999619,
  "episodes": [
    {
      "id": "587fe3a5-d720-4031-aa88-91e20acd4040",
      "title": "1170: Gareth Gore | This Vatican Cult Corrupts Courts and Sells Slaves",
      "description": "From Supreme Court infiltration to human trafficking, secretive Catholic cult Opus Dei wields dangerous power. Gareth Gore exposes its operations here! Full show notes and resources can be found here: jordanharbinger.com/1170 What We Discuss with Gareth Gore: Journalist Gareth Gore discovered secretive Catholic cult Opus Dei\u0027s control of Spain\u0027s Banco Popular through archived records after the bank\u0027s 2017 collapse — revealing decades of financial manipulation. Opus Dei recruits girls as young as 11 from poor communities, promising education but enslaving them as unpaid domestic workers in \u0022hospitality schools\u0022 worldwide. The organization has deeply penetrated US political circles, with connections to Supreme Court justices through Federalist Society leader Leonard Leo — potentially influencing major rulings. Members endure physical self-harm rituals, live under surveillance, and submit to \u0022chat\u0022 sessions that collect compromising personal information for manipulation. The good news: the vast majority of Opus Dei members are genuinely good people who\u0027d be horrified to learn about the trafficking and manipulation happening in their organization\u0027s name. New Pope Leo isn\u0027t just aware of Opus Dei\u0027s shenanigans — he began actively working to dismantle its power structure within hours of taking office. And much more... And if you\u0027re still game to support us, please leave a review here — even one sentence helps! Sign up for Six-Minute Networking — our free networking and relationship development mini course — at jordanharbinger.com/course ! Subscribe to our once-a-week Wee Bit Wiser newsletter today and start filling your Wednesdays with wisdom! Do you even Reddit, bro? Join us at r/JordanHarbinger ! This Episode Is Brought To You By Our Fine Sponsors : The Cybersecurity Tapes: thecybersecuritytapes.com Caldera Lab: 20% off: calderalab.com/jordan, code JORDAN Oura Ring: 10% off: ouraring.com/jordan Wayfair: Start renovating: wayfair.com Quince: Free shipping \u0026 365-day returns: quince.com/jordan See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-06-17T07:00:00Z",
      "duration": "01:24:24.3330000",
      "explicit": true,
      "spotifyId": "6xKz3k7yTqoD6xCXctUrlN",
      "appleId": 1000713210527,
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6xKz3k7yTqoD6xCXctUrlN",
        "apple": "https://podcasts.apple.com/podcast/1170-gareth-gore-this-vatican-cult-corrupts-courts/id1344999619?i=1000713210527"
      }
    },
    {
      "id": "48a9083b-b55f-44f3-9764-ebdcebf9fe6a",
      "title": "850: Self-Help Cults | Skeptical Sunday",
      "description": "Striving to better yourself is a noble pursuit, and there are plenty of legitimate resources to help you navigate this journey. But how do you protect yourself against the unscrupulous shysters lurking in the shadows looking to exploit you at this vulnerable juncture? Welcome to Skeptical Sunday, a special edition of The Jordan Harbinger Show where Jordan and fact-checker, comedian, and podcast host David C. Smalley break down a topic that you may have never thought about, open things up, and debunk common misconceptions. On This Week\u0027s Skeptical Sunday:  Globally, the self-help industry brings in nearly $60 billion per year. But how much of this is generated by programs that actually help people better themselves? Under the surface, many so-called self-help groups are nothing more than cults that use coercive tactics — or even abuse — to keep their \u0022customers\u0022 in line. These groups cultivate dependency among the flock while escalating the price of admission. A healthy dose of skepticism and genuine connection with the outside world will help guard against such exploitation. Therapy, research, and self-guided approaches are better bets for promoting genuine well-being. Connect with Jordan on Twitter, Instagram, and YouTube. If you have something you\u0027d like us to tackle here on Skeptical Sunday, drop Jordan a line at jordan@jordanharbinger.com and let him know! Connect with David at his website, Twitter, Instagram, TikTok, and YouTube, and make sure to check out The David C. Smalley Podcast here or wherever you enjoy listening to fine podcasts! If you like to get out of your house and catch live comedy, keep an eye on David\u0027s tour dates here and text David directly at (424) 306-0798 for tickets when he comes to your town!  Full show notes and resources can be found here: jordanharbinger.com/850  This Episode Is Brought To You By Our Fine Sponsors: jordanharbinger.com/deals  Sign up for Six-Minute Networking — our free networking and relationship development mini course — at jordanharbinger.com/course!  ",
      "release": "2023-06-25T00:00:00",
      "duration": "00:45:18.7460000",
      "explicit": false,
      "spotifyId": "7Hh3i18NifaLHPMz1Yf7Uq",
      "appleId": 1000618226160,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Hh3i18NifaLHPMz1Yf7Uq",
        "apple": "https://podcasts.apple.com/podcast/850-self-help-cults-skeptical-sunday/id1344999619?i=1000618226160"
      }
    },
    {
      "id": "e92ebd53-5023-48a8-bf8a-d20010256135",
      "title": "823: Daniella Mestyanek Young | How to Disengage from a Lifelong Cult",
      "description": "Daniella Mestyanek Young (@daniellamyoung) is a survivor of the religious Children of God cult, a US Army combat veteran, an extremely advanced knitter, and the author of Uncultured: A Memoir. What We Discuss with Daniella Mestyanek Young:  How the seemingly wholesome Children of God (later known by variations of \u0022The Family\u0022) religious group centered around love, faith, and Jesus — and packaged to appeal to impressionable countercultural hippie types of the day — veered into true cult territory under the direction of its leader, David Berg. How female followers of Children of God were encouraged to use their bodies and sexuality to gain converts and money in a practice known as \u0022flirty flashing.\u0022 How child sexual abuse became a commonplace Children of God practice in an effort to raise \u0022sexually liberated\u0022 children. What this cult and others do to cultivate credibility — and raise funds — among its followers and the outside world. The toll that life in a cult takes on those who are lucky enough to exit. And much more...  Full show notes and resources can be found here: jordanharbinger.com/823  This Episode Is Brought To You By Our Fine Sponsors: jordanharbinger.com/deals  Sign up for Six-Minute Networking — our free networking and relationship development mini course — at jordanharbinger.com/course!  Like this show? Please leave us a review here — even one sentence helps! Consider including your Twitter handle so we can thank you personally!",
      "release": "2023-04-11T00:00:00",
      "duration": "01:35:42.9150000",
      "explicit": false,
      "spotifyId": "7CmAGCrMAAfnwrmIhOwffg",
      "appleId": 1000608334904,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7CmAGCrMAAfnwrmIhOwffg",
        "apple": "https://podcasts.apple.com/podcast/823-daniella-mestyanek-young-how-to-disengage-from/id1344999619?i=1000608334904"
      }
    },
    {
      "id": "c75cf725-97be-453b-ae40-86a46fc2188f",
      "title": "471: Steven Hassan | The #iGotOut Guide to Quitting QAnon",
      "description": "Steven Hassan (@CultExpert) has helped thousands of individuals and families recover from undue influence (authoritarian control). With over 40 years of experience, he is sought after as one of the foremost authorities on undue influence and controlling groups and individuals. He is the founder of the Freedom of Mind Resource Center, and a founding collaborator of the #iGotOut movement. What We Discuss with Steven Hassan:  How a disinformation crusade like QAnon takes root and thrives in the politically polarized petri dish of modern America (with a little help from its outside adversaries). Why the trope of non-human elites ritualistically sustaining themselves on the essence of innocent children should seem familiar -- because this blood libel has been most famously used to normalize the persecution of Jews from the Middle Ages to the Holocaust and beyond. How QAnon appeals not only to the predictable dumber-than-a-box-of-rocks demographic, but a surprising number of seemingly otherwise intelligent people who are counterintuitively more susceptible to its influence than most. How Steven’s BITE model applies to QAnon\u0027s manipulation of behavior, information, thought, and emotion among its followers to show it for what it is: a destructive cult with elements of psyops thrown in for good measure. What we can and should do when people we care about have been sucked down the QAnon rabbit hole and we want to see them safely tethered back to reality. And much more...  Full show notes and resources can be found here: jordanharbinger.com/471 Sign up for Six-Minute Networking — our free networking and relationship development mini course — at jordanharbinger.com/course! Like this show? Please leave us a review here -- even one sentence helps! Consider including your Twitter handle so we can thank you personally!",
      "release": "2021-02-18T00:00:00",
      "duration": "01:34:17.4430000",
      "explicit": false,
      "spotifyId": "2kpGoPRAgNs7HxjbnHwZDp",
      "appleId": 1000509645347,
      "subjects": [
        "Cult-Expert",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2kpGoPRAgNs7HxjbnHwZDp",
        "apple": "https://podcasts.apple.com/podcast/471-steven-hassan-the-igotout-guide-to-quitting-qanon/id1344999619?i=1000509645347"
      }
    },
    {
      "id": "ec835895-db7a-46e1-aba7-bbbca30ebb69",
      "title": "238: Steven Hassan | Combating Cult Mind Control Part Two",
      "description": "Steven Hassan (@CultExpert) is a licensed mental health counselor who has been educating the public about mind control, brainwashing, and destructive cults since 1976. He\u0027s the author of Combating Cult Mind Control: The Guide to Protection, Rescue, and Recovery from Destructive Cults and the founder of the Freedom of Mind Resource Center. This is part two of a two-part episode. Check out part one here! What We Discuss with Steven Hassan:   What to do if you suspect you\u0027ve been targeted for recruitment by a cult.  How to tell if your friends and family are being affected by a cult.  What you should and shouldn\u0027t say to someone you\u0027re trying to rescue from a cult.  How phobia indoctrination keeps a cult\u0027s potential defectors tethered to its undue influence by fear (and how Steven helps people break this indoctrination).  Why Steven is optimistic that we\u0027ve reached a turning point at which the bulk of humanity is waking up to understanding the psychology of undue influence.  And much more...  Full show notes and resources can be found here: https://jordanharbinger.com/238 Sign up for Six-Minute Networking — our free networking and relationship development mini course — at jordanharbinger.com/course! Like this show? Please leave us a review here -- even one sentence helps! Consider including your Twitter handle so we can thank you personally!",
      "release": "2019-08-15T00:00:00",
      "duration": "01:00:48.1300000",
      "explicit": false,
      "spotifyId": "6ZPhLcBWKjuwpHCioIzHxL",
      "appleId": 1000446954136,
      "subjects": [
        "Cult Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ZPhLcBWKjuwpHCioIzHxL",
        "apple": "https://podcasts.apple.com/podcast/238-steven-hassan-combating-cult-mind-control-part-two/id1344999619?i=1000446954136"
      }
    },
    {
      "id": "c1b1fd08-b62a-498c-9fb2-99e299ce7aa7",
      "title": "237: Steven Hassan | Combating Cult Mind Control Part One",
      "description": "Steven Hassan (@CultExpert) is a a licensed mental health counselor  who has been educating the public about mind control, brainwashing, and destructive cults since 1976. He\u0027s the author of Combating Cult Mind Control: The Guide to Protection, Rescue, and Recovery from Destructive Cults and the founder of the Freedom of Mind Resource Center. This is part one of a two-part episode (part two coming soon). What We Discuss with Steven Hassan:  How to use Steven\u0027s BITE model to tell if you or someone you love is involved in a destructive cult through control of behavior, information, thought, and emotion. The four types of destructive cults most prevalent today: commercial, religious, political, and self-help. How cults have weaponized the Internet and social media to fill their ranks and thrive as never before possible. Why it\u0027s the people who believe themselves immune to (i.e., too smart for) cult indoctrination who are most at risk of being targeted and recruited. How Steven has refined Ted Patrick\u0027s invasive cult deprogramming tactics of the \u002770s into a more effective strategic interactive approach.  Full show notes and resources can be found here: https://jordanharbinger.com/237 Sign up for Six-Minute Networking -- our free networking and relationship development mini course -- at jordanharbinger.com/course! Like this show? Please leave us a review here -- even one sentence helps! Consider including your Twitter handle so we can thank you personally!",
      "release": "2019-08-13T00:00:00",
      "duration": "01:20:15.7770000",
      "explicit": false,
      "spotifyId": "3l9LVTN6W9Sz9YqUAXlo56",
      "appleId": 1000446779375,
      "subjects": [
        "Cult Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3l9LVTN6W9Sz9YqUAXlo56",
        "apple": "https://podcasts.apple.com/podcast/237-steven-hassan-combating-cult-mind-control-part-one/id1344999619?i=1000446779375"
      }
    },
    {
      "id": "4eef2bda-e5ba-4d3b-b468-e6c31af1a6da",
      "title": "158: How to Save Someone from a Self-Help Cult | Feedback Friday",
      "description": "Jordan Harbinger (@JordanHarbinger) and Jason DeFillippo (@jpdef) banter and take your comments and questions for Feedback Friday right here every week! If you want us to answer your question, register your feedback, or tell your story on one of our upcoming weekly Feedback Friday episodes, drop us a line at friday@jordanharbinger.com. Now, let\u0027s dive in! On This Week\u0027s Feedback Friday, We Discuss:  How can you prove that your teacher is name-grading essays without cheating on the paper? You\u0027re a veteran looking to transition back to civilian life. Here are some resources that might help (many thanks to your fellow veteran Zach Criswell for this info). When the big change you really need is a job opportunity at another company, is it unfair not to give your current employer a chance to negotiate with you to stay put? You\u0027re worried your significant other might have gotten wrapped up in an expensive self-help cult. What might you say to bring them gently back to Earth without wasting even more time and money? How do you find a lawyer who will actually get the job you need done and won\u0027t break the bank? An important network connection has offered to help you find opportunities as you\u0027re transitioning into a new field, but how can you ensure you\u0027re not biting off more than you can chew while still learning the ropes without wasting anyone\u0027s time? You\u0027re a contractor who has worked for a company that has been bought and sold three times in the past three years. How do you present this on your resume so it doesn\u0027t look like you\u0027ve worked for three companies in that time? You\u0027re in your fifties and looking to open a franchise, though you don\u0027t have direct retail experience. What should you do to minimize risk so you\u0027re not burdened with debt in your retirement years should things go south? Recommendation of the Week: Conversations with a Killer: The Ted Bundy Tapes Quick shoutout to Natasha Holmes! Have any questions, comments, or stories you\u0027d like to share with us? Drop us a line at friday@jordanharbinger.com! Connect with Jordan on Twitter at @JordanHarbinger and Instagram at @jordanharbinger. Connect with Jason on Twitter at @jpdef and Instagram at @JPD, and check out his other show: Grumpy Old Geeks.  Sign up for Six-Minute Networking -- our free networking and relationship development mini course -- at jordanharbinger.com/course!  Rob Cesternino is a two-time Survivor contestant and was referred to by Jeff Probst as \u0022The Smartest Player to Never Win Survivor.\u0022 Rob...",
      "release": "2019-02-08T00:00:00",
      "duration": "00:43:20.8550000",
      "explicit": false,
      "spotifyId": "6uzZH0CNdzJlhhFdKlLkK8",
      "appleId": 1000429447765,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6uzZH0CNdzJlhhFdKlLkK8",
        "apple": "https://podcasts.apple.com/podcast/158-how-to-save-someone-from-a-self-help-cult-feedback-friday/id1344999619?i=1000429447765"
      }
    }
  ]
}