{
  "id": "6ae3b63e-8da4-4799-ad32-c589bdfb6340",
  "name": "The Way Forward",
  "youTubeChannelId": "UCrozL7-rFf0JkTWit3gQvvA",
  "episodes": [
    {
      "id": "0f4fa2eb-98c2-4071-bdc4-94fba641c7f5",
      "title": "Memoirs of a Child Sex Slave: Quest For Love featuring Anneke Lucas",
      "description": "In this powerful episode, Anneke Lucas shares her journey of healing from the severe trauma of being sold as a child sex slave. Listen as Anneke recounts her involvement with \u0022The Network,\u0022 her struggles, and her path to recovery and advocacy. \n \nEpisode Highlights: \n \n- Childhood Trauma: Anneke reveals her early life experiences and the impact of being sold into a pedophile network at age 6. \n \n- The Network: Insight into the structure and operations of \u0022The Network,\u0022 including its connections to political and entertainment figures. \n \n- Perpetrators of Evil: Accounts of the individuals who inflicted trauma and the systemic abuse within \u0022The Network.\u0022 \n \n- Rituals and Abuse: Examples of the rituals, abuse, and sacrifices that were part of her traumatic experience. \n \n- Survival Strategies: Discussion on \u0022Suicide and Grey Programming\u0022 used to suppress traumatic memories. \n \n- Healing Journey: Anneke\u0027s extensive healing process through psychotherapy, writing, yoga, and meditation. \n \n- Wounded Healer Role: How Anneke channels her experiences into helping others heal as an advocate and creator of the Unconditional Model. \n \nAbout Anneke Lucas: \n \nAnneke Lucas is an author, speaker, and advocate for child sex trafficking victims. Her work is based on her personal experience of a 30\u002B-year healing journey after surviving being sold by her family as a child sex slave to a pedophile network. She has synthesized her healing through psychotherapy, writing, yoga, and meditation, dedicating a decade of service to incarcerated populations and survivors of sex trafficking. Anneke\u0027s message focuses on personal and global evolution through the Unconditional Model, a mindfulness modality she developed. \n \nFor more information on Anneke’s work and resources, visit her at annekelucas. com. \n \nResources: \n \nBook: \u0022Quest for Love: Memoir of a Child Sex Slave\u0022 - Get your copy here: annekelucas. com/book\n \nWorkshop: \u0022Shifting the Power\u0022 - Learn more and sign up: annekelucas. com/shifting-the-power\n \nSurvivors: Find support and resources: annekelucas. com/resources\n \nEnjoy this episode? Please share it with at least ONE friend who you think needs to hear it! \n \nThe podcast is sponsored by: \n \nNEW BIOLOGY CLINIC: Experience individually tailored terrain-based health services with virtual consults, practitioner livestreams, movement classes, and more. The New Biology Clinic’s motivation is to make you healthy and keep you that way. Visit newbiologyclinic. com and enter code TheWayForward for $50 off your activation fee. Members of The Way Forward get the full activation fee waived. Become a member of The Way Forward here: thewayfwrd. com/membership-sign-up/ \n \n—\n \nORGANIFI: Experience the delicious taste of Organifi\u0027s products infused with 250mg of shilajit. Explore their full collection and enjoy 20% off your entire order by going to organifi. com/twf. \n \n—\n \nOff Grid Dream Life: Discover the path to off-grid living! Join us on August 3rd for an exclusive event where they\u0027ll unveil The 4-Steps To Make Your Dream Of Living In A \u0022Garden Of Eden\u0022 Style EcoVillage A Reality! Don\u0027t miss out—secure your spot today: offgriddreamlife. com/eventregistration\n \n—\n \nVisit our online marketplace for discounts on a variety of the best holistic health brands and products: thewayfwrd. com/store/ \n \nFor all of our links: flowcode. com/page/thewayforward \n \nConnect with like minded men and women near you, businesses near you, and more! The best part? You pay whatever you want!: www. thewayfwrd.com/membership-sign-up/ \n \nAre you a natural health practitioner? Join our private, natural-health practitioner database here: thewayfwrd. com/directory-form/ \n \n—\n \n*This material may not be published, broadcast, rewritten or redistributed in whole or in part without expressed written permission from The Way Forward, LLC. The purpose of this presentation is to convey information. It is not intended to diagnose, treat or cure a condition; nor is it to be considered medical or legal advice, opinion or recommendation. This information is presented in the spirit of service for all.*\n\n0:00 - Intro\n2:31 - Memoirs of a Child Sex Slave: Quest For Love\n8:35 - What is \u0022The Network\u0022?\n15:20 - The Depth of Darkness \n28:15 - Comparing Your Normal to Others \n38:08 - Projection of Demonic Energy \n50:18 - Mind Control Tactics, Torture and Structure of \u0022The Network\u0022\n1:12:08 - Exposure to Others and Throw Away Children\n1:22:18 - Exposure to Rituals and Abuse \n1:30:57 - Examples of What Took Place During These Rituals\n1:37:35 - God Manifesting in the Shadows\n1:46:00 - Media Manipulation and Unknown Truths\n1:56:25 - Don\u0027t Call People Sheep \n2:03:44 - Finding The Innocence and Healing Yourself \n2:19:44 - Remembering and Manipulation Programs \n2:31:30 - Levels of Forgiveness \n2:35:05 - Hardest Acts ti Forgive \n2:46:55 - Working with Other Survivors\n2:59:14 - Act of Escape\n3:06:48 - Revisiting Events to Heal\n3:12:08 - Unconditional Model to Help Others \n3:17:55 - Quest for Love",
      "release": "2024-07-03T23:00:06Z",
      "duration": "03:24:02",
      "explicit": false,
      "youTubeId": "ygzPGR1he0w",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ygzPGR1he0w"
      }
    }
  ]
}