{
  "_ts": 0,
  "id": "5f7fdd7d-0d51-4e59-9855-e9418c8f535c",
  "name": "The Scientology Money Project",
  "youTubeChannelId": "UCqZP90nZjgXbyTwNXPXA6zw",
  "episodes": [
    {
      "id": "4355a1d2-82b6-4307-8176-de33c5d514b3",
      "title": "Tax Exemption \u0026 Religious Worker Visas: Scientology\u0027s License to Human Traffick Children \u0026 Teenagers",
      "description": "Jeffrey Augustine explains why Scientology\u0027s 501c3 tax exemption allows it to engage in human trafficking children and young teenagers by using R-1 Religious Worker Visas",
      "release": "2024-03-05T00:13:33Z",
      "duration": "01:06:56",
      "explicit": false,
      "youTubeId": "1plePsh917Y",
      "subjects": [
        "Scientology",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1plePsh917Y"
      }
    },
    {
      "id": "1f77a6be-c3ac-40d6-92fb-db3da1cf0286",
      "title": "The Horror of CHILDREN in the SCIENTOLOGY SEA ORG. Why American Law Enables Cults to Exploit Kids",
      "description": "Jeffrey Augustine discusses the context of American Law and why Cults are allowed to exploit children. \n\nCases and law are discussed as to why children in any American cult or religion are subject to horrific abuse.",
      "release": "2024-03-03T16:29:08Z",
      "duration": "01:23:40",
      "explicit": false,
      "youTubeId": "qKyblSYBjjU",
      "subjects": [
        "Scientology",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qKyblSYBjjU"
      }
    },
    {
      "id": "da28b2d7-5a75-4254-a311-1f449cb60361",
      "title": "LAPD Update \u002B How Scientology\u0027s Paranoia, Greed \u0026 Violence Combine Into Its Assured Self-Destruction",
      "description": "Analysis: How Scientology\u0027s Paranoia, Greed \u0026 Violence Combine Into Its Inevitable Self-Destruction",
      "release": "2024-02-24T04:15:08Z",
      "duration": "01:30:13",
      "explicit": false,
      "youTubeId": "CtonSWP1t_s",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CtonSWP1t_s"
      }
    },
    {
      "id": "38abb395-c56f-4fc7-b41d-372359445b9e",
      "title": "Scientology Impersonates Local Residents \u0026 Uses Hysterical Propaganda to Attack the Squirrel Squad",
      "description": "NextDoor, which is always being used by Scientology\u0027s OSA, is now using sock puppets to attack the Squirrel Squad. \r\n\r\nWe show an interesting new post on our live.",
      "release": "2024-02-19T04:37:53Z",
      "duration": "01:36:39",
      "explicit": false,
      "youTubeId": "aXzPoeSxk9I",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aXzPoeSxk9I"
      }
    },
    {
      "id": "124ddfce-7610-467b-91e7-ac931728aaf5",
      "title": "A History \u0026 Synopsis of Scientology Violence Against Those Who Expose Its System of Destruction",
      "description": "A History \u0026 Synopsis of Scientology Violence Against Those Who Expose Its System of Destruction",
      "release": "2024-02-07T21:08:50Z",
      "duration": "01:14:28",
      "explicit": false,
      "youTubeId": "-BUjWOUL2a4",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-BUjWOUL2a4"
      }
    },
    {
      "id": "59e69e9a-97e2-4a9d-84cb-e1bb0e6fbf94",
      "title": "Scientology\u0027s Bizarre 1996 Orientation Film: Join Scientology or Blow Your Brains Out!",
      "description": "Mitch Brisker and Jeffrey Augustine discuss Scientology\u0027s bizarre 1996 Orientation film which all new members are required to watch. \n\nAfter watching the film, new Scientologists must sign a contract stating they have seen the film and agree that Scientology is a religion. \n\nThis is the first of four membership contracts all Scientologists must sign which systematically strip them of their civil and legal rights. \n\nSee Jeffrey Augustine\u0027s article on this and read the contracts for yourself: https://scientologymoneyproject.com/2016/12/14/dox-how-scientology-ensnares-the-unsuspecting-in-a-series-of-binding-contracts/\n\nIn the 1996 version, the film\u0027s narrator declared that you could join Scientology or walk away from it -- and if you chose to walk away you could also jump off a bridge or blow your brains out. \n\nL. Ron Hubbard scripted the 1996 film when he was alive. Typical of Hubbard\u0027s work, he created a false sense of danger in which Scientology or unaliving one\u0027s self were the only possible options. \n\nIn this video, Mitch shows a letter written to him by David Miscavige who praised the Orientation film as the greatest film ever made.",
      "release": "2024-01-25T15:00:51Z",
      "duration": "01:43:42",
      "explicit": false,
      "youTubeId": "OnprpNaByJY",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OnprpNaByJY"
      }
    },
    {
      "id": "c6cacdd2-b7c0-4d53-9dfd-a491aee80bbe",
      "title": "Grant Cardone Called Out by John Legere. Cardone Demands $100 Million for the Narcissistic Injury.",
      "description": "This is the Periscope audio that initiated Grant Cardone\u0027s $100 million lawsuit against John Legere for libel and slander.",
      "release": "2024-01-14T04:39:03Z",
      "duration": "00:01:04",
      "explicit": false,
      "youTubeId": "8F3e1WZG-yk",
      "subjects": [
        "Grant Cardone"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8F3e1WZG-yk"
      }
    },
    {
      "id": "23b9f8c3-ae48-4c9a-841f-5121df27b404",
      "title": "From Engrams to Entities: Why L. Ron Hubbard Dumped Freud \u0026 Crossed Over to the Dark Side",
      "description": "In this podcast, Jeffrey Augustine traces the hidden reasons why L. Ron Hubbard dumped his Freudian-based Dianetics system and crossed over into the Occult OT Levels to gain money, power, and control over his followers.",
      "release": "2023-11-28T15:10:08Z",
      "duration": "00:59:34",
      "explicit": false,
      "youTubeId": "yVeaaUBZZLU",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yVeaaUBZZLU"
      }
    },
    {
      "id": "acad333d-b669-41c1-90dd-62f87bf2a8ea",
      "title": "Scientology: Lying in the Rain with a Rat Below Your Crotch \u0026 Other Weird Things L. Ron Hubbard said",
      "description": "L. Ron Hubbard wrote and said thousands of strange and weird things and made them all part of official Scientology doctrine. \n\nJeffrey Augustine discusses four of these weird things in the first episode of his new series \u0022Weird Things L. Ron Hubbard Said.\u0022",
      "release": "2023-08-09T05:58:12Z",
      "duration": "00:26:01",
      "explicit": false,
      "youTubeId": "mwFtMpESjLI",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mwFtMpESjLI"
      }
    },
    {
      "id": "a6177b8f-603a-4451-b8f4-111b1e2c1638",
      "title": "Hubbard\u0027s Great Fraud: Irrefutable Evidence that L. Ron Hubbard Did Not Create Scientology. 4/5",
      "description": "Long-time Scientology critic and California PI Jeffrey Augustine reveals the astonishing facts showing how and why L. Ron Hubbard pulled off his \u0022Big Bamboozle\u0022 in 1951 to reboot the staggering failure that was Dianetics as it headed towards bankruptcy.  \n\nAugustine shows how L. Ron Hubbard did not invent the e-meter and did not create auditing. Rather, Augustine shows precisely how Hubbard took the work of others to relabel Dianetics as \u0022Scientology.\u0022\n\nErratum: Jeffrey Augustine uses the word \u0022copyright\u0022 in this video whereas the correct term is \u0022trademark.\u0022 Commenters are thanked for pointing this out. A correction will be stated in the next video.",
      "release": "2023-03-27T06:12:20Z",
      "duration": "00:41:01",
      "explicit": false,
      "youTubeId": "FKyKxNKeHZY",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FKyKxNKeHZY"
      }
    },
    {
      "id": "a523f878-fcdd-45f9-9c23-5fdc57ad1333",
      "title": "The Psychiatrist Who Used an E-Meter in 1906: The Real Truth About the Creation of \u0022Scientology\u0022 3/5",
      "description": "Long-time Scientology critic and California PI Jeffrey Augustine discusses the history of the galvanometer and how it came to be used in psychiatric research in the 19th century. \n\nAugustine presents the facts of how the legendary Swiss psychotherapist Carl Jung used the meter in his formal psychiatric research in 1906. Jung\u0027s work with the e-meter and word association was published in English in 1919.  Click over to the Scientology Money Project to read Jung\u0027s 1919 \u0022Studies in Word Association\u0022: \n\nAugustine\u0027s central point in this video is that Psychiatry was using the e-meter in psychotherapy decades before L. Ron Hubbard adopted the work of a psychotherapy researcher and inventor and called it Scientology.  \n\nSorry Scientologists: The Psychs were doing auditing with a meter long before L. Ron Hubbard was even born.",
      "release": "2023-03-25T02:03:29Z",
      "duration": "00:23:30",
      "explicit": false,
      "youTubeId": "6EpRjOJBj28",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6EpRjOJBj28"
      }
    },
    {
      "id": "5794d9d0-26e1-42d1-bcd7-57ca4373d56a",
      "title": "Narcotics, Hypnosis \u0026 Past Lives: The Real Truth About the Creation of Scientology - Part 2 of 5",
      "description": "Scientology Money Project author Jeffrey Augustine introduces his three-part series which presents the evidence showing why L. Ron Hubbard was not the actual creator of Scientology. \n\nIn this video Augustine shows Hubbard\u0027s use of narcotics and hypnosis in his pre-Dianetics days. He also discusses how past lives in Dianetics became a public relations problem for L. Ron Hubbard.\n\nAugustine shows the story arc of Dianetics: An overnight sensation followed two years later by bankruptcy. Why did Dianetics implode and crash in only two years?",
      "release": "2023-03-09T00:17:11Z",
      "duration": "00:32:52",
      "explicit": false,
      "youTubeId": "MhlpFVwY2WU",
      "subjects": [
        "Scientology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MhlpFVwY2WU"
      }
    },
    {
      "id": "0dad7e6f-8583-4822-ac48-6ba4c1688162",
      "title": "Black Magick:  The Real Truth About the Creation of Scientology - Part 1 of 5",
      "description": "Scientology Money Project author Jeffrey Augustine introduces his three-part series which presents the evidence showing why L. Ron Hubbard was not the actual creator of Scientology. \n\nAugustine answers one question he has been asked many times: Did L. Ron Hubbard practice Black Magick?\n\nIn Part 1 Augustine offers a brief overview of the influences on L. Ron Hubbard prior to the release of Dianetics on May 9, 1950. These influences include Hubbard\u0027s near death experience in 1937; the US Navy; Sigmund Freud; Aleister Crowley; Jack Parsons; Goetia; and Hubbard\u0027s early career as a pulp fiction writer. \n\n\nL. Ron Hubbard\u0027s Affirmations (scroll down to bottom of page): https://scientologymoneyproject.com/2023/03/03/proof-that-l-ron-hubbard-did-not-create-scientology-the-prelude-part-1/\n\nThe Scientology Money Project: https://scientologymoneyproject.com/\n\nSurviving Scientology Channel on YouTube: https://www.youtube.com/@SurvivingScientology",
      "release": "2023-03-04T03:28:56Z",
      "duration": "00:28:39",
      "explicit": false,
      "youTubeId": "55TaMPnOeA8",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=55TaMPnOeA8"
      }
    }
  ]
}