{
  "id": "5328b301-90d6-466a-af1d-67e1ed430fdd",
  "name": "The Spiritually F*cked Podcast",
  "spotifyId": "0RnCVDWoD7cJh0aQXBgUhl",
  "appleId": 1829193477,
  "episodes": [
    {
      "id": "da8f77f3-b0ea-491c-a0c0-a29884e47b40",
      "title": "22. The Joe Dispenza experience: coherence, commitment and yes this is definitely a cult",
      "description": "\u0022Sorry can\u0027t get to the phone right now I\u0027m at Joe Dispenza...\u0022 In this epi Taylor shares how she found her way into daddy Joe Dispenza’s work and how it became one of the catalysts that changed her life. She spills the low down on attending three of his retreats, what actually happens in the rooms people love to speculate about, and how his teachings around coherence, meditation, and commitment reshaped her entire relationship to living life. We explore what it really means to take responsibility for your inner state, how the body responds when the mind changes (embodiment helloooo), and why consistency—not bypassing—is the work. Call it a cult? We call it devotion... And we want to be apart of this cult. This isn’t a sales pitch or blind praise. It’s a firsthand reflection on learning how to heal yourself, meet your edge, and stay committed to that higher frequency. Because no one is coming to save you - so you better buckle up and take ownership of your life. Taylor also gives a mini update on her life: what\u0027s brewing for her in the next few months and the intentions she\u0027s stepping into. (You don\u0027t want to miss this). ~ Connects! instagram: https://www.instagram.com/thespirituallyfckedpodcast/ https://www.instagram.com/taylormvlholland/ youtube: https://www.youtube.com/@TheSpirituallyFckedPodcast tiktok: https://www.tiktok.com/@maylorgangordie website: https://sadflowerswritten.com podcast: https://podcasts.apple.com/us/podcast/the-spiritually-f-cked-podcast/id1829193477 substack - https://substack.com/@sadflowerswritten Intuitive Guided Mentorship with me - https://sadflowerswritten.com/blogs/news/intuitive-guided-mentorships",
      "release": "2026-01-13T04:46:18Z",
      "duration": "00:46:28.6500000",
      "explicit": false,
      "spotifyId": "1rTzK5keuT9ayfEB1HWddQ",
      "appleId": 1000744934580,
      "subjects": [
        "Joe Dispenza",
        "Ramtha\u0027s School of Enlightenment"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1rTzK5keuT9ayfEB1HWddQ",
        "apple": "https://podcasts.apple.com/podcast/22-the-joe-dispenza-experience-coherence-commitment/id1829193477?i=1000744934580"
      }
    }
  ]
}