{
  "_ts": 0,
  "id": "e227bc15-4615-49ad-b12d-23b0c810016b",
  "name": "The Good Girl Confessional",
  "appleId": 1475210883,
  "episodes": [
    {
      "id": "a2815040-4d01-4757-8075-341fc12397d5",
      "title": "#18 (part 1) - Claire Ashman |  From Cult Survivor to Ted X Talker | Lessons of a Cult Survivor",
      "description": "Claire Ashman is a remarkable woman. She grew up in a sect, a break away from the Catholic Church, and at 18 married a man who would lead her into an even more sinister community. For almost a decade she lived by the whim of a man who called himself \u0022Little Pebble\u0022, the leader of a doomsday cult called The Order of St. Charbel. Forced to join the religious order, she took a vow of poverty, chastity and obedience and attended prayer sessions three times a day, It was the concern for the safety of her eight young children that eventually saw her bravely flee with her kids from the secretive cult , led by convicted rapist and pedophile William Kamm, on the NSW south coast. After escaping the cult, Claire had no idea about the outside world or how to survive on her own. But survive she did. Claire went on to forge an amazing life, is an author, a coach and has delivered no less that four Ted X talks.\nClaire joins host, Sandy Lowres, to tell her story. This is Part 1 of Claire\u0027s remarkable journey of survival. (*Note: We made a conscious decision to have Claire\u0027s story told in two parts so that she could tell it fully). \n\nClaire Ashman is the author of Lessons of a Cult Survivor. \nYou can buy her remarkable book here:\nhttps://www.amazon.com.au/Lessons-Cult-Survivor-Claire-Ashman-ebook/dp/B07G7276P5\n\nYou can watch Claire Ashman\u0027s Ted X Talks and find out more about Claire here:\nwww.claireashman.com\n\nFollow us on instagram: @thegoodgirlconfessional\n\nThe Good Girl Confessional Podcast is a production of Wb40 - Women Beyond Forty\n\nCraving more? You can find us at www.wb40.com\nInstagram: @womenbeyondforty\n\n\nThe Good Girl Confessional and Wb40 - Women Beyond Forty team acknowledges the traditional owners of the lands this podcast is recorded and researched on - the Wurundjeri Woi-wurrung and Bunurong Peoples of the Kulin Nation and we pay our respects to the Elders past, present and emerging. ",
      "release": "2020-02-18T19:30:17Z",
      "duration": "01:03:26",
      "explicit": false,
      "appleId": 1000465994418,
      "subjects": [
        "Order of St Charbel"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/18-part-1-claire-ashman-from-cult-survivor-to-ted-x/id1475210883?i=1000465994418"
      }
    }
  ]
}