{
  "id": "1459bf28-41a9-47c8-8c10-e32c88f258ab",
  "name": "The People Who Read People psychology podcast",
  "spotifyId": "0MXNhbb3bR4qG05bpY4r9p",
  "appleId": 1432369172,
  "youTubeChannelId": "UC9CABb419r7z3yN_YTfu3tQ",
  "episodes": [
    {
      "id": "32176b3b-8e20-48d8-9956-37bb288e356e",
      "title": "NLP pseudoscience and its use by Chase Hughes and other con artists and deceptive faux-gurus",
      "description": "You’ve probably heard of neuro-linguistic programming (NLP). It’s a popular thing. It’s the foundation for the work of popular life/business coach Tony Robbins, and there are many other popular trainers and “gurus” who have used NLP ideas as the basis for their work. The con artist Chase Hughes, whose lies and unethical behaviors I’ve examined on this podcast, is one such false guru whose origins are in NLP. This is a reshare of an episode from Chris Shelton’s “Speaking of Cults” podcast, which you can find on YouTube. We talk about: the history and origins of NLP and the ideas it contains; the good and the bad in NLP; my own experiences working for 6 months in the NLP industry; how people like Chase Hughes and other obvious charlatans succeed at gaining popularity (e.g., Chase Hughes being promoted by Joe Rogan and Dr. Phil); how Joe Rogan\u0027s and Chase Hughes\u0027 popularity relate to political polarization; and more. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-10-20T15:54:00Z",
      "duration": "02:16:05.0940000",
      "explicit": false,
      "spotifyId": "4lRcPwoKanhZYPtJPPlkPh",
      "appleId": 1000732674578,
      "youTubeId": "6J-jvsDq6WU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4lRcPwoKanhZYPtJPPlkPh",
        "apple": "https://podcasts.apple.com/podcast/nlp-pseudoscience-and-its-use-by-chase-hughes-and/id1432369172?i=1000732674578",
        "youtube": "https://www.youtube.com/watch?v=6J-jvsDq6WU"
      }
    },
    {
      "id": "3acfb44e-e8cf-4f08-9126-0ed57a38565b",
      "title": "The psychology of “Bad Vegan”: Sarma Melngailis on the con, the crash, and the devastating aftermath",
      "description": "For the transcript, see the episode entry on my site: https://behavior-podcast.com/the-psychology-of-bad-vegan-sarma-melngailis-on-the-mechanics-of-narcissistic-manipulation-and-its-devastating-aftermath/. Want to know the full story behind \u0022Bad Vegan\u0022? Get Sarma\u0027s tell-all memoir at https://TheGirlwiththeDuckTattoo.com. \n\nAbout this episode: \nThe documentary \u0022Bad Vegan\u0022 was about Sarma Melngailis’s nightmarish journey from successful New York City restaurant owner to Rikers inmate jailed for stealing millions. How did this happen? Sarma was the victim of a narcissistic con man named Anthony Strangis, who manipulated her into believing (or semi-believing) a number of wild, delusional ideas (like that he might be a non-human being with immense, other-worldly powers). He used this strange hold over her to persuade her to give him large amounts of money (much of which he blew at casinos). I talk to Sarma about her experiences. We talk about: what led to her being so emotionally vulnerable that someone like Strangis could manipulate her; the factors that can lead someone to believe things that most people see as clearly ridiculous lies; why she dislikes the “Bad Vegan” documentary maker for his editing choices; the huge emotional challenge of trying to rebuild and stay positive after such nightmarish, debilitating events; her new book \u0022The Girl With the Duck Tattoo.\u0022",
      "release": "2025-09-12T01:39:32Z",
      "duration": "01:23:18",
      "explicit": false,
      "spotifyId": "1iI63mcyIKScAPjzBF8s8u",
      "appleId": 1000725493751,
      "youTubeId": "dO4noNp927s",
      "subjects": [
        "One-on-one",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1iI63mcyIKScAPjzBF8s8u",
        "apple": "https://podcasts.apple.com/podcast/the-psychology-of-bad-vegan-sarma-melngailis-on/id1432369172?i=1000725493751",
        "youtube": "https://www.youtube.com/watch?v=dO4noNp927s"
      }
    },
    {
      "id": "9516b1b4-a91a-4a89-8114-7ff08550d24e",
      "title": "Con artist Chase Hughes fools Joe Rogan, Diary of a CEO, Patrick Bet-David, other popular podcasts",
      "description": "The charlatan Chase Hughes, whose major lies and unethical behaviors I’ve examined in past episodes (see https://www.youtube.com/watch?v=4t1DMxmqJOk and text summary here: https://behavior-podcast.com/debunking-chase-hughes-examining-the-bullshit-of-the-self-titled-1-expert-in-behavior-influence) has succeeded in getting on several popular podcasts with large audiences. Chase recently appeared on the Joe Rogan Experience, the podcast The Diary of a CEO with host Steven Bartlett, Patrick Bet-David’s podcast (aka the PBD podcast). A while back he was also on Dr. Phil\u0027s show, and on Leon Hendrix\u0027s podcast DRVN. In this episode, I examine some clips from Chase\u0027s appearances on Diary of a CEO and PBD shows, as a public service announcement to the millions of people who may have recently learned about Chase and been interested in his \u0022work.\u0022 I recap some of the absurd claims Chase has made. I talk about why I think these podcasts keep interviewing him, and what it tells us about the internet information ecosystem. I examine an early podcast interview where the host told me for Chase\u0027s bio he just wrote what Chase said and didn’t vet it, which is what many of these podcasts have done. More podcast appearances; more seeming legitimacy. \n\nSome notes: \n* For more details about this episode, including a transcript with links to the online resources featured in this episode, go to https://behavior-podcast.com/the-charlatan-chase-hughes-featured-on-shows-diary-of-a-ceo-patrick-bet-david-others. \n* Excerpt from my polarization-related book examining why believing there are many big plots around us will generally be illogical: https://american-anger.com/conspiracy-theories. Without good evidence, we should be unlikely to believe theories that require many people being involved in keeping a secret.  \n* Sorry about the audio and the mic noises in this one. I need to spend some time getting a better audio setup. I hate this setup I have. \n* Want to subscribe on audio podcast? See links at https://behavior-podcast.com.",
      "release": "2025-01-18T23:51:19Z",
      "duration": "00:53:24",
      "explicit": false,
      "spotifyId": "2HYPZtxly86Ulh4cL9pPSq",
      "appleId": 1000684526841,
      "youTubeId": "Gr-gpeJxG8E",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2HYPZtxly86Ulh4cL9pPSq",
        "apple": "https://podcasts.apple.com/podcast/the-charlatan-chase-hughes-promoted-by-popular-shows/id1432369172?i=1000684526841",
        "youtube": "https://www.youtube.com/watch?v=Gr-gpeJxG8E"
      }
    },
    {
      "id": "e93ba03f-abc8-4031-9b33-3f0517947d7b",
      "title": "Chase Hughes, Hypnosis, \u0026 Behavior Analysis: Putting a secret-agent spin on old NLP seminar ideas",
      "description": "My third episode about Chase Hughes, who promotes himself as the “#1 expert in behavior and influence” and who\u0027s known for being on The Behavior Panel show. My first episode about Chase examined his early deceptions and his involvement in pick-up artistry and vitamin supplement sales (that episode: https://www.youtube.com/watch?v=4t1DMxmqJOk). In this episode, I focus on how Chase\u0027s content and training relates to Neuro-Linguistic Programming (NLP), and related things like hypnosis/influence courses and transformational seminars. Time-stamped chapters are below.\n\nSummary of points in this episode: Chase has used the NLP trainer template but repackaged it with a military/secret-agent/MK-Ultra-type spin. I examine the connections between NLP and Chase’s behavior analysis and influence/hypnosis content. I also attempt to explain why Chase (and people like him) can acquire good reviews and fans, despite so much of it being low-quality and also very expensive. I examine Chase’s promotion of supplements sold by a chiropractor named John Lieurance. And I talk about the various people who\u0027ve promoted Chase, from influential podcasters to Dr. Phil to his fellow Behavior Panel members, and why there\u0027s such a lack of interest in examining Chase\u0027s deceptive claims.\n\nFor a transcript and more details about this episode, see https://behavior-podcast.com/chase-hughes-and-how-he-put-a-military-top-secret-spin-on-nlp-hypnosis-seminar-ideas. \n\nA later episode will focus on behavior analysis and the Behavior Panel. This episode is focused squarely on NLP/hypnosis. \n\n0:00 Intro\n2:20: People pay Chase large amounts of money\n3:58: This is focused on NLP/hypnosis, not behavior analysis\n5:10 Some have asked, “Isn\u0027t this normal marketing exaggeration?”\n6:56 Chase’s absurd claims about controlling people \n9:22 What do experts say about hypnosis?\n10:58 Thoughts from hypnosis expert Martin Taylor\n13:44 Bullshit in Chase’s book, The Ellipsis Manual \n15:45 How can Chase’s books (and other work) get good reviews? \n18:34 What is NLP? \n24:13 How NLP relates to hypnosis \n26:14 NLP involves influence using language and behavior patterns\n26:52 What does research say about NLP?\n27:50 Eye direction tells\n34:09 NLP and gaining rapport\n35:25 Repackaging NLP ideas in a military/secret-agent theme\n36:38 NLP, strange “transformational” experiences, and love bombing\n38:24 Some good and okay things about NLP \n42:58 Chase’s foreword in an NLP/hypnosis book \n46:00 Why do so many people believe this stuff?\n50:01 A note about behavior analysis and separating bullshit from reality\n51:22 The placebo effect plays a role\n52:44 Harms in NLP/hypnosis areas\n54:10 Chase promoting Dr. John\u0027s Mitozen supplements\n59:18 A closer look at Chase’s sales/manipulation funnel \n1:00:34 Cult-like dynamics that arise due to customers\u0027 emotional vulnerability \n1:01:33 Responses from other NLP/hypnosis gurus\n1:08:17 Various podcasters and personalities who\u0027ve promoted Chase\n1:12:14 Concluding thoughts\n\nTopics discussed in this video include: \n• How Chase’s concepts relate to NLP\n• What NLP is and why people attend those seminars\n• My own personal experiences working for an NLP trainer\n• NLP seminars relate to other experiential/transformational multi-day seminars\n• Good and okay aspects of NLP/hypnosis/influence type content and training\n• The many influential people who’ve promoted Chase and the factors in that\n• Why these things can impress people despite being so obviously silly and strange\n• What a hypnosis expert had to say about Chase\u0027s stuff\n• How cult-like dynamics can come about due to the emotional vulnerability of some NLP/self-help customers\n• Why behavior-analysis and influence/hypnosis-type offerings lend themselves to exaggerated claims",
      "release": "2024-09-26T18:39:26Z",
      "duration": "01:14:13",
      "explicit": false,
      "spotifyId": "61V5UoVI8UgBUc9mFHljE4",
      "appleId": 1000670760893,
      "youTubeId": "flI6NWcshq8",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61V5UoVI8UgBUc9mFHljE4",
        "apple": "https://podcasts.apple.com/podcast/chase-hughes-nlp-hypnosis-putting-a-top-secret/id1432369172?i=1000670760893",
        "youtube": "https://www.youtube.com/watch?v=flI6NWcshq8"
      }
    },
    {
      "id": "90430237-ab03-4f75-aea6-5c3caebb05e3",
      "title": "Fans of Chase Hughes (NCI University, Applied Behavior Research) lash out at his lies being exposed",
      "description": "For the first episode about Chase Hughes\u0027 many lies and unethical behaviors, see this video: https://www.youtube.com/watch?v=4t1DMxmqJOk) or read the text summary: https://behavior-podcast.com/debunking-chase-hughes-examining-the-bullshit-of-the-self-titled-1-expert-in-behavior-influence. There\u0027s a third episode out that goes into more detail about the nature of Chase\u0027s \u0022work\u0022 and how it relates to neuro-linguistic programming (NLP); also talks about why it\u0027s so easy for Chase and others doing similar stuff to impress people and get positive reviews: https://www.youtube.com/watch?v=flI6NWcshq8\n\nMy investigation into Chase Hughes\u0027 deceptions led to some Behavior Panel fans and Chase Hughes fans responding in angry ways, personally insulting me and downplaying the significance of what I found. Some of the people who responded in these ways, I\u0027ve been informed, are social media content moderators who work and/or volunteer for Chase Hughes and the Behavior Panel. In this episode, I examine these behaviors and talk about how this ties in with similar things, like people taking it personally when political leaders they like are criticized, or cult members taking criticisms of cult leaders personally... things like this. I talk about it ties in with how people respond when their sense of meaning is threatened (https://behavior-podcast.com/how-do-we-respond-when-our-sense-of-meaning-is-threatened-with-steven-heine). I read some of the more angry and emotional YouTube comments people sent me.\n\nThis show is also in audio format. Subscribe on Spotify: https://open.spotify.com/episode/2pRykpc4hscMNzdOSj9bNZ",
      "release": "2024-09-09T02:58:11Z",
      "duration": "00:26:34",
      "explicit": false,
      "spotifyId": "2pRykpc4hscMNzdOSj9bNZ",
      "appleId": 1000668855590,
      "youTubeId": "orwNPdT-lPI",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2pRykpc4hscMNzdOSj9bNZ",
        "apple": "https://podcasts.apple.com/podcast/angry-chase-hughes-fans-lash-out-after-his-many-lies/id1432369172?i=1000668855590",
        "youtube": "https://www.youtube.com/watch?v=orwNPdT-lPI"
      }
    },
    {
      "id": "50d432a3-c3fd-41a0-9666-ac3122c185be",
      "title": "Who is Chase Hughes? The Lies of the Alleged “#1 Expert in Behavior and Influence”",
      "description": "For an overview of Chase Hughes\u0027 bullshit, see https://www.whoischasehughes.com. For a transcript of this episode, see https://behavior-podcast.com/debunking-chase-hughes-examining-the-bullshit-of-the-self-titled-1-expert-in-behavior-influence. I have a follow-up episode on how Chase\u0027s \u0022work\u0022 relates to Neuro-Linguistic Programming (NLP) and that discusses his promotion of supplements (like methylene blue): https://www.youtube.com/watch?v=flI6NWcshq8 \n\nChase Hughes calls himself the “#1 expert in behavior and influence.\u0022 But is this true? Or is it smoke and mirrors? This video examines the many lies Chase has made, big and small, throughout his \u0022career.\u0022 I purposefully walk through slowly what I found about him, as I think this is valuable for helping people do this kind of research on your own. Truth is that there are so many obvious red flags about Chase, anyone should be quickly able to tell what kind of person he is from a little bit of online research. Timestamps are below. \n\nTimestamps for this episode: \n0:00 - Introduction\n3:42 - Claims and products\n9:39 - Experience and education (including military service, claims of a Harvard education, and \u0022top CEO\u0022 claims)\n16:05 - Pick-up artistry and seduction strategies\n27:30 - Fighting videos on YouTube\n29:43 - Selling his vitamin supplements\n36:24 - His early behavior and influence work (including many grandiose claims about hypnosis, mind control, and training beautiful women to become “deadly psychological weapons”)\n57:45 - Conclusion\n\nChase Hughes (https://chasehughes.com) refers to himself as the “#1 expert in behavior and influence\u0022 and runs a company called NCI University (https://www.nci.university).  A popular YouTube show that he’s on, the Behavioral Panel, gets millions of views. Dr. Phil has had him on his show and has called him the “best on the globe.” But Chase’s career is built on a foundation of lies and exaggerations not only in the behavior and psychology space, but in the world of pick-up artistry and vitamin supplements. He makes many claims that just about every psychology expert would disagree with (for example, his claims that he can teach people to hypnotize just about anyone to do things against their morals and will). This video, the first of at least a two-part series, examines his many deceptions and his many grandiose (and in some cases clearly absurd) claims. It establishes the extremely deceptive patterns that Chase Hughes has been practicing since 2007, when he wrote his pick-up artist book The Passport. \n\nWant to see episodes of my podcast related to investigation/interrogation? Check them out here: https://behavior-podcast.com/reading-behavior-in-criminal-security-and-legal-scenarios/ \n\nIf you\u0027d like to support my work, sharing my episodes is greatly appreciated. Another option is to sign up for a premium subscription to my podcast: https://pwrp.supercast.com. Another option is sending a gift via Venmo: https://venmo.com/zacharyelwood. Any other thoughts or questions, reach out to me at: https://behavior-podcast.com/contact.",
      "release": "2024-09-02T05:55:46Z",
      "duration": "01:04:13",
      "explicit": false,
      "spotifyId": "6yBUld0ic9qmCDLQuz9lxh",
      "appleId": 1000668017336,
      "youTubeId": "4t1DMxmqJOk",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6yBUld0ic9qmCDLQuz9lxh",
        "apple": "https://podcasts.apple.com/podcast/the-lies-of-chase-hughes-the-1-expert-in/id1432369172?i=1000668017336",
        "youtube": "https://www.youtube.com/watch?v=4t1DMxmqJOk"
      }
    }
  ]
}