{
  "id": "622673ca-6e04-47a8-a06a-0b21c60374d0",
  "name": "The Irregular Pioneer Channel",
  "youTubeChannelId": "UCuHLo0qEvKF9tqzipre4Ifw",
  "episodes": [
    {
      "id": "e5898bd0-fd02-45c1-8139-d9cbf3f9dc46",
      "title": "How The 2018 Convention Helped Me To Start Asking Questions",
      "description": "We all wake up for different reasons. We all were impacted by certain things on the way to us totally freeing ourselves of JW propaganda. Here’s how the 2018 “Be Courageous” Regional Convention helped to plant seeds of doubt in my mind.\n\nBy the way here are some other ex-jw youtubers who I really enjoy, and recommend:\n\nCindy Lu Who?: https://youtu.be/0cY_nlzfDr0\n\nDiary of an Awkward Ex-JDub Mum: https://youtu.be/MQ_BErybbdM\n\nLew Night: https://youtu.be/HMPNYFtdjQw\n\nChessa Manion: https://youtu.be/_5j4rFQFSwY\n\nMentally Diseased: https://youtu.be/YoZg781tGvM\n\nFair Use Note: All statements made in this video are only my personal opinion as a former member of the Jehovah\u0027s Witness religion. The Watchtower videos featured in this video are being used legally for criticism, education, public awareness, transparency and commentary, and is protected by the Fair Use Law Act: Section 107 of the USC: https://www.copyright.gov/legislation/dmca.pdf",
      "release": "2020-03-04T23:56:19Z",
      "duration": "00:20:46",
      "explicit": false,
      "youTubeId": "smsFJdInh5o",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=smsFJdInh5o"
      }
    },
    {
      "id": "14a74b24-55d2-4784-b46f-59347688aa44",
      "title": "Ex-Jehovah’s Witness Elder explaining why my family and I left the Watchtower Organization",
      "description": "I’m Matt. A former Jehovah’s Witness Elder, Regular Pioneer, Service Overseer, Convention Speaker, Convention Department Overseer, etc. \n\nI list all of those JW titles not to brag, but to emphasize that I did plenty for the WT organization and I have specific, first-hand knowledge of how it generally works on a local, circuit and convention level. \n\nBut even after working toward all of those goals, my family and I decided to leave the organization. I had specific doubts, that when I finally investigated them, proved what I had feared...I wasn’t in “The Truth”.\n\nMy four big issues that lead me personally (seperate from my wife’s doubts and issues with JW’s) to leave were:\n\n1. No longer believing in a “holy spirit”, or that it guides the organization. Based on personal experiences, the stories and experiences of others, and general critical thinking.\n\n2. The systemic child sexual abuse in the organization, and the impotent response and safeguards of the organization to prevent it. Along with the refusal at times to work with authorities, and the refusal to submit the information gathered on the pedophiles in the organization.\n\n3. The rampant sexism and misogyny in the bible and in the organization.\n\n4. The scientific inaccuracies in the bible. Chief among them, the fallacy of humans only existing for a little over 6,000 years. \n\nMy goal is not to bash rank \u0026 file JW’s, nor to bash Christians or those who are Theists in general. I’m just here to tell my story and give my personal thoughts. I hope that those who are active Jehovah’s Witnesses, and those who formerly considered me a friend when I was in the organization view this video, and do so with an open mind and an open heart. \n\nBut I truly want to be a voice for those who maybe are also ex-witnesses, or those who might be PIMO (physically in, mentally out), and want to hear about someone else who had doubts, and realized that they weren’t part of an honest organization.\n\nPlease, do not fear the men making decisions for the Watchtower Organization. They have no proof, and cannot prove they have any divine insight. So I recommend strongly that you do unbiased and objective research on the Jehovah’s Witness religion. Do not be afraid to read or view information outside of their tyrannical hold. Free your mind, and search for real truths, ones that can be proven and stand up to scrutiny.\n\nThank you for taking the time to watch.",
      "release": "2019-06-11T01:35:29Z",
      "duration": "01:09:45",
      "explicit": false,
      "youTubeId": "kIMnSGywJTA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kIMnSGywJTA"
      }
    }
  ]
}