{
  "id": "d27038ab-6a77-4e92-9a4f-e97a567ecab9",
  "name": "The Truman Charities Podcast",
  "spotifyId": "6tYmvYVvFm9mVn1EHxI0ml",
  "appleId": 1562691717,
  "episodes": [
    {
      "id": "fce30919-34a4-4bbc-a3c6-46b6173de13a",
      "title": "From Cult Survivor to Yale Graduate and Loving Father of Three | Peter Gronvall\u0027s Story Ep 144",
      "description": "Re-airing our most downloaded episode from our Vanishing Father\u0027s Series “To be a father was my way of breaking a cycle and starting over.” In this one sentence, today’s guest, Peter Gronvall, insightfully reflects on his journey to fatherhood after growing up in a cult. - During his conversation with host Jamie Truman, Peter discusses his experience living in two distinct worlds: One world where he and his eight siblings were subjected to severe emotional and physical abuse, and another where he was a dedicated student and spent time with friends. He shares how he and his siblings persevered through these painful years, and the impact on his relationship with his parents. - Remarkably, Peter didn’t let his experience derail his aspirations. He earned a full scholarship to college and then got accepted into Yale Law School, all the while being a source of support to his siblings. Most importantly, he became the type of father he always wanted: nurturing, empathetic, and protective. - Tune in to learn more about Peter Gronvall and how he survived growing up in a cult. - Purchase Vanishing Fathers 100% of the proceeds go to charity that help at-risk youths Connect with Jamie at Truman Charities: Facebook Instagram LinkedIn Website YouTube Email: info@trumancharities.com This episode was post produced by Podcast Boutique https://podcastboutique.com/",
      "release": "2025-06-26T19:00:00Z",
      "duration": "00:46:00.2800000",
      "explicit": false,
      "spotifyId": "6Qg4wWcwpOjuV1p1ptuEPq",
      "appleId": 1000714704474,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Qg4wWcwpOjuV1p1ptuEPq",
        "apple": "https://podcasts.apple.com/podcast/from-cult-survivor-to-yale-graduate-and-loving-father/id1562691717?i=1000714704474"
      }
    }
  ]
}