{
  "id": "895359e2-e859-46aa-9c6a-568d8bbc301d",
  "name": "The Only One In The Room",
  "spotifyId": "6K9QFgphKG9KhM025HyCam",
  "appleId": 1457399201,
  "episodes": [
    {
      "id": "86dd53fb-2090-46de-ab1d-3401c660233b",
      "title": "Ronit Plank is The Only One Talking About Growing Up In A Kibbutz",
      "description": "Ronit Plank is a Seattle-based Author, Podcaster, and Storyteller. Her work has been published in The New York Times, The Atlantic, The Washington Post, and more. Her podcast Let’s Talk Memoir is available wherever you listen to podcasts. And her book When She Comes Back, about her mother abandoning her to follow a cult in India, is available on Amazon. She makes ser second appearance on The Only One In The Room for this week’s show. Laura and Ronit talk a bit about meeting each other, Ronit’s podcast, and niche podcast communities. Ronit then shares her childhood, growing up on a Kibbutz in Israel and working the fields alongside other children and adults. Ronit recalls her initial thoughts when the October 7th attack happened, and goes on to distinguish the difference between Hamas and Palestinians, as well as the misinformation that comes with labels. After questioning where the hatred of Jewish people come from, Ronit talks about the role that they, and her father, played in the civil rights movement. Ronit and Laura finish the show with a discussion about the possibility of a ceasefire in Gaza, as well as the oppressed vs oppressor narrative that drives many peoples opinions today. You can listen to Ronit’s original appearance on the show from 2021 here: https://podcasts.apple.com/us/podcast/ronit-plank-is-the-only-one-whose-mother-left-her-for/id1457399201?i=1000549632557 For more on Ronit: Email_ ronit@ronitplank.com Website_www.ronitplank.com IG: @ronitplank FB: @ronitplank Twittwer/X: @ronitplank BOOK: When She Comes Back PODCAST: Let’s Talk Memoir Visit our website: https://theonlyonepod.com/ for full interviews, videos, event dates, articles and more. Follow the show on all social media channels: @TheOnlyOneInTheRoom Become a Patreon member for exclusive content, including additional episodes every month, as well as behind the scenes podcast footage. https://www.patreon.com/theonlyonepodcast And send us your questions so we can answer them on the show: TheOnlyOnePod@Gmail.com Become a supporter of this podcast: https://www.spreaker.com/podcast/the-only-one-in-the-room--6052418/support .",
      "release": "2024-02-20T08:05:02Z",
      "duration": "00:56:03.5020000",
      "explicit": false,
      "spotifyId": "1NKihSQY1K2NLRfRwgErdW",
      "appleId": 1000645969603,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1NKihSQY1K2NLRfRwgErdW",
        "apple": "https://podcasts.apple.com/podcast/ronit-plank-is-the-only-one-talking-about-growing-up/id1457399201?i=1000645969603"
      }
    }
  ]
}