{
  "id": "9cd58029-f283-4593-82e8-8771b5e69c77",
  "name": "The McMasters’ Chronicles",
  "youTubeChannelId": "UC-Mh54QdIgA_5jRXLsULOhQ",
  "episodes": [
    {
      "id": "8082626c-2cd9-4dab-baca-4af3e5d79716",
      "title": "Part 2: The Truth About Leaving- How Our Pastors (Cult Leaders) Responded to Being Confronted",
      "description": "We continue our discussion on how it feels impossible to leave abusive churches/cult-like organizations. We tell how we knew it was time to go, and how we left. We also discuss how the \u0022pastor\u0027s\u0022 responded to that. \n\nShare your story in the comments below! \nSubscribe for more conversations on faith, healing, and breaking free from religious control. \n\n#spiritualabuse #narcissisticabuse #boundedchoice #religiousabuse #faithjourney #faithoverfear #trapped",
      "release": "2025-11-03T01:01:13Z",
      "duration": "00:17:07",
      "explicit": false,
      "youTubeId": "sngsCNElyyY",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sngsCNElyyY"
      }
    },
    {
      "id": "98ccd834-6f39-4409-b24c-ee5ad0b33ca6",
      "title": "Part 1: The Truth About Leaving a Controlling and Abusive Church (Cult)",
      "description": "We didn’t stay because we wanted to — we stayed because we felt like we couldn’t leave. We stayed because we knew we wouldn\u0027t be able to talk with people we knew our whole lives. We stayed because leaving felt like we were betraying God and leaving his will for our lives. \n\nIn this episode of the McMasters Chronicles, we share our real story of spiritual abuse, control, and fear inside a toxic church environment. We talk about how manipulation and guilt made leaving feel impossible. \n\nIf you’ve ever felt trapped in a controlling church or pressured to stay silent, you’re not alone. There’s hope, healing, and truth waiting for you.\n\n💬 Share your story in the comments below \n🔔 Subscribe for more conversations on faith, healing, and breaking free from religious control.\n\n#spiritualabuse  #narcissisticabuse #cultsurvivor #religiousabuse #faithjourney #horror #scary #trapped",
      "release": "2025-10-30T00:01:30Z",
      "duration": "00:28:29",
      "explicit": false,
      "youTubeId": "usBz0N3qoNg",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=usBz0N3qoNg"
      }
    },
    {
      "id": "49ce1eca-617f-48ef-acd9-02d5ad679dd0",
      "title": "🚩11 Warning Signs That Your Church May Be Toxic🚩",
      "description": "Are you seeing red flags in your church? \n\nIn this video we share warning signs that may indicate a church is spiritually abusive or controlling. These are patterns we personally experienced- and now we want to help others recognize the same signs before they cause deeper harm. \n\nWe talk honestly about manipulation, fear-based leadership, and how love and obedience can be twisted to control people. Our goal is to bring clarity, hope, and freedom to those who have felt trapped, confused or silenced in unhealthy religious environments. \n\n#redflags #relationshipredflags #religioustrauma #spiritualabuse #coercivecontrol #cultsurvivor",
      "release": "2025-10-26T23:30:05Z",
      "duration": "00:35:54",
      "explicit": false,
      "youTubeId": "L8ZIm5ZV22w",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L8ZIm5ZV22w"
      }
    },
    {
      "id": "8a05e453-64a8-4ddb-9a10-57ce33eb05cf",
      "title": "Part 2: Our Honest Account of Spiritually Abusive Sunday Services",
      "description": "In this episode of the McMasters\u0027 Chronicles, we open up about the pressures we faced during our former \u0022church\u0027s\u0022 services- the expectations, the fear, the constant criticism and the leaderships demands for us to follow their distorted rules. We talk honestly about how spiritual abuse can disguise itself as \u0022obedience\u0022 or \u0022worship.\u0022 All of these demands were given in the context of this is what God required from us. We believe these situations occurred because it was what the abusive leadership needed to pressure us with in order for them to maintain their control over the congregation. These conditions kept us afraid, ashamed, worried of our standing before God, and vulnerable to the financial demands that often followed the services. \n\nWhile we remembered several stories, it is impossible to recount the numerous times and situations these tactics were use against the congregation in our former church (cult).\n\n#cultsurvivor #spiritualabuse #faithoverfear #faithjourney #coercivecontrol #abusesurvivors",
      "release": "2025-10-23T00:00:52Z",
      "duration": "00:34:27",
      "explicit": false,
      "youTubeId": "jxYruZU_cpw",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jxYruZU_cpw"
      }
    },
    {
      "id": "cabc8ce3-f829-4e9e-8a37-55ecd671c979",
      "title": "Part 1: Our Honest Account of Spiritually Abusive Wednesday Night Prayer Meetings",
      "description": "In this episode of the McMasters\u0027 Chronicles, we open up about the pressures we faced during our former \u0022church\u0027s\u0022 services- the expectations, the fear, the constant criticism and the leaderships demands for us to follow their distorted rules. We talk honestly about how spiritual abuse can disguise itself as \u0022obedience\u0022 or \u0022worship.\u0022 All of these demands were given in the context of this is what God required from us. We believe these situations occurred because it was what the leadership needed to pressure us with in order for them to maintain their control over the congregation. These conditions kept us afraid, ashamed, worried of our standing before God, and vulnerable to the financial demands that often followed the services. \n\nWhile we remembered several stories, it is impossible to recount the numerous times and situations these tactics were use against the congregation in our former church (cult).\n\n#cultsurvivor #narcissisticabuse #spiritualabuse #coercivecontrol #abusesurvivors #faithoverfear",
      "release": "2025-10-20T02:16:45Z",
      "duration": "00:19:09",
      "explicit": false,
      "youTubeId": "tbreh5lEOks",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tbreh5lEOks"
      }
    },
    {
      "id": "09ee365a-b13f-4235-928e-f16c799072de",
      "title": "Exposing the Cycle of Coercion and Control in Our Former \u0022Church\u0022",
      "description": "In this episode of The McMasters\u0027 Chronicles we ask a simple but powerful question- Why is there always a \u0022need?\u0022 In our former church there was always a great degree of financial need even with all the tithes coming into the ministry.\n\nWe share our personal experience in a ministry that consistently demanded more- more time, more sacrifice- all under the banner of these WORKS being a requirement to be closer with God and the leadership. While they would speak on Ephesians and the efficacy of grace, their actions were very different from their occasional expositions. What you did for THEM, was of the utmost importance. Not serving them would lead to messages, sermons, verbal assaults, and public shaming in person, by phone, or by message apps. \n\n#spiritualabuse #churchhurt #narcissisticabuse #financialabuse #narcissisticabuseawareness #cultsurvivor",
      "release": "2025-10-08T21:30:03Z",
      "duration": "00:20:52",
      "explicit": false,
      "youTubeId": "5t_4BPaIPzw",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5t_4BPaIPzw"
      }
    },
    {
      "id": "cdd87e6d-0e94-432f-ad65-70dbce2edbcf",
      "title": "The Need: How Our Church Used Spiritual Abuse for Financial Gain",
      "description": "In our former \u0022church\u0022 we were required to give above the regular 10% of tithes. While we tried to tell the leaders that we could not always make this quota, they did not accept this and said that we could \u0022not muzzle the ox\u0022 and the pastors couldn\u0027t go without a paycheck. \n\n#coercivecontrol #cultsurvivor #narcissisticabuse #churchabuse #financialabuse #spiritualabuse",
      "release": "2025-10-05T18:30:40Z",
      "duration": "00:20:21",
      "explicit": false,
      "youTubeId": "Vu9ZDDrr9A8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Vu9ZDDrr9A8"
      }
    },
    {
      "id": "da82b9c4-c2cc-47f4-b08d-2148d80a4f48",
      "title": "How Toxic Churches Weaponize Communication",
      "description": "Jonathan and I discuss how the leaders of our former \u0022church\u0022 would require  detailed communication in services and over message boards and relate it to our spiritual standing before Christ. Using the backdrop of scripture, they would highlight how the Bible encourages communication, and thus use this to demand personal details and daily communication. What was communicated  would include, intimate, personal and private information that would not normally be required in healthy churches and relationships. \u0022Not communicating\u0022 or \u0022silence\u0022 became the ultimate \u0022sin\u0022 and at any moment you could be accused of this. Not communicating \u0022enough\u0022 meant that you were lesser and flawed. On occasion one of the leaders would post the Simon and Garfunkel song, The Sound of Silence, to scold members publicly for not communicating. \n\n#cult #emotionalabuse #cultsurvivor #spiritualabuse #churchtrauma #spiritualmanipulation #thesoundofsilence #narcissisticabuse #narcissisticabuseawareness #narcissisticabuserecovery",
      "release": "2025-10-01T22:07:56Z",
      "duration": "00:22:49",
      "explicit": false,
      "youTubeId": "FFUdZ0udfi8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FFUdZ0udfi8"
      }
    },
    {
      "id": "d336610b-eeeb-46ec-8e22-ee2d3315d3f1",
      "title": "This Story was Used to Scare Us Into Not Questioning Authority",
      "description": "In this video we discuss how yet another biblical passage was used by our former \u0022church\u0022 to cause fear and gain control over the congregation. The \u0022preaching\u0022 on specific passage made the congregants feel like they could not question or criticize leadership under penalty of spiritual or physical harm. \n\n#spiritualabuseawareness #narcissisticabuse #cultsurvivor #coercivecontrol #religioustrauma #elisha",
      "release": "2025-09-24T22:04:00Z",
      "duration": "00:17:38",
      "explicit": false,
      "youTubeId": "kjPPSGjcv-s",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kjPPSGjcv-s"
      }
    },
    {
      "id": "7a9389b4-afc4-4ca1-8d35-a3ef481a5ab9",
      "title": "The Story of Korah: Misused Scripture, Control and Fear",
      "description": "In this video we detail how this biblical passage is used by the leaders of our former church/cult to intimidate the congregation and deter them from speaking up about abuses and injustices that go on. \n\n#spiritualabuse #faithoverfear #narcissisticabuse #bible #cultsurvivor #numbers16 #churchaccountability #faithjourney",
      "release": "2025-09-21T22:00:51Z",
      "duration": "00:17:39",
      "explicit": false,
      "youTubeId": "dZ_d4KW3tq0",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dZ_d4KW3tq0"
      }
    },
    {
      "id": "32c151b6-bd40-4a44-94a7-183847e213a6",
      "title": "The Shocking Way our Former Church used Ananias \u0026 Sapphira",
      "description": "We discuss how the story of Ananias and Sapphira was told by our former \u0022pastors\u0022 in order to manipulate the congregation into giving everything they had. The twisting of this Biblical passage was used to perpetuate financial abuse, create fear and spur financial giving. \n\n#financialabuse #coercivecontrol #spiritualabuse #churchhurt #narcissisticabuse #jesuslovesyou #jesussaves #cultsurvivor #churchabuse #church #ananias\u0026sapphira #acts5",
      "release": "2025-09-17T18:24:50Z",
      "duration": "00:15:10",
      "explicit": false,
      "youTubeId": "1DNy0s7KA9g",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1DNy0s7KA9g"
      }
    },
    {
      "id": "d45d0024-645b-4add-b654-e975d0bef38a",
      "title": "How our Former \u0022Church\u0022 used Matthew 18 to Avoid Accountability",
      "description": "In this video we describe how our former \u0022pastors\u0022 twisted the Matthew 18 passage to avoid accountability. This twisting of scripture specifically was and is currently being used to keep people in their congregation who love God and who want to address problems in a \u0022godly\u0022 manner. They skillfully avoid accountability by finding fault in how problems are brought up. We use examples from our leaving story to show how we tried to follow Matthew 18. Jonathan first went to the pastors prior to leaving and then we went to the church by putting a letter on the church door. However, no matter what we did, we would have always been considered wrong because the sin of our \u0022pastor\u0022 wasn\u0027t the issue, it was the fact that we were questioning their \u0022God-given authority.\u0022\n\n#church #cultsurvivor #spiritualabuse #narcissisticabuse #bible #jesuslovesyou #jesussaves #narcissisticabuseawareness #churchhurt #churches #churchabuse #matthew18",
      "release": "2025-09-14T18:00:54Z",
      "duration": "00:13:57",
      "explicit": false,
      "youTubeId": "yM4UFmAnuDM",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yM4UFmAnuDM"
      }
    },
    {
      "id": "d795bdec-ece3-4c47-ac94-115e26685d6e",
      "title": "DARVO",
      "description": "In this new series, Our Abusive \u0022Pastor\u0027s\u0022 Playbook, we outline different tacts that our former church used to confuse and manipulate the congregation. These tactics made it difficult to leave the group. Today we talk about DARVO, which stands for deny, attack/accuse, reverse the victim and offender. \n\n#narcissisticabuse #cultsurvivor #churchhurt #spiritualabuse #coercivecontrol #jesuslovesyou #jesussaves",
      "release": "2025-09-10T18:00:00Z",
      "duration": "00:17:07",
      "explicit": false,
      "youTubeId": "05sYRAUKbKM",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=05sYRAUKbKM"
      }
    },
    {
      "id": "ded706a0-ba3e-402c-ac42-03c35db0845c",
      "title": "Freedom and Betrayal: The Cost of Leaving an Abusive \u0022Church\u0022",
      "description": "We discuss the pain of dealing with someone leaving the group and the emotional, and verbal abuse that came from our former \u0022church\u0022 leaders toward us to further isolate us from the people that left. We also discuss the difficulties of leaving our former \u0022church\u0022 and not being able to speak with our lifelong friends. We talk about how leaving is difficult, but it is possible. Talking with former friends or outside counselors can help you identify toxic patterns in your relationships. \n\n#religion #christianity #spiritualabuse #narcissisticabuse #narcissist #narcissisticabuseawareness #recovery",
      "release": "2025-08-31T23:39:46Z",
      "duration": "00:31:01",
      "explicit": false,
      "youTubeId": "OZa7SpgJ8ZI",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OZa7SpgJ8ZI"
      }
    },
    {
      "id": "30985bbd-9132-4fbc-9d1f-eabbd56349d1",
      "title": "Forced Labor Disguised as \u0022Unity\u0022",
      "description": "We talk about how owning a business in our former \u0022church\u0022 meant that the \u0022pastor\u0022 could interfere at whim in the day to day running of the business. Our emotional and spiritual wellbeing would be tied to the success of the business and providing. Others who didn\u0027t own businesses were expected to work at the business to help bring in funds for the church. \n\n#exploitation #cultsurvivor #narcissisticabuseawareness #spiritualabuse #financialabuse #narcissisticabuse #coercivecontrol #religion",
      "release": "2025-08-28T22:00:22Z",
      "duration": "00:20:34",
      "explicit": false,
      "youTubeId": "K8z52xRDFVY",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K8z52xRDFVY"
      }
    },
    {
      "id": "e1161171-1986-46cc-a8eb-abf23f73c438",
      "title": "The Love Bombing Week",
      "description": "Our \u0022Church\u0022 called us Ahab and Jezebel in order to spiritually manipulate us after we left. \n\n#narcissisticabuse #spiritualabuse #cultsurvivor #",
      "release": "2025-08-18T00:14:23Z",
      "duration": "00:24:53",
      "explicit": false,
      "youTubeId": "8QmKGzP-dAQ",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8QmKGzP-dAQ"
      }
    },
    {
      "id": "468f77ce-0129-4213-928f-c61548a6a702",
      "title": "Leaving for good!",
      "description": "After receiving the shocking text message from an elder pastor, we are reeling. While we were on the trip, we come to terms with the fact that we cannot continue in this \u0022church.\u0022 We mourn the loss of friendships because we knew that we would not be able to speak with our friends again or relate with them in the same way. Jonathan mourns the relationships he thought he had with the leaders. Jonathan wanted to make sure that he was leaving in the right way- although this was not possible in this organization. We leave our trip to Tennessee early to head back and attend the Sunday night service for the last time. The elder pastor spent the entire sermon criticizing us going on the trip and then doubles down on the sentiments expressed in the heinous text message. \n\n#churchabuse #cultsurvivor #cultabuse #narcissisticabuse #spiritualabuse #coercivecontrol",
      "release": "2025-08-11T22:54:05Z",
      "duration": "00:34:48",
      "explicit": false,
      "youTubeId": "f-0MaAeg6kA",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f-0MaAeg6kA"
      }
    },
    {
      "id": "8634712f-cd10-4b40-a6c2-92730e2761ee",
      "title": "August 7, 2024: Realizing Things Will Never Change",
      "description": "This Wednesday Jonathan met with the lead \u0022pastor\u0022 to address the mistreatments and issues that were going on. He was gaslit and made to feel like he was the one with the issues and sinning. While Jonathan started to believe them he was realizing that they were never going to address their misdeeds or change. \n\n#abusesurvivors #spiritualabuse #narcissisticabuse #cultsurvivor #cultabuse",
      "release": "2025-08-06T16:48:48Z",
      "duration": "00:14:31",
      "explicit": false,
      "youTubeId": "0fPvD_3S_i4",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0fPvD_3S_i4"
      }
    },
    {
      "id": "1bfea7a6-dcec-4c4a-ba57-f4e4c6ecd740",
      "title": "July 24, 2024 - The Beginning of Our Exit: Leaving An Abusive \u0022Church\u0022 Part 2",
      "description": "A year ago, on July 24th, 2024 Jonathan began to realize that the pastors and friends that he had for his whole life were abusive to him. While being confronted in front of the whole church, shamed, damned and criticized loudly, was not a new occurrence in this organization, Jonathan\u0027s willingness to accept this abuse was waning. We remember this defining moment when he decided not to receive the abuse any longer. This day was the first in an 18 day assault on our lives and our position before God. #abusesurvivors #cultsurvivor #spiritualabuse #McMastersChronicles",
      "release": "2025-07-26T16:09:28Z",
      "duration": "00:12:32",
      "explicit": false,
      "youTubeId": "qTOCkAv15m4",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qTOCkAv15m4"
      }
    },
    {
      "id": "6d683637-b1d4-478a-95d8-c7543e0505e8",
      "title": "July 24, 2024 - The Beginning of Our Exit: Leaving An Abusive \u0022Church\u0022 Part 1",
      "description": "A year ago, on July 24th, 2024 Jonathan began to realize that the pastors and friends that he had for his whole life were abusive to him. While being confronted in front of the whole church, shamed, damned and criticized loudly, was not a new occurrence in this organization, Jonathan\u0027s willingness to accept this abuse was waning. We remember this defining moment when he decided not to receive the abuse any longer. This day was the first in an 18 day assault on our lives and our position before God. #abusesurvivors #cultsurvivor #spiritualabuse #McMastersChronicles\n\nLink for Part 2: https://youtu.be/qTOCkAv15m4",
      "release": "2025-07-26T16:08:14Z",
      "duration": "00:13:19",
      "explicit": false,
      "youTubeId": "-1KK6w23Uyg",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-1KK6w23Uyg"
      }
    }
  ]
}