{
  "id": "046e3394-9f63-4c74-83cf-4df8a834b808",
  "name": "The Unconventional Therapists\u0027 Guide to Nothing",
  "spotifyId": "5PmGjhtysOp0dijmG7QG3s",
  "appleId": 1617369619,
  "episodes": [
    {
      "id": "dbcb1326-e51f-4b9f-a9c2-982dd32d6035",
      "title": "Guide to Charles Mansion and the Manson Family",
      "description": "Send us a Text Message. Would you be surprised to know that the man synonymous with the most abhorrent murders didn’t participate in the actual execution of the crimes? Join Dave and Greg as they discuss the infamous Charles Manson, his brush with fame, and his horrific cult influence. The Animal Turn Animals are increasingly at the forefront of research questions – Not as shadows to... Listen on: Apple Podcasts Spotify Support the Show. Follow The Unconventional Therapist’s Guide to Nothing on social media: Instagram: @unconventionaltherapistsguidetonothing Twitter: @UTGN_Podcast Intro and Outro music by 13th Ward Social Club Follow on Instagram at @13thwardsocialclub and visit https://www.13thwardsocialclub.com/",
      "release": "2024-08-20T08:00:00Z",
      "duration": "01:07:37.7560000",
      "explicit": true,
      "spotifyId": "2M8K41wBZaP0n7RGyG6UNI",
      "appleId": 1000665977229,
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2M8K41wBZaP0n7RGyG6UNI",
        "apple": "https://podcasts.apple.com/podcast/guide-to-charles-mansion-and-the-manson-family/id1617369619?i=1000665977229"
      }
    },
    {
      "id": "865968b7-6d00-4c0a-9d48-fea0de22a408",
      "title": "Guide to Warren Jeffs and the Fundamentalist Church of Jesus Christ of Latter-Day Saints (FLDS)",
      "description": "The Church of Jesus Christ of Latter-day Saints decided they would move on from the practice of polygamy in the early 20th century. Not all members agreed which caused a fracture where some practitioners wanted to follow more fundamentalists teaching. The FLDS was born and created fertile ground for Warren Jeffs to plant his evil seeds. Join Dave and Greg as they discuss polygamy, Warren Jeffs, and the FLDS as the dangerous cult that it is. This show is sponsored by BetterHelp . Give online therapy a try by going to betterhelp.com/NOTHING and get 10% off your first month. BetterHelp Disclaimer: This post contains affiliate links. If you make a purchase, I may receive a commission at no extra cost to you. Support the show Follow The Unconventional Therapist’s Guide to Nothing on social media: Instagram: @unconventionaltherapistsguidetonothing Twitter: @UTGN_Podcast Intro and Outro music by 13th Ward Social Club Follow on Instagram at @13thwardsocialclub and visit https://www.13thwardsocialclub.com/",
      "release": "2024-03-26T08:00:00Z",
      "duration": "01:02:57.8280000",
      "explicit": true,
      "spotifyId": "38Vec0aPOz4YFGrIKPtUPN",
      "appleId": 1000650465449,
      "subjects": [
        "FLDS Church",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38Vec0aPOz4YFGrIKPtUPN",
        "apple": "https://podcasts.apple.com/podcast/guide-to-warren-jeffs-and-the-fundamentalist-church/id1617369619?i=1000650465449"
      }
    }
  ]
}