{
  "_ts": 0,
  "id": "8bb89b69-68f5-48d6-9019-c549260ccb71",
  "name": "The World Of Crime",
  "youTubeChannelId": "UCCQckHVgiG1tG6--4UFN7kw",
  "episodes": [
    {
      "id": "877c33c1-d6eb-409d-800d-875fdb7e587d",
      "title": "SUMMER \u002769: Inside the Hippy Cult of Chaos - The Manson CULT AND MURDERS | FULL CRIME DOCUMENTARY",
      "description": "Charles Manson and his infamous \u0027hippy killers\u0027 shattered the illusion of peace and love in 1960s California. Leading the Manson Family cult, Manson manipulated his followers—who seemed to embody the free-spirited, anti-establishment ideals of the hippy era—into committing brutal, senseless murders. In the summer of 1969, this so-called family turned on Hollywood’s elite, culminating in the tragic killing of actress Sharon Tate, who was 8 months pregnant, and others in a spree that would haunt the nation. Discover how a twisted vision turned a hippy dream into a nightmare that forever scarred American history.\n\nStars: Glen Lloyd\nDirector: Remone Jones\nWriter: Remone Jones\n\nWelcome to The World of Crime®, the ultimate YouTube channel for true crime enthusiasts! Immerse yourself in hours of gripping stories from around the globe, featuring notorious serial killers, murderers, kidnappers, con artists, and bank robbers. Explore famous cases like O.J. Simpson, Jack the Ripper, Jeffrey Dahmer, Charles Manson, and many more. Our channel also offers a wide selection of true crime films to keep you on the edge of your seat.\n\nSubscribe today for free to  @TheWorldOfCrimeYT and hit the notification bell to stay updated on our latest releases. Don\u0027t miss out on the most intriguing and chilling true crime content!\n\n#truecrime #crimestory #charlesmanson",
      "release": "2024-11-29T10:01:07Z",
      "duration": "00:46:05",
      "explicit": false,
      "youTubeId": "xLuX1IrZAr8",
      "subjects": [
        "Manson Family",
        "Family Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xLuX1IrZAr8"
      }
    }
  ]
}