{
  "id": "49768c7b-aafd-4d81-bcbb-016f022ce9d1",
  "name": "Them Before Us",
  "spotifyId": "6NOF7bYlZgPmHl6Dcyn2kL",
  "appleId": 1694596050,
  "youTubeChannelId": "UC1wfboQ31vt4NvfM4iYWKZA",
  "episodes": [
    {
      "id": "23804410-2731-437d-9233-5b307a3fe27d",
      "title": "Them Before Us #84 | From a Cult to Caring about Children\u0027s Rights in Spain",
      "description": "Jenn chats with a new connection from Spain, Rosana Montes, whose unique story has led her to caring for children and equipping adults in Spain with a restored understanding of the importance of marriage and family. If you have any connections in Spain, email us@thembeforeus.com so we can connect you. Let\u0027s get Them Before Us in Spain!\n\n------\n\u0022My name is Rosana, and I hold an Associate Degree in Childcare and am currently completing a Bachelor\u0027s Degree in Social Education at the Universitat Rovira i Virgili (URV). I work with children who experience learning disorders and language development challenges, helping them build confidence, communication skills, and meaningful connections.\n\nCurrently, I’m involved in two projects that reflect my passion for emotional and social development in youth. At La Casa Colibrí, I co-lead a program aimed at children and teenagers, where we use artistic expression as a tool for emotional learning and self-awareness. In parallel, I’m engaged in a collaborative initiative with parents, fostering a shared responsibility in addressing the complex challenges that young people face in today’s society.\n\nMy interests center around emotional education, inclusive pedagogy, and community-based approaches to youth development. I\u0027m especially passionate about using creativity as a bridge for connection and healing, and about building spaces where children and families feel empowered, seen, and supported.\u0022\n\n#thembeforeus #katyfaust #TBUSpain #parenting #marriage #divorce",
      "release": "2025-06-27T05:51:25Z",
      "duration": "00:25:58",
      "explicit": false,
      "spotifyId": "2gnY0Q4eAZuDCQ4k1xfIwD",
      "appleId": 1000714803074,
      "youTubeId": "gzIRT5Bg_Xw",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2gnY0Q4eAZuDCQ4k1xfIwD",
        "apple": "https://podcasts.apple.com/podcast/them-before-us-84-from-a-cult-to-caring-about/id1694596050?i=1000714803074",
        "youtube": "https://www.youtube.com/watch?v=gzIRT5Bg_Xw"
      }
    }
  ]
}