{
  "id": "218e90f0-0e85-4df2-94b7-ad13f3848e16",
  "name": "Theophilus Most Excellent",
  "youTubeChannelId": "UClh6ABQPVkU3N1fD7jb_6yA",
  "episodes": [
    {
      "id": "56539545-3424-48c7-b90a-54bc326a8862",
      "title": "Jehovah\u0027s Witness Catch-22",
      "description": "Jehovah\u0027s Witness Catch-22 - In this short video I discuss a catch-22 argument from the New World Translation that one can use to prove Jesus is God to the Jehovah\u0027s Witness that they encounter. The argument revolves around Revelation 22:13 and its speaker claiming to be both the Alpha \u0026 Omega, as well as the First \u0026 the Last.\n\nLink to my new channel \u0027Christian Video Vault\u0027:\nhttps://www.youtube.com/channel/UCtBvO5YdROe5CWU41KVde4Q\n\nMy playlist \u0027Proving Jesus Is God\u0027:\nhttps://www.youtube.com/playlist?list=PL0ZaautnfUXNqSSbt9EVp8amjR8xVP6v4\n\nAs a side note, I encourage my Christian brothers who are interested to examine my Playlists section here on YouTube:\n\nhttps://www.youtube.com/channel/UClh6ABQPVkU3N1fD7jb_6yA/playlists\n\nI have put together a lot of good material for the believing Christian, esp. the newborn Christian, categorizing it all the best I could. There is quite a lot of good material available, ranging from apologetics, which is reasons for faith and answers to difficulties regarding faith, to Biblical teaching, to in-depth examinations of various other worldviews, as well as videos exposing satanic teachings/teachers, occultism, New World Order/Illuminati type things and many many others.\n\nI hope the video edifies and builds up the Church of Christ. If you liked the material, feel free to subscribe to my channel for similar material in the future. I love all of you very much and I hope you\u0027re blessed in the Lord.\n\nGodspeed,\nTheophilus",
      "release": "2018-04-21T16:30:01Z",
      "duration": "00:07:01",
      "explicit": false,
      "youTubeId": "9vf23OdCqpM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9vf23OdCqpM"
      }
    }
  ]
}