{
  "id": "9c5c39ca-f0ab-4c1b-af9f-7bfb4bf0fdcb",
  "name": "The Religion and Ethics Report",
  "appleId": 499968301,
  "episodes": [
    {
      "id": "edefe305-d014-4a25-b457-30bdc573fb13",
      "title": "An investigation into the Toowoomba cult called The Saints",
      "description": "In February this year 14 members of Toowoomba-based religious sect the Saints were sentenced to prison in the Queensland supreme court.\nThey group, including her parents, were found guilty of manslaughter over the death of 8 year old Elizabeth Struh\u0027s 2022 death by diabetic ketoacidosis.\nIn a confronting documentary for ABC TV\u0027s Compass, award-winning journalist Suzanne Smith enters the world of the religious cult the Saints and talks to their families and former cult members.\nSuzanne brings The Religion and Ethics Report exclusive access to audio of police interviews and conversations with some of the young girl\u0027s relatives.\nThe program \u0022The Cult of the Saints\u0022 will air on ABC TV and be available here on ABC iView",
      "release": "2025-08-06T07:30:00Z",
      "duration": "00:13:24",
      "explicit": false,
      "appleId": 1000720860315,
      "subjects": [
        "The Saints"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/an-investigation-into-the-toowoomba-cult-called-the-saints/id500606381?i=1000720860315"
      }
    },
    {
      "id": "ffa979b5-bd7b-4d1e-9037-f983cd8e1ebc",
      "title": "South Korean cults, and the hero chaplain at Gallipoli",
      "description": "South Korea is one of the great success stories of the past 30 years, moving from military dictatorship to a strong democracy and economy. Last year, it weathered a serious test when the former president tried to declare martial law. He’s since been removed. But South Korea’s also the home of a thriving number of troubling religious cults – some of them exported to Australia. Professor Tark Ji-il of Busan Presbyterian University understands this threat better than most. Not only is he a world-renowned expert, his family’s been affected in a tragic way. He was in Australia recently, sharing his story.\nThe heroic image of the Anzac at Gallipoli is of the young man, with rifle and bayonet, going over the top of the trenches to face a hail of bullets from the Turkish troops. While that was, indeed, true, there was another hero at Gallipoli, and he carried only a shovel and a Bible. William ‘Mac’ McKenzie was a beloved Salvation Army chaplain. In his day, he ranked alongside our most famous soldiers and politicians. He’s the subject of a new biography, The Man the Anzacs Revered, by author Daniel Reynaud. \nGUESTS:\nProfessor Tark Ji-il - Busan Presbyterian University - a respected expert on South Korea\u0027s religious movements.Daniel Reynaud - author of The Man the Anzacs Revered",
      "release": "2025-07-23T07:30:00Z",
      "duration": "00:36:51",
      "explicit": false,
      "appleId": 1000718577942,
      "subjects": [
        "Shincheonji Church of Jesus",
        "World Mission Society Church of God",
        "Unification Church",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Political Cult"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/south-korean-cults-and-the-hero-chaplain-at-gallipoli/id500606381?i=1000718577942"
      }
    },
    {
      "id": "25c0159c-4623-42b5-a644-cf077b6a356b",
      "title": "The stand-off between a cult and the FBI that gripped America",
      "description": "The 51-day stand-off between the FBI and the Branch Davidians cult that came to a fiery end.",
      "release": "2025-01-01T05:00:00Z",
      "duration": "00:28:37",
      "explicit": false,
      "appleId": 1000682293822,
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/the-stand-off-between-a-cult-and-the-fbi-that-gripped-america/id499968301?i=1000682293822"
      }
    },
    {
      "id": "b1add3c8-adbf-4b28-ba5e-cadba4cc7a6b",
      "title": "The FBI and cult stand-off that gripped America",
      "description": "The 51 day stand-off between the FBI and the Branch Davidians cult that came to a fiery end.",
      "release": "2024-06-19T06:00:00Z",
      "duration": "00:28:49",
      "explicit": false,
      "appleId": 1000659492126,
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/the-fbi-and-cult-stand-off-that-gripped-america/id499968301?i=1000659492126"
      }
    }
  ]
}