{
  "_ts": 0,
  "id": "f357b2db-b63a-4467-88f6-8b499c2cd852",
  "name": "Therapists IRL",
  "spotifyId": "4m9A1N7UXpOkNGY69ZIEcM",
  "appleId": 1724524981,
  "episodes": [
    {
      "id": "92726461-9433-4d8e-ac5c-bf0a72fa6862",
      "title": "Episode 13: For Good or for Evil - The Powerful Intersection of Religion, Shame, Hope, Belonging, \u0026 Trauma",
      "description": "POV: A 16 year girl plants a purity flag with her dad under the shadow of The Washington Monument, proclaiming her chastity alongside hundreds of other teenage girls, under the watchful eye of the Evangelical Christian Nation. Welcome to Episode 13 of Therapists IRL, where Jen and Steph discuss the impact of religion on mental health. Join us as Steph shares a little more of her story growing up in the 90s US Purity Culture, her brush with involvement in a pseudo-cult in college, and reclamation of her identity apart from internalized shame-based messages and the impact of toxic religion. Resources: 90s Fundamentalist Christian Church Survivor Comedian: Www.instagram.com/kevinjamesthornton (*The below resources are through a faith lens. This is by no means an exhaustive list - just what was mentioned in the podcast. Please reach out if you would like other resources for recovery from religious trauma.) \u0022Unraveling the Source of our Sexual Shame: Jay Stringer Deconstructs Purity Culture\u0022 Podcast with Jen Hatmaker https://jenhatmaker.com/podcasts/series-45/unraveling-the-source-of-our-sexual-shame-jay-stringer-deconstructs-purity-culture/ Book: \u0022Unwanted: How our Sexual brokenness Reveals our Way to Healing\u0022 by Jay Stringer \u0022Pure\u0022 - Linda Kay Klein (autobiography) \u0022The Cross in the Closet\u0022 - Timothy Kurek Therapists IRL Contact info: Please reach out with comments, questions, feedback, and/or to be featured on the show! www.instagram.com/therapistsirl TherapistsIRL@gmail.com No therapists were harmed in the making of this episode, but vulnerability hangovers are real. Please note: While our podcast aims to destigmatize and normalize mental health issues, increase awareness, foster understanding, and offer support with love and laughter, we are not a substitute for professional mental health advice or treatment. [Read our full disclaimer here.] If you\u0027re struggling, we encourage you to reach out to a licensed therapist, counselor, or healthcare provider. If you are in crisis, please contact your local emergency services or a mental health crisis hotline. In the U.S., dial 9-8-8 for immediate services. Remember, your mental health matters, and seeking professional help is a sign of strength. We\u0027re here to share stories, insights, and a bit of humor, but your well-being is our top priority. With care, Jen and Steph",
      "release": "2024-04-03T08:00:00Z",
      "duration": "01:23:52.5680000",
      "explicit": true,
      "spotifyId": "4DdpBmJ8uvdiesgFQ40Vjz",
      "appleId": 1000651282547,
      "subjects": [
        "Evangelicalism",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4DdpBmJ8uvdiesgFQ40Vjz",
        "apple": "https://podcasts.apple.com/podcast/episode-13-for-good-or-for-evil-the-powerful/id1724524981?i=1000651282547"
      }
    }
  ]
}