{
  "_ts": 0,
  "id": "fc2f9f48-a58b-4742-92ae-0ff9f3705073",
  "name": "Thinking 2 Think",
  "spotifyId": "6KfIrgV7IUsjmUJ8UJAIJq",
  "appleId": 1531984919,
  "episodes": [
    {
      "id": "0d72ef1f-4c43-4854-bb92-e3da2d42cdc3",
      "title": "Are You Thinking or Just Obeying?",
      "description": "Send us a text We dig into the psychology of blind obedience, exploring how the findings from Milgram\u0027s famous shock experiment continue to echo powerfully in today\u0027s world from cults to pandemic responses and political tribalism. • The Milgram experiment revealed 65% of participants would deliver maximum \u0022shocks\u0022 when instructed by an authority figure • Three key conditions facilitate obedience: legitimate-seeming authority, diffused responsibility, and gradual escalation • The \u0022agentic state\u0022 allows people to transfer responsibility to authority figures and bypass their own moral judgment • Cult dynamics weaponize the same psychological principles found in Milgram\u0027s experiment • During the pandemic, social pressure and fear of being labeled \u0022anti-science\u0022 discouraged questioning of changing directives • Political tribalism mirrors cult psychology with blind loyalty, moral framing, and punishment of dissenters • The Dunning-Kruger effect combines with obedience to create people who are confidently wrong yet resistant to correction • Critical thinking and self-awareness are the antidotes to blind obedience • We should reframe dissent as a form of care rather than rebellion or betrayal • Understanding these psychological mechanisms gives us power to consciously choose whether to be influenced by them Keep thinking to think and practicing conscious, critical engagement with the authorities in your life. Support the show \u0026#x1f3a7; Don\u0027t forget to like, share, and subscribe to join our growing community of thoughtful individuals! \u0026#x1f517; Follow us: \u0026#x1f4d6; Check out my book: The Logical Mind: Learn Critical Thinking to Make Better Decisions: https://theintellectuallibrary.com/ https://a.co/d/jdOm9pI https://shop.ingramspark.com/b/084?uZBbvqij7WRGoezaZG6c6L5tcjbl9VZB2vE9UAB9j2b \u0026#x1f4f2; Let’s connect on social media! https://x.com/Thinking_2Think",
      "release": "2025-07-07T11:00:00Z",
      "duration": "00:18:34.8270000",
      "explicit": false,
      "spotifyId": "1aSPjxH90Gsu5XEsveGl95",
      "appleId": 1000716168475,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1aSPjxH90Gsu5XEsveGl95",
        "apple": "https://podcasts.apple.com/podcast/are-you-thinking-or-just-obeying/id1531984919?i=1000716168475"
      }
    }
  ]
}