{
  "id": "1d1dcdf8-988d-4010-a36b-ac9d01ae95c3",
  "name": "This Is Rad!",
  "spotifyId": "62LLfHA0sgrxyDn6CGy39O",
  "appleId": 900721560,
  "episodes": [
    {
      "id": "88716117-2173-47a1-a646-097015242400",
      "title": "Escaping Cults",
      "description": "This week the boys are joined by comedian Uriah Wesman (@uriahjokes) for his incredible story of escaping from not one, not two, but THREE cults. And he\u0027s made a one man show about it. Uriah has a great sense of humor and some inedible insights. Plus, we debate if gmail is rad... Uriah\u0027s one man show “Three Cults Walk into a Bar” premieres May 11th at the Lyric Hyperion in Los Angeles. Tickets: https://www.eventbrite.com/e/three-cults-walk-into-a-bar-tickets-726865222447 Weekly Rads: Kyle – Problemista (movie) Matthew – RX Bandits playing The Resignation live for 20th anniversary (live) seeing a band that means a lot to you (concept) Uriah – Stop Motion (movie) Check out Burnside playing video games at https://www.twitch.tv/stayindoorsburnside Get Kyle Clark\u0027s I\u0027m a Person: Director\u0027s Cut. You can go to www.kyleclarkcomed.bandcamp.com and pay what you want for the full uncut set from “I\u0027m a Person” which includes 20 mins of unheard material, plus an additional 15 minutes of never released bonus live recordings! Send Us Stuff! We have a PO Box! This Is Rad! / Kyle Clark PO Box #198 2470 Stearns St Simi Valley, CA 93063 Tales from an Analog Future Get it HERE: https://gumroad.com/analogfuturecomic Get Kyle\u0027s album \u0022Absolute Terror\u0022 here: https://smarturl.it/absoluteterro r Go to www.Patreon.com/thisisrad and subscribe to send in questions for our Listener Questions episodes, to get exclusive bonus episodes, extra content, and access to the This Is Rad Discord server! Check out our merch! Also! Check out merch for Kyle\u0027s record label Radland Records https://www.teepublic.com/t-shirt/4109261-radland-logo Also! Laura started an online store for her art! Go buy all of her stuff!!! https://www.teepublic.com/stores/lmknight?utm_campaign=8178\u0026utm_medium=affiliate\u0026utm_source=lmknight Follow us on social media or whatever! Instagram: @thisisradpodcast @kyleclarkisrad @lmknightart @8armedspidey (Frank Gillen TIR\u0027s social media!) @thearcknight (techno lord Adam Cross) Twitter: @ThisIsRadPod @kyleclarkisrad @MatthewBurnside @LMKnightArt",
      "release": "2024-03-13T07:30:00Z",
      "duration": "01:37:50.5910000",
      "explicit": true,
      "spotifyId": "1J6VRhUWttgASJ8fihjqUK",
      "appleId": 1000649020418,
      "subjects": [
        "Church Universal and Triumphant",
        "The Hearts Center",
        "IDEAL Society"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1J6VRhUWttgASJ8fihjqUK",
        "apple": "https://podcasts.apple.com/podcast/escaping-cults/id900721560?i=1000649020418"
      }
    }
  ]
}