{
  "id": "261a546b-3018-463c-bf11-940ea212c352",
  "name": "This Fire",
  "spotifyId": "4bLGHbld1WM4Rjk6oDYMWe",
  "appleId": 1674312712,
  "episodes": [
    {
      "id": "44c73132-68cc-42ad-97bb-ac979187dadf",
      "title": "Ep29: Skateboarding for Jesus! - Finding Your Place in God\u0027s Body (3/1989)",
      "description": "Hey bruh, it’s time to get radical for Christ, as This Fire looks at the March 1989 episode of Fire By Nite - “Finding Your Place In God”.\n\nWe got skateboarding for Jesus. Stand-up comedy for Jesus. Going to 3rd world countries for Jesus. Anything you want? We got it. Anything you wanna do? Do it. (Editors Note: As long as its for Jesus.)\n\nEveryone’s got a role to play in the body of Christ, what appendage will you be?",
      "release": "2025-11-21T05:59:13Z",
      "duration": "02:00:54",
      "explicit": false,
      "spotifyId": "7FeRa4vg9b9A5UrP6QHHe2",
      "appleId": 1000737733285,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7FeRa4vg9b9A5UrP6QHHe2",
        "apple": "https://podcasts.apple.com/podcast/ep29-skateboarding-for-jesus-finding-your-place-in/id1674312712?i=1000737733285"
      }
    },
    {
      "id": "ebfd9551-a89f-4e6c-85e1-a633b1ef7fef",
      "title": "Book Burning: Michelle Remembers - The Finale (Satan Arrives!)",
      "description": "When we tell you this episode has everything, trust we mean EVERYTHING. Jesus, Satan, a French speaking Mother Mary, a man and a woman using allegations of ritual abuse to mask the fact that they’re clearly having an affair.\n \nThat’s right! This week we get back to the root of our evil, and FINALLY polish off seminal Satanic Panic tome: Michelle Remembers, on this extra special SUPER-SIZED episode of This Fire!\n \nCONTENT WARNING: This episode contains descriptions of child abuse, sexual assault, murder, and (supposed) Satanic ritual abuse. Listener discretion is advised.",
      "release": "2025-11-01T04:33:40Z",
      "duration": "02:45:27",
      "explicit": false,
      "spotifyId": "5ghQCAKxPB0Y91JytGMRRA",
      "appleId": 1000734571182,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ghQCAKxPB0Y91JytGMRRA",
        "apple": "https://podcasts.apple.com/podcast/book-burning-michelle-remembers-the-finale-satan-arrives/id1674312712?i=1000734571182"
      }
    },
    {
      "id": "8ada066a-d38b-4f48-b752-cba51ff2b922",
      "title": "Oprah\u0027s 1989 Satanic Dismemberment Special",
      "description": "Picture this. It’s 4pm, on a sleepy May 1989 afternoon. You just got home from school, you want to settle in for some Duck Tales, but your mom flips the channel for her daily dose of The Oprah Winfrey Show. Only on this episode, Oprah’s not talking to the celebrity of the day about their new movie, or to some self help guru turned author. Nope, today she’s detailing grizzly murders, baby sacrifice, generational Satanists, and the psychologists just trying to make sense of it all. That’s right, today on This Fire we take a look back at Oprah’s May 1st 1989 episode, where everyone’s mom’s favorite day time talk show host cribs directly from Fire By Nite’s homework and “exposes” Satanic ritual sacrifice happening from sea to shining sea, and maybe even in your own backyard!",
      "release": "2025-10-16T20:32:38Z",
      "duration": "01:24:12.8160000",
      "explicit": false,
      "spotifyId": "5P6me62bQ3hYF7o1ioEFF3",
      "appleId": 1000732198433,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5P6me62bQ3hYF7o1ioEFF3",
        "apple": "https://podcasts.apple.com/podcast/oprahs-1989-satanic-dismemberment-special/id1674312712?i=1000732198433"
      }
    },
    {
      "id": "ff2cccd5-c31b-433a-bc6e-0f6dcf4ce0cb",
      "title": "Ep28: Why Feel Guilty? (2/1989)",
      "description": "SHAME! SHAME! SHAME!! Its time to learn the RIGHT and WRONG way to beat yourself up, as this month we take a look at the February 1989 episode of Fire By Nite: “Why Feel Guilt?” Youth groups often get accused of breaking kids down, demolishing their self esteem, so that they can be built back up in the image of God (or…maybe just the image of whichever church they were at’s youth pastor). But here, Blaine and crew let us know that it’s not all self flagellation and internalized hatred. Sometimes kids? Things aren’t your fault…except when they are…but sometimes they aren’t! I dunno, it’s all a bit murky. At least we’ve got the dulcet tones of CCM rocker girl Margaret Becker to look forward to! ——— This Fire is taking an in depth look at Fire By Nite - a Christian teen variety show produced at the height of the 1980s Satanic Panic. Subscribe NOW wherever you find your podcasts, or at AcquireThisFire.com",
      "release": "2025-10-06T06:55:16Z",
      "duration": "01:56:46.7520000",
      "explicit": false,
      "spotifyId": "31Wjn0gFJUJs5ybVGzfdiq",
      "appleId": 1000730369122,
      "urls": {
        "spotify": "https://open.spotify.com/episode/31Wjn0gFJUJs5ybVGzfdiq",
        "apple": "https://podcasts.apple.com/podcast/ep28-why-feel-guilty-2-1989/id1674312712?i=1000730369122"
      }
    },
    {
      "id": "48eed491-620b-4e7b-98e8-fd5b839e743f",
      "title": "Interview w/ Chris Theis",
      "description": "This week, we’ve officially stared into Fire By Nite long so long, that Fire By Nite has started to stare BACK, as we welcome to the show Clarence Stanley himself…the one, the only, Chris Theis!! Our conversation runs the gamut, from the origin of Fire By Nite itself, to CCM music videos shot in irradiated desert towns, to the time the FBN production crew brought a Satanic Bible to set! You DON’T wanna miss this one! ——— This Fire is taking an in depth look at Fire By Nite - a Christian teen variety show produced at the height of the 1980s Satanic Panic. Subscribe NOW wherever you find your podcasts, or at AcquireThisFire.com",
      "release": "2025-09-16T05:16:46Z",
      "duration": "01:45:36.1440000",
      "explicit": false,
      "spotifyId": "5WudIGlLvovmeEPSBNcCVU",
      "appleId": 1000727004519,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WudIGlLvovmeEPSBNcCVU",
        "apple": "https://podcasts.apple.com/podcast/interview-w-chris-theis/id1674312712?i=1000727004519"
      }
    },
    {
      "id": "a4e56e77-388d-43a6-b98b-89ce4b76fd36",
      "title": "Teen Mania...Let\u0027s Talk About It (w/ Special Guest Molly)",
      "description": "Teen Mania Ministries. From the very start it’s been a through-line of our survey of Fire By Nite, and one that will be there til the bitter end of FBN’s run in 1994. In light of a certain recent docuseries, we felt there was no better time to have our first (but certainly not last) conversation focusing on Teen Mania’s influence on the broader Gen-X/Millennial Youth Group culture; and what better place to start than with someone who back in the 1990s was a regular attendee of Acquire the Fire and Teen Mania affiliated events - our sister from another mister (and very first guest) Molly! Join us for a candid conversation about growing up, and growing out, of the evangelical world in the 90s, set against the backdrop of Ron Luce’s expanding empire of teen warriors for Christ. ——— This Fire is taking an in depth look at Fire By Nite - a Christian teen variety show produced at the height of the 1980s Satanic Panic. Subscribe NOW wherever you find your podcasts, or on AcquireThisFire.com",
      "release": "2025-08-21T15:20:57Z",
      "duration": "00:55:56.1840000",
      "explicit": false,
      "spotifyId": "2lT8sjMVj9i7zWthRbCxPM",
      "appleId": 1000722966172,
      "subjects": [
        "Teen Mania Ministries"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2lT8sjMVj9i7zWthRbCxPM",
        "apple": "https://podcasts.apple.com/podcast/teen-mania-lets-talk-about-it-w-special-guest-molly/id1674312712?i=1000722966172"
      }
    },
    {
      "id": "9e26bdc7-1654-40f0-9cae-68b869b9139b",
      "title": "Ep27: In The World, Not Of The World (1/1989)",
      "description": "This week, it’s a whole NEW YEAR as Steve and Alec take a look at the January 1989 episode of Fire By Nite, titled “In the World, Not of the World”. About 10 years before NOTW would become a clothing brand that defined fashion for a generation of adolescent believers, Blaine and crew would reveal the SHOCKING truth of our extra-terrestrial origins, letting FBN’s teen audience know that when you are a Christian, you truly are \u0027Not Of This World\u0027. You are an alien ambassador sent by President Jesus to reach out to the people of Earthrealm, and offer them eternal life. All you need to do is prepare for the return of the comet Hale-Bopp and…..wait, sorry, wrong video for that last one. PLUS, the sounds of CCM chanteuse Renee Garcia, as she debuts the video for her end times pop anthem “Jerusalem”! This Fire is taking an in depth look at Fire By Nite - a Christian teen variety show produced at the height of the 1980s Satanic Panic.",
      "release": "2025-07-28T04:37:50Z",
      "duration": "01:47:13.1510000",
      "explicit": false,
      "spotifyId": "3AotVLKa170lsLloKyzR1C",
      "appleId": 1000719449926,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3AotVLKa170lsLloKyzR1C",
        "apple": "https://podcasts.apple.com/podcast/ep27-in-the-world-not-of-the-world-1-1989/id1674312712?i=1000719449926"
      }
    },
    {
      "id": "ab2a2a53-510b-4545-b9d5-94a9832af0df",
      "title": "Quibi: How CCM Conquered the Mainstream in Summer 2025",
      "description": "We’re back with another break from our regularly scheduled programming as we take a look at the state of pop music in 2025, and how the CCM industry has struck back, influencing the very mainstream it used to so desperately ape. With the dulcet tones of KLOVE all over the Billboard Hot 100, Steve and Alec are here to make sense of it all and figure out why all of a sudden mainstream audiences are so enthusiastically embracing the not quite country, not quite hip-hop, not quite pop mélange that has become a staple of Christian contemporary music over the past decade. PLUS, we take a look back at our This Fire mixtape in progress, and compare the Fire By Nite featured CCM hits of the 80s, to what’s going on in the scene today. Which era comes out on top? You’ll have to listen and see! All this and more, on this accidentally SUPER-SIZED bonus episode of This Fire!",
      "release": "2025-07-18T07:05:44Z",
      "duration": "01:13:24.7680000",
      "explicit": false,
      "spotifyId": "7hPw2RNvzzyp6NOBx4v5M0",
      "appleId": 1000717858051,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7hPw2RNvzzyp6NOBx4v5M0",
        "apple": "https://podcasts.apple.com/podcast/quibi-how-ccm-conquered-the-mainstream-in-summer-2025/id1674312712?i=1000717858051"
      }
    },
    {
      "id": "6642e653-b06b-4c67-b23b-0db5fc257ef7",
      "title": "Ep26: Strife?! Who Needs It!! (12/1988)",
      "description": "It’s a real Family Feud on today’s episode of This Fire, as the Fox Bros. take a look at 2 chilling tales of interpersonal conflict, watching the December 1988 episode of Fire By Nite: “Strife! Who Needs It?!” It’s Family vs Family. Friend vs. Friend. The Church vs. Itself! Ever wondered why the evangelical world can be SO good at suppressing anything remotely resembling conflict in the church body, that it lets it fester until inevitably erupting into a massive scandal? Boy do we have some bible verses for YOU! All this, plus the dulcet tones of CCM soft metal band Whitecross! Also, this is apparently a Christmas episode? You don’t wanna miss this one!",
      "release": "2025-06-22T05:34:06Z",
      "duration": "02:02:03.6710000",
      "explicit": false,
      "spotifyId": "36yrlqrO5QNdFmWatU0BC0",
      "appleId": 1000714020503,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/36yrlqrO5QNdFmWatU0BC0",
        "apple": "https://podcasts.apple.com/podcast/ep26-strife-who-needs-it-12-1988/id1674312712?i=1000714020503"
      }
    },
    {
      "id": "b6a91f05-c4b8-4e9c-82ed-1d47adb7e60c",
      "title": "The 1988 Geraldo Rivera Special: Devil Worship - Exposing Satan\u0027s Underground",
      "description": "We’re channel surfing this week as we take a break from our usually scheduled programming, and find ourselves in late October of 1988, as we watch The Geraldo Rivera Special: Devil Worship - Exposing Satan’s Underground. While Fire By Nite was serving up the Satanic panic to teens already in the fold, we discover what the panic looked like to a mainstream audience, broadcast in PRIMETIME on NBC. Folks - this special was seen in the homes of over 19 million Americans when it broadcast. So if all of a sudden your otherwise secular parents took away your heavy metal music and D\u0026D monster manuals in late 1988? There’s a pretty good shot this special was the reason why!",
      "release": "2025-05-02T17:14:49Z",
      "duration": "01:33:46.0800000",
      "explicit": false,
      "spotifyId": "3b88J0SOmx3M487zTH4k8C",
      "appleId": 1000705868662,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3b88J0SOmx3M487zTH4k8C",
        "apple": "https://podcasts.apple.com/podcast/the-1988-geraldo-rivera-special-devil-worship/id1674312712?i=1000705868662"
      }
    },
    {
      "id": "ced88815-8c70-4e62-9ee1-7ec7e0f62bc4",
      "title": "Ep25: These Last Days (11/1988)",
      "description": "It’s the end of the world as we know it, and we feel......well, not great tbh……thanks for asking! This month we time travel to November of 1988, and return to the battlefield of the end times, as Blaine and crew decide to turn up the rapture anxiety dial to 11, on this very special episode of Fire By Nite - ‘These Last Days’. This episode’s got it all! DeGarmo \u0026 Key! Live (well…in 1988) updates from Israel! A wild, non-canonical installment of Family First! Hit that download button now! You never know if you’ll have the chance tomorrow…",
      "release": "2025-04-11T03:52:15Z",
      "duration": "02:38:12.3830000",
      "explicit": false,
      "spotifyId": "3BxAtfHZYqXNald88MKOfi",
      "appleId": 1000703108058,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BxAtfHZYqXNald88MKOfi",
        "apple": "https://podcasts.apple.com/podcast/ep25-these-last-days-11-1988/id1674312712?i=1000703108058"
      }
    },
    {
      "id": "d9810a56-e133-4b0d-83d1-5beb63d5ec4d",
      "title": "Paula White: Profiles in Christian Nationalism",
      "description": "On today’s episode of This Fire, we’re switching things up a bit, and profiling the blondest grifter on the block. That’s right it’s our new White House Faith Office head, Paula White! Join us as we chart Paula’s rise to political prominence. From her humble beginnings preaching out of a tent, all the way to her political zenith as a hyper-wealthy property gospel televangelist that now finds herself working out of 1600 Pennsylvania Avenue…or should we call it: The Paula White House? PLUS, learn how Paula was INSTRUMENTAL in laundering billionaire playboy Donald John Trump’s own personal brand into the Christian zeitgeist, setting the stage for the political hellscape we see before us today! All this, and we’re not even asking you to sow a financial seed in ANY amount. Aren’t we generous?",
      "release": "2025-02-28T22:52:38Z",
      "duration": "01:15:00.8400000",
      "explicit": false,
      "spotifyId": "0NvtXtm9TPEa8iSLZnlwrC",
      "appleId": 1000696888188,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NvtXtm9TPEa8iSLZnlwrC",
        "apple": "https://podcasts.apple.com/podcast/paula-white-profiles-in-christian-nationalism/id1674312712?i=1000696888188"
      }
    },
    {
      "id": "3cceaf49-3669-4135-91b5-543459a2583f",
      "title": "Ep24: The Power of Prayer (10/1988)",
      "description": "On this month’s This Fire, it’s all about putting those hands together and leaving them locked in a secure, upright position until the big man in the sky gives you what you asked for, as Steve and Alec watch the October 1988 episode of Fire By Nite - The Power of Prayer. Learn all sorts of neat tricks to maximize the effectiveness of YOUR prayers! From prayers of worship and praise, to prayers of intercession on behalf of your country, that one day enables a fascist coup that transforms the very fabric of modern society!…Sorry, we’re clearly working through some things… We PRAY, that you press play, and join us for this very special, very introspective episode of This Fire!",
      "release": "2025-02-07T06:04:26Z",
      "duration": "01:53:57.6960000",
      "explicit": false,
      "spotifyId": "2o0D5WMwoVuVdHnInFN1A9",
      "appleId": 1000689869127,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2o0D5WMwoVuVdHnInFN1A9",
        "apple": "https://podcasts.apple.com/podcast/ep24-the-power-of-prayer-10-1988/id1674312712?i=1000689869127"
      }
    },
    {
      "id": "aabba545-8f5f-48d8-81c6-ee2e6d58fac5",
      "title": "Book Burning: Turmoil in the Toybox",
      "description": "Looking for an escape from your relatives this week? Why not spend the holiday with This Fire, as Steve \u0026 Alec go on a little bit of a detour, and take an in depth look at the legendary Satanic Panic book: Turmoil in the Toybox. That’s right! It’s finally time to expose the demonic influence of He-Man, Star Wars, GI Joe, the CareBears…(wait, that can’t be right. The CareBears?), The Smurfs…ET…..ok, so they literally just hated everything going on in 1980s pop culture. Got it. So join us! On this nostalgic look back at the ruined childhoods of evangelical children in the 1980s, on this very special holiday episode of This Fire!",
      "release": "2024-12-24T04:04:00Z",
      "duration": "02:18:26.7600000",
      "explicit": false,
      "spotifyId": "6ZQipW57fvnr7xMfKeptMa",
      "appleId": 1000681511789,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ZQipW57fvnr7xMfKeptMa",
        "apple": "https://podcasts.apple.com/podcast/book-burning-turmoil-in-the-toybox/id1674312712?i=1000681511789"
      }
    },
    {
      "id": "cda0adad-a572-481a-bc64-eec1f1f224e0",
      "title": "Ep23: Are We Not All Missionaries? (9/1988)",
      "description": "Today on This Fire, it’s a road show! As the Fox Bros. take a look at the September 1988 episode of Fire By Nite, “Are We Not All Missionaries?”, coming to you LIVE from sunny Guatemala! Well…I mean, WE’RE not in Guatemala, but Blaine and crew sure are; \u0026 no impoverished neighborhood is left un-evangelized to (or un-videotaped!) as we learn how teenagers should go about expanding God’s kingdom in these last days. All that, PLUS the debut of one of the most iconic praise and worship songs of all time (not even being sarcastic here), brought to us by musical guest Rich Mullins! Does The End Times© \u0026#43; neocolonialism x CCM artists on a fact finding mission = fun and (spiritual) profit for the 80s? Find out on this very special episode of This Fire!",
      "release": "2024-11-22T06:00:59Z",
      "duration": "02:23:12.1200000",
      "explicit": false,
      "spotifyId": "1QARWSmENPwjaPRf3Cqk9U",
      "appleId": 1000677863856,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1QARWSmENPwjaPRf3Cqk9U",
        "apple": "https://podcasts.apple.com/podcast/ep23-are-we-not-all-missionaries-9-1988/id1674312712?i=1000677863856"
      }
    },
    {
      "id": "156c172b-97a8-4688-92d8-1a4d3cc84664",
      "title": "Quibi: What Now?...Evangelical Churches React to the 2024 US Election",
      "description": "Turns out nightmares really do come true! As a certain puppet of the Christian Nationalist movement heads back to the White House, in this special Election 2024 episode of This Fire. We talk about the reaction to the news from our local evangelical churches, look at some of the expected cabinet appointments, and oh! Steve has a shocking admission that you won’t want to miss. They say misery loves company, so why not sit down with the Fox Bros. and process what comes next…",
      "release": "2024-11-14T05:31:02Z",
      "duration": "00:31:35.4960000",
      "explicit": false,
      "spotifyId": "7AVP6GyvdKKF4yIOjJSO1r",
      "appleId": 1000676908522,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7AVP6GyvdKKF4yIOjJSO1r",
        "apple": "https://podcasts.apple.com/podcast/quibi-what-now-evangelical-churches-react-to-the-2024/id1674312712?i=1000676908522"
      }
    },
    {
      "id": "734e4504-2b29-4f64-b877-e5b762646ace",
      "title": "Ep22: Satanism Unmasked - Part 2 (8/1988)",
      "description": "This Fire is BACK to finish what we started, as the Fox Bros. take on Part 2 or Fire By Nite’s Satanism Unmasked special. We’re turning over ALL the Satanic cornerstones, to uncover the truth, and finally unmask Satan HIMSELF. Heavy metal music. Dungeons \u0026 Dragons. LARPers in the woods doing graffiti….you know. It’s starting to feel like these so-called Satanists might just be a bunch of misunderstood nerds, doing geek stuff? No, that can’t be it… Get ready for MAXIMUM PANIC, as Blaine and crew take us on a whirlwind tour of everything that’s fit to be scared of in the year of our Lord 1988. You don’t wanna miss this one!",
      "release": "2024-11-03T04:24:07Z",
      "duration": "02:18:07.5590000",
      "explicit": false,
      "spotifyId": "3cFSzPUSgbDPOCLKiRoLvM",
      "appleId": 1000675486651,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3cFSzPUSgbDPOCLKiRoLvM",
        "apple": "https://podcasts.apple.com/podcast/ep22-satanism-unmasked-part-2-8-1988/id1674312712?i=1000675486651"
      }
    },
    {
      "id": "c8a78f7f-1b67-47ac-b7f3-1bc4366fbe05",
      "title": "Ep21: Satanism Unmasked - Part 1 (7/1988)",
      "description": "It’s July 1988, and fear of “Satanic Ritual Abuse” is reaching fever pitch, and has broken evangelical community quarantine and into the mainstream. Talk show hosts from Oprah to Geraldo are inviting on “Former Satanists” to tell their audiences the “truth” about the “dangers” of rampant Satanism, taking over America. And against this backdrop, Blaine Bartel and crew adapt these lurid (and largely made up!) stories about abuse, murder, and animal sacrifice for their teenage audience, as Fire By Nite officially tackles the Satanic Panic of the 1980s. You’ve waited long enough, its finally time for This Fire to tackle Satanism Unmasked, part 1!",
      "release": "2024-10-19T05:46:00Z",
      "duration": "02:17:18.7910000",
      "explicit": false,
      "spotifyId": "1d4I0gwI8nt1vuikkS3K1X",
      "appleId": 1000673654801,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1d4I0gwI8nt1vuikkS3K1X",
        "apple": "https://podcasts.apple.com/podcast/ep21-satanism-unmasked-part-1-7-1988/id1674312712?i=1000673654801"
      }
    },
    {
      "id": "a54486a3-b3da-420e-9a48-3ce466371d91",
      "title": "Ep20: Discipline To Win (6/1988)",
      "description": "Are you having trouble hearing the voice of God in your life? Have you…considered that you’re just not trying hard enough, and that you lack the discipline required to carry on a quality convo with your almighty Father? That’s what we’re discussing today as Steve and Alec watch the June 1988 episode of Fire By Nite, “Discipline to Win”. We’ve got all sorts of terrific advice on how to be more disciplined in your biblical life - sometimes taking lead from the military industrial complex! And not just that! But - THE RUSSIANS ARE HERE! As newly (well, in 1988) naturalized United States citizens Nikolai and Peter tell us harrowing tales about their escape from Soviet Russia, and their new life as CCM rock stars, in their new (Liberty University christened) band Ruscha!",
      "release": "2024-10-01T03:42:57Z",
      "duration": "01:45:15.6710000",
      "explicit": false,
      "spotifyId": "5DmAOgNuXDVUkPY1cRtoDK",
      "appleId": 1000671373426,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5DmAOgNuXDVUkPY1cRtoDK",
        "apple": "https://podcasts.apple.com/podcast/ep20-discipline-to-win-6-1988/id1674312712?i=1000671373426"
      }
    },
    {
      "id": "783f651f-6280-4f37-b8a6-ce120dcdab11",
      "title": "Quibi: January 6th Part II, and the Pastors Cheering It On",
      "description": "We’re back with another quick bite, and this time we’re talking pastors (both local and national) that are determined to politicize their flocks, and quite frankly, lead the United States down the path to January 6th part deux…so you know, just some casual, fun weekend conversation. Election season is heating up, and Steve and Alec are here monitoring what’s going on in their community churches. And it. Is. Terrifying!",
      "release": "2024-09-22T05:52:26Z",
      "duration": "00:32:25.3680000",
      "explicit": false,
      "spotifyId": "2tEGH2MyhhVFWcXaQ3h1PI",
      "appleId": 1000670283492,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2tEGH2MyhhVFWcXaQ3h1PI",
        "apple": "https://podcasts.apple.com/podcast/quibi-january-6th-part-ii-and-the-pastors-cheering-it-on/id1674312712?i=1000670283492"
      }
    },
    {
      "id": "3cf5b2e8-e6f3-4a21-8ca9-5427fa59274f",
      "title": "Ep19: The Call of God (5/1988)",
      "description": "‘Our name is This Fire and we’re here to say, this eps about rap in a major way!’ That’s right! On today’s episode of This Fire, the Christian Contemporary Music world FINALLY recognizes rap and hip-hop as a cultural force that’s taking the nation’s youth by storm! It only took them until May of 1988 to do so, but hey! Better late than never we suppose. Come to see Christians learning about hip-hop in the waning days of the Reagan administration, but STAY for a very special message that will (in theory) let YOU hear God, and specifically his calling for your life. You literally can’t afford to miss this one!",
      "release": "2024-09-18T05:13:28Z",
      "duration": "02:18:48.7430000",
      "explicit": false,
      "spotifyId": "6yNT3AGO4AWa1TAL7sUW8i",
      "appleId": 1000669896270,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6yNT3AGO4AWa1TAL7sUW8i",
        "apple": "https://podcasts.apple.com/podcast/ep19-the-call-of-god-5-1988/id1674312712?i=1000669896270"
      }
    },
    {
      "id": "4c3bf225-4c7e-4ef1-af73-32aa10c5b124",
      "title": "Ep18: If God Is For You (4/1988)",
      "description": "Everyone is always looking for that sure thing. That personal victory. That dub with the immaculate vibes. Well, if you’re interested - Steve and Alec may have discovered just such a thing, as the bros. sit down and watch the April 1988 episode of Fire By Nite, titled “If God is For You (Who Can Be Against You?)”. You’ll see that with the power of God, you’ve already attained victory over any trials and tribulations that may come into your life. All you have to do is claim it!!……oh, and by the way, while you’re enjoying that tick mark in the W column…God (via Blaine and crew) do have a favor to ask...if its at all possible, do you think you could you work on convincing your representatives in Washington to push for a constitutional amendment to force prayer into public schools? It would be really cool if you did…pleeeeease? That’s right! Its The Law of Attraction meets Christian Nationalism, on this very exciting episode of THIS FIRE!",
      "release": "2024-08-29T05:22:12Z",
      "duration": "02:11:58.6800000",
      "explicit": false,
      "spotifyId": "21yYdWjHvTDE1P0Vjad38u",
      "appleId": 1000666988776,
      "urls": {
        "spotify": "https://open.spotify.com/episode/21yYdWjHvTDE1P0Vjad38u",
        "apple": "https://podcasts.apple.com/podcast/ep18-if-god-is-for-you-4-1988/id1674312712?i=1000666988776"
      }
    },
    {
      "id": "e260152b-7894-4338-8374-56b2dd328ce4",
      "title": "Summertime Special: Kingdom Bound 2024",
      "description": "On today’s episode, we take a break from our regularly scheduled programming, to bring you something a little different: Steve and Alec get out of the studio, and head down to Six Flags over Darien Lake, where they are live ON LOCATION broadcasting from Christian music festival - Kingdom Bound 2024! They take in the sights, ride some roller coasters, go to seminars, and try to get perspective into just what’s happening in the CCM world today. Does Alec (a neophyte to the evangelical world) feel like a fish out of water? Does the festival live up to Steve’s childhood nostalgia? For the answer to these questions and more, join us on this very special episode of This Fire!",
      "release": "2024-08-13T05:01:48Z",
      "duration": "01:21:04.9430000",
      "explicit": false,
      "spotifyId": "1TSkcKd6jL1zSeMrBTbz0h",
      "appleId": 1000665111323,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1TSkcKd6jL1zSeMrBTbz0h",
        "apple": "https://podcasts.apple.com/podcast/summertime-special-kingdom-bound-2024/id1674312712?i=1000665111323"
      }
    },
    {
      "id": "8a37b99d-557a-4a76-9812-fba115faff00",
      "title": "Ep17: Conquering Temptation (3/1988)",
      "description": "TEMPTATION! Ever since Eve took that first bite way back in the Garden of Eden 6000 years ago, it’s been something humanity has ceaselessly struggled with. Lucky for us, we have Blaine Bartel and Fire By Nite to give us the 411 on how to break the demonic bonds of temptation, and in just under an hour! Imagine if Eve had had a VCR/TV combo back in the garden. Could have saved us some trouble, eh? OH! And you’re not gonna wanna miss this, as Blaine starts going full televangelist, and heals his diabetic viewers of their condition! Benny Hinn would be proud! So give into YOUR temptation, and press play on this decadent, milk-chocolate covered, episode of This Fire! So good, it’s almost sinful.",
      "release": "2024-07-29T06:28:18Z",
      "duration": "02:38:38.1360000",
      "explicit": false,
      "spotifyId": "3zWzEQSxDvfY2rbZaiZ1JF",
      "appleId": 1000663649294,
      "subjects": [
        "Benny Hinn"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zWzEQSxDvfY2rbZaiZ1JF",
        "apple": "https://podcasts.apple.com/podcast/ep17-conquering-temptation-3-1988/id1674312712?i=1000663649294"
      }
    },
    {
      "id": "d55abc3a-16d2-41d4-860f-da58c0cd2195",
      "title": "Ep16: Don\u0027t Say Suicide (2/1988)",
      "description": "Content Warning: This episode contains discussion about suicide \u0026 self-harm. Listener discretion is advised. On today’s episode of This Fire, Steve and Alec tackle Fire By Nite’s first ever VERY SPECIAL episode - ‘Don’t Say Suicide’. Join us as we explore the evangelical community’s surprisingly thoughtful take on just what caused the suicide epidemic of the 1980s…..just kidding. They blame it all on rock music and secular movies. But at least we get to enjoy the dulcet tones of musical guest Rick Cua (finally!). As you can imagine, this is a heavy one. If you or anyone you care about is struggling with suicidal ideation, you can dial 988 to reach the National Suicide Lifeline for free crisis resources.",
      "release": "2024-07-07T22:05:13Z",
      "duration": "03:06:52.9200000",
      "explicit": true,
      "spotifyId": "1PJMrPWsaRy95ZZ8NTGD3U",
      "appleId": 1000661468209,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1PJMrPWsaRy95ZZ8NTGD3U",
        "apple": "https://podcasts.apple.com/podcast/ep16-dont-say-suicide-2-1988/id1674312712?i=1000661468209"
      }
    },
    {
      "id": "e8a35b85-d4de-4f17-9686-d3b0010edfdc",
      "title": "Ep15: Being Truly Committed (1/1988)",
      "description": "Hey girl (or boy). We here at This Fire just want you to know that (*bites lip*) we’re ready to finally settle down and be truly committed to you, the listener. What is it that gave us the courage to make such a grown up decision about our pod/pod-ee relationship? Why it was none other than having watched Fire By Nite’s January 1988 episode, all about ‘Being Truly Committed’. With the help of Blaine and crew we’ve gained a whole new perspective on how to demonstrate commitment. With great strategies like: Pray more. And “submit totally” to your master. And “be a prisoner of Jesus” (no really, that’s a real quote from the episode). All this hot commitment action PLUS, we review part 1 of a very special 2-part Family First where Doug’s girlfriend Cheryl finds her soul hanging. In. The. Balance. 1988 is going to be a wild year on Fire By Nite, and it starts RIGHT HERE on today’s episode of This Fire.",
      "release": "2024-06-09T03:16:33Z",
      "duration": "01:55:35.4480000",
      "explicit": false,
      "spotifyId": "3fAjJow5ljBvmggKW6avWi",
      "appleId": 1000658292451,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3fAjJow5ljBvmggKW6avWi",
        "apple": "https://podcasts.apple.com/podcast/ep15-being-truly-committed-1-1988/id1674312712?i=1000658292451"
      }
    },
    {
      "id": "31c4dd52-a360-4776-8598-691324058d4d",
      "title": "Ep14: How to Raise Your Parents (12/1987)",
      "description": "This month, we look at Fire By Nite’s guide to ‘raising’ your parents. What do you think ‘raising’ means in this context? We guarantee you didn’t guess correctly! This episode is about honoring your parents in all things, even when said parents fall...shall we say, woefully short of being worthy of said honor…its complicated, and to be honest a little depressing. But hey! We also find out the fate of one Clarence Stanley, after his brush with death in last month’s Family First segment. So there’s something to look forward to, that totally won’t disappoint literally everyone! If you’re looking for a bright spot though, we also get to experience the effervescent vocal stylings of CCM siren (and former Miss America finalist) Kim Boyce! All this and much, much, more on this super-sized, kid tested/parent approved, episode of This Fire!!",
      "release": "2024-04-30T05:01:15Z",
      "duration": "02:06:38.7110000",
      "explicit": false,
      "spotifyId": "35bL3ZB4FdoehFU0M4t7sg",
      "appleId": 1000654007194,
      "urls": {
        "spotify": "https://open.spotify.com/episode/35bL3ZB4FdoehFU0M4t7sg",
        "apple": "https://podcasts.apple.com/podcast/ep14-how-to-raise-your-parents-12-1987/id1674312712?i=1000654007194"
      }
    },
    {
      "id": "8c44d11f-c2f0-450e-8600-e586487a1213",
      "title": "Book Burning: Michelle Remembers (Part 2)",
      "description": "This week, we’re back in therapy with a 2nd round of the (fraudulent) 1980 epic ‘Michelle Remembers’! This time we learn more about the depths of depravity that incel prince of darkness Malachi is willing to stoop to. We feel the sizzle as Michelle and Dr. Lawrence’s relationship gets….cozier. AND we reveal the answer to the question that’s been on everyone’s mind: ‘What is “The Lump”?’ CONTENT WARNING: This episode contains descriptions of child abuse, sexual assault, and (supposed) Satanic ritual abuse. Listener discretion is advised.",
      "release": "2024-04-17T05:04:37Z",
      "duration": "01:45:45.8880000",
      "explicit": true,
      "spotifyId": "0zjIseBojNAzYaIx9pynBR",
      "appleId": 1000652696136,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0zjIseBojNAzYaIx9pynBR",
        "apple": "https://podcasts.apple.com/podcast/book-burning-michelle-remembers-part-2/id1674312712?i=1000652696136"
      }
    },
    {
      "id": "572b1c99-4a11-4939-a5d4-d65f38a96b4a",
      "title": "Quibi: Total Eclipse of the Herd",
      "description": "Turn around bright eyes! Its another This Fire Quibi! This time we\u0027re turning our eyes to the skies, as the impending total solar eclipse, and prophesies being fulfilled world wide, potentially herald THE END! So I guess what we\u0027re saying is that this may be our last episode? I guess if we don\u0027t see you next week, then thanks for being a listener! Oh, and this episode features some adorable red haired cows! Which I\u0027m sure won\u0027t have anything inhumane happen to them...no sir-ee-bob...",
      "release": "2024-04-06T04:21:33Z",
      "duration": "00:15:39.2630000",
      "explicit": false,
      "spotifyId": "7zSf6rkOx7qNUy3htfwlzn",
      "appleId": 1000651600844,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7zSf6rkOx7qNUy3htfwlzn",
        "apple": "https://podcasts.apple.com/podcast/quibi-total-eclipse-of-the-herd/id1674312712?i=1000651600844"
      }
    },
    {
      "id": "141e40e8-480b-4f36-96aa-e8109aead813",
      "title": "Ep13: Real Friendship (11/1987)",
      "description": "“Friends. How many of us have them? Ones we can depend on? Before we go any further, let’s be friends.” - Whodini This month, Steve and Alec take a little sociology advice from Blaine and crew, as they explore Fire By Nite’s guide to cultivating REAL Friendships. Not like those FAKE friendships that The World™ wants to sell you. Plus a special visit from musical guest, CCM guitar hero Phil Keaggy. And look, if none of that floats your boat? In this month’s episode of resident sit-com Family First, Clarence takes a bullet for HIS best friend Doug. Wild stuff! So please, be our friend, and join us for this ‘Very Special Episode’ of This Fire.",
      "release": "2024-03-30T05:52:53Z",
      "duration": "01:49:44.5430000",
      "explicit": false,
      "spotifyId": "08lLZNueMKfnLnC7Ht65Li",
      "appleId": 1000650906685,
      "urls": {
        "spotify": "https://open.spotify.com/episode/08lLZNueMKfnLnC7Ht65Li",
        "apple": "https://podcasts.apple.com/podcast/ep13-real-friendship-11-1987/id1674312712?i=1000650906685"
      }
    },
    {
      "id": "7e77d684-0c15-457d-9c36-e4f4a952dfc1",
      "title": "Ep12: Overcoming Fear (10/1987)",
      "description": "Boo! Did I get you? Because it’s time for an unseasonably spooky episode of the pod, as Steve and Alec take a deep dive into Fire By Nite’s guide to Overcoming Fear. Join us, explore the truly macabre! Such as…kids not being allowed to pray in public school…wait, that’s what this episode is about? And they use holocaust imagery to compare the plight of Christians in America to…..no, that can’t be right. I guess we’re just going to have to listen and discover the truth together. If you DARE!! MwaHaHa! (*lightningcrash*) Happy Hallelujah Night from your pals at This Fire!",
      "release": "2024-03-09T07:23:48Z",
      "duration": "02:03:55.2960000",
      "explicit": false,
      "spotifyId": "1dimxLMMjcINIyMxeVKuab",
      "appleId": 1000648564607,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dimxLMMjcINIyMxeVKuab",
        "apple": "https://podcasts.apple.com/podcast/ep12-overcoming-fear-10-1987/id1674312712?i=1000648564607"
      }
    },
    {
      "id": "ad7cd718-859f-489f-869f-e6c3462753ee",
      "title": "Book Burning: Michelle Remembers (Part 1)",
      "description": "This week, we’re turning back the clocks to November of 1980, to explore something truly scary. Nope, not the election of Ronald Reagan, its the release of foundational Satanic Panic text - ‘Michelle Remembers’! Join Steve and Alec as they take a deep dive into the controversial (and widely discredited) tome, as they plumb the depths of Michelle’s “memories”, and find out just how the lies spread about Satanic Ritual Abuse in the 1980s, are STILL hurting people today. A real uplifting one this time folks! CONTENT WARNING: This episode contains descriptions of child abuse, sexual assault, and (supposed) Satanic ritual abuse. Listener discretion is advised.",
      "release": "2024-02-16T16:27:48Z",
      "duration": "01:32:51.0480000",
      "explicit": true,
      "spotifyId": "3UdTlfLWY8SJB24GpPbbXg",
      "appleId": 1000645603555,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3UdTlfLWY8SJB24GpPbbXg",
        "apple": "https://podcasts.apple.com/podcast/book-burning-michelle-remembers-part-1/id1674312712?i=1000645603555"
      }
    },
    {
      "id": "a9009ae7-bb0d-471f-a938-afc78504e1ec",
      "title": "Ep11: Nobody\u0027s Purfekt (9/1987)",
      "description": "They say “to err is human”. But if we were made in God’s own image, does that mean he himself is prone to making mistakes? This week Steve and Alec ponder the imperfection of mankind, as they review the September 1987 (1st Anniversary!) episode of Fire By Nite, ‘Nobody’s Purfekt’. Come for the insufferable outtakes, but stay for the hard right turn into discussion of broken homes, coercive relationships, and sin. It\u0027s just a good ol\u0027 fashioned laugh riot, celebrating one full year of FBN. We\u0027ll save you a slice of cake!",
      "release": "2024-01-31T04:15:37Z",
      "duration": "02:03:09.8160000",
      "explicit": false,
      "spotifyId": "20JQ4SgS5vkK9Cf89tCsmJ",
      "appleId": 1000643610402,
      "urls": {
        "spotify": "https://open.spotify.com/episode/20JQ4SgS5vkK9Cf89tCsmJ",
        "apple": "https://podcasts.apple.com/podcast/ep11-nobodys-purfekt-9-1987/id1674312712?i=1000643610402"
      }
    },
    {
      "id": "b4a8a967-cde8-44db-8627-288fed0c482c",
      "title": "Ep10: Honesty vs. Lying (8/1987)",
      "description": "This month, we find out if honesty truly is the best policy, as Fire By Nite illustrates for us the pitfalls and perils brought on by lies and coverups. Join Steve and Alec as they discuss the wages of sin, the music of special guest Mr. Bryan Duncan, and even the communist origins of the Christian church….wait, no…that can’t be right, can it? Are WE the ones lying now? Only one way to find out for sure! Hit that play button and join us, on this very special holiday edition of This Fire!",
      "release": "2023-12-20T07:30:03Z",
      "duration": "02:13:10.5360000",
      "explicit": false,
      "spotifyId": "2tQhKMmLJKtbzwLA5aTQNr",
      "appleId": 1000639182548,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2tQhKMmLJKtbzwLA5aTQNr",
        "apple": "https://podcasts.apple.com/podcast/ep10-honesty-vs-lying-8-1987/id1674312712?i=1000639182548"
      }
    },
    {
      "id": "c428d0b9-7661-4d28-9f77-08ec6045fa20",
      "title": "Ep09: The Pursuit of Happiness (7/1987)",
      "description": "C’mon get happy! Join Steve and Alec as they learn the secret behind attaining true, actual-factual, happiness by avoiding the glitz and glamour of showbiz and focusing on what’s really important. I’m not going to mince words here folks. Without the knowledge contained within this episode of Fire By Nite, you yourself might end up a streetwalker, a drug addict, or WORSE! Someone that works in the entertainment industry. *shudder*",
      "release": "2023-11-30T06:31:33Z",
      "duration": "01:51:02.0400000",
      "explicit": false,
      "spotifyId": "4e2dQKkSydzzb6lpPuFTwe",
      "appleId": 1000637010778,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4e2dQKkSydzzb6lpPuFTwe",
        "apple": "https://podcasts.apple.com/podcast/ep09-the-pursuit-of-happiness-7-1987/id1674312712?i=1000637010778"
      }
    },
    {
      "id": "2fed944c-c454-4f2b-99af-332e7626831e",
      "title": "Ep08: Sex, Dating, \u0026 Relationships (6/1987)",
      "description": "SEX!! Now that we\u0027ve got your attention, this week\u0027s episode of This Fire is all about that which is most awkward to discuss in a church setting - \u0027Sex, Dating, \u0026 Relationships\u0027. Join Steve and Alec as they attempt to navigate the messy relationship Fire By Nite (and by proxy the evangelical church) has to that most delicate of subjects. Marvel as Blaine and crew are able to steer skit after skit into deeply homophobic territory. Recoil in horror at the transformation of resident sit-com \u0027Family First\u0027s\u0027 main character, into a chauvinist, controlling psychopath. It\u0027s everything you\u0027ve ever needed to know about sex and dating, rolled into a feature length podcast episode!",
      "release": "2023-10-16T04:35:46Z",
      "duration": "01:51:17.8800000",
      "explicit": false,
      "spotifyId": "2vHVlUzJoNtNImzYe63MFp",
      "appleId": 1000631429516,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2vHVlUzJoNtNImzYe63MFp",
        "apple": "https://podcasts.apple.com/podcast/ep08-sex-dating-relationships-6-1987/id1674312712?i=1000631429516"
      }
    },
    {
      "id": "7141d04d-3b0f-4217-bdb8-ca5430dc6ae9",
      "title": "Ep07: The Power of Faith (5/1987)",
      "description": "We’re back, and ready to PUMP. YOU. UP. With “The Power of Faith”! On today’s episode of This Fire, Steve and Alec take a look at Fire By Nite’s manual for harnessing the power of prayer for fitness and fortune. With strong enough faith, you TOO can defeat debilitating illness, have stolen property returned to you, and learn to manifest miracles with ease. We also visit with evangelical bodybuilder John Jacobs and The Power Team, as we start to slide headlong into the satanic panic proper, and learn that even with all the evil and suffering in the world, God will always be there to help you break out of a pair of handcuffs to impress an arena of slack jawed onlookers. Oh, and before we forget! Feel free to stop by our new official website acquirethisfire.com, where you can download the show and drop us a line and give us YOUR thoughts on today’s epsiode. Do you have memories of watching Fire By Nite as a kid? Did you grow up during the satanic panic? Do you have scathing criticisms of our podcast format? We would love to hear from you! #thisFire #fireByNite #rockandroll #truth #evangelical #christianity #jesus #christian #comedy #podcast #sketch #church #youthGroup #80s #90s #nostalgia #ccm #music #satanism #crunchylightbulb #bodyBuilding #powerTeam #johnJacobs",
      "release": "2023-09-30T05:48:24Z",
      "duration": "02:30:51.4310000",
      "explicit": false,
      "spotifyId": "7IlePOfJeEj2iUSb2p5RBf",
      "appleId": 1000629722126,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7IlePOfJeEj2iUSb2p5RBf",
        "apple": "https://podcasts.apple.com/podcast/ep07-the-power-of-faith-5-1987/id1674312712?i=1000629722126"
      }
    },
    {
      "id": "5452bb78-c55c-4671-81c2-c0b8c1de99a8",
      "title": "Ep06: Evangelism/Soulwinning (4/1987)",
      "description": "We. Are. Back. After a short break Alec and Steve are in the saddle once more and ready to win some souls, as Fire By Nite (and by proxy This Fire) takes a look at everyday techniques YOU can use to save your friends from an eternity of sulfur and brimstone. Plus, did we mention skiing?! Because on this week\u0027s episode the FBN crew, and special musical guest Russ Taff, take over beautiful Winter Park Colorado for Youth Express \u002787! Which absolutely, positively in no way was just an excuse to shoot at a location where Blaine could get his downhill jam on! So get your snowpants and lift ticket ready, cause we\u0027re about to save some souls - on the slopes!",
      "release": "2023-07-03T06:16:50Z",
      "duration": "01:58:49.3430000",
      "explicit": false,
      "spotifyId": "2I8H1AJiiQsqmKO8p8ozwY",
      "appleId": 1000619098109,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2I8H1AJiiQsqmKO8p8ozwY",
        "apple": "https://podcasts.apple.com/podcast/ep06-evangelism-soulwinning-4-1987/id1674312712?i=1000619098109"
      }
    },
    {
      "id": "61acf5b9-a874-4d23-889b-5a628a0a81b9",
      "title": "Ep05: The Truth About Rock and Roll (3/1987)",
      "description": "ITS ROCK ’N’ ROLL BAY-BAY! Wearing head to toe leather. Chopping out tunes on the ol’ axe. Shreddin’ hot licks trying to impress the girl working the register at the Guitar Center. For some it’s just background music, for others it’s the only way of life. But did you know that if you’re not careful, those sick solos and drum fills can take over, and lead you down a path of degeneracy and Godlessness? On today’s episode of This Fire, punk out with Steve and Alec as they trip the light fantastic and sample some of the “heaviest” Christian rock 1987 had to offer. Find out what Fire By Night had to say about the influence rock (and or) roll had over America’s youth, and stick around for the dulcet tones of one Mr. Mylon LeFevre and Broken Heart. We promise this episode does not go off the rails, and 100% guaranteed delivers the TRUTH about Rock and Roll.",
      "release": "2023-05-06T06:14:06Z",
      "duration": "01:43:46.9910000",
      "explicit": false,
      "spotifyId": "1oBHd4Op7SpWavpVqe0mP3",
      "appleId": 1000611962168,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1oBHd4Op7SpWavpVqe0mP3",
        "apple": "https://podcasts.apple.com/podcast/ep05-the-truth-about-rock-and-roll-3-1987/id1674312712?i=1000611962168"
      }
    },
    {
      "id": "e00b083b-616d-497c-8d3d-bf9ea6e45926",
      "title": "Ep04: How to Face the Future (2/1987)",
      "description": "THE END IS HERE!…..Uh, I meant NEAR. I mean, SOON right? On this super-sized episode of This Fire, Steve and and Alec examine Fire By Nite’s first crack at the end times, and discover “How to Face the Future”. It’s an episode that’s chock full of useful information: How to make sure your car doesn’t mow down pedestrians if you happen to be raptured while driving. What to do if the rapture happens and it turns out you weren’t on the guest list. Plus, discover the perfect amount of anxiety you should carry with you every day about the impending end of times. All this AND a special musical performance by CCM royalty DeGarmo \u0026 Key! Listen today, you might not have tomorrow!",
      "release": "2023-04-18T15:31:09Z",
      "duration": "02:33:49.3910000",
      "explicit": false,
      "spotifyId": "5WaC6hvA3dpAc2NouUkamD",
      "appleId": 1000609500402,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WaC6hvA3dpAc2NouUkamD",
        "apple": "https://podcasts.apple.com/podcast/ep04-how-to-face-the-future-2-1987/id1674312712?i=1000609500402"
      }
    },
    {
      "id": "1974b5d7-88ac-4a37-85ad-c42e175d2552",
      "title": "Ep03: Beating the Blues (1/1987)",
      "description": "Feeling low? Down in the dumps? Depressed? This Fire has got you covered! Join Steve and Alec as they subject themselves to episode 5 of ‘Fire By Nite’, and some of the…best…mental health advice the evangelical church of 1987 had to offer. Spoiler alert, your depression MAY be caused by direct influence from the Prince of Darkness™️ himself. Big yikes! But it’s not all bad news, we also sample the musical stylings of preeminent Christian rock band Petra, and even a music video from a little known artist, one Ms. Amy Grant. If that’s not reason to smile I don’t know what is - and remember, no matter how you’re feeling inside, you should at least try and smile. You’re prettier when you smile.",
      "release": "2023-03-26T22:38:01Z",
      "duration": "01:55:15",
      "explicit": false,
      "spotifyId": "4b333QJ99WGT68hfWja5nf",
      "appleId": 1000605988043,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4b333QJ99WGT68hfWja5nf",
        "apple": "https://podcasts.apple.com/podcast/ep03-beating-the-blues-1-1987/id1674312712?i=1000605988043"
      }
    },
    {
      "id": "9cf7da44-ab48-4acb-8a81-15711ad65505",
      "title": "Ep02: Rebellion (11/1986)",
      "description": "Them Fox boys are back with a look at Fire By Nite episode 3 (wait, isn\u0027t this supposed to be episode 2?): REBELLION! Join us as we learn that the kids aren\u0027t alright and are rebelling....against something...by doing...um, you know what? I\u0027m not exactly sure, and I\u0027m not sure the show does either. Regardless, let\u0027s hop in the wayback machine and experience the absolute pinnacle of Christian teen comedy and culture from November of 1986!",
      "release": "2023-03-11T06:14:31Z",
      "duration": "01:41:54.6710000",
      "explicit": false,
      "spotifyId": "6oEOQe7rQ4K5bpiAg4EPF9",
      "appleId": 1000603683445,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6oEOQe7rQ4K5bpiAg4EPF9",
        "apple": "https://podcasts.apple.com/podcast/ep02-rebellion-11-1986/id1674312712?i=1000603683445"
      }
    },
    {
      "id": "e0057fe7-b3f4-4729-9689-896d5cff41fe",
      "title": "Ep01: Peer Pressure (9/1986)",
      "description": "On the premiere episode of This Fire, Steve and Alec crack into a refreshing ice cold bottle of Fire By Nite, and discuss the perils of Peer Pressure. Do the violent whims of an authoritarian government count as \u0022peer\u0022 pressure? Why exactly are we talking about this almost 40 year old show aimed at Christian teens? Did Steve in fact peer pressure Alec into recording this show in the first place? All questions are answered inside!",
      "release": "2023-02-25T04:40:56Z",
      "duration": "01:19:57.7430000",
      "explicit": false,
      "spotifyId": "0hyi3TLiGyANIsyR5MSzSQ",
      "appleId": 1000601539245,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hyi3TLiGyANIsyR5MSzSQ",
        "apple": "https://podcasts.apple.com/podcast/ep01-peer-pressure-9-1986/id1674312712?i=1000601539245"
      }
    }
  ]
}