{
  "id": "d4ed8e5c-40c8-4826-ae63-2de75b501fa2",
  "name": "This Morning",
  "youTubeChannelId": "UChFsYLqPUyLiZnfRog6wiZA",
  "episodes": [
    {
      "id": "15ccd113-6c30-4a56-a4d0-4a578cd25ce4",
      "title": "\u0027We Escaped One Of The Most Shocking Cults, And It Was In This Country\u0027 | This Morning",
      "description": "For years, Hope Bastine and Verity Carter suffered in silence as they were subjected to shocking abuse while growing up in the notorious \u0027Children of God\u0027 cult. But after separately managing to escape the institution’s clutches - the British women are speaking out about their traumatic experiences, in a new five-part documentary. And today, they’re bravely joining us in the studio to share the realities of life inside the chilling cult. \nBroadcast on 25/08/21\nSubscribe now for more! http://bit.ly/1JM41yF\n\nStream This Morning live, every weekday from 10am on the ITV Hub 📲 http://daytimelink.itv.com/WatchTMYT\n\nLike, follow and subscribe to This Morning!\nWebsite: http://bit.ly/1MsreVq\nInstagram: https://www.instagram.com/thismorning\nFacebook: http://on.fb.me/1FbXnjU\nTwitter: https://twitter.com/thismorning\n\nJoin Holly Willoughby and Phillip Schofield, Alison Hammond and Dermot O\u0027Leary as we meet the people behind the stories that matter, chat to the hottest celebs and cook up a storm with your favourite chefs!\n\nDr Sara and Dr Zoe answers all your health questions, stay stylish with Gok Wan and Lisa Snowdon\u0027s fabulous fashion, be beautiful with Bryony Blake\u0027s top make-up tips, and save money with Martin Lewis.\n\nAnd did we mention we have quite a few laughs along the way too?\n\nhttp://www.itv.com\nhttp://www.stv.tv\n\n#thismorning #phillipandholly #alisonanddermot",
      "release": "2021-08-25T10:35:24Z",
      "duration": "00:11:19",
      "explicit": false,
      "youTubeId": "N8aABrjMZSs",
      "subjects": [],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=N8aABrjMZSs"
      }
    }
  ]
}