{
  "_ts": 0,
  "id": "4aff216d-cbd8-479e-96fc-98d81ab855d9",
  "name": "This Is Actually Happening",
  "spotifyId": "0TvsB5KtaRNudHGbVzVi7L",
  "appleId": 497227384,
  "episodes": [
    {
      "id": "51343387-069a-45f6-8736-91df8a3983c4",
      "title": "336: What if you escaped a polygamous cult?",
      "description": "A woman born into the notorious Mormon cult, Church of the Firstborn, grows up in constant fear of their fatal practice of “blood atonement”, but after suffering under the oppression of her husband and caretaking his multiple wives, she plots a daring international escape. Today’s episode featured Pamela Jones. If you’d like to reach out to her, you can email her at hello@pamelaspeaks.live, or you can find her on Instagram @pamela_speaks. Visit pamelaspeaks.live to find out more about her life as an author, speaker and coach. She also has another project about the hypocrisy, secrecy and scandals of the cult: wickedconfessionsuncensored.com. Producers: Whit Missildine, Andrew Waits, Aviva Lipkowitz Content/Trigger Warnings: cult, religious abuse/trauma, polygamy/plural marriage, child bride/child marriage, abuse, fraud, blood atonement/death, murder (religious \u0026 cartel), the afterlife, poverty, birth control, rape/sexual coercion, explicit language Social Media: Instagram: @actuallyhappening Twitter: @TIAHPodcast Website: thisisactuallyhappening.com Website for Andrew Waits: andrewwaits.com Website for Aviva Lipkowitz: avivalipkowitz.com Support the Show: Support The Show on Patreon: patreon.com/happening Wondery Plus: All episodes of the show prior to episode #130 are now part of the Wondery Plus premium service. To access the full catalog of episodes, and get all episodes ad free, sign up for Wondery Plus at wondery.com/plus Shop at the Store: The This Is Actually Happening online store is now officially open. Follow this link: thisisactuallyhappening.com/shop to access branded t-shirts, posters, stickers and more from the shop. Transcripts: Full transcripts of each episode are now available on the website, thisisactuallyhappening.com Intro Music: \u0022Illabye\u0022 – Tipper Music Bed: Cylinder Four Services If you or someone you know is struggling with the effects of trauma or mental illness, please refer to the following resources: National Suicide and Crisis Lifeline: Text or Call 988 National Alliance on Mental Illness: 1-800-950-6264 National Sexual Assault Hotline (RAINN): 1-800-656-HOPE (4673) See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2024-10-22T07:01:00Z",
      "duration": "01:06:14.0340000",
      "explicit": true,
      "spotifyId": "6QDlXTWIPLyozXPdTf8rGe",
      "appleId": 1000673906327,
      "youTubeId": "QpZlmvXbuJQ",
      "subjects": [
        "Church of the Firstborn (Morrisite)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6QDlXTWIPLyozXPdTf8rGe",
        "apple": "https://podcasts.apple.com/podcast/what-if-you-escaped-a-polygamous-cult/id497227384?i=1000673906327",
        "youtube": "https://www.youtube.com/watch?v=QpZlmvXbuJQ"
      }
    }
  ]
}