{
  "id": "dd085379-b756-441c-8a2f-55f75492958e",
  "name": "Times Now World",
  "youTubeChannelId": "UCw8Fc5R0Q5yyS3KrDCPM3xg",
  "episodes": [
    {
      "id": "34ff97e8-7719-4a15-a85b-6d78e2925647",
      "title": "DOJ UNDER FIRE: Epstein Survivors Slam DOJ for \u0022Betrayal\u0022 as Powerful Names Stay Redacted in Files",
      "description": "In a landmark bipartisan show of force, Jeffrey Epstein survivors joined members of Congress at the U.S. Capitol on Wednesday to demand an immediate investigation into the Department of Justice\u0027s \u0022betrayal\u0022 of victims following the botched release of the Epstein files. Standing alongside lawmakers including Rep. Pramila Jayapal and Rep. Nancy Mace, survivors condemned the DOJ for leaking their personal information and nude images while redacting the names of powerful co-conspirators. The press conference preceded a high-stakes House Judiciary Committee hearing where Attorney General Pam Bondi faced intense questioning over the department\u0027s failure to release over 3 million remaining documents. Lawmakers and advocates simultaneously unveiled \u0022Virginia’s Law,\u0022 a historic legislative push to eliminate the statute of limitations for sexual abuse, ensuring that the wealth and influence of global elites—including princes, ambassadors, and prime ministers—can no longer provide immunity from prosecution.\n\n#epsteinfiles #pambondi #epsteinsurvivors #justicedepartment #virginiaslaw #humantrafficking #nancymace #jeffreyepstein #endstatuteoflimitations #ghislainemaxwell #doj #breakingnews #survivorjustice #accountability2026 #tnworld #timesnowworld #worldnews #internationalnews #timesnews #newsworld\n\n​Subscribe now: http://bit.ly/3VHIl37\n\nTimes Now World is your definitive source for comprehensive global news and analysis.\nAt Times Now World, we bring you breaking news and real-time updates on US news, US elections, Trump, Biden, Putin, Zelensky, Russia-Ukraine war, Israel-Hamas conflict, Gaza, China-Taiwan tensions, Hungary news, NATO updates, and EU developments. Stay informed with our in-depth coverage of politics, economics, and current affairs, exclusively on Times Now World. Explore diverse perspectives and expert insights on international relations, technology, and more, all on Times Now World.\nEngage with dynamic discussions on global issues, including NATO news and EU updates, on Times Now World.\n\nFollow compelling stories and impactful reports on Times Now World. Discover the pulse of international affairs with Times Now World\u0027s extensive coverage of global events.",
      "release": "2026-02-11T22:30:00Z",
      "duration": "00:32:57",
      "explicit": false,
      "youTubeId": "xCb-fQekSnM",
      "subjects": [
        "_America",
        "Human Trafficking",
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xCb-fQekSnM"
      }
    }
  ]
}