{
  "id": "90e40f7c-b7b5-49e4-93bd-583ccff82e6f",
  "name": "Times Royals",
  "youTubeChannelId": "UCFKQzh08wOOUM8yl7JDpeyw",
  "episodes": [
    {
      "id": "bc0995e9-8bdc-42de-8b83-163b461663cc",
      "title": "‘The Royal Family Has Covered Up This Story For 15 Years’ | Andrew Lownie",
      "description": "“It’s very clear that the Royal Family has covered up the story for 15 years.”\n\nAn inquiry into how much the Royal Family knew about the nature of Andrew Mountbatten-Windsor’s history with Jeffrey Epstein would be welcome after they’ve tried to “suppress” the story, claims the author of Entitled, Andrew Lownie.\n\nA discerning look at royal life in the era of King Charles, presented by the royal editors of The Times and Sunday Times, Kate Mansey and Roya Nikkhah – two women with unmatched insight into the inner workings of the monarchy. It’s a time of challenges and change for the royal family, but also one of great hope and warmth, and a sense of the possibilities of this new Carolean age. \n\nThere are personal challenges for the royals, but new links are being forged with “kind words”, as King Charles has said, between the public and the Palace. Join Roya and Kate every week for their reactions to the latest news on Charles and Camilla, William and Kate, Harry and Meghan and more.\n\nRead the best of our journalism: https://www.thetimes.com/\nSubscribe to the Times Royals YouTube channel: https://https://www.youtube.com/@timesroyals?sub_confirmation=1\nFind us on Facebook: https://www.facebook.com/timesandsundaytimes/\nFind us on X: https://x.com/thetimes\nFind us on TikTok: https://www.tiktok.com/@thetimes?lang=en\nFind us on Instagram: https://www.instagram.com/thetimes/",
      "release": "2026-02-13T20:00:11Z",
      "duration": "00:07:46",
      "explicit": false,
      "youTubeId": "DtPKqaVeuuA",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DtPKqaVeuuA"
      }
    }
  ]
}