{
  "id": "c0eb10cf-77fc-46b4-9afd-27eb95f1f08c",
  "name": "Tin Foil Hat With Sam Tripoli",
  "spotifyId": "1ywvh6P5saIEuZAL9BqVfx",
  "appleId": 577245086,
  "episodes": [
    {
      "id": "dd513154-3743-4714-bbdc-d313a8c99c50",
      "title": "#726:  Exorcisms, Pedo Rings and Cults with Andrew Gold",
      "description": "Thank you so much for tuning in for another episode of Tin Foil Hat with Sam Tripoli.  This episode we welcome Investigative Reporter Andrew Gold to the show to discuss journey into investigating Exorcisms, Jimmy Savile, Scientology, NXIVM and at the end he drops a bomb on us about a program Germany came up with on how to fix their pedophile problem.  This was an insane episode.  Thank you so much for your support. Please support The Chaos Twins Indiegogo.  Join the Army Of Chaos:  https://www.indiegogo.com/projects/chaos-twins-1-by-sam-tripoli-paranoid-american--2/coming_soon/x/5548203    Want to see Sam Tripoli live?  Get tickets at SamTripoli.com:    Nov 17th: Headlining Vulcan with Eddie Bravo and XG In Austin https://tickets.vulcanpresents.com/e/tin-foil-11-17/tickets   Nov 18th: Tin Foil Hat Comedy Night And Swarm Tank LIve The House Of Comedy in Dallas Tx 7pm: Tin Foil Hat Comedy- https://txtickets.houseofcomedy.net/event/tin-foil-hat-comedy-night-special-presentation   9pm: Swarm Tank- https://txtickets.houseofcomedy.net/event/swarm-tank-special-presentation   Nov 24th: The Revival Live At Room 237 at The Rabbit Hole In Woodland Hills  https://therabbitholebar.com/event/room-237-3/    Dec 16th: Headlining The Post Comedy Show in El Monte, Ca  https://www.eventbrite.com/e/the-post-comedy-show-w-sam-tripoli-tickets-758061160337?aff=oddtdtcreator     Jan 25th-27th: Headlining the Comedy Vault In Batavia, Ill  https://www.comedyvaultbatavia.com/calendar?month=1\u0026year=2024     Feb 8th-10th:  The Comic Strip in Edmonton https://wem.thecomicstrip.ca     Please check out Andrew Gold\u0027s internet: Linktree: https://linktr.ee/andrewgold Youtube: https://www.youtube.com/@AndrewGold1 Podcast:  On The Edge With Andrew Gold- https://apple.co/3MNLLfR Locals: https://andrewgold.locals.com Twitter: https://twitter.com/AndrewGold_ok           Please check out SamTripoli.com for all things Sam Tripoli.     Please check out Sam Tripoli\u0027s Linktree: https://linktr.ee/samtripoli Please Follow Sam Tripoli\u0027s Comedy Instagram: https://www.instagram.com/samtripolicomedy/ Please Follow Sam Tripoli\u0027s Podcast Clip Instagram:  https://www.instagram.com/samtripolispodcastclips/   Thank you to our sponsors:    FUM: Stopping is something we all put off because it’s hard, but switching to Füm is easy, enjoyable, and even fun. Füm has served over 100,000 customers and has thousands of success stories, and there’s no reason that can’t be you. Join Füm in accelerating humanity\u0027s breakup from destructive habits by picking up the Journey Pack today. Head to TryFum.com and use code TINFOIL to save 10% off when you get the Journey pack today. That’s TRY-F-U-M.com and use code TINFOIL to save an additional 10% off your order today    CopyMyCrypto.com: The ‘Copy my Crypto’ membership site shows you the coins that the youtuber ‘James McMahon’ personally holds - and allows you to copy him. So if you’d like to join the 1300 members who copy James, then stop what you’re doing and head over to: CopyMyCrypto.com/TFH You’ll not only find proof of everything I’ve said - but my listeners get full access for just $1    Blue Chew: This episode is sponsored by BlueChew. Want to have better sex? Visit   https://go.bluechew.com/tinfoil to receive your first month FREE -- pay only $5 shipping.    Helix: The Helix lineup offers 20 unique mattresses, including the award-winning Luxe collection, the newly released Helix Elite collection, a mattress designed for big \u0026 tall sleepers, and even a mattress made just for kids! Helix is offering 20% off all mattress orders AND two free pillows for our listeners! Go to Helix Sleep dot com slash Tinfoil. This is their best offer yet and it won’t last long! With Helix, better sleep starts now.   MOOD: MOOD puts an end to guessing games. It’s 100% federally legal Delta-8 and Delta-9 THC you can have shipped straight to you. No doctors, no waiting. Just affordable, legal THC. For a limited time, Mood is giving our listeners FREE delta 9 gummies and 20% off your first order. Visit hellomood.com and use our code, TINFOIL.          MrBallen\u0027s Podcast: MrBallen (MISTER BALL-IN), one of the internet’s most popular storytellers and host of the MrBallen Podcast, turns to the human body for an all new suspense driven podcast - MRBALLEN’S MEDICAL MYSTERIES.     Every episode of MRBALLEN’S MEDICAL MYSTERIES recounts someone’s living nightmare. Follow MrBallen’s Medical Mysteries wherever you get your podcasts. Prime members can listen early and ad-free on Amazon Music.     DraftKings:  NBA fans, the wait is over! Basketball is BACK and DraftKings Sportsbook – an Official Sports Betting Partner of the NBA, is celebrating with an UNBEATABLE offer. New customers can score TWO HUNDRED DOLLARS INSTANTLY IN BONUS BETS for throwing down FIVE DOLLARS on the NBA. Win or lose–it doesn’t matter! You’ll start the season with an instant dub! Basketball’s more fun when you’re in on the action! Download the DraftKings Sportsbook app NOW and use the code TINFOIL. New customers can get TWO HUNDRED DOLLARS IN BONUS BETS INSTANTLY for betting just FIVE DOLLARS. Only on DraftKings Sportsbook with code TINFOIL. The crown is yours Gambling problem? Call 1-800-Gambler or visit w w w 1 800 gambler dot net. In New York, call 877-8-HOPENY or text HOPENY (467369). In Connecticut, Help is available for problem gambling call 888-789-7777 or visit c c p g dot org. Please play responsibly. On behalf of Boot Hill Casino \u0026 Resort (KS). 21 plus age varies by jurisdiction. Void in Ontario. See D K N G dot com slash football for eligibility, terms and responsible gaming resources. Bonus bets expire seven days after issuance. Eligibility and deposit restrictions apply.           Fum",
      "release": "2023-11-16T00:00:00",
      "duration": "01:52:55.6930000",
      "explicit": true,
      "spotifyId": "2XJHoCyH5IKuh3HOcwu8lT",
      "appleId": 1000635095616,
      "subjects": [
        "NXIVM",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2XJHoCyH5IKuh3HOcwu8lT",
        "apple": "https://podcasts.apple.com/podcast/726-exorcisms-pedo-rings-and-cults-with-andrew-gold/id577245086?i=1000635095616"
      }
    }
  ]
}