{
  "id": "0a5f5092-a589-433a-bf4c-4e638d3b9cbc",
  "name": "Tinfoil Tales",
  "spotifyId": "0ZTLJzy5q6tjEEmBYBFLDq",
  "appleId": 1643026594,
  "episodes": [
    {
      "id": "e928d061-971f-48fb-8b93-f27b3956b338",
      "title": "Ep. 58: Leaving Eden - From Cults to Russia\u0027s Drilling Mystery",
      "description": "Welcome back Foil Fanatics to another new episode of Tinfoil Tales! On this episode we are joined Gavi from Leaving Eden podcast and we talk about some of the things cults do, and some of the warning signs of cults.Leaving Eden Podcast on Apple Podcastshttps://open.spotify.com/show/6jh5cAYRXAoqBSIQ1OckG5?si=59be37e40d654535Join us in this special edition of Tinfoil Tales as Gavi, cohost of Leaving Eden Podcast, takes the spotlight. Delve into the world of cults with Gavi, who shares insights gained from discussing the experiences of his cohost, a former cult member. Learn about the signs of cults, their impact, and the captivating stories explored on Leaving Eden Podcast.Gavi also touches on an extraordinary topic—Russia\u0027s drilling expedition and the eerie sounds recorded. Could they be on the verge of uncovering the unknown, even venturing into the mysterious concept of Hell? Find out more in this eye-opening interview.Cult Insights from Leaving Eden PodcastSigns and Stories of CultsRussia\u0027s Drilling Expedition to HellUnraveling the Mystery SoundsGavi\u0027s Perspective on the Unexplained🚀 Don\u0027t miss this chance to gain unique insights into the world of cults and the uncharted territories explored by Russia. Subscribe, hit the notification bell, and embark on a journey of discovery with Tinfoil Tales!👍 If you found this interview intriguing, give it a thumbs up, share your thoughts in the comments, and subscribe for more thought-provoking content.#LeavingEdenPodcast #TinfoilTales #CultInsights #RussiaDrilling #GaviInterview #PodcastSpecial #UnexplainedSounds #PodcastDiscussion #CultStories #MysteryRevealed #TinfoilTalksTinfoil Tales Podcast - Show Notes 🎙️ Want to be a Guest? If you have a paranormal encounter, conspiracy theory, or unexplained story to share, we\u0027d love to hear from you! Reach out to us at tinfoiltalespodcast@gmail.com or use the contact button on our website. http://www.tinfoiltales.com Let\u0027s schedule you for a future episode and dive into the mysteries together! 📱 Follow Us on Social Media: Connect with us on Twitter for updates and discussions.https://www.twitter.com/tinfoiltalesStay engaged on Facebook to join the conversation. http://www.facebook.com/tinfoiltalesExplore mysterious visuals on Instagram and share your own experiences. https://www.instagram.com/tinfoiltalespodcast📺 Subscribe to our YouTube Channel: Catch video snippets, visuals, and more on our YouTube channel. Don\u0027t miss out – subscribe for intriguing content related to our episodes. https://www.youtube.com/@tinfoiltales💼 Become a Patreon Member: Join our Patreon community for exclusive benefits! For just $1.99 a month, enjoy early access to new episodes and ad-free content. Your support helps us continue exploring the unknown – become a member here. http://www.patreon.com/tinfoiltales🎶 Music Credits:All music for the podcast was written and performed by Devin Gowin. For those interested in hiring Devin, you can reach him at harmonicgray@gmail.com🚨 Disclaimer:Neither The Host (Brandon Wright) nor the podcast (Tinfoil Tales) is responsible for the views and opinions of any of the guests. Tinfoil Tales is a platform for others to share their experiences and opinions. The podcast and its host neither agree nor disagree with the views and opinions expressed by guests. All claims made by individual guests are at their own discretion and do not reflect on the overall views of the podcast or its host. We encourage listeners to do their own research and form their own opinions on the topics discussed on Tinfoil Tales. Content may be controversial or challenging, so it\u0027s important to listen critically and be aware of your own biases. If you are concerned about any content, feel free to skip ahead or stop listening altogether.📅 Copyright 2023Support this podcast at — https://redcircle.com/tinfoil-tales6786/donationsAdvertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-01-02T08:00:00Z",
      "duration": "01:16:55.3050000",
      "explicit": true,
      "spotifyId": "5joi9EQqyOy4fU2GUrXV38",
      "appleId": 1000640294157,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5joi9EQqyOy4fU2GUrXV38",
        "apple": "https://podcasts.apple.com/podcast/ep-58-leaving-eden-from-cults-to-russias-drilling-mystery/id1643026594?i=1000640294157"
      }
    }
  ]
}