{
  "_ts": 0,
  "id": "62dd8656-ac40-4ef8-bf28-9e2afcca7f4b",
  "name": "Toby Ruddy",
  "youTubeChannelId": "UCHv5cI4k1MOsm814sZtqTnQ",
  "episodes": [
    {
      "id": "37a68508-fa37-469f-a799-c37f22878f05",
      "title": "From brainwashed to what woke her up - #vishwananda #bhakti #marga #nithyananda  #cult",
      "description": "Taken from a medium article written in 2021",
      "release": "2024-05-04T22:53:49Z",
      "duration": "00:27:54",
      "explicit": false,
      "youTubeId": "I3YNqGxxll0",
      "subjects": [
        "Nithyananda",
        "Bhakti Marga"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I3YNqGxxll0"
      }
    },
    {
      "id": "c2f3bfb5-1258-46d7-b53f-9c904d94be6a",
      "title": "The coercive #rape of Miles by #vishwananda #bhakti #marga #cult. #Darshan #experiences are false.",
      "description": "This is a snippet of a documentary that was made by a German TV station about the coercive #rapes of various young men (heterosexual as well as homosexual) and also about how #Vishwananda was prosecuted for stealing relics from churches. The argument is that it is a form of #rape because they are/were brainwashed to believe that it is a blessing to submit to sex if he wishes it since Vishwananda’s followers see him as an avatar of God/ #Vishnu - a view which Vishwananda has carefully cultivated amongst his Swamis. Vishwananda’s followers treat him as all-knowing and all-powerful, as a God would be, hence giving away their own will to him. We feel it is important for this viewpoint to be presented to anyone considering joining Bhakti Marga, as it has been severely repressed so far. All people trying to speak out against Bhakti Marga have been threatened and had their videos removed from YouTube. We wish for freedom of speech and choice.\n\nVishwananda\u0027s #darshan #experiences are dangerous energy manipulations of your chakras, your will and your emotions using Hindu magick techniques. They are not blessings from God. He is an abusive and fake guru. He makes people believe he is an avatar of God and therefore always right, omniscient and never to be doubted. He makes people fear going against him. You can see how he lies and misleads by the fact that he supported and vouched for another very dangerous guru, Nithyananda, who has been shown to have abused children. You can find out about the abuse of Nithyananda by googling Sarah Landry and her \u0027Little Bit Culty\u0027 podcast. Sarah used to be his main frontwoman.",
      "release": "2023-10-12T21:31:27Z",
      "duration": "00:08:01",
      "explicit": false,
      "youTubeId": "m2WLyxjFddE",
      "subjects": [
        "Bhakti Marga"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=m2WLyxjFddE"
      }
    }
  ]
}