{
  "_ts": 0,
  "id": "8703eb51-685a-4a88-8c7a-d392fbcd0018",
  "name": "Today\u0027s Family Lawyer Podcast",
  "spotifyId": "3wBODqzpS690KlI0oGn7Zb",
  "appleId": 1650218780,
  "episodes": [
    {
      "id": "769ba155-eb30-4aa7-8ec5-3a1e9b7e849c",
      "title": "Understanding gaslighting and narcissistic behaviour",
      "description": "In this powerful episode of the Today’s Family Lawyer Podcast, host David Opie welcomes Shoba Aziz, an experienced barrister at Great James St Chambers, for an important conversation exploring the psychological dimensions of domestic abuse—specifically narcissistic behaviour and gaslighting. Drawing on over 20 years in legal practice, Shoba shares her deep expertise in private child and family law, especially in cases involving coercive control and emotional manipulation. She explains how narcissistic traits and gaslighting manifest within relationships, often leaving victims confused, isolated, and doubting their own reality. Shoba offers real-world insights from her courtroom experience, highlighting the emotional toll this abuse has on victims and the need for practitioners to spot often-subtle signs. She emphasises the importance of creating a safe space for clients, ensuring their voices are heard and their experiences are validated. The episode also explores the evolving legal landscape, with Shoba referencing landmark cases and the application of the Domestic Abuse Act 2021. She underscores the critical need for joined-up support services, wider education among professionals, and greater societal awareness. This episode is a compelling call to action, encouraging legal professionals and the wider community to better understand, identify, and support those affected by psychological abuse in the family court system. The Today\u0027s Family Lawyer podcast is available on your preferred podcast provider and at www.todaysfamilylawyer.co.uk . Subscribe to Today\u0027s Family Lawyer to receive our FREE weekly newsletter, out every Thursday and listen in to the podcast to hear all the latest news and views from across the family law sector. Thank you to our Podcast Sponsors; LexTox and VacantC Legal Recruitment.",
      "release": "2025-06-18T09:00:00Z",
      "duration": "00:28:38.5950000",
      "explicit": false,
      "spotifyId": "0pLCfXZi4PKdpTddKBchVj",
      "appleId": 1000713413500,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0pLCfXZi4PKdpTddKBchVj",
        "apple": "https://podcasts.apple.com/podcast/understanding-gaslighting-and-narcissistic-behaviour/id1650218780?i=1000713413500"
      }
    }
  ]
}