{
  "id": "c02a662a-3534-4c90-9067-d011d046bd6f",
  "name": "Top Docs:  Award-Winning Documentary Filmmakers",
  "spotifyId": "3bdiB18kdIwz11j00brnax",
  "appleId": 1584498043,
  "episodes": [
    {
      "id": "295beaf3-8a65-486b-88d5-a29caf1d819f",
      "title": "\u0022Escaping Twin Flames\u0022 with Cecilia Peck \u0026 Inbal Lessner",
      "description": "We continue our Emmy coverage with a conversation with the filmmakers behind the Netflix series, “ Escaping Twin Flames ”: director Cecilia Peck as well as executive producer and editor Inbal Lessner (both of “ Brave Miss World ,” and “ Seduced: Inside the Nexium Cult .”) Here is how Cecilia describes the series: “Escaping Twin Flames is a three part Netflix doc series investigating ‘Twin Flames Universe’, which is a purported online relationship coaching school. This series follows former members of the group and family members, and focuses on the methodology used by this group to attract and indoctrinate and then control the lives of its members. It does pay particular attention to how, under the guise of being LGBTQ-friendly, Twin Flames Universe recruited within the gay, bi, and trans communities and then forced a heteronormative ideology onto its members.” With the series nominated for Outstanding Editing, Cecilia, Inbal, and Mike dig into a sequence that leverages precisely chosen and deftly edited clips from the trove of materials from social to demonstrate exactly how the leaders of this group, Jeff and Sheliah, attracted, indoctrinated and integrated new members. They then go on to explore the ramifications that the group’s strict gender ideology has had on both the participants in the group, as well as their family members. Follow: @ceciliapeck on Instagram and twitter/X @inballessner on Instagram and @inbal_lessner on twitter/X Hidden Gems: “ Harlan County, USA ” “ Victim/Suspect ” “ Stormy ” “ Fire of Love ” The Presenting Sponsor of \u0022Top Docs\u0022 is Netflix.",
      "release": "2024-08-18T21:24:18Z",
      "duration": "00:38:48.2930000",
      "explicit": false,
      "spotifyId": "2EU6dOwwxRRAMh80QmNWBJ",
      "appleId": 1000665810285,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2EU6dOwwxRRAMh80QmNWBJ",
        "apple": "https://podcasts.apple.com/podcast/escaping-twin-flames-with-cecilia-peck-inbal-lessner/id1584498043?i=1000665810285"
      }
    }
  ]
}