{
  "_ts": 0,
  "id": "05bb8121-734c-41d1-ac10-4896042eae36",
  "name": "Top Viral Report TV ✅",
  "youTubeChannelId": "UCzZvbOF9UYUsuiNgIh-3Yzw",
  "episodes": [
    {
      "id": "2a4e14a0-f9d1-4641-abc0-436304102d60",
      "title": "Cult of MURDER in 1980s Miami - Yahweh ben Yahweh’s “Nation of Yahweh”",
      "description": "In the 1980s, Miami was not only a hotbed of cocaine cartels but also home to a quasi-religious Black supremacist cult that became a murderous criminal enterprise. Yahweh ben Yahweh (born Hulon Mitchell Jr.) founded the Nation of Yahweh in 1979 in Miami’s Liberty City, preaching a radical doctrine that he was the son of God and that whites were infidels. Behind a facade of religious charity and community improvement, Yahweh ben Yahweh’s group enforced strict discipline and espoused violence against “enemies.” He built a following of hundreds, requiring absolute loyalty—followers donned white robes and turbans, renounced their birth names for Hebrew ones, and lived communally in the “Temple of Love” compound. As the cult’s power grew, Yahweh formed a secret death squad of enforcers known as the “Brotherhood” or “Death Angels.” What followed was a reign of terror in the mid-1980s that few outsiders knew was happening. \n\n\nInstagram @topviralreporttv\nTwitter @toptrendreportv\nFacebook: Trend Johnson\n\nSUBSCRIBE ‼️‼️\n\n\n*Copyright Disclaimer* \nUnder Section 107 of the Copyright Act 1976, allowance is made for \u0022fair use\u0022 for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.",
      "release": "2025-05-01T11:07:11Z",
      "duration": "00:10:51",
      "explicit": false,
      "youTubeId": "EkZOnv9zOg4",
      "subjects": [
        "Nation of Yahweh",
        "Black Hebrew Israelites"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EkZOnv9zOg4"
      }
    }
  ]
}