{
  "id": "b9f787d8-0515-4158-ac5c-ca98b716dfd8",
  "name": "Tor\u0027s Cabinet of Curiosities",
  "youTubeChannelId": "UC8oMvYlwaS7m5VpMwOTvgzw",
  "episodes": [
    {
      "id": "80ecc6ee-93e2-4153-87b4-60333f9bb93d",
      "title": "The Anti-Sex Communist Cult Leader Who Thought The World Was Inside Out",
      "description": "Sources \u0026 further info (mostly gathered by the great Nick Miller):\n1. J. Phillip Arnold, ‘Did David Koresh Plagiarize Cyrus R. Teed,’ 102.\n2. Annual Report of the Adjutant-General of the state of New York for the Year 1903 (Albany NY: State of New York, 1904) 11, 1144.\n3. Register of Graduates, 1867-1908 (New York: Eclectic Medical College of the City of New York, 1908; John H. Francis, comp., Utica City Directory, 1869-1970 (Utica: White \u0026 Floyd, 1869) 319.\n4. Cyrus R. Teed, The Illumination of Koresh: Marvelous Experience of the Great Alchemist at Utica (New York, n.p, n.d.) 9, 13.\n5. Cyrus Teed (Koresh), “Interpretation of the Book of Revelation Part II,” The Flaming Sword, February 1923, 1–2; “Interpretation Part VIII,” The Flaming Sword, August 1923\n6. Koresh, The Cellular Cosmogony, or, the Earth, a Concave Sphere. Guiding Star Publishing House, Estero, FL.\n7. Adam Morris, ‘Perils, Gold and Yellow: Cyrus Teed’s The Great Red Dragon,’ 196-197.\n8. Richard S. Berrey, ‘The Koreshan Unity: An Economic History of a Communistic Experiment in Florida,’\n9. Koresh, Not Allow Yourselves to Be the Tools of a Plutocratic, Daily Press! The Flaming Sword 3(21): 3-4; Woman\u0027s Restoration to Her Rightful Dominion and Her Relation to Koreshanity. Guiding Star Publishing House, Estero, FL.\n10. Richard S. Berrey, ‘The Koreshan Unity: An Economic History of a Communistic Experiment in Florida,’ 64\n11. Sally L Kitch, Chaste Liberation? Celibacy and Female Cultural Status. (University of Illinois Press, Chicago, IL. 1989)\n12. Hedwig Michel, A Gift to the People, 1975, 5.\n13. Koresh, the Koreshan Unity: General Information Concerning Membership and Its Obligations. Guiding Star Publishing House, Chicago, IL\n14. Sarah A. Tarlow, ‘Representing Utopia: The Case of Cyrus Teed’s Koreshan Unity Settlement,’ 91.\n15. Mildred Fryman, National Register of Historic Places Inventory Nomination Form (Koreshan Unity Settleman Historic District). Manuscript, Florida Office of Cultural and Historical Programs, Tallahassee, 8.\n16. New York Times, August 10, 1884, 1 col. 5; Syracuse City Directory, 1884 (Syracuse NY: 1884), 371; Howard Fine notes in his review there was no listings in NYC directories from the 1880s that appear to ‘belie or confirm his residence in the city’ and ‘nor was there any record of Dr. Cyrus Teed in the physicians and surgeons records of the New York County Clerk’s Office’. Howard D. Fine, ‘The Koreshan Unity: The Chicago Years of a Utopian Community,’ 215\n17. World\u0027s College of Life, Metaphysics (Chicago, hand dated June 11, 1887), 4.\n18. Cole v. Teed, Case G. 103461, Circuit Court of Cook County\n19. Utica (N.Y.) Herald-Dispatch, Dec. 26, 1908, p. 8, col. 2; Lee County, Florida, Closed Index to Deeds, I^Z, Grantee from 1887 to July 1, 1922, p. 334.\n20. Elwin E. Damkohler, Estero, Fla., 1882: Memoirs of a First Settler (Fort Myers Beach, Fla.: Island Press, 1967), pp. 22-23\n21. Chicago Herald, April 8, 1894, p. 30, cols. 4, 1.\n22. H. K. Carroll, The Religious Forces of the United States, rev. ed. (New York: Christian Literature Co., 1896), p. 11\n23. Fort Myers Press, September 27, 1906, 4; The Pioneer University of Koreshan Universology (ca. 1904; rpt. Estero, Fla.: Koreshan University System).\n24. Lyn Rainard, \u0022Conflict Inside the Earth: The Koreshan Unity in Lee\nCounty,\u0022 Tampa Bay History 2 (Spring/Summer 1981)\n25. Elliott Mackle, \u0022Cyrus Teed and the Lee County Elections of 1906\u0022, Florida Historical Quarterly 57, 1978: 1-18.\n26. Ignatius Donnelly, Caesar’s Column: A Story of the Twentieth Century, edited by Nicholas Ruddick (Middletown, CT: Wesleyan University Press, 2003)\n27. Herald of the New Covenant (Utica, N.Y.) 1, no. 5, p. 51, Robert S. Fogarty, The Righteous Remnant: The House of David (Kent, OH: Kent\nState University Press, 1981), 138–39; \n28. Millner, “Koreshans.” Lyn Millner, \u0022The Allure of Immortality: An American Cult, a Florida Swamp, and a Renegade Prophet\u0022 (Gainesville, FL: University of Florida Press, 2019)",
      "release": "2025-05-23T11:00:10Z",
      "duration": "00:31:25",
      "explicit": false,
      "youTubeId": "6iQz3ltC8Ug",
      "subjects": [
        "Koreshanity",
        "House of David (commune)",
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6iQz3ltC8Ug"
      }
    },
    {
      "id": "58039c9e-5e80-49f5-8b19-3e680a1a8308",
      "title": "The Neo-Victorian Neo-N*zi Lesbian BDSM Cult That Made Video Games",
      "description": "It gets real in this episode.\n\nWhat other surprising side hustle should St. Bride\u0027s have gotten involved in?\nEffective altruism - https://www.patreon.com/torscabinet/membership\nOwning an NBA team - https://x.com/parsons_tor\nYIMBY activism - https://www.reddit.com/user/MrSluds/\nA bakery called \u0022St. Bread\u0027s School\u0022 - https://www.instagram.com/tor.in.oregon/\n\nOwen Williams\u0027 article on \u0022The Mystery of St. Brides\u0022: https://flexiblehead.blog/2014/02/16/st-brides-school/\n\nAn excellent BBC podcast about St. Brides: https://www.bbc.co.uk/programmes/m001dd9t\n\n\u0022Encyclopedia Aristasiana\u0022: https://web.archive.org/web/20030801100917/http://aristasia.com/glossary.html \n\n\u0022Daughters of Shining Harmony\u0022, which contrary to what I said in the video, does not seem to be online anymore:\nhttps://web.archive.org/web/20180805032309/https://www.daughtersofshiningharmony.com/introductory/ \n\nThere are a handful of Aristasia-related web pages still accessible without the Internet Archive, but beware before you do your own research - a lot of the links have been taken over by malware. Nothing super dangerous, as far as I\u0027m aware, but I still get annoying pop-ups on my laptop after doing research for this episode.",
      "release": "2024-12-05T03:39:22Z",
      "duration": "00:37:25",
      "explicit": false,
      "youTubeId": "b-i1tFWmMYg",
      "subjects": [
        "Silver Sisterhood"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=b-i1tFWmMYg"
      }
    }
  ]
}