{
  "_ts": 0,
  "id": "c99cd192-660a-49e6-8166-6575be9d2f7c",
  "name": "Touched Out!",
  "spotifyId": "0GOYtJp4sybvWfsKvvmx1o",
  "appleId": 1679800062,
  "episodes": [
    {
      "id": "a8fe758b-3e6a-4b5a-be17-79d843ab27f6",
      "title": "Faith, Fear, and Freedom | Escaping a Cult \u0026 Finding Strength",
      "description": "After escaping a controlling religious cult as a teenager, Lockie shares his journey of rebuilding his life, becoming a father to three children, and finding healing through therapy, art, and community. • Growing up in a Christ-based cult that restricted medical care, education, and social connections • Experiencing sexual abuse within the cult environment with ongoing court cases against other members • Being disowned by his parents at age 17 when he questioned his faith • Supporting himself through his final year of school while homeless and couch-surfing • Becoming a father and struggling to create healthy parenting patterns without positive models • Receiving ADHD and autism diagnoses as an adult after years of being told these conditions weren\u0027t real • Finding unexpected healing through graffiti art and the community it provided • Rebuilding a limited but meaningful relationship with his parents who remain in the cult • Using therapy to process religious trauma and break generational cycles • Balancing legal and illegal aspects of graffiti culture while finding creative expression Support the show Thanks for listening to Touched Out: A Mental Health and Parenting Support Podcast. If you enjoyed this episode, please like, subscribe, share, and leave a rating and review. Your support helps others discover their new favorite parenting and mental health podcast. Connect with Us: Drop a comment on Spotify if you have any questions or thoughts. You can also visit The Touched Out Website to leave a voice message or contact me via email. If you are interested in being a guest on Touched Out you can access the guest form HERE Get your official Touched Out! Merch HERE Donate to Touched Out! HERE Spoony App: All of the friends, None of the fear. A safe space for neurodivergent, chronically ill and disabled people to make friends and find support. Download the Spoony App HERE *This is not a paid promotion Theme music written and performed by Ben Drysdale ©2025: www.bendrysdalemusic.com",
      "release": "2025-04-09T21:00:00Z",
      "duration": "00:53:13.0510000",
      "explicit": true,
      "spotifyId": "1JIPCbLg44EINnmsDTpOVg",
      "appleId": 1000702933497,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1JIPCbLg44EINnmsDTpOVg",
        "apple": "https://podcasts.apple.com/podcast/faith-fear-and-freedom-escaping-a-cult-finding-strength/id1679800062?i=1000702933497"
      }
    }
  ]
}