{
  "id": "1e7e2547-5126-43c3-8277-9928c30978fa",
  "name": "Toxic",
  "spotifyId": "2r4rBJYl07xniILO0Kqo45",
  "appleId": 1551560627,
  "episodes": [
    {
      "id": "7657a2ba-7b27-4df1-853e-3fea7cc0eccb",
      "title": "Ep. 107: Jim Jones, Trump....It\u0027s Like All Cult Leaders Attended the Same Meeting or Something—Dr. Janja Lalich Confirms Our Suspicions",
      "description": "In the \u002770s, a charismatic minister named Jim Jones convinced thousands of followers of his Peoples Temple that he was for them, moving them from the U.S. where he was being investigated for running a cult (lol, nothing to see here) to an agricultural commune in Guyana under the auspice that he was \u0022creating a paradise free from the oppression of the U.S. government.\u0022 Oh, and also, they had to call him dad, maybe sleep with him and never, ever leave unless they wanted to be shot. But that\u0027s neither here nor there. He was FOR them, you guys. Of course, if you know anything about Jonestown, you know this didn\u0027t end well for 909 of them. You\u0027ll never believe this, but the markers of Jim Jones—a guy who loved Hitler, schmoozing with politicians and exerting power over others—have a lot of overlap with our current RPOTUS (that would be rapist president of the United States). In this episode, we welcome back—Dr. Janja Lalich, CEO of the Lalich Center on Cults and Coercion and foremost international expert on cults to answer our is-half-the-country-in-a-cult? questions. She also recommended a book that we\u0027re going to recommend to you: The Brainwashing of My Dad: How the Rise of the Right-Wing Media Changed a Father and Divided Our Nation—And How We Can Fight Back , by Jen Senko. We want to hear from you. Do you have a story we need to discuss or a guest we should feature? Visit us at ToxicThePodcast.com and share your story. If you’re experiencing abuse or domestic violence, please reach out to someone you trust. You can also connect with a trained advocate near you through DomesticShelters.org. Finally, help us keep this conversation going. Share an episode of Toxic with a friend, your gyno, or even the person next to you in line voting for Wisconsin Supreme Court candidate Susan Crawford. Follow us on your favorite podcast platform or social media, and if you’re willing, leave us a review. Your support helps us amplify these critical stories. Together, we can create change.",
      "release": "2025-04-01T12:40:00Z",
      "duration": "01:31:21.6330000",
      "explicit": true,
      "spotifyId": "0Hpyqhzvter85LUtqSdm09",
      "appleId": 1000701730088,
      "subjects": [
        "Cult-Expert",
        "Peoples Temple",
        "Qanon",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Hpyqhzvter85LUtqSdm09",
        "apple": "https://podcasts.apple.com/podcast/ep-107-jim-jones-trump-its-like-all-cult-leaders-attended/id1551560627?i=1000701730088"
      }
    },
    {
      "id": "3c3aeb72-6a34-4026-81c5-9aaa61505f94",
      "title": "Season 3! Ep. 84: Jill Duggar Wearing Pants Isn\u0027t Actually the Bravest Thing She\u0027s Done",
      "description": "Welcome to 2024 where a good number of men are still audacious beyond belief and women are still saying \u0022WTF just let me live, dammit\u0022 every five seconds. Among them, many of the daughters who grew up Duggar, as in TLC\u0027s most viewed show ever, 19 Kids and Counting Duggar. Jill released a memoir at the end of 2023, Counting the Cost, that called out everyone who was complacent in her repressed, abusive and highly controlled religious upbringing, and we are here for it. We talk Jim Bob, IBLP (Institute of Basic Life Principals) and the \u0022Shiny, Happy People\u0022 documentary. It\u0027s a lot to unpack, but stay with us because at the end we close out the episode with special guest Dr. Janja Lalich, an international authority on cults, extremism, and coercion. She offers some much-needed insight into how cults operate and advice on how to know if that new self-help support group you just joined online is actually a cult. (Heads up, MLMs can be cults, too.) Dr. Lalich can be found at janjalalich.com or lalichcenter.org.   Do you have a story you think we need to discuss or a guest we should have on? Visit us at ToxicthePodcast.com and tell us all about it.  Please help us spread this conversation further by sharing an episode of Toxic with a friend, your dentist, a random stranger in line at the grocery store, etc., by following us on your favorite podcast platform or social media, or by leaving us a review. We appreciate you. ",
      "release": "2024-01-16T12:42:00Z",
      "duration": "01:55:13.5840000",
      "explicit": true,
      "spotifyId": "2xjLDgXWFdabzD2lvlTCXM",
      "appleId": 1000641858820,
      "subjects": [
        "Institute In Basic Life Principles",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2xjLDgXWFdabzD2lvlTCXM",
        "apple": "https://podcasts.apple.com/podcast/season-3-ep-84-jill-duggar-wearing-pants-isnt-actually/id1551560627?i=1000641858820"
      }
    }
  ]
}