{
  "id": "1e7e2547-5126-43c3-8277-9928c30978fa",
  "name": "Toxic",
  "spotifyId": "2r4rBJYl07xniILO0Kqo45",
  "appleId": 1551560627,
  "episodes": [
    {
      "id": "3c3aeb72-6a34-4026-81c5-9aaa61505f94",
      "title": "Season 3! Ep. 84: Jill Duggar Wearing Pants Isn\u0027t Actually the Bravest Thing She\u0027s Done",
      "description": "Welcome to 2024 where a good number of men are still audacious beyond belief and women are still saying \u0022WTF just let me live, dammit\u0022 every five seconds. Among them, many of the daughters who grew up Duggar, as in TLC\u0027s most viewed show ever, 19 Kids and Counting Duggar. Jill released a memoir at the end of 2023, Counting the Cost, that called out everyone who was complacent in her repressed, abusive and highly controlled religious upbringing, and we are here for it. We talk Jim Bob, IBLP (Institute of Basic Life Principals) and the \u0022Shiny, Happy People\u0022 documentary. It\u0027s a lot to unpack, but stay with us because at the end we close out the episode with special guest Dr. Janja Lalich, an international authority on cults, extremism, and coercion. She offers some much-needed insight into how cults operate and advice on how to know if that new self-help support group you just joined online is actually a cult. (Heads up, MLMs can be cults, too.) Dr. Lalich can be found at janjalalich.com or lalichcenter.org.   Do you have a story you think we need to discuss or a guest we should have on? Visit us at ToxicthePodcast.com and tell us all about it.  Please help us spread this conversation further by sharing an episode of Toxic with a friend, your dentist, a random stranger in line at the grocery store, etc., by following us on your favorite podcast platform or social media, or by leaving us a review. We appreciate you. ",
      "release": "2024-01-16T12:42:00Z",
      "duration": "01:55:13.5840000",
      "explicit": true,
      "spotifyId": "2xjLDgXWFdabzD2lvlTCXM",
      "appleId": 1000641858820,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2xjLDgXWFdabzD2lvlTCXM",
        "apple": "https://podcasts.apple.com/podcast/season-3-ep-84-jill-duggar-wearing-pants-isnt-actually/id1551560627?i=1000641858820"
      }
    }
  ]
}