{
  "id": "c968db83-0fb1-444c-b7bb-c52094fd7ef9",
  "name": "Tracy Malone",
  "youTubeChannelId": "UCFtt3fhMMCBKGRMGyN2D2GQ",
  "episodes": [
    {
      "id": "098dc5f2-4198-4250-96ee-6c8b9609fed0",
      "title": "Narcissistic Abuse vs. Cult Behaviors: A Discussion with Vanessa Reiser",
      "description": "#Narcissism #NarcissistAbuse #cultbehaviors\nEver noticed the striking similarities between a narcissist and a cult behaviors? Often, narcissistic abuse is seen as a \u0022cult of one.\u0022 Join me and my special guest, Vanessa Reiser—author, entrepreneur, two-time Ironman, and psychotherapist specializing in narcissistic and cult abuse—as we dive deep into the overlap between cult behaviors and narcissistic behaviors.\n\nVanessa, who famously ran 285 miles across New York in her wedding dress to raise awareness about narcissistic abuse, shares her insights and experiences. We discuss manipulation, control, and the tactics used by both narcissists and cult leaders. Learn about the impact on victims, the importance of boundaries, and how to protect yourself and your loved ones from these toxic dynamics.\n\nVanessa Reiser is a mother, author, entrepreneur, 2X Ironman and psychotherapist licensed in New York, New Jersey, Massachusetts, and Florida, specializing in narcissistic and cult abuse. She is also the founder of Tell a Therapist, LLC and is best known for her run across the state of New York (285 miles in 11 days) in a wedding dress to raise awareness for narcissistic abuse. She also subsequently ran across NJ CT \u0026 MA. Her insights are both personal and professional, giving her a unique lens into this insidious form of domestic abuse.\n\nVisit Vanessa\u0027s website here: https://tellatherapist.net/\n\nWEBSITE - resources for victims - http://narcissistabusesupport.com\n\nSOCIAL MEDIA - https://linktr.ee/TracyAMalone\n\nBuy my book DIVORCING YOUR NARCISSIST: You Can\u0027t Make This Shit Up! - https://amzn.to/3wB1RQA\n \nRESOURCES - by state - search Free help \u0026 Meetups - https://narcissistabusesupport.com/sign-access-resources/\n \nBOUNDARIES COURSE - https://narcissistabusesupport.com/boundaries/\n\nFREE - AUDIOBOOK FROM AUDIBLE - http://www.audibletrial.com/Narcissist\n*As an Amazon Associate I earn from qualifying purchases.\n\nAre you looking for someone to talk to about the narcissist abuse you have endured?\nhttps://narcissistabusesupport.com/product-category/coaching/\n\nFACEBOOK GROUP – https://goo.gl/JoXOkD \n \nLEGAL SHIT BELOW - TO PROTECT ME FROM NARCISSISTS\nAll statements made in this video are expressions of the opinion of the speaker, and should be regarded as such.  The video is made to serve a therapeutic purpose for the speaker or speakers and to assist others in recognizing and dealing with matters in their own lives which they believe may be similar.\n \nI’m a survivor of Narcissistic abuse and my goal with this channel is to educate other “victims” as they transition to becoming a “survivor”. I believe that education is our best way to heal, and the best way to not become a victim or supply to another narcissist.\n \nPlease note: I am not a therapist, psychologist, psychiatrist or coach so use this information as my own personal journey of healing and the information that has been shared with me by friends, other YouTubers, groups and community. This video is not intended to treat or diagnose any condition, if you believe you or a loved one is suffering from narcissistic abuse please use seek any help from your community.",
      "release": "2024-07-28T12:15:04Z",
      "duration": "00:34:03",
      "explicit": false,
      "youTubeId": "zgdyXCl49PI",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zgdyXCl49PI"
      }
    }
  ]
}