{
  "_ts": 0,
  "id": "4431db09-f230-41f4-b083-5f4193e68efa",
  "name": "Transmissions From Jonestown",
  "spotifyId": "0Efev51SDjCk66zdGM2bh9",
  "appleId": 1308803723,
  "youTubeChannelId": "UCPiqN-33HLn_OPyIU9XzBDg",
  "episodes": [
    {
      "id": "a814167d-de41-4a6c-9aef-cecfa166f4ae",
      "title": "Jonestown\u0027s First Memorial: Families Grieve and Await News at the Human Freedom Center",
      "description": "The Jonestown Massacre, one of the darkest chapters in modern history, occurred on November 18, 1978, in a remote jungle settlement in Guyana. Over 900 members of the Peoples Temple, led by charismatic yet manipulative preacher Jim Jones, died in what Jones called a \u0022revolutionary suicide.\u0022 Men, women, and children consumed cyanide-laced drinks or were forcibly poisoned. The tragedy unfolded after Congressman Leo Ryan visited Jonestown to investigate claims of abuse, only to be ambushed and killed at a nearby airstrip by Temple gunmen. \n\nIn the aftermath of the Jonestown massacre, families gathered at the Human Freedom Center in Berkeley, clinging to hope and bracing for devastating news. Teresa Cobb speaks about her brother, Jim Cobb, who had journeyed to Jonestown with Congressman Leo Ryan as part of the Concerned Relatives group. Wanda Johnson Kice reflects on the early days of Peoples Temple while anxiously awaiting word on her son, Tom Kice Jr., uncertain of his fate. Unbeknownst to her, her ex-husband, Tom Kice Sr., was one of the gunmen who ambushed the Congressman.\n\nWanda and Jim Cobb Sr. are overwhelmed by fear and sorrow, grappling with the agonizing uncertainty of their children\u0027s fate. A moment of relief emerges when they learn that Jim Cobb survived the airstrip attack by hiding in a tree. Wanda\u0027s adult son Wayne Pietila was part of the Concerned Relatives group but he did not go to Jonestown, he stayed behind in Georgetown. Wanda\u0027s  younger son Tom Kice JR and his father both died in Jonestown. \n\nThe Cobb family endured unspeakable loss that day. Among those who perished were Ava Cobb and her husband John Moss Brown, along with their baby Marchelle; Darlene Ramey and her baby Mayshawn; Sandy Cobb and her baby Monyelle; Brenda Cobb; Joel Cobb; and their mother, Christine Cobb. This video offers a somber look at the heartbreaking aftermath, the families left behind, and the enduring pain of those who lost so much in Jonestown.\n\nIn the months following the Jonestown massacre, the sorrow was compounded by a tragic reality—no cemetery was willing to inter the bodies. For months, the remains of hundreds, many unclaimed and unidentified, awaited a resting place as the world recoiled from the horror of the event. Finally, Evergreen Cemetery in Oakland, California, became the first to open its gates, offering a solemn refuge for the victims. At the cemetery’s first memorial service, Fred Lewis, Jynonna Norwood, and Guy Young stood in quiet remembrance, mourning lives lost too soon and the painful legacy left behind. The journey to find a place of peace for the deceased mirrored the tragedy itself—a devastating tale of rejection, loss, and the search for humanity in the aftermath of unimaginable despair.\n\nThis video is intended for educational purposes and seeks to honor and memorialize the victims of the Jonestown tragedy.",
      "release": "2024-11-18T16:29:04Z",
      "duration": "00:08:37",
      "explicit": false,
      "youTubeId": "WtuOr972yZE",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WtuOr972yZE"
      }
    },
    {
      "id": "4766eb40-bf00-44ad-bb1c-e99eb3dbbb6a",
      "title": "The Jonestown Express - Jonestown is so Beautiful",
      "description": "Deanna Wilkinson and the Jonestown Express performing \u0022Jonestown is so Beautiful\u0022.",
      "release": "2024-07-04T21:49:33Z",
      "duration": "00:03:00",
      "explicit": false,
      "youTubeId": "tTGt5cRMsM0",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tTGt5cRMsM0"
      }
    },
    {
      "id": "95e1203c-d7b6-4198-a28a-19bbc305ff07",
      "title": "Jonestown extended NBC footage",
      "description": "On November 14, Congressman Leo Ryan journeyed to Guyana, South America on a fact finding mission to investigate reports that Jim Jones, the leader of the Peoples Temple, was holding Americans against their will in Jonestown. The footage you are about to see was shot by the NBC crew that accompanied Leo Ryan to Jonestown. \n\nOn November 18, Congressman Leo Ryan was assassinated. Not long after 913 people in Jonestown died in a mass murder/suicide. \n\nAt the command of  their charismatic leader Reverend Jim Jones, 909 members of the Peoples Temple Agricultural Project lost their lives. Some believed they were committing a revolutionary act of suicide, others were forced or coerced by the group.\n\nAlso killed on the airstrip with Ryan was Patricia Parks, Don Harris, Greg Robinson, and Bob Brown. \n\nSharon Amos, Liane Harris, Christa Amos, and Martin Amos died in a murder suicide in Georgetown Guyana.",
      "release": "2021-11-15T02:01:35Z",
      "duration": "01:55:00",
      "explicit": false,
      "youTubeId": "o1HmhLkiG2o",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=o1HmhLkiG2o"
      }
    },
    {
      "id": "3f65ccfa-e501-49c6-ae4e-f2ec2a59c787",
      "title": "Episode 21 Sunday Service Liar\u0027s Communion",
      "description": "Jim Jones had a gift for recognizing and cultivating a person’s capacity for magical thinking or the belief that unrelated events are connected by invisible, supernatural threads. Those who followed Jim Jones surrendered their will, believing that, whatever Father was planning, he had the power and knowledge to guide them home. Temple members were systematically conditioned to accept the fake healings and miracles as a part of the tapestry their lives were woven into. With a wink and a smile Jim Jones reassured his flock that the chicanery was all a part of God’s plan.   ",
      "release": "2021-08-15T04:16:48Z",
      "duration": "01:59:48.7120000",
      "explicit": true,
      "spotifyId": "5mfV1L1rDhuef81nJuSkZX",
      "appleId": 1000532038369,
      "youTubeId": "vQTPKlERw64",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5mfV1L1rDhuef81nJuSkZX",
        "apple": "https://podcasts.apple.com/podcast/sunday-service-liars-communion/id1308803723?i=1000532038369",
        "youtube": "https://www.youtube.com/watch?v=vQTPKlERw64"
      }
    },
    {
      "id": "1fb93d5a-03e7-4774-9200-e172c1e49670",
      "title": "Episode 20 Sunday Service Leave Room for the Holy Ghost",
      "description": "The paranormal healing ministry drew new members into the movement with Jim Jones’ promises of supernatural support for the cause. The divine gifts physically drained him, he could feel people’s sickness and pain as he healed them. He began using sleight of hand when removing cancers, this seemed to cause a chain reaction and trigger actual healings. It was the catalyst to build faith. As more helpers were recruited, secrets were traded amongst the inner circle like currency, making Jim Jones the richest man in Peoples Temple.",
      "release": "2021-08-15T04:10:15Z",
      "duration": "01:20:00.3210000",
      "explicit": true,
      "spotifyId": "7FajLjVDPr0U0rgGBSqFmp",
      "appleId": 1000532038202,
      "youTubeId": "JFjqqhzRiHw",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7FajLjVDPr0U0rgGBSqFmp",
        "apple": "https://podcasts.apple.com/podcast/sunday-service-leave-room-for-the-holy-ghost/id1308803723?i=1000532038202",
        "youtube": "https://www.youtube.com/watch?v=JFjqqhzRiHw"
      }
    },
    {
      "id": "dcc79372-e1b8-4540-898d-62bd1f808507",
      "title": "Episode 19 Sunday Service Hands Clasped",
      "description": "Welcome to the Sunday Service, a 3-part immersive experience exploring Jim Jones’ paranormal ministry and the mystery of the nine gifts of the holy spirit. Your first visit to Peoples Temple will involve a profound, life changing, spiritual experience of the paranormal variety. The blind shall see, the deaf shall hear and the dead shall rise again! Lose yourself in the mystique, as Jim Jones’ creates the illusion that leads to the Temple’s eventual demise.",
      "release": "2021-08-15T04:01:20Z",
      "duration": "01:07:38.8770000",
      "explicit": true,
      "spotifyId": "1MhnAAgzDegG1yjO5o9AiR",
      "appleId": 1000532037819,
      "youTubeId": "DrmL2D5qjr0",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MhnAAgzDegG1yjO5o9AiR",
        "apple": "https://podcasts.apple.com/podcast/sunday-service-hands-clasped/id1308803723?i=1000532037819",
        "youtube": "https://www.youtube.com/watch?v=DrmL2D5qjr0"
      }
    },
    {
      "id": "a98961fa-744a-485a-b608-bc16fc98318f",
      "title": "Episode 18 Where there\u0027s smoke",
      "description": "Denise was three years old when her family first joined the Peoples Temple. Like so many early childhood memories, obscured by the lenses of time or augmented by repeated viewings of the family photo album, Denise’s early recollections of her time in the temple are vivid snapshots of experiences and emotions. She sacrificed her youth to Jim Jones and the cause. As she grew up, she learned that no show of loyalty was ever enough.",
      "release": "2021-05-21T23:08:51Z",
      "duration": "01:24:45.9360000",
      "explicit": true,
      "spotifyId": "5vcsxNTmFW6D2FHg7ACJLR",
      "appleId": 1000522702558,
      "youTubeId": "W2ceQKFLvdw",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5vcsxNTmFW6D2FHg7ACJLR",
        "apple": "https://podcasts.apple.com/podcast/where-theres-smoke/id1308803723?i=1000522702558",
        "youtube": "https://www.youtube.com/watch?v=W2ceQKFLvdw"
      }
    },
    {
      "id": "1a8935b1-1d37-47b3-8ccc-8d5ae96098ee",
      "title": "Episode 17 He\u0027s Able",
      "description": "Music was often peoples first, and last impression of Peoples Temple. From the moment you walked into a temple service, the music created a certain atmosphere. The voices of the choir lifted the spirits of the congregants, electrifying the audience. In 1973 the temple recorded the gospel funk album “He’s Able”. The altruistic message of equality expressed on the album, the optimism and high energy of the singers juxtaposes what we know will be their eventual fate in Jonestown. Yet in that moment in 1973 now etched on vinyl, the temples future is not yet set, and the dreamers still believe, and you can hear it.  This is the story behind the making of “He’s Able”.",
      "release": "2021-03-05T05:39:10Z",
      "duration": "01:45:53.0750000",
      "explicit": true,
      "spotifyId": "76hPrWywEM2FINVM2RQ3GT",
      "appleId": 1000511739857,
      "youTubeId": "2HS1_PxWedk",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/76hPrWywEM2FINVM2RQ3GT",
        "apple": "https://podcasts.apple.com/podcast/hes-able/id1308803723?i=1000511739857",
        "youtube": "https://www.youtube.com/watch?v=2HS1_PxWedk"
      }
    },
    {
      "id": "6550f46a-b1af-452a-81d2-9f681268ca2b",
      "title": "Episode 16 MK United",
      "description": "Jim Jones will be remembered  as the notorious cult leader who betrayed his followers trust and orchestrated their deaths. Join us as we examine the fabric of his ideals and beliefs stained by the blood of his flock in search of his true motives and spiritual beliefs.",
      "release": "2021-01-02T05:07:02Z",
      "duration": "02:24:01.1480000",
      "explicit": true,
      "spotifyId": "6i8rKU6moCT0wsqTz1FIE7",
      "appleId": 1000504107860,
      "youTubeId": "jgN_HRvk7ts",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6i8rKU6moCT0wsqTz1FIE7",
        "apple": "https://podcasts.apple.com/podcast/mk-united/id1308803723?i=1000504107860",
        "youtube": "https://www.youtube.com/watch?v=jgN_HRvk7ts"
      }
    },
    {
      "id": "606c4080-a231-431f-b3f5-8cd7a10ba1f7",
      "title": "Episode 15 The Nuclear Family",
      "description": "Irrational fear opens the floodgates of our imaginations unleashing upon ourselves the monsters and demons we let live in our subconscious. In 1962 Jim Jones leaves his church in Indiana behind to travel to Belo Horizonte Brazil under the guise of missionary work. Join us as former members of Peoples Temple remember this mysterious chapter of Jim Jones\u0027 life. Did Jim Jones travel to Brazil as part of a clandestine government project? Was Jim Jones searching for a safe haven from nuclear fallout?  ",
      "release": "2020-12-16T05:00:00Z",
      "duration": "01:04:26.4090000",
      "explicit": true,
      "spotifyId": "0KLu9Hfk2JPBPAIVP8kY3i",
      "appleId": 1000502541581,
      "youTubeId": "8894KzhepTA",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0KLu9Hfk2JPBPAIVP8kY3i",
        "apple": "https://podcasts.apple.com/podcast/the-nuclear-family/id1308803723?i=1000502541581",
        "youtube": "https://www.youtube.com/watch?v=8894KzhepTA"
      }
    },
    {
      "id": "b2b35951-0c70-4759-b3d9-459111f33966",
      "title": "Episode 14 Evangelical Profit",
      "description": "I believe in Jim Jones. Many of you have seen the photograph. An elderly woman dressed in her Sunday best with a resolute, if not revolutionary sparkle in her eye. But what did Jim Jones believe? Jim Jones, the pied piper of lies, will forever be remembered as the self-proclaimed prophet who led his flock to the slaughter. Traditional Churches immediately distanced themselves from the Peoples Temple Christian church after the tragedy in Jonestown claiming that Jim Jones only used religion to introduce people to socialism. To assume that whatever the temple believed cannot be found in the Bible might seem reasonable, even comforting. Surely the foundation of a communist suicide cult could only grow outside of traditional religions and on foreign soil. But this assumption is wrong. Join us as we examine Jim Jones beliefs and his adventures with the Holy Ghost.",
      "release": "2020-12-02T05:00:00Z",
      "duration": "01:38:19.3300000",
      "explicit": true,
      "spotifyId": "5Rg88dm7WR2LLhEucaLP10",
      "appleId": 1000501063320,
      "youTubeId": "W5jpdmpWw_o",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Rg88dm7WR2LLhEucaLP10",
        "apple": "https://podcasts.apple.com/podcast/evangelical-profit/id1308803723?i=1000501063320",
        "youtube": "https://www.youtube.com/watch?v=W5jpdmpWw_o"
      }
    },
    {
      "id": "ab6b04ea-8cec-42d2-9300-d118b66fd823",
      "title": "Episode 13 God\u0027s Highway",
      "description": "Welcome back. All this time I was searching for the truth, I ignored the psychedelic elephant in the room. Former members of the temple, the survivors, have as many questions about what happened in Jonestown as I do. I invite you to forget everything you think you know about Jim Jones and the Peoples Temple and let go of your outsiders perspective. Join me as I stop peering through the temples foggy windows and going through their trash, and cross the threshold to go inside. Was Jim Jones responsible for a series of deaths that occurred in California, years before the tragic mass murder suicide in Guyana? Three automobile accidents, spanning three decades, provide a backdrop for examining this question, and others, about the infamous cult leader and Peoples Temple members. ",
      "release": "2020-11-18T05:00:00Z",
      "duration": "01:07:09.2320000",
      "explicit": true,
      "spotifyId": "3hmWkSMcqRTwHqVkIewdMN",
      "appleId": 1000499231461,
      "youTubeId": "vI_3-WF57ko",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hmWkSMcqRTwHqVkIewdMN",
        "apple": "https://podcasts.apple.com/podcast/gods-highway/id1308803723?i=1000499231461",
        "youtube": "https://www.youtube.com/watch?v=vI_3-WF57ko"
      }
    },
    {
      "id": "7bb0c103-e188-45c0-bb18-6d2ed445a46d",
      "title": "Episode 12 Hill Of Dreamers",
      "description": "41 years ago today the Jonestown massacre claimed the lives of 918 Americans. When the people of Jonestown died, their bodies remained where they fell for 4 days. Sprayed with pesticides and crowded into military body bags, the remains of Jonestown’s dead were shipped to Dover Air Force Base in Delaware for processing. In the end 593 people were identified leaving 320 bodies mostly those of children, unidentified.  As families arranged to recover their love ones, 409 bodies were left unclaimed. This is not a normal episode of the program but rather a memorial to those who died on November 18, 1978 deep in the jungles of Guyana.",
      "release": "2019-11-19T01:11:07Z",
      "duration": "00:44:51.7850000",
      "explicit": true,
      "spotifyId": "6GQqgcam1sHz22zdGQlQtj",
      "appleId": 1000457193240,
      "youTubeId": "Rkv00Phmg6s",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6GQqgcam1sHz22zdGQlQtj",
        "apple": "https://podcasts.apple.com/podcast/hill-of-dreamers/id1308803723?i=1000457193240",
        "youtube": "https://www.youtube.com/watch?v=Rkv00Phmg6s"
      }
    },
    {
      "id": "3047f37a-30a2-4fc1-9b4f-d110ca9c0308",
      "title": "Episode 11 Ockham\u0027s Razor, Solving The Mystery Of Q875",
      "description": "Q875, known as the November 19 mystery tape, with its static filled audio and found footage type origins, perplex and mystify those who choose to analyze it. A Jonestown survivor claims to hear the voice of Jim Jones hours after the settlement had been poisoned. Others believe the CIA made the tape. Q875 was found in Jonestown with hundreds of other tapes, what makes the mystery tape unique is that it was the only tape recorded in Jonestown AFTER everyone was dead. Who made the tape and why? Join us as we try to find out. ",
      "release": "2018-11-18T06:00:00Z",
      "duration": "01:03:21.8340000",
      "explicit": true,
      "spotifyId": "0dwdW7oconW99IHgGfxSKX",
      "appleId": 1000424085702,
      "youTubeId": "L_cFSz2VBAo",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dwdW7oconW99IHgGfxSKX",
        "apple": "https://podcasts.apple.com/podcast/ockhams-razor-solving-the-mystery-of-q875/id1308803723?i=1000424085702",
        "youtube": "https://www.youtube.com/watch?v=L_cFSz2VBAo"
      }
    },
    {
      "id": "7feb1cc9-1144-431b-8e30-7bcb49943073",
      "title": "Episode 10 Thank You For Letting Me Be Myself",
      "description": "40 years ago, 918 Americans died in the largest mass murder/suicide in modern history. Defined by the last day of their lives, the people of Jonestown became a part of true crime lore, overshadowed by their charismatic leader Jim Jones.  We all know how the Peoples Temple died, but how did they live? The Attention Span Recovery Project is proud to present this memorial special, honoring the lives of the people of Jonestown, told by the survivors who knew and loved them.",
      "release": "2018-11-18T05:30:00Z",
      "duration": "01:05:32.2970000",
      "explicit": true,
      "spotifyId": "1Gb9c8dLjLARh1SsPwp6Cf",
      "appleId": 1000424085703,
      "youTubeId": "f_zUNC0uJ7s",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Gb9c8dLjLARh1SsPwp6Cf",
        "apple": "https://podcasts.apple.com/podcast/thank-you-for-letting-me-be-myself/id1308803723?i=1000424085703",
        "youtube": "https://www.youtube.com/watch?v=f_zUNC0uJ7s"
      }
    },
    {
      "id": "93d1e900-3d0d-4287-a01e-dc2bb9479de6",
      "title": "Episode 9 Q875, Is It Too Late For Russia?",
      "description": "What if everything you thought you knew about Jonestown was a lie? This is the final episode of Transmissions From Jonestown. Join us as we examine new evidence that not only challenges popular theory, but history itself.  ",
      "release": "2017-12-09T06:00:00Z",
      "duration": "01:01:10.0840000",
      "explicit": true,
      "spotifyId": "6NYW2dHSklHQytIjSmaLAv",
      "appleId": 1000396860358,
      "youTubeId": "OKdF55PX-3U",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6NYW2dHSklHQytIjSmaLAv",
        "apple": "https://podcasts.apple.com/podcast/q875-is-it-too-late-for-russia/id1308803723?i=1000396860358",
        "youtube": "https://www.youtube.com/watch?v=OKdF55PX-3U"
      }
    },
    {
      "id": "d02aaaef-93b9-49cd-bda8-987422c5d698",
      "title": "Episode 8 The Psychodelic Elephant",
      "description": "Truth often requires those who search for it to accept coincidence as a form of nature. How are Jim Jones, Patty Hearst, Jack Ruby, and Sirhan Sirhan all connected? Find out as we go further down the rabbit hole.",
      "release": "2017-12-09T05:30:00Z",
      "duration": "01:06:41.8890000",
      "explicit": true,
      "spotifyId": "7dAfUeDSaX8DSSIr1wvEp2",
      "appleId": 1000396860357,
      "youTubeId": "96S2To3Tkgo",
      "subjects": [
        "Peoples Temple",
        "Symbionese Liberation Army"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7dAfUeDSaX8DSSIr1wvEp2",
        "apple": "https://podcasts.apple.com/podcast/the-psychodelic-elephant/id1308803723?i=1000396860357",
        "youtube": "https://www.youtube.com/watch?v=96S2To3Tkgo"
      }
    },
    {
      "id": "c6452c2e-439d-4611-bf45-0be11d92cd38",
      "title": "Episode 7 The Electric Koolaid Acid Tests",
      "description": "After world war two German scientists were recruited by the American military into intelligence programs. MKULTRA, a behavior modification program, used American citizens for its experiments after the war until 1974 when the program went underground. As society attempted to understand how a massacre like Jonestown could happen, many theorized that the Peoples Temple were victims of a CIA medical experiment. Join us as we investigate Jonestown conspiracy theories and MKULTRA.",
      "release": "2017-12-02T06:00:00Z",
      "duration": "01:03:01.4170000",
      "explicit": true,
      "spotifyId": "5tQgVQyIPG3rgCejj81R3F",
      "appleId": 1000395528430,
      "youTubeId": "JELaWlZRZyE",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tQgVQyIPG3rgCejj81R3F",
        "apple": "https://podcasts.apple.com/podcast/the-electric-koolaid-acid-tests/id1308803723?i=1000395528430",
        "youtube": "https://www.youtube.com/watch?v=JELaWlZRZyE"
      }
    },
    {
      "id": "f4abe168-daa8-4403-a233-1e6faaba5932",
      "title": "Episode 6 Apostolic Socialism",
      "description": "Guyana has a strange and fascinating history. Once believed to hide the lost city of El Dorado, the northwest territory of Guyana is home to a violent mythology predating the Jonestown massacre by hundreds of years. Mined for its gold and known for its mysterious mountains, mid century Guyana emerged as a newly independent nation lost in a world of espionage. Join us as we investigate why Guyana was chosen to be Jim Jones’s socialist paradise.",
      "release": "2017-12-01T17:00:00Z",
      "duration": "00:55:19.8380000",
      "explicit": true,
      "spotifyId": "3p7CrlCljUM3d4WVKTcm7a",
      "appleId": 1000395528429,
      "youTubeId": "g7p3vKcBwsI",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3p7CrlCljUM3d4WVKTcm7a",
        "apple": "https://podcasts.apple.com/podcast/apostolic-socialism/id1308803723?i=1000395528429",
        "youtube": "https://www.youtube.com/watch?v=g7p3vKcBwsI"
      }
    },
    {
      "id": "ef0b8111-fbc7-4f15-a57a-cdcedfbfe59b",
      "title": "Episode 5 The Consequences Of Apathy",
      "description": "Leo Ryan wasn’t the only publicly elected official assassinated the week of November 18. In the weeks following the mass tragedy in Jonestown, rumors of a Peoples Temple hit squad terrified the concerned relatives and survivors. In the wake of false news reports, the world struggled to understand what had happened to the Peoples Temple. For the few who made it out of Jonestown, the process of reentering society was traumatic. Surviving the lonely road home in a world demanding answerers robbed many survivors of their grief. Join us as we investigate what became of the Peoples Temple.",
      "release": "2017-11-25T05:30:00Z",
      "duration": "01:01:47.1770000",
      "explicit": true,
      "spotifyId": "2BkJFS6h0Lc4L2h6JDdeyD",
      "appleId": 1000395241030,
      "youTubeId": "et_lnhRjZn0",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2BkJFS6h0Lc4L2h6JDdeyD",
        "apple": "https://podcasts.apple.com/podcast/the-consequences-of-apathy/id1308803723?i=1000395241030",
        "youtube": "https://www.youtube.com/watch?v=et_lnhRjZn0"
      }
    },
    {
      "id": "e5883cd6-860b-4a64-b0c5-db3361f3c856",
      "title": "Episode 4 The Death Tape",
      "description": "Of all the evidence collected in Jonestown a single audio recording proved to the world that over 900 American citizens chose to drink cyanide laced Kool-aid on the command of their cult leader Jim Jones. But what if the tape was edited? Or spliced together from earlier white nights and planning commission meetings in which suicide drills took place? Join us as we analyze the death tape. ",
      "release": "2017-11-24T17:00:00Z",
      "duration": "00:56:44.6520000",
      "explicit": true,
      "spotifyId": "23gPymz8MEz2xN0FS29ZK4",
      "appleId": 1000395241031,
      "youTubeId": "wbRcoCRaWMU",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23gPymz8MEz2xN0FS29ZK4",
        "apple": "https://podcasts.apple.com/podcast/the-death-tape/id1308803723?i=1000395241031",
        "youtube": "https://www.youtube.com/watch?v=wbRcoCRaWMU"
      }
    },
    {
      "id": "447afe86-1ca4-4672-8066-445d680538cb",
      "title": "Episode 3 Revolutionary Suicide",
      "description": "Unable to delay Leo Ryan\u0027s congressional inquiry any longer, Jim Jones readied the settlement for what he believed to be an attempt to destroy the Peoples Temple by defectors. An elaborate show was performed in the pavilion and fried chicken was served. To the visitors the people seemed happy and well nourished.  The atmosphere in Jonestown relaxed as Leo Ryan expressed how impressive the community was , it seemed the Peoples Temple had survived yet another attack by outside forces. As the Jonestown Express played on, a note was passed to newsman Don Harris that said, \u0022HELP US GET OUT OF JONESTOWN\u0022. This episode focuses on Jonestown, on its last day on earth.  ",
      "release": "2017-11-18T05:30:00Z",
      "duration": "00:48:04.0110000",
      "explicit": true,
      "spotifyId": "1dWTb0UoUg2I9yeyI8UOfl",
      "appleId": 1000394965672,
      "youTubeId": "Upnb8zWYS_g",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dWTb0UoUg2I9yeyI8UOfl",
        "apple": "https://podcasts.apple.com/podcast/revolutionary-suicide/id1308803723?i=1000394965672",
        "youtube": "https://www.youtube.com/watch?v=Upnb8zWYS_g"
      }
    },
    {
      "id": "3b29db07-3f77-42ad-a19a-cb703a2387f0",
      "title": "Episode 2 Life In The Promised Land",
      "description": "After the New West article, Jim Jones fled to his jungle compound bringing several hundred Peoples Temple members with him. The population of Jonestown exploded from about 50 to over 900 residents. Resources and food were scarce and Jim Jones rambled over the loudspeakers warning the community of a coming siege. The atmosphere in Jonestown was tense and chaotic, the people toiled 10 hours a day in the fields as Jim Jones slipped into a drug induced waking nightmare. For the members of Peoples Temple who’d sold all of their worldly possessions to live in the promised land, the realization that the pied piper of lies was in total control came the moment they entered Jonestown and handed in their passports. Join us as we investigate life in Jonestown.",
      "release": "2017-11-17T17:00:00Z",
      "duration": "00:46:44.3690000",
      "explicit": true,
      "spotifyId": "6y3Pa6LVjeBO6M3CE6s54I",
      "appleId": 1000394965673,
      "youTubeId": "S-LeaCF0c0k",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6y3Pa6LVjeBO6M3CE6s54I",
        "apple": "https://podcasts.apple.com/podcast/life-in-the-promised-land/id1308803723?i=1000394965673",
        "youtube": "https://www.youtube.com/watch?v=S-LeaCF0c0k"
      }
    },
    {
      "id": "e498aaaa-1c7c-4d0a-8521-07ae0a61536e",
      "title": "Episode 1 Peoples Temple",
      "description": "On November 18 1978, an entire community of United States Citizens died deep in the jungle of Guyana. At the command of  their charismatic leader Rev. Jim Jones 909 members of the peoples temple agricultural project lost their lives, some believed they were committing a revolutionary act of suicide, others were forced or coerced by the group. A colorful toxic mix of flavor aid, Kool-Aid and cyanide was passed around in Dixie cups, for those unable or unwilling the mixture was administered using syringes. Most of us have heard the story, an egomaniacal madman and his brainwashed cult of zombie followers commit mass suicide in the heart of darkness. Nothing more than a cautionary tale reminding us all to think for ourselves and never ever drink the Kool-Aid. Join us as we investigate how it all began. ",
      "release": "2017-11-07T04:33:22Z",
      "duration": "00:44:52.3220000",
      "explicit": true,
      "spotifyId": "4iC54BPMQQBUv6ztFCNTIC",
      "appleId": 1000394502301,
      "youTubeId": "0SdwS-2MCGQ",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4iC54BPMQQBUv6ztFCNTIC",
        "apple": "https://podcasts.apple.com/podcast/the-peoples-temple/id1308803723?i=1000394502301",
        "youtube": "https://www.youtube.com/watch?v=0SdwS-2MCGQ"
      }
    }
  ]
}