{
  "_ts": 0,
  "id": "809d731d-e888-47c9-b999-d55c99c2cf38",
  "name": "Tremendous Talk Podcast",
  "spotifyId": "7MBTXD5E62on83cKfKO7gH",
  "appleId": 1690092029,
  "youTubeChannelId": "UCLeqzp9NEXcFmouX2hgq-Gw",
  "episodes": [
    {
      "id": "47bc3e8b-d044-466d-8eea-7498d3220066",
      "title": "Giovannie Espiritu On Taking Baby Steps, Resilience, and Showing Your Soul",
      "description": "This week on the podcast we are so so happy to chat with GIOVANNIE ESPIRITU! Giovannie is an actor, producer, director, writer, filmmaker, speaker, musician, and one of our favorite people! Giovannie Espiritu\u0027s identity is inherently political: A bisexual, once-undocumented immigrant Filipina mom who spent time in a Biblical doomsday cult as a teen. Her first short film, “Ultra-Feminist,” got an Honorable Mention at Outfest:Fusion, and her second film, “ALLY 3000,” won over 12 awards at film festivals mainly in scriptwriting and social justice. Most of her work has taken aim at dismantling the patriarchy, healing generational trauma, and exposing systems of bias with humor. Her IRL and reel life mantra is to “Break Hearts Wide Open and Create More Moments of Joy.” In today’s episode we get into the balance of sharing your experiences in story form, following your heart in day to day moments, and so so so much more. Welcome to the Tremendous Talk Podcast, Giovannie Espiritu! Giovannie Espiritu’s Website: https://giovannieespiritu.com/ Giovannie Espiritu’s IMDB: https://www.imdb.com/name/nm1482080/ Giovannie Espiritu’s Instagram: https://www.instagram.com/giospirit2/?hl=en Giovannie Espiritu’s Hollywood Actors Workshop: https://hollywoodactorsworkshop.com/ Join your hosts, Ashley and Law, as they guide you through culture in the realms of Hollywood and speak to industry professionals in the spotlight. They cover individuality and self-discovery, visibility on screen and their parallels to society, pop-culture and more. This is a safe space to break down all the walls with big screen names who hold even bigger places in our hearts and the unsung heroes behind the scenes! From who they are to their favorite snack - get into the nuances with some of your favorite folx. So grab a boba tea and leave your shoes at the door. Welcome to Tremendous Talk! Hosted by Ashley Rapuano Sanchez \u0026 Lawrence Sharma \u0026#x1f399;️ Produced by Lawrence Sharma, Ashley Rapuano Sanchez, Joseph Garalde , and Jeremiah Abraham , in collaboration with Tremendous . ✨ The Tremendous Talk Podcast jingle is by Jared Sanchez and Ashley Rapuano Sanchez, produced at Hammsterden Records . \u0026#x1f3b6; LISTEN to Tremendous Talk on SPOTIFY: https://open.spotify.com/show/7MBTXD5E62on83cKfKO7gH?si=1db9369ef2fb4e65 LISTEN to Tremendous Talk on APPLE PODCASTS: https://podcasts.apple.com/us/podcast/tremendous-talk-podcast/id1690092029 FOLLOW Tremendous Talk on Instagram \u0026#x1f4f8;: https://www.instagram.com/tremendoustalkpodcast/ FOLLOW Tremendous Talk on Twitter \u0026#x1f426;: https://twitter.com/TremendousTalk FOLLOW Tremendous Talk on TikTok \u0026#x1f525;: https://www.tiktok.com/@tremendoustalkpodcast FOLLOW Tremendous Talk on YouTube \u0026#x1f4f9;: https://www.youtube.com/@TremendousTalkPodcast FOLLOW Tremendous Talk on Facebook ✴️: https://www.facebook.com/tremendoustalk/ Contact: hello@tremendoustalk.com #WeAreTremendous #TremendousTuesdays #TremendousTalkPodcast",
      "release": "2024-10-31T20:10:47Z",
      "duration": "00:39:30.7940000",
      "explicit": false,
      "spotifyId": "0azCbAQdZYFs7dHIJSU3UE",
      "appleId": 1000675256719,
      "youTubeId": "P-yp_RFVyKk",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0azCbAQdZYFs7dHIJSU3UE",
        "apple": "https://podcasts.apple.com/podcast/giovannie-espiritu-on-taking-baby-steps-resilience/id1690092029?i=1000675256719",
        "youtube": "https://www.youtube.com/watch?v=P-yp_RFVyKk"
      }
    }
  ]
}