{
  "id": "c55dc426-92dd-43f0-ad4b-c3b2f8938d6d",
  "name": "BBC Trending",
  "spotifyId": "4OvEMfsvAFIDll2CwowkDD",
  "appleId": 739773408,
  "episodes": [
    {
      "id": "5c71cfe3-8a92-49c8-9d11-2b2a038a9e65",
      "title": "Trolled by a life coaching cult",
      "description": "A life coaching group has been accused of trolling former members. Lighthouse International Group promises to help people realise their dreams and ambitions, but the reality is more sinister.  Lighthouse obsessively records and stores mentoring sessions and group calls. But when people ask questions or try to leave, that’s when the trouble really starts.  BBC Trending\u0027s series Trolled lifts the lid on online abuse and trolling on and off social media. Presenter: Catrin Nye Producer: Ed Main Editor: Flora Carmichael",
      "release": "2023-05-06T00:00:00",
      "duration": "00:20:12.1270000",
      "explicit": true,
      "spotifyId": "4R36tLoyJ5POxjHbLtrImu",
      "appleId": 1000611956874,
      "subjects": [
        "Lighthouse International Group"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4R36tLoyJ5POxjHbLtrImu",
        "apple": "https://podcasts.apple.com/podcast/trolled-by-a-life-coaching-cult/id739773408?i=1000611956874"
      }
    },
    {
      "id": "117eb302-d614-41a5-8ff9-6d372bdb2379",
      "title": "India’s anti-MLM movement",
      "description": "The past few years gave way to a boom in the number of people joining direct selling schemes in India who were lured in by the false promise of riches. These tactics – imported from the West – have been quietly growing without much scrutiny. Ria – not her real name – fell prey to one of the largest schemes operating in the country. In an exclusive interview for BBC Trending, she reveals how she was trained to “attract people” into the business.  There is a small group of crusaders who are fighting back, trying to save people from buying into schemes that leave more people further out of pocket than they were to begin with. So who are they and how are they doing it? The BBC’s health and disinformation reporter, Rachel Schraer investigates this phenomenon, speaking to experts, the authorities and even two YouTubers who are spreading awareness in the small South Indian village.   Presenter: Rachel Schraer Producer: Reha Kansara Editor: Flora Carmichael",
      "release": "2022-12-03T00:00:00",
      "duration": "00:24:40.1280000",
      "explicit": false,
      "spotifyId": "404PqueHPNn7QJIcg2G8ag",
      "appleId": 1000588593233,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/404PqueHPNn7QJIcg2G8ag",
        "apple": "https://podcasts.apple.com/podcast/indias-anti-mlm-movement/id739773408?i=1000588593233"
      }
    }
  ]
}