{
  "id": "39c0dd71-eacd-491a-aa71-a6d744726ccf",
  "name": "Trivial Trivia - the Podcast",
  "spotifyId": "6b4JtQrO9pHZHDVQs75iHW",
  "appleId": 1513939958,
  "episodes": [
    {
      "id": "8af58171-ca07-49f5-a1bd-042935e7b0d8",
      "title": "Real Cults",
      "description": "In today\u0027s episode, we discuss Real Cults. The other possible title for this episode was Real Cults Near You! This was because this is what Joe called it in the very first moments of the show, but since that is not necessarily the case, we decided against that. We talked about several interesting and possibly well known cults. One cult was even mentioned in the last episode. Let us see if you can figure out which one. As always, we have a Florida Man and a movie rundone. Today\u0027s movie is 47 Meters Down. I hope you enjoy. Until next time.  Also, I would like thank John our cameraman. We would not have been able to do video without him.  Also, I apologize for the editing. I am still very new at editing, but hopefully I will get better soon.  Always remember to like, subscribe, and share. Also, do not forget to head on down to the website and check out the awesome stuff we have there.  https://www.mrtrivialtrivia.com/⁠ Or our LinkTree (all our links in one place) Linktr.ee/trivialtrivia  If you want to get in contact with us, shoot us an email or head to our lovely website. Email: mrtrivialtrivia@gmail.com Until Next Time - Mr. Trivial  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/trivial-trivia-podcast/message Support this podcast: https://podcasters.spotify.com/pod/show/trivial-trivia-podcast/support",
      "release": "2023-11-13T00:00:00",
      "duration": "00:17:40.0730000",
      "explicit": false,
      "spotifyId": "1dBBKaSX2dCqTI1SRi7ITX",
      "appleId": 1000634645734,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dBBKaSX2dCqTI1SRi7ITX",
        "apple": "https://podcasts.apple.com/podcast/real-cults/id1513939958?i=1000634645734"
      }
    }
  ]
}