{
  "id": "833fc69b-dc0b-4f72-8bac-ec6b8e0db08c",
  "name": "True Crime Travelers",
  "spotifyId": "4SytC47AsOqVPPY41xI3Lp",
  "appleId": 1769494528,
  "youTubeChannelId": "UCr_Xui303wXU6EwPOTYmcbQ",
  "episodes": [
    {
      "id": "4b8872ee-3815-4dcb-8967-42e639fca45f",
      "title": "Ep. 08 The Tantra Cult in Thailand: Elise Dallemagne",
      "description": "Destination: Koh Tao, Thailand April 2017, Belgian backpacker Elise Dallemagne was member of a tantra sex cult on Koh Phangan island in Thailand. After a year living there, she decided to return home. She announced her departure and attempted to leave, but for some reason, she fled to a neighboring island. A few weird things happened here and then a week later she was found dead in the jungle with lizards eating her body. How the hell did this happen? Many believe that Elise was followed by and murdered by the cult which she was trying to escape. \u0026#x1f50d; Listen to the clues as we investigate this mysterious death of a traveler. AS PROMISED ON THE EPISODE: ▷ Solo Girl\u0027s Travel Guide to Thailand ▷ Solo Girls Travel FB Group ▷ Solo Girl\u0027s Travel Guide SubReddit ▷ Life 360 App ▷ Google Maps Want to travel with us? \u0026#x1f449;\u0026#x1f3fb; Glow Up Travel Trips Support the show \u0026#x1f49c; Don’t miss out on all things True Crime Travelers Instagram: @truecrimetravelers TikTok: @truecrimetravelers YouTube: @sologirlstravelguide Get episodes delivered to your inbox every week, join the TCT Newsletter \u003E TrueCrimeTravelers.com Get Alexa\u0027s book, The One-Way Ticket Plan and check out the full collection of The Solo Girl\u0027s Travel Guide at www.Alexa-West.com Want to travel with us? w ww.Alexa-West.com/Glow-Up-Travel-Trips \u0026#x1f49b; True Crime Travelers is hosted by Alexa West \u0026 Emilia Igartua. Connect with Alexa: www.alexa-west.com Connect with Emilia: www.holaemilia.com Safe travels!",
      "release": "2024-11-12T08:00:00Z",
      "duration": "00:43:54.0310000",
      "explicit": false,
      "spotifyId": "4ISoyfYrnk3n1GDY2sVbTt",
      "appleId": 1000676607439,
      "youTubeId": "FxiuvJxwNr0",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ISoyfYrnk3n1GDY2sVbTt",
        "apple": "https://podcasts.apple.com/podcast/ep-08-the-tantra-cult-in-thailand-elise-dallemagne/id1769494528?i=1000676607439",
        "youtube": "https://www.youtube.com/watch?v=FxiuvJxwNr0"
      }
    }
  ]
}