{
  "_ts": 0,
  "id": "14706109-750a-4291-a690-bea60f1d4e7a",
  "name": "True Geordie",
  "spotifyId": "7Gov6HAUQCp1eYsrcw97nJ",
  "appleId": 1157693037,
  "youTubeChannelId": "UCWaZLW7Bfa83J_h587dH1WQ",
  "episodes": [
    {
      "id": "21785423-fe8d-4971-9bf9-473ea4d603ff",
      "title": "Scientology EXPOSED - Evil Tom Cruise, Brainwashing \u0026 Forced to Terminate Babies!",
      "description": "True Geordie talks to former scientology member Claire Headley on her life inside the cult and working with the leader David Miscavige who succeeded L. Ron Hubbard and is now best friends with Tom Cruise. The world scientology is blown open by Claire who details the extreme punishments she was subjected to.\n\nClaire’s links…\n\nYouTube: https://www.youtube.com/@blownforgood\n \nPodcast: https://blownforgood.com/podcast/\n \nWeb: https://blownforgood.com\n \nHelping people get out of Scientology: www.theaftermathfoundation.org\n\n📧 Business Email : info@truegeordie.com\n\n🎙️ TG Channel : https://youtube.com/@TrueGeordie\n\n🥊 The Pain Game : https://youtube.com/@paingamepodcast\n\n⚽️ The Kick Off : https://youtube.com/@TheKickOff \n\n🐦 Twitter : https://twitter.com/TrueGeordieTG\n\n📸 Instagram : https://instagram.com/TrueGeordieOfficial\n\nJoin us on the latest episode of the True Geordie Podcast as we delve deep into the dark and mysterious world of Scientology with former high-ranking member Claire Hedley. Claire shares her harrowing journey of escaping Scientology after enduring over a decade of abuse, working closely with prominent figures like David Miscavige and even Tom Cruise.\n\nIn this eye-opening discussion, Claire sheds light on the shocking levels of abuse she experienced, from her childhood to later being coerced into multiple pregnancy terminations. Her bravery in speaking out aims to prevent others from falling prey to the same fate.\n\nDiscover the truth behind Scientology\u0027s beliefs and practices, its notorious pay-to-learn system, and its elaborate mythology involving alien origins. Claire\u0027s first-hand experiences working directly with Scientology\u0027s leaders provide invaluable insights into the inner workings of this controversial organization.\n\nDon\u0027t miss this compelling conversation as Claire shares her story of liberation and resilience, exposing the dark realities of Scientology. Tune in now to the True Geordie Podcast and join the fight against cult manipulation and abuse.\n\n#Scientology #TrueGeordiePodcast #ClaireHedley #EscapeFromCult #ExposingAbuse #TomCruise #DavidMiscavige #AlienOrigins #CultManipulation #TrueStories",
      "release": "2024-02-19T19:14:36Z",
      "duration": "01:22:07",
      "explicit": false,
      "youTubeId": "1j99cM0C8Yc",
      "subjects": [
        "Scientology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1j99cM0C8Yc"
      }
    }
  ]
}