{
  "id": "6d60af95-aa84-4ac2-81e6-e9954b81be9e",
  "name": "True Crime Fix",
  "youTubeChannelId": "UCmgpjm53OGZd8a2z859a9vw",
  "episodes": [
    {
      "id": "14996733-d676-4f92-b6bd-d6ff6e919a4a",
      "title": "How I Escaped The Children of God Cult | People Are Deep | True Crime Fix",
      "description": "In this episode we talked to Petra Velzeboer, who grew up in a religious cult The Children Of God (now known as The Family International). Petra told us how she left the cult, how her trauma led to addiction and wanting to take her life, and how she managed to find healing and recovery.\n\nDocumentary: People Are Deep | S1E07 | How I Escaped A Dangerous Cult\r\n**This film is under non-exclusive license from Hat Trick. All rights reserved.**\r\n\r\nOur BEST Curated True Crime Docs: https://www.youtube.com/playlist?list=PL_KQjFE9NyNvbK5Y0M-c-UOJl8S1u46B8\r\n\r\nMurders and Homicide Documentaries: https://www.youtube.com/playlist?list=PL_KQjFE9NyNtUIoU4QuWhJv12USi0OeIl\r\n\r\nIf you love the content on the channel, and you want to see more, consider giving us a Super Thanks! Every bit helps us get more incredible content onto the channel.\r\n\r\nLet us know what you think of this case in the comments below!\r\n______________________________________________________\r\n\r\nWelcome to the Crime Family!\r\nBe Sure to Subscribe to get more Incredible Crime Content!\r\n\r\nhttps://www.youtube.com/channel/UCmgpjm53OGZd8a2z859a9vw?sub_confirmation=1\r\n\r\nWelcome to True Crime Fix—your ultimate destination for gripping crime stories and chilling documentaries! Dive deep into the world of real crime with shows that explore everything from catfishing and hate crimes to online predators. We bring you the best true crime documentaries from the top producers around the world, showcasing the most compelling and thought-provoking cases. Whether you\u0027re a true crime enthusiast or simply curious, our weekly content will keep you hooked. Subscribe now and never miss an episode—your next crime fix is just a click away!\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\n\r\nTrue Crime Fix is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#truecrimefix #crimegenre #crimedocumentaries #crimestory #crimestories #documentary #stalkers #truecrimedocumentary",
      "release": "2025-11-11T11:00:48Z",
      "duration": "00:46:11",
      "explicit": false,
      "youTubeId": "NUrlJIXFdbY",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NUrlJIXFdbY"
      }
    }
  ]
}