{
  "_ts": 0,
  "id": "e29aedf2-ddee-4e32-b033-bffe9c37b6e1",
  "name": "True Crime Today  | A True Crime Podcast",
  "spotifyId": "0GYshi6nJCf3O0aKEBTOPs",
  "appleId": 1504280230,
  "episodes": [
    {
      "id": "7fd4965d-7864-4932-afd9-3b8c202f12bb",
      "title": "Why Did Chad Daybell Admit \u0022I\u0027m Not Coming Back\u0022 Before Arrest?",
      "description": "In this episode of \u0022Hidden Killers With Tony Brueski,\u0022 Tony is joined by Robin Dreeke, a retired FBI Special Agent, to discuss new developments in Chad Daybell\u0027s trial. They analyze a recent video presented in court where Daybell tells his daughter \u0022I\u0027m not coming back,\u0022 signaling his awareness of the impending consequences of his actions. This episode delves into the behavioral dynamics between Chad Daybell and Lori Vallow, exploring how Vallow\u0027s alleged manipulative nature may have influenced Daybell to commit crimes under the guise of love and financial gain. Dreeke discusses the psychological aspects of the case, including the concept of narcissism and manipulation. He raises questions about Daybell\u0027s self-awareness versus delusional thinking and examines how these factors intersect with criminal behavior. The conversation also touches on the broader implications of their actions on their family and social perceptions, emphasizing the lack of support for Vallow from anyone in her past, which underscores her history of manipulative relationships. **Main Points Made in the Conversation:** - Chad Daybell showed signs of awareness about the severity of his situation in a newly revealed video. - Discussion on Lori Vallow\u0027s dominant role in the relationship and her influence over Daybell. - Analysis of Daybell\u0027s potential motivations, including love, manipulation, and financial incentives. - Consideration of Daybell\u0027s relationship with his children and its impact on his decisions. - The lack of a support network for Lori Vallow highlights her manipulative past. - Examination of the psychological traits of narcissism and manipulation in both Daybell and Vallow. - The role of societal and familial perceptions in understanding the case and its participants. - Insights into the cult-like dynamics between Daybell and Vallow and their effects on their legal defense. #ChadDaybell #LoriVallow #RobinDreeke #TonyBrueski #HiddenKillersPodcast #CriminalPsychology #Manipulation Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Karen Read Trial, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, Justice for Harmony Montgomery, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2024-04-22T21:00:00Z",
      "duration": "00:08:11.5980000",
      "explicit": false,
      "spotifyId": "0WmhBLssDD5HyZu2iUq5dX",
      "appleId": 1000653257339,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0WmhBLssDD5HyZu2iUq5dX",
        "apple": "https://podcasts.apple.com/podcast/why-did-chad-daybell-admit-im-not-coming-back-before-arrest/id1504280230?i=1000653257339"
      }
    }
  ]
}