{
  "_ts": 0,
  "id": "c9bdd718-70ea-48c7-ae41-feef7af9ab4f",
  "name": "True Cult Stories",
  "youTubeChannelId": "UCyXoV3CmTPpreZJhhHf3-sQ",
  "episodes": [
    {
      "id": "61c8063b-e0b2-41a9-b585-daa83fa423e9",
      "title": "Secret Cult That Abducted Tourists For Ritual Sacrifices",
      "description": "https://www.youtube.com/channel/UCyXoV3CmTPpreZJhhHf3-sQ? sub_confirmation=1",
      "release": "2024-04-30T12:00:07Z",
      "duration": "00:14:17",
      "explicit": false,
      "youTubeId": "KoGl6YB3y_M",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KoGl6YB3y_M"
      }
    },
    {
      "id": "b9d0de27-161f-4153-9105-33ff293b126d",
      "title": "This Cult-Turned American Sikhism into billion dollar Fraud",
      "description": "https://www.youtube.com/channel/UCyXoV3CmTPpreZJhhHf3-sQ? sub_confirmation=1\n\nHow a Cult-turned-Corporation Hijacked American Sikhism 3HO (Healthy, Happy, Holy Organization) \n\nDuring the last years of the Vietnam war the hippie culture in America exploded with hundreds and thousands of youngsters adapting this new way of life. Interestingly at the same time more and more cults started to develop all across America, some of them were religious while the others not so much. Moving into the 60s and 70s cults like Manson Family, Children of God, The Peoples Temple Church and the Heaven’s Gate started to become quite famous among the masses and pretty soon there was a new cult starting in every state of the country. Among many such entities was one called 3HO, an organisation that used one of the oldest and most followed religions in the world for its own sick purposes.\n\nThis is the story of how a cult turned capitalistic corporation hijacked American Sikhism.\n\nWell then let’s get into it!!\n\nYogi Bhajan- The Guru:\n\nSo before getting into the details of the organisation let’s first talk about the man behind it all. Yogi Bhajan was born as Harbajhan Singh Khalsa on 26th August, 1929 into a pretty well off Sikh family. His family moved to Delhi after partition from where Yogi got his master’s degree in economics. In 1953 he started a government job in the country\u0027s revenue department, eventually getting promoted to  a customs officer at Delhi Airport. This was the time when he started learning Sikhism from Baba Virsa Singh at the Gobind Sadan Institute.\n\nIn 1968 Yogi moved to Toronto and without wasting a minute he got to work. Within three months he started teaching Yoga all over the city, co-founded a yoga centre and helped setting the base of the first Sikh Temple in Eastern Canada. A year later he moved to America and established the 3HO Foundation in Los Angeles to officially introduce his style of Sikhism to the American public!\nHe claimed himself to be this religious figure back home and that he was this kind of Messiah that was sent to free these people from the animalistic approach they had towards life. He claimed that he had been given the knowledge about Kundalini from its oldest known master. He told his followers that he had to ride a helicopter to the rural parts of India where he had to kneel in front of the mouth of a cave for 3 three days before the master finally agreed to teach him Kundalini.\n\nKundalini Yoga:\nNow what exactly is Kundalini yoga?\nThe word Kundalini is the feminine form for the Sanskrit word “coiled” or “snake-like”. Kundalini refers to a form of divine feminine energy that lies at the base of the spine and can be released through a series of deep and rapid breathing exercises. Basically Kundalini is a form of yoga that is predominantly used by Hindu gurus and has its basis in ancient hinduism teachings. It appeals to its followers by giving them a hope of taking complete control of their mind and body while becoming completely free of any form of desire.\n\n3HO-the cult:\n\nNow that you know about Kundalini yoga let’s move on. So the name 3HO, means the Healthy, Happy, Holy organisation. Well the motto of this organisation was simple, to introduce the westerners with a new way of life that keeps them in touch with religion; which was Sikhism in this case and teaches them how to be healthy and happy without worrying about the worldly materialistic problems. Now as i have already told you luckily for Yogi this was the time when hippie culture in America especially in LA was at top. So Yogi made these young hippies his target audience.\nMost of his early converts were these people and to be honest they were quite happy and comfortable with this form of Sikhism. Now for instance some of the key practices in Yogi’s organisation were to not cut one’s hair or beard, similarly all of his followers had to strictly follow vegetarianism. These sorts of things were already popular in hippie culture so naturally they didn’t have much issue adjusting in the 3HO. Other than this both men and women had to wear turbans at all times and only wear white colour. Additionally in order to be a Sikh and member of 3HO you had to strictly stay away from all sorts of recreational drugs, alcohol and tobacco. All of this was further strengthened by regular yoga classes, meditation and other forms of spiritual learning. In short Yogi had successfully given a lot of young people a sense of purpose and belief.",
      "release": "2024-04-17T12:30:07Z",
      "duration": "00:13:28",
      "explicit": false,
      "youTubeId": "14YuBxcQP5k",
      "subjects": [
        "3HO",
        "Sikhism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=14YuBxcQP5k"
      }
    },
    {
      "id": "b687305a-11da-4e9b-bc22-1db0817b6575",
      "title": "Child Abuse CULT Believed to Be Operated By CIA || THE FINDERS CULT",
      "description": "https://www.youtube.com/channel/UCyXoV3CmTPpreZJhhHf3-sQ? sub_confirmation=1\n\nThe Finders came to wider public attention when two members of the movement were arrested in Tallahassee, Florida in 1987 and charged with misdemeanor child abuse of the six children accompanying them, the two men having remained silent when, in a public park, the police inquired as to their identity and relationship to the children. The men were Douglas Ammerman and James Michael Holwell, both described as \u0022well-dressed men in suits.\u0022 They used a van to transport \u0022six scruffy, hungry children\u0022 of varying ages between 2 and 11.\n\nThe two oldest children, referred to as \u0022Mary\u0022 and \u0022Max\u0022, were interviewed by law enforcement, as the others were too young to properly communicate. It was noted that medical examinations of the children showed signs of sexual abuse and malnutrition, as well as bite marks potentially belonging to an adult human. During the interview as well as eyewitness testimony from neighbors, it was discovered that the children were raised on a farm belonging to Pettie with little adult supervision, with there being twenty adults and one other child present. The younger children were observed to display behavior indicating they were not used to being in a house or using indoor plumbing, requesting to go outside to use the bathroom, or urinating in their pants (noted to lack underwear). \u0022Max\u0022 had a poor concept of time. They explained that they were being “weaned” from their mothers and were rarely allowed inside the house, even sleeping outside. Neighbors observed that the children apparently lived in the farm’s watermelon field. Mary described Ammerman and Holwell as their \u0022teachers\u0022, teaching them to read and \u0022play games\u0022. One game involved disrobing a man, wearing his clothes, and going through his pockets for money (she later revised her statement and asserted that only jackets were involved). The two reported seeing female members of the cult naked and believed this to be another game as well. When questioned about \u0022bad touches\u0022 Mary denied sexual abuse but \u0022became very fidgety and wanted to end the interview.\u0022 At another Finders farm in Virginia, agents recorded cages on the premises, with witnesses asserting they were used to keep children. As of 2022, the full medical and psychological reports are not available for public viewing.\n\nAccording to U.S. District Court records in Washington, a confidential police source had previously told authorities that the Finders were \u0022a cult\u0022 that conducted \u0022brainwashing\u0022 techniques at a warehouse and a Glover Park duplex raided by law enforcement. This source told of being recruited by the Finders with promises of \u0022financial reward and sexual gratification\u0022 and of being invited by one member to \u0022explore\u0022 satanism with them, according to the documents. Police sources said some of the items seized showed pictures of children engaged in what appeared to be \u0022cult rituals.\u0022 Officials of the U.S. Customs Service said that the material seized included photos showing children involved in bloodletting ceremonies of animals and one photograph of a child in chains. It was noted by a detective during the investigation that documents were discovered with detailed instructions about methods to obtain children for unspecified purposes (including the impregnation of female members of the community, purchasing, trading, and kidnapping), but neither the documents nor anyone else with knowledge of them could later be found.\n\nRobert Gardner Terrell, who owned one of the raided properties, claimed ″We are rational people ... not devil worshipers or child molesters″ and ″anything we’ve done is based on the desire for the children to have the richest life they could have.″ According to Terrell, the recovered photos of naked children were of Holwell’s own children, and the dead goats shown in the photos mentioned by the Customs Service were already butchered with the children being taught how to prepare them. The men were released six weeks later, with the state of Florida dropping all charges against them.\n\nThe Finders leader Robert Terrell publicly gathered with members at the Vietnam Memorial Park in Tallahassee to speak with members of the press and give the public an opportunity to meet the group personally in order \u0027to dispel the bad image bestowed on the group by law enforcement and the media\u0027.\n\nFederal authorities concluded that there was no evidence of criminal activity, with it being noted that, although more could have been done for the children, it was difficult to compile accurate information with what knowledge they did have of their lifestyle only being able to be judged subjectively. The authorities contacted the mothers of the children, who came to Tallahassee and retrieved them.\n\n#cult",
      "release": "2024-04-14T12:30:07Z",
      "duration": "00:13:15",
      "explicit": false,
      "youTubeId": "aLN1eqT0id8",
      "subjects": [
        "The Finders"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aLN1eqT0id8"
      }
    },
    {
      "id": "f68e4c68-998f-4a81-84a7-3c5266261631",
      "title": "Horrifying Story Of The Sarah Lawrence Sex Cult",
      "description": "https://www.youtube.com/channel/UCyXoV3CmTPpreZJhhHf3-sQ? sub_confirmation=1\n\nThe “Sickening” Story of the Sarah Lawrence Sex Cult\nIn February 2020, Lawrence V. Ray, a sixty year old con man, was charged with fifteen\ncounts of extortion, mental manipulation, conspiracy, sex trafficking, abuse, forced labor, and\nsome other very serious offenses. For almost ten years, Lawrence Ray, more commonly\nknown as Larry Ray, lived with seven to ten young college going students in their dorm, but\nmind you, this wasn’t just any usual living setting. Ray was constantly controlling every\naspect of the lives of these young students, and soon all of it turned into a sex cult!\nSo what exactly happened? Who really was this Larry Ray? And why was he even allowed\nto live with the students? But the most important question is how for almost ten years he was\nable to manipulate these youngsters?\nThis is the sickening story of the Sarah Lawrence Sex Cult, so buckle because this will keep\ngetting more and more weird!\nWho was Larry Ray?\nBorn Lawrence Grecco in 1960 in New York City, Larry was definitely an interesting and\nunique personality from the very beginning. He started his career on Wall Street in the 1980s\nand then later went on to become a consultant for a number of different industries, ranging\nfrom insurance to construction. During the 90s Ray also worked in the gambling world, and\nthis was the time he got involved with all sorts of people in the mob. Ray didn’t have any\ncollege degrees, but there was something about him that helped him make connections with\nall sorts of people easily.\nAccording to a report by the New York Times Ray during the 80s and 90s, he also owned\nsome bars and nightclubs in New Jersey, and this was the time when he became friends\nwith people who were in higher positions, including Bernard Kerik, who later became\ncommissioner of the New York Police Department. However, before all the clubs, bars, and\ngambling, Ray had also served in the military, but his job in the American Air Force lasted\njust 19 days. According to the students that lived with him and through his own interviews,\nRay also spent some time working undercover for the CIA, but there has been no evidence\nto support his claims.\nAt this point, it seems quite strange how a man with a stable income and some pretty well\nconnected friends ended up becoming a criminal and a cult leader.\nTurbulence in person life:\nIn 1988, Larry married Teresa Ray, and for years, the marriage was pretty happy one.\nTogether, the couple welcomed two daughters into their lives, named Talia and Ava Ray. In\n2004, Teresa filed for divorce from Ray, even calling police on him, alleging that Ray had\nphysically hit her. However, when the police arrived, both Ray and his elder daughter Talia\ntold the police that Teresa was repeatedly abusing both children. After this accusation,\nthings got even worse, and Ray was given custody of both children.\nThe complaints about Teresa didn’t stop after this, and local police repeatedly received\nanonymous tips about Teresa and her relatives abusing the children. Ray even started a\nblog with all the details about the physical and mental abuse of historical children. However,\n\nwhen the police properly investigated these complaints, all of them turned out to be bogus,\nand it was proven that Ray was manipulating his children to lie to authorities about their\nmother.\nThe fight for custody continued for some years, and during this time Ray was even charged\nwith jumping his bail, interfering with child custody, and contempt of court because, despite\nthe orders from the judge, he failed to bring his daughters to their aunt on Thanksgiving\n2005.\nEventually Teresa was given custody of her children, but Talia was under so much\nmanipulation that she preferred living in shelters to living with her mother.",
      "release": "2024-04-10T18:21:21Z",
      "duration": "00:16:36",
      "explicit": false,
      "youTubeId": "pqvQSy3ugco",
      "subjects": [
        "Larry Ray"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pqvQSy3ugco"
      }
    },
    {
      "id": "1cdc2c43-f93d-40cf-b139-10e44758a89e",
      "title": "How This Man Exposed Sadistic Cult Created By Gay Porn Star after 22 Years  of Exploitation",
      "description": "https://www.youtube.com/channel/UCyXoV3CmTPpreZJhhHf3-sQ? sub_confirmation=1",
      "release": "2024-04-06T11:13:14Z",
      "duration": "00:16:40",
      "explicit": false,
      "youTubeId": "P4pe54Xu5Co",
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P4pe54Xu5Co"
      }
    }
  ]
}