{
  "id": "5adde6e2-f4ce-4351-b46f-57f1267a04d1",
  "name": "True Crime \u0026 Authors",
  "youTubeChannelId": "UCltdxSeFoFBqFqxq7G2apzw",
  "episodes": [
    {
      "id": "41704922-fbf5-43d5-a92c-e629047906f4",
      "title": "S2 EP6 From Cult to Career: Amber Powers\u0027 Journey of Liberation and Resilience",
      "description": "Source:\nhttps://www.spreaker.com/user/adaywithcrime/ep-amber-powers\n\nJourney with us as we cross paths with the extraordinary Amber Powers, whose life story reads like a best-selling novel. Born into a cult and living under an oppressive regime of fear and manipulation, Amber\u0027s tale is one of liberation, resilience, and self-discovery. Listen to her revealing account of a childhood steeped in fear-based theology, intricate cult control tactics, and her daring escape that led her to freedom.\n \nAmber’s story of transformation from a captive to an entrepreneur and author is nothing short of breathtaking. Her faith in God and connection to Jesus remained her guiding force, even amidst the tumultuous times that followed her departure from the cult. With an unyielding spirit, she navigated the aftermath of a shattered life and embraced a journey of self-discovery, leading to an inspiring path of career success.\n \nIn her entrepreneurial voyage, Amber founded Powers Digital Marketing and her latest venture, Shop From Her. A platform dedicated to the empowerment of women entrepreneurs, Amber’s vision is to bridge the gender gap in business. She is on a mission to create an app that supports women-owned businesses globally, turning her tumultuous past into a beacon of hope and empowerment. Her remarkable journey serves as a testament to the strength of the human spirit and the power of faith and resilience.\n\nhttps://www.truecrimeandauthors.com/blog/from-cult-to-career-a-journey-of-liberation-and-resilience/for the Blog Post for the Episode\n\nTime Line\n\n(0:00:00) - Escaping Cults and Finding Strength \n(0:10:45) - Fear-Based Theology and Cult Control \n(0:19:37) - Escaping a Manipulative Cult\n(0:29:51) - Emotional Affairs, Self-Discovery, and Career Success \n(0:36:27) - Supporting Women in Business Platform\n\nAbout Amber Powers\n\nAfter escaping the grips of a cult, even losing two family members in the Jonestown Massacre, Amber Powers found herself adrift and isolated.\nAfter being groomed into marriage at a young age, she started to doubt her entire existence. With immense courage, she bravely chose to leave behind her childhood beliefs, her spouse, her church community, her lifelong companions, and even some family members.\n\nAmber is a shining example of resilience and strength. She dared to dismantle the falsehoods she once embraced as truths and emerged a successful entrepreneur who is dedicated to helping others bravely embrace their voice and their purpose, regardless of their past.\u0022\n\nAmber Powers is both the President of Powers Digital Marketing and the Founder of Shop From Her, a startup intended to cause consumers and businesses to consciously choose to buy or hire from a woman-owned business. She has over 22 years of marketing experience and has successfully led her marking firm, specializing in creating and nurturing ethical influencers, since 2014.\n\n\nAmber\u0027s https://www.powersdigitalmarketing.com\n\nDON\u0027T FORGET TO RATE, COMMENT AND SUBSCRIBE\n\nJOIN ME ON SOCIAL MEDIA BY FOLLOWING THE https://linktr.ee/davidmcclam\n\nSIGN THE DEEP DARK SECRETS PETITION https://www.change.org/p/enforce-federal-obscenity-laws-in-the-united-states?recruiter=1286778319\u0026amp;recruited_by_id=a5f40ee0-6a95-11ed-8607-194ca90c9229\u0026amp;utm_source=share_petition\u0026amp;utm_campaign=share_petition\u0026amp;utm_medium=copylink\u0026amp;utm_content=cl_sharecopy_35053550_en-US%3A7\n\nVISIT THE SHOWS SPONSOR’S KATScreations614 use code TRUECRIME10 for 10% Discoount\n\nDeep Dark Secrets with LaDonna Humphrey\n\nCover Art and Logo created byArslan (Moazzam) From Fiverr\n\nSound Mixing and editing by David McClam\n\nIntro script by Sophie Wild From Fiverr \u0026amp; David McClam\n\nIntro and outro jingle byJacqueline G. (JacquieVoice) From Fiverr",
      "release": "2023-10-11T06:18:55Z",
      "duration": "00:50:19",
      "explicit": false,
      "youTubeId": "Hu2TAIWF9zg",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Hu2TAIWF9zg"
      }
    }
  ]
}