{
  "_ts": 0,
  "id": "0f78cfc8-5126-40b4-8824-51b7d3d2222e",
  "name": "True Crime Conversations",
  "spotifyId": "31jNJsdwsa2GHrjiPFcfq2",
  "appleId": 1469153910,
  "youTubeChannelId": "UCz90sqM_NXGDWx34HV84xtw",
  "episodes": [
    {
      "id": "c883c413-21ae-47af-bd3f-168cb359cd76",
      "title": "Tortured \u0026 Brainwashed: How Ben Shenton Survived Australia’s Most Disturbing Cult",
      "description": "At just 18 months old, Ben Shenton was handed over to a woman who claimed she was the reincarnation of Jesus Christ. That woman was Anne Hamilton-Byrne, the leader of a secretive doomsday cult called The Family. For 14 years, Ben lived cut off from the outside world—beaten, starved, drugged, and taught to stay “unseen, unheard, unknown.” The cult twisted Christianity into a tool of fear and control. Ben was finally rescued at age 15 during a police raid. Today, he’s an advocate for survivors and a pastor who still follows the teachings of Jesus Christ, just not the version the cult tried to force on him. You can find Ben’s website, Rescue the Family, here , and his book Life Behind the Wire here . CREDITS Guest: Ben Shenton Host: Claire Murphy Producer: Tahli Blackman Audio Producer: Jacob Round GET IN TOUCH Want us to cover a case on the podcast? Email us at truecrime@mamamia.com.au or send us a voice note. Rate or review us on Apple by clicking on the three dots in the top right-hand corner, click Go To Show, then scroll down to the bottom of the page, click on the stars at the bottom and write a review. You can also leave a comment for us on Spotify. If any of the contents in this episode have caused distress, know that there is help available via Lifeline on 13 11 14 or Beyond Blue on 1300 22 4636. We acknowledge the Traditional Owners of the Land we have recorded this podcast on, the Gadigal people of the Eora Nation. We pay our respects to their Elders past and present and extend that respect to all Aboriginal and Torres Strait Islander cultures.",
      "release": "2025-05-07T21:51:07Z",
      "duration": "00:52:54.6610000",
      "explicit": false,
      "spotifyId": "1u0g383BLKEzpCwLXDArKh",
      "appleId": 1000706726056,
      "youTubeId": "Bz-zkh86Q3g",
      "subjects": [
        "Santiniketan Park Association"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1u0g383BLKEzpCwLXDArKh",
        "apple": "https://podcasts.apple.com/podcast/tortured-brainwashed-how-ben-shenton-survived-australias/id1469153910?i=1000706726056",
        "youtube": "https://www.youtube.com/watch?v=Bz-zkh86Q3g"
      }
    },
    {
      "id": "354cf5f4-b7ea-4608-982c-d51f2daa69e4",
      "title": "A Doomsday Cult And Two Missing Kids",
      "description": "In November 2019, police conducted a welfare check on seven-year-old JJ Vallow. He hadn\u0027t been seen since September, and police will come to realise that neither had his teenage sister Tylee. They\u0027ve stumbled onto a web of lies that are about to unravel. Affairs, mysterious deaths, a doomsday cult, and at the centre of it all two missing children. And a mother who isn’t trying to find them. THE END BITS Subscribe to Mamamia CREDITS Guest: Leah Sottile, author of When The Moon Turns To Blood And host of the Two Minutes Past Nine and Bundyville podcasts. Host: Gemma Bath Executive Producer: Gia Moylan Audio Producer: Rhiannon Mooney GET IN TOUCH: Feedback? We’re listening! Email us at truecrime@mamamia.com.au If any of the contents in this episode have caused distress, know that there is help available via Lifeline on 13 11 14 or Beyond Blue on 1300 22 4636 Mamamia acknowledges the Traditional Owners of the Land we have recorded this podcast on, the Gadigal people of the Eora Nation. We pay our respects to their Elders past and present and extend that respect to all Aboriginal and Torres Strait Islander cultures.",
      "release": "2024-12-27T18:30:00Z",
      "duration": "00:51:15.8660000",
      "explicit": false,
      "spotifyId": "0mGWS7ZSy8CPaeoA55bKHD",
      "appleId": 1000681880605,
      "youTubeId": "8QxHKKKCZpY",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0mGWS7ZSy8CPaeoA55bKHD",
        "apple": "https://podcasts.apple.com/podcast/a-doomsday-cult-and-two-missing-kids/id1469153910?i=1000681880605",
        "youtube": "https://www.youtube.com/watch?v=8QxHKKKCZpY"
      }
    },
    {
      "id": "f915b948-29a7-4ab5-9a3e-a6eadaadaefa",
      "title": "Tia Levings Escaped A Trad Wife Cult",
      "description": "Tia Levings was raised within the same strict Christian fundamentalist ideology as the infamous Duggar family from 19 Kids And Counting. By the time she was 19 years old, Tia found herself in an abusive marriage where the violence was sanctioned by the church. In this must-listen episode of No Filter, Tia tells Mia Freedman about the ways she was groomed to be a Trad Wife, and the moment she knew she had to run for her life. This is a story of indoctrination and survival, of reinvention and strength…but it is also about the thousands of other women who haven’t escaped the Trad Wife movement, and the new ones who are joining every day. You can hear the second half of Mia\u0027s conversation with Tia here. You can find out more about Tia and her book, A Well Trained Wife, here . You can follow her on Instagram here. And if you need to talk to someone, call Lifeline on 13 11 14. THE END BITS: Subscribe to Mamamia Listen to more No Filter interviews here and follow us on Instagram here. Discover more Mamamia podcasts here . Feedback: podcast@mamamia.com.au Share your story, feedback, or dilemma! Send us a voice message , and one of our Podcast Producers will come back to you ASAP. Rate or review us on Apple by clicking on the three dots in the top right-hand corner, click Go To Show then scroll down to the bottom of the page, click on the stars at the bottom and write a review. CREDITS: Host: Mia Freedman You can find Mia on Instagram here and get her newsletter here. Executive Producer: Naima Brown Audio Producer: Leah PorgesMamamia acknowledges the Traditional Owners of the Land we have recorded this podcast on, the Gadigal people of the Eora Nation. We pay our respects to their Elders past and present, and extend that respect to all Aboriginal and Torres Strait Islander cultures.",
      "release": "2024-12-25T18:30:00Z",
      "duration": "00:47:20.2670000",
      "explicit": false,
      "spotifyId": "6sjGQ9FJUIbLsoXN8GoiSR",
      "appleId": 1000681675676,
      "youTubeId": "x7uU5iHY4Dc",
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6sjGQ9FJUIbLsoXN8GoiSR",
        "apple": "https://podcasts.apple.com/podcast/tia-levings-escaped-a-trad-wife-cult/id1469153910?i=1000681675676",
        "youtube": "https://www.youtube.com/watch?v=x7uU5iHY4Dc"
      }
    },
    {
      "id": "7272aad4-f781-4926-9b09-804d9e60aab8",
      "title": "Inside One Of Australia’s Longest Running Cults",
      "description": "The Geelong Revival Centre, one of Australia’s longest-running cults, has been hiding in plain sight for years. Led by Pastor Noel Hollins until his death in 2024, the ultra-conservative church controls every aspect of its followers\u0027 lives. For the past two years, investigative journalist Richard Baker has collected disturbing audio recordings from Hollins and testimonies from survivors. They’ve told him stories of alleged physical and sexual abuse, emotional stories of families being torn apart by strict rules and disturbing allegations of medicine being banned. Due to legal constraints, he’s been unable to share it… until now. You can listen to Richard\u0027s podcast Secrets We Keep: Pray Harder here . THE END BITS Subscribe to Mamamia CREDITS Guest: Richard Baker Host: Gemma Bath Producer: Tahli Blackman Audio Producer: Jacob Round GET IN TOUCH Feedback? We’re listening! Email us at truecrime@mamamia.com.au If any of the contents in this episode have caused distress, know that there is help available via Lifeline on 13 11 14 or Beyond Blue on 1300 22 4636. Mamamia acknowledges the Traditional Owners of the Land we have recorded this podcast on, the Gadigal people of the Eora Nation. We pay our respects to their Elders past and present and extend that respect to all Aboriginal and Torres Strait Islander cultures.",
      "release": "2024-12-22T18:30:00Z",
      "duration": "00:44:56.9330000",
      "explicit": false,
      "spotifyId": "3GFJQ16J2pCKPW8aDaY9Ky",
      "appleId": 1000681324767,
      "youTubeId": "qLaK8srLG48",
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3GFJQ16J2pCKPW8aDaY9Ky",
        "apple": "https://podcasts.apple.com/podcast/inside-one-of-australias-longest-running-cults/id1469153910?i=1000681324767",
        "youtube": "https://www.youtube.com/watch?v=qLaK8srLG48"
      }
    },
    {
      "id": "6f7bc0c0-ccf6-485a-a5d3-7b3cbac5e7f5",
      "title": "Escaping One Of Australia\u0027s Most Secretive Cults",
      "description": "Laura McConnell grew up in a fundamentalist sect with no name. Along with no official title, the group also claims to have no registration around the world, no formal hierarchy, and no official places of worship. According to Laura, it\u0027s this secrecy and denial that has allowed abuse to flourish within the community. She joins us today to expose what she witnessed and experienced inside the group she calls The Truth. THE END BITS Subscribe to Mamamia Want to try our new exercise app? Click here to start a seven-day free trial of MOVE by Mamamia. CREDITS Guest: Laura McConnell Host: Gemma Bath Executive Producer: Gia Moylan Audio Producer: Scott Stronach GET IN TOUCH: Feedback? We’re listening! Call the pod phone on 02 8999 9386 or email us at truecrime@mamamia.com.au If any of the contents in this episode have caused distress, know that there is help available via Lifeline on 13 11 14 or Beyond Blue on 1300 22 4636 Mamamia acknowledges the Traditional Owners of the Land we have recorded this podcast on, the Gadigal people of the Eora Nation. We pay our respects to their Elders past and present and extend that respect to all Aboriginal and Torres Strait Islander cultures.",
      "release": "2024-02-14T18:00:00Z",
      "duration": "00:51:11.2940000",
      "explicit": false,
      "spotifyId": "7MOQU1G40GvIPwSYGixua3",
      "appleId": 1000645341937,
      "youTubeId": "VKQeTxaqZR4",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MOQU1G40GvIPwSYGixua3",
        "apple": "https://podcasts.apple.com/podcast/escaping-one-of-australias-most-secretive-cults/id1469153910?i=1000645341937",
        "youtube": "https://www.youtube.com/watch?v=VKQeTxaqZR4"
      }
    }
  ]
}