{
  "id": "e29aedf2-ddee-4e32-b033-bffe9c37b6e1",
  "name": "True Crime Today  | A True Crime Podcast",
  "spotifyId": "0GYshi6nJCf3O0aKEBTOPs",
  "appleId": 1504280230,
  "episodes": [
    {
      "id": "c9dad113-c3d6-4f16-9d33-b74e29995cc3",
      "title": "The Unraveling of Lori Vallow Daybell",
      "description": "The Unraveling of Lori Vallow Daybell Lori Vallow Daybell has spent years spinning her own version of events, but in an Arizona courtroom on Tuesday, the judge wasn’t buying it. Already convicted and sentenced to life in prison for the murders of her two children, JJ Vallow and Tylee Ryan, and for conspiring to kill her husband’s first wife, Tammy Daybell, Lori is now facing more charges—this time in Arizona. She’s accused of murdering her fourth husband, Charles Vallow, and conspiring to kill her niece’s ex-husband, Brandon Boudreaux. And if Tuesday’s hearing was any indication, things aren’t exactly going in her favor. Lori, representing herself, started by asking the judge to ban cameras from the courtroom, arguing that the media coverage of her case has been “inherently prejudicial.” She specifically called out Court TV, claiming their coverage has falsely shaped public perception and turned her into some kind of spectacle. Judge Justin Beresky listened but made it clear he was leaning toward allowing a single camera with restrictions—no zooming in on notes, just a straightforward courtroom feed. Then Lori moved on to jury selection, requesting that potential jurors be questioned individually instead of in groups. She claimed her previous trial in Idaho required screening nearly 2,000 jurors and worried that people would try to get on this jury just for the attention. The judge didn’t seem convinced that a change was necessary but took her concerns under advisement. One of the biggest blows to Lori’s defense came when she tried to introduce statements from her brother, Alex Cox, as evidence. Cox, who shot and killed Charles Vallow in 2019, initially claimed self-defense, but Lori wanted his statements admitted in court. The judge shut that down quickly, ruling that not only were the statements hearsay, but Lori—having been convicted of conspiring in Cox’s actions—was legally prohibited from using his words as evidence in her defense. Lori also pushed for additional evidence from the prosecution, demanding access to certain police recordings and conversations that she claimed exist. The judge told prosecutors to check again but made it clear that if they said they didn’t have the material, he couldn’t force them to produce it. Then came the issue of time. With jury selection set for March 31, Lori reminded the court that her speedy trial deadline was May 11 and insisted that the trial needed to move forward within that time frame. But Judge Beresky overruled her, waiving the deadline over her objection and pointing out that both sides had acknowledged the impossibility of trying two complex cases at once. The next hearing is set for March 18, where both sides will argue over remaining issues, including whether Lori can bring in a digital forensics expert for her defense. But after Tuesday’s hearing, one thing is clear—Lori may be running the show in her own mind, but in court, she’s losing control fast. #LoriVallow #DoomsdayMom #TrueCrime #Justice Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-03-12T11:00:00Z",
      "duration": "00:15:49.3680000",
      "explicit": false,
      "spotifyId": "7yK9jP2vhu9cUUQDZHEdHY",
      "appleId": 1000698873944,
      "youTubeId": "FoqVoxVX5WI",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7yK9jP2vhu9cUUQDZHEdHY",
        "apple": "https://podcasts.apple.com/podcast/the-unraveling-of-lori-vallow-daybell/id1504280230?i=1000698873944",
        "youtube": "https://www.youtube.com/watch?v=FoqVoxVX5WI"
      }
    },
    {
      "id": "88152e10-fda5-4148-a6ef-f0852146bfac",
      "title": "Breaking Down The Beliefs of Chad \u0026 Lori Vallow Daybell Part 1 How It Started",
      "description": "Breaking Down The Beliefs of Chad \u0026 Lori Vallow Daybell Part 1 How It Started ORIGINS \u0026 BELIEF DEVELOPMENT The story of Chad Daybell and Lori Vallow didn’t start with murder—it started with faith twisted into fanaticism. In this episode, we explore the LDS Church’s core beliefs, how mainstream Mormonism views prophecy and the Second Coming, and how Chad and Lori veered from religious devotion into dangerous extremism. Chad’s near-death experiences convinced him he had access to divine knowledge, while Lori’s obsession with end-times prophecy led her to believe she was a goddess chosen to gather the righteous. How did a simple belief in personal revelation and spiritual preparedness turn into an apocalyptic worldview that justified murder? We break down Chad’s early writings, his rise in LDS prepping circles, and how fiction became fact in his mind. We also examine Lori’s transformation from a devoted Mormon mother to a self-proclaimed leader of the 144,000. By tracking their path from faith to fanaticism, we expose the psychological and religious factors that led them to classify people as “light” or “dark,” ultimately determining who lived and who died. Through expert analysis and firsthand accounts, this episode lays the groundwork for understanding how a dangerous cult ideology took root within the framework of a mainstream religion. How did their beliefs develop? What warning signs were ignored? And could this have been stopped before it spiraled into murder? Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-03-04T23:00:00Z",
      "duration": "00:36:19.7870000",
      "explicit": false,
      "spotifyId": "70A6XlW5wTohAP2x26MgY3",
      "appleId": 1000697736252,
      "youTubeId": "isLKtVPz_SQ",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/70A6XlW5wTohAP2x26MgY3",
        "apple": "https://podcasts.apple.com/podcast/breaking-down-the-beliefs-of-chad-lori-vallow/id1504280230?i=1000697736252",
        "youtube": "https://www.youtube.com/watch?v=isLKtVPz_SQ"
      }
    },
    {
      "id": "9232c6b4-c64e-43b4-8467-46cf01b10edc",
      "title": "Kevin Franke Finally Speaks Out The Truth About Ruby Franke’s Abuse",
      "description": "Kevin Franke Finally Speaks Out The Truth About Ruby Franke’s Abuse\nWas Kevin Franke a victim of manipulation, or did he knowingly turn a blind eye while his children suffered? The Ruby Franke case has left many stunned, but the focus now shifts to her husband, Kevin—a man who still claims to love the woman who tortured their children. While he insists he was a victim of religious coercion and extreme psychological control, many argue he was complicit, neglectful, and far too passive.\n\nWith a new Hulu documentary shedding light on his role, Kevin is scrambling to explain his inaction. Was he brainwashed by the cult-like influence of Jodi Hildebrandt and the rigid authority of his faith? Or was he just a man too weak to stand up for his own kids? And now that he\u0027s seeking custody, should the courts even consider giving it to him?\n\n#RubyFranke #KevinFranke #JodiHildebrandt #TrueCrime #CultMentality #ChildAbuse #HiddenKillers\n\nWant to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj\nFollow Our Other Cases: https://www.truecrimetodaypod.com\nThe latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-03-04T18:00:00Z",
      "duration": "00:12:25",
      "explicit": false,
      "spotifyId": "1l3NoTBQOAWLwpAXQKLa0H",
      "appleId": 1000697688404,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1l3NoTBQOAWLwpAXQKLa0H",
        "apple": "https://podcasts.apple.com/podcast/kevin-franke-finally-speaks-out-the-truth-about-ruby/id1504280230?i=1000697688404"
      }
    },
    {
      "id": "f506f937-505a-4979-80aa-350562ae4a21",
      "title": "Convicted YouTuber Ruby Franke Left Journal Detailing Abuse of Her ‘Demonic’ Children",
      "description": "Convicted YouTuber Ruby Franke Left Journal Detailing Abuse of Her ‘Demonic’ Children Before Ruby Franke, the infamous YouTube mom behind the \u00228Passengers\u0022 channel, pleaded guilty to child abuse charges, authorities uncovered something chilling—a handwritten journal detailing the suffering she inflicted on her own children. In it, she described acts of cruelty with a detachment that made even seasoned investigators pause. As revealed in Hulu’s new docuseries Devil in the Family: The Fall of Ruby Franke, a police investigator reads from the journal, bringing Franke’s own words into the open. One entry is particularly disturbing: \u0022Sleep outside, shaved her head, doused her with water, over his nose and mouth, head in the toilet, needs to be painful. Blood on his face, scream and scream.\u0022 Another entry is no less horrifying: \u0022I told the boy, he emulates a snake. If he wants to emulate the Savior, he needs to be a hundred percent obedient with exactness. The body must engage in good work and the good works need to be painful. I have the power of God and he must obey.\u0022 The extent of the abuse detailed in these pages is staggering. In one passage, Franke wrote about forcing her son into the sun, then returning with a \u0022cactus poker\u0022 to prod him. She recorded her own twisted logic: \u0022When I poke his back to get in the sun, he doesn’t even flinch. I told him, give your demon friend a message for me. I will not rest. I will not stop. I will not leave. I will fight him until the day you die.\u0022 These weren’t the ramblings of someone suffering a temporary lapse in judgment. They were calculated. Premeditated. Written down as if she was keeping a ledger of pain. In August 2023, it all came to an end when Franke’s 12-year-old son escaped from the home she shared with her business partner, Jodi Hildebrandt. Starving, injured, and desperate, he ran to a neighbor and pleaded for help. The neighbor, moved to tears by the boy’s skeletal appearance, called 911. Soon after, authorities discovered his 9-year-old sister inside Hildebrandt’s home in an equally horrific condition. Franke and her husband, Kevin, had gained a massive following through \u00228Passengers,\u0022 where their brand of strict, authoritarian parenting was often defended as tough love. Their content, which amassed over 2 million subscribers, frequently walked the fine line between discipline and outright cruelty. YouTube ultimately shut down the channel after Franke’s arrest. Kevin Franke was not charged in connection with the abuse. Jodi Hildebrandt, Franke’s business partner and a former therapist, only made things worse. The founder of the so-called \u0022ConneXions\u0022 program, a religious-based self-help movement, Hildebrandt reportedly encouraged extreme parenting methods, preying on vulnerabilities within the Mormon community. According to a therapist featured in the docuseries, Hildebrandt \u0022was excellent at exploiting Mormon anxiety.\u0022 Her influence, combined with Franke’s already dangerous beliefs, created a toxic and violent environment for the children trapped in their care. Both Franke and Hildebrandt pleaded guilty to four counts of aggravated child abuse. Their sentences—ranging from four to 30 years—will be decided by the Utah Board of Pardons and Parole. At her sentencing, Franke broke down in tears, addressing her children directly. \u0022I will never stop crying for hurting your tender souls,\u0022 she said. But the damage was already done. Devil In The Family: The Fall of Ruby Franke is now streaming on Hulu. #TrueCrime #RubyFranke #8Passengers #ChildAbuse Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-03-04T12:00:00Z",
      "duration": "00:22:07.4640000",
      "explicit": false,
      "spotifyId": "4PiAF7oQwI4bEvrN3dU3gp",
      "appleId": 1000697628242,
      "youTubeId": "0caz6_5qnPo",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4PiAF7oQwI4bEvrN3dU3gp",
        "apple": "https://podcasts.apple.com/podcast/convicted-youtuber-ruby-franke-left-journal-detailing/id1504280230?i=1000697628242",
        "youtube": "https://www.youtube.com/watch?v=0caz6_5qnPo"
      }
    },
    {
      "id": "9176785c-1ebf-4aa6-bdeb-0b3595caf2fe",
      "title": "Kevin Franke Speaks Out on Ex-Wife Ruby Franke’s Crimes: ‘I Have Regrets’",
      "description": "Kevin Franke Speaks Out on Ex-Wife Ruby Franke’s Crimes: ‘I Have Regrets’ Kevin Franke, the estranged husband of disgraced parenting influencer Ruby Franke, is breaking his silence following her conviction for child abuse. In a new interview, he admitted that he trusted his wife and her business partner, Jodi Hildebrandt, despite mounting concerns about their extreme parenting methods. “The bottom line is: I was choosing to trust a licensed professional mental health counselor and my wife, and they gave some terrible counsel,” Franke told Good Morning America. “And I have regrets. And I wish I hadn’t done those things.” Ruby Franke, 43, was once a celebrated mommy blogger with over 2.5 million subscribers on her YouTube channel, 8Passengers. Alongside Hildebrandt, she later founded ConneXions Classrooms, a parenting and lifestyle brand that offered paid counseling sessions and retreats. What was once a lucrative online business ultimately unraveled into a criminal case when authorities discovered two of Franke’s children malnourished and restrained in Hildebrandt’s home. The case shocked audiences familiar with Franke’s strict parenting style, which had already raised red flags. In one of her earlier 8Passengers videos, her eldest son Chad casually revealed that he had been forced to sleep on a beanbag for seven months as punishment. After losing sponsors and facing backlash, Franke shifted to working with Hildebrandt, who encouraged even harsher parenting methods. In one resurfaced video from ConneXions Classrooms, Franke told parents, “If your child comes to you on fire, you don’t pat them on the head and say, ‘It’s OK, I’ll help you.’ No, you beat them, and you kick them, and you hit them with a rod.” Kevin Franke, a professor and father of six, said he was unaware of the extent of the abuse but now acknowledges that his wife’s actions were dangerous. He last saw his children more than a year before Ruby’s arrest in August 2023. The abuse allegations surfaced when Franke’s 12-year-old son escaped from Hildebrandt’s $5.3 million home in Ivins, Utah. The child, severely malnourished and bound with duct tape, ran to a neighbor for help, prompting an immediate police response. Authorities discovered another one of Franke’s children, a 9-year-old girl, in similarly horrific condition. The case revealed years of disturbing practices, with Franke’s eldest daughter, Shari, previously attempting to alert child services about the abuse. Both Ruby Franke and Jodi Hildebrandt pleaded guilty to four counts of aggravated child abuse and were sentenced to a minimum of 30 years in prison. Despite the horror of the case, Kevin Franke admitted that his feelings for Ruby are complicated. “I don’t think I’ll ever stop loving her,” he said. “Does that mean that I want to let her back into my life? Let her back into my kids’ lives? Absolutely not.” Kevin and his son Chad are now speaking out ahead of the release of Devil in the Family: The Fall of Ruby Franke, a new documentary detailing Ruby’s rise and fall. The documentary includes never-before-seen clips of Franke’s aggressive outbursts, painting a stark contrast to the polished image she portrayed online. Reflecting on the dangers of social media, Kevin Franke is now urging parents to reconsider exposing their families to the public eye. “There is real danger when you place yourself, or your family, your children, out onto public social media,” he warned. The case has ignited broader discussions about parenting influencers, the ethics of monetizing family life, and the potential dangers of unregulated online advice. While Franke and Hildebrandt marketed their content as guidance for struggling parents, their convictions highlight the dark side of influencer culture, where financial incentives can overshadow child welfare. #KevinFranke #RubyFranke #JodiHildebrandt #TrueCrime #8Passengers #ConneXions #ParentingScandal Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-02-26T12:00:00Z",
      "duration": "00:32:08.3850000",
      "explicit": false,
      "spotifyId": "3FXzSuwGh6WyH2WRoYwkpf",
      "appleId": 1000696227647,
      "youTubeId": "mGmcczCBgig",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3FXzSuwGh6WyH2WRoYwkpf",
        "apple": "https://podcasts.apple.com/podcast/kevin-franke-speaks-out-on-ex-wife-ruby-frankes-crimes/id1504280230?i=1000696227647",
        "youtube": "https://www.youtube.com/watch?v=mGmcczCBgig"
      }
    },
    {
      "id": "a1b678c8-60dc-4195-9ebb-9255a222d1bf",
      "title": "Kevin Franke Still Loves Ruby Franke? Shocking Details from the New Documentary",
      "description": "The shocking downfall of YouTube’s 8 Passengers family took the world by storm when Ruby Franke and Jodi Hildebrandt were arrested for horrific child abuse. But one name has remained at the center of controversy—Kevin Franke. Was he an enabler who failed to protect his children, or was he just another victim of the psychological control wielded by Ruby and Jodi? In this deep-dive episode, we unravel the complex story behind Kevin Franke’s relationship with Ruby, his shocking admission that he still loves her, and the disturbing influence that led to the unraveling of their family. We’ll explore the timeline of events leading up to Ruby’s arrest, the extreme parenting methods she enforced, and the toxic mentorship of Jodi Hildebrandt, who many believe played a pivotal role in radicalizing Ruby. Kevin Franke’s decision to remain legally married long after the abuse was exposed raises questions—was he truly in the dark, or did he ignore the red flags for too long? With firsthand accounts, legal analysis, and public reactions, we examine the weight of his role in this tragic case. As Kevin fights for custody of his children, sues Jodi Hildebrandt, and tries to rebuild his life, the internet remains divided. Is Kevin Franke a father who failed his kids, or a man manipulated into silence? Join us as we break down the case, separate fact from speculation, and uncover the real story behind the headlines. Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-02-25T21:00:00Z",
      "duration": "00:20:42.3050000",
      "explicit": false,
      "spotifyId": "6bBAJu43MhZxS6eVHOtx64",
      "appleId": 1000695999911,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6bBAJu43MhZxS6eVHOtx64",
        "apple": "https://podcasts.apple.com/podcast/kevin-franke-still-loves-ruby-franke-shocking-details/id1504280230?i=1000695999911"
      }
    },
    {
      "id": "07783ca4-9ec1-4209-b48c-40302db43c6a",
      "title": "Unmasking Ruby Franke FBI Expert Robin Dreeke Breaks Down Shari Franke Memoir",
      "description": "Unmasking Ruby Franke FBI Expert Robin Dreeke Breaks Down Shari Franke Memoir Was family vlogging ever really about family—or was it just another way to cash in on childhood innocence? Ruby Franke, once the face of the popular YouTube channel Eight Passengers, crafted a wholesome image of family life—one that, according to her daughter, Sherry Franke, was a carefully curated front hiding something far darker. In her new memoir, The House of My Mother: A Daughter’s Quest for Freedom, Sherry pulls back the curtain on the alleged abuse and control that shaped her upbringing, exposing the chilling reality behind the perfectly edited videos. But Ruby wasn’t operating alone. Her husband, Kevin Franke, played his own role—one that raises serious questions about willful ignorance and blind loyalty. How does a father just step away from his family under the guise of “self-improvement” while another woman steps in to assume control? And what does it say when his return to reality comes with zero accountability? Retired FBI Special Agent Robin Dreeke joins the discussion, breaking down the psychological manipulation at play and the disturbing influence of Jodi Hildebrandt, the so-called therapist who only amplified Ruby’s obsession with control. As more former child influencers come forward about their experiences, the question remains—how many more kids are still trapped in this modern-day nightmare of parental exploitation disguised as entertainment? #TrueCrime #RubyFranke #EightPassengers #FamilyVlogging #KevinFranke #CultMentality #ChildExploitation Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-02-07T22:00:00Z",
      "duration": "00:17:27.0120000",
      "explicit": false,
      "spotifyId": "20HqG8EfHHYljeeUKq1EMw",
      "appleId": 1000690103141,
      "youTubeId": "ZCu1eRDvhbs",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20HqG8EfHHYljeeUKq1EMw",
        "apple": "https://podcasts.apple.com/podcast/unmasking-ruby-franke-fbi-expert-robin-dreeke-breaks/id1504280230?i=1000690103141",
        "youtube": "https://www.youtube.com/watch?v=ZCu1eRDvhbs"
      }
    },
    {
      "id": "1bf436d1-5ecd-45f4-9cd5-87a8b8446a27",
      "title": "Jodi Hildebrandt and Ruby Franke Accused of Fraud, Racketeering, and Ongoing Abuse in New Lawsuit",
      "description": "On this episode, we dig into the shocking new lawsuit against Jodi Hildebrandt and Ruby Franke, which alleges that their ConneXions empire isn’t dead—it’s still manipulating, isolating, and financially exploiting victims, even with its leaders behind bars. Filed by former client Michael Robert Tilleman, the lawsuit accuses Hildebrandt, Franke, and their network of running a racketeering operation disguised as therapy, using coercion and fear to control their followers. Even more disturbing, the lawsuit claims that ConneXions members continue to recruit and enforce Hildebrandt’s harmful teachings, with some cases of child abuse allegedly still occurring. How does a system like this survive without its leaders, and can it finally be dismantled? We break it all down. Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-02-04T18:10:00Z",
      "duration": "00:14:55.8690000",
      "explicit": false,
      "spotifyId": "1F13Gq5rQWbDVwcNmdPog2",
      "appleId": 1000688987623,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1F13Gq5rQWbDVwcNmdPog2",
        "apple": "https://podcasts.apple.com/podcast/jodi-hildebrandt-and-ruby-franke-accused-of/id1504280230?i=1000688987623"
      }
    },
    {
      "id": "900729c5-8862-4bcc-b864-7e26cd3e7aaf",
      "title": "Evidence Tampering \u0026 Appeals: Does Keith Raniere Have a Shot at a New Trial?",
      "description": "Could a convicted cult leader actually get a new trial because of FBI misconduct? That’s the question hanging over Keith Raniere’s case, as allegations of tampered evidence and manipulated metadata surface. While the branding, coercion, and disturbing power dynamics of NXIVM are well-documented, former FBI agents now claim that crucial digital evidence—particularly in relation to an alleged minor—may have been altered. If true, does that mean Raniere gets a second shot at freedom, or does the mountain of other evidence against him still seal his fate? Defense attorney and former prosecutor Eric Faddis joins the discussion, breaking down what this could mean for the future of the case. If the FBI cut corners, should it matter when the defendant is someone like Keith Raniere? #NXIVM #KeithRaniere #TrueCrime #FBI #EvidenceTampering #CultMindset #Justice Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-02-04T16:00:00Z",
      "duration": "00:11:47.9440000",
      "explicit": false,
      "spotifyId": "6ReFqtSPkMziSorHJtEKvS",
      "appleId": 1000688947110,
      "youTubeId": "bs3iQ0N00R0",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ReFqtSPkMziSorHJtEKvS",
        "apple": "https://podcasts.apple.com/podcast/evidence-tampering-appeals-does-keith-raniere-have/id1504280230?i=1000688947110",
        "youtube": "https://www.youtube.com/watch?v=bs3iQ0N00R0"
      }
    }
  ]
}