{
  "id": "5a21654a-5973-418c-93fb-0737e3614a3c",
  "name": "True Crime Unsolved",
  "spotifyId": "6MhlBrpvNnRJZ73TCWnnqO",
  "appleId": 1848906709,
  "youTubeChannelId": "UCHkjl0RB3KNDvrEubjivaxQ",
  "episodes": [
    {
      "id": "d13e6020-6be2-43ad-a92f-c129293f4ee6",
      "title": "The Movement Center: Cult Allegations, Control, and a Death That Raises Questions",
      "description": "For decades, The Movement Center, a spiritual organization led by Michael Shoemaker (also known as Swami Chaitananda), has been the subject of controversy, allegations, and lawsuits. In this episode of True Crime Unsolved, we examine publicly reported claims surrounding the group — including allegations of coercive control, sexual misconduct, exploitation of members, and abuse of spiritual authority.\n\nDrawing from court filings, investigative journalism, and firsthand accounts, we trace the group’s origins, its leadership structure, and how a small yoga-based spiritual movement allegedly evolved into a high-control environment. We also explore reporting by a Pulitzer Prize–winning journalist, testimony from former members, and the troubling patterns that emerge across multiple accounts \n\nThis episode also sets the stage for a deeper investigation into the death of Ayaz Qadir, a young man who died from a heroin overdose while staying at the Movement Center — a death ruled accidental, but one his family believes deserves renewed scrutiny.\n\n⚠️ Important Note:\nAll allegations discussed are sourced from publicly available reporting and legal filings. They are presented as allegations, not proven facts. Individuals mentioned are presumed innocent unless proven otherwise in a court of law. Our goal is to examine documented claims and unresolved questions — not to reach legal conclusions.\n\nIf you’re interested in stories involving cult dynamics, coercive control, spiritual abuse, and unsolved or disputed deaths, this is a case worth understanding.\n\n🎧 Prefer audio? Listen to True Crime Unsolved as a podcast:\n• Apple Podcasts: https://podcasts.apple.com\n\n\n• Spotify: https://open.spotify.com\n\n• Amazon Music: https://music.amazon.com\n\n• Pocket Casts: https://pocketcasts.com\n\n📌 Subscribe for more investigations into unsolved cases, missing persons, cults, and stories the mainstream won’t touch.\n\n  #TrueCrimeUnsolved #UnsolvedCases #InvestigativeJournalism #Documentary\n#HighControlGroups #SpiritualAbuse #CoerciveControl #CultDynamics #CultAwareness\n#MovementCenter #SwamiChaitananda #SpiritualLeadership #SurvivorStories",
      "release": "2025-12-19T17:30:30Z",
      "duration": "00:51:13",
      "explicit": false,
      "spotifyId": "436fwW69JUvzOq9AAFT5Jk",
      "appleId": 1000742023930,
      "youTubeId": "qr2eN-HRZk8",
      "subjects": [
        "The Movement Center"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/436fwW69JUvzOq9AAFT5Jk",
        "apple": "https://podcasts.apple.com/podcast/the-movement-center-cult-allegations-abuse-and-a/id1848906709?i=1000742023930",
        "youtube": "https://www.youtube.com/watch?v=qr2eN-HRZk8"
      }
    }
  ]
}