{
  "id": "c8960c8c-8c3f-4cfc-aa33-fde921f414e1",
  "name": "TRUE CRIME WITH SAVAGE ROYALT",
  "youTubeChannelId": "UClARl2cAFX3_PTCt6fabifw",
  "episodes": [
    {
      "id": "042f4b6c-1246-461d-b25c-c75422aa8e9a",
      "title": "TD McNutt EXPOSED: Inside the Making of a Modern Cult Leader | Abuse, Control, and “Sons in Christ”",
      "description": "This episode breaks down the disturbing allegations surrounding Tavares Dwayne “TD” McNutt — and how this case mirrors the psychological blueprint of a modern cult leader.\n\nMcNutt, a 49-year-old pastor tied to Transformation Empowerment Worship Center in West Palm Beach, was arrested in December 2025 on charges related to child abuse after a school counselor reported visible injuries on a boy described as his “son in Christ.” Investigators documented bruising, a busted lip, and reports of repeated beatings. He bonded out the next day.\n\nBut this story goes far beyond a single arrest.\n\nIn this deep dive, we analyze how influence, religion, and authority intersect — and how cult-like dynamics allegedly formed around McNutt’s ministries, training institutes, and counseling programs. From prophetic schools and paid certifications to financial dependence and public humiliation tactics, former members and online investigators have begun connecting disturbing patterns.\n\nThis breakdown explores:\n\n• The arrest and child abuse allegations\n• The “sons in Christ” dynamic and power structure\n• Forced livestream apologies and public shaming\n• Former members speaking out with abuse claims\n• Financial control and loyalty-based rewards\n• Psychological tactics often seen in cult leadership\n• Social media backlash and renewed investigations\n\nWe also examine the wider fallout, including allegations from former parishioners, claims of manipulation and control, and reports that authorities removed a child following public pressure.\n\nThis video is not about sensationalism  it’s about understanding how alleged cult dynamics can form in real time, often hidden behind religion, loyalty, and fear.",
      "release": "2026-02-21T13:33:27Z",
      "duration": "01:48:01",
      "explicit": false,
      "youTubeId": "zDHsdMMl31E",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zDHsdMMl31E"
      }
    }
  ]
}