{
  "_ts": 0,
  "id": "0f78cfc8-5126-40b4-8824-51b7d3d2222e",
  "name": "True Crime Conversations",
  "spotifyId": "31jNJsdwsa2GHrjiPFcfq2",
  "appleId": 1469153910,
  "episodes": [
    {
      "id": "6f7bc0c0-ccf6-485a-a5d3-7b3cbac5e7f5",
      "title": "Escaping One Of Australia\u0027s Most Secretive Cults",
      "description": "Laura McConnell grew up in a fundamentalist sect with no name. Along with no official title, the group also claims to have no registration around the world, no formal hierarchy, and no official places of worship. According to Laura, it\u0027s this secrecy and denial that has allowed abuse to flourish within the community. She joins us today to expose what she witnessed and experienced inside the group she calls The Truth. THE END BITS Subscribe to Mamamia Want to try our new exercise app? Click here to start a seven-day free trial of MOVE by Mamamia. CREDITS Guest: Laura McConnell Host: Gemma Bath Executive Producer: Gia Moylan Audio Producer: Scott Stronach GET IN TOUCH: Feedback? We’re listening! Call the pod phone on 02 8999 9386 or email us at truecrime@mamamia.com.au If any of the contents in this episode have caused distress, know that there is help available via Lifeline on 13 11 14 or Beyond Blue on 1300 22 4636 Mamamia acknowledges the Traditional Owners of the Land we have recorded this podcast on, the Gadigal people of the Eora Nation. We pay our respects to their Elders past and present and extend that respect to all Aboriginal and Torres Strait Islander cultures.",
      "release": "2024-02-14T18:00:00Z",
      "duration": "00:51:11.2940000",
      "explicit": false,
      "spotifyId": "7MOQU1G40GvIPwSYGixua3",
      "appleId": 1000645341937,
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MOQU1G40GvIPwSYGixua3",
        "apple": "https://podcasts.apple.com/podcast/escaping-one-of-australias-most-secretive-cults/id1469153910?i=1000645341937"
      }
    }
  ]
}