{
  "_ts": 0,
  "id": "e29aedf2-ddee-4e32-b033-bffe9c37b6e1",
  "name": "True Crime Today  | A True Crime Podcast",
  "spotifyId": "0GYshi6nJCf3O0aKEBTOPs",
  "appleId": 1504280230,
  "youTubeChannelId": "UC8-vxmbhTxxG10sO1izODJg",
  "episodes": [
    {
      "id": "07783ca4-9ec1-4209-b48c-40302db43c6a",
      "title": "Unmasking Ruby Franke FBI Expert Robin Dreeke Breaks Down Shari Franke Memoir",
      "description": "Unmasking Ruby Franke FBI Expert Robin Dreeke Breaks Down Shari Franke Memoir Was family vlogging ever really about family—or was it just another way to cash in on childhood innocence? Ruby Franke, once the face of the popular YouTube channel Eight Passengers, crafted a wholesome image of family life—one that, according to her daughter, Sherry Franke, was a carefully curated front hiding something far darker. In her new memoir, The House of My Mother: A Daughter’s Quest for Freedom, Sherry pulls back the curtain on the alleged abuse and control that shaped her upbringing, exposing the chilling reality behind the perfectly edited videos. But Ruby wasn’t operating alone. Her husband, Kevin Franke, played his own role—one that raises serious questions about willful ignorance and blind loyalty. How does a father just step away from his family under the guise of “self-improvement” while another woman steps in to assume control? And what does it say when his return to reality comes with zero accountability? Retired FBI Special Agent Robin Dreeke joins the discussion, breaking down the psychological manipulation at play and the disturbing influence of Jodi Hildebrandt, the so-called therapist who only amplified Ruby’s obsession with control. As more former child influencers come forward about their experiences, the question remains—how many more kids are still trapped in this modern-day nightmare of parental exploitation disguised as entertainment? #TrueCrime #RubyFranke #EightPassengers #FamilyVlogging #KevinFranke #CultMentality #ChildExploitation Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-02-07T22:00:00Z",
      "duration": "00:17:27.0120000",
      "explicit": false,
      "spotifyId": "20HqG8EfHHYljeeUKq1EMw",
      "appleId": 1000690103141,
      "youTubeId": "ZCu1eRDvhbs",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20HqG8EfHHYljeeUKq1EMw",
        "apple": "https://podcasts.apple.com/podcast/unmasking-ruby-franke-fbi-expert-robin-dreeke-breaks/id1504280230?i=1000690103141",
        "youtube": "https://www.youtube.com/watch?v=ZCu1eRDvhbs"
      }
    },
    {
      "id": "1bf436d1-5ecd-45f4-9cd5-87a8b8446a27",
      "title": "Jodi Hildebrandt and Ruby Franke Accused of Fraud, Racketeering, and Ongoing Abuse in New Lawsuit",
      "description": "On this episode, we dig into the shocking new lawsuit against Jodi Hildebrandt and Ruby Franke, which alleges that their ConneXions empire isn’t dead—it’s still manipulating, isolating, and financially exploiting victims, even with its leaders behind bars. Filed by former client Michael Robert Tilleman, the lawsuit accuses Hildebrandt, Franke, and their network of running a racketeering operation disguised as therapy, using coercion and fear to control their followers. Even more disturbing, the lawsuit claims that ConneXions members continue to recruit and enforce Hildebrandt’s harmful teachings, with some cases of child abuse allegedly still occurring. How does a system like this survive without its leaders, and can it finally be dismantled? We break it all down. Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-02-04T18:10:00Z",
      "duration": "00:14:55.8690000",
      "explicit": false,
      "spotifyId": "1F13Gq5rQWbDVwcNmdPog2",
      "appleId": 1000688987623,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1F13Gq5rQWbDVwcNmdPog2",
        "apple": "https://podcasts.apple.com/podcast/jodi-hildebrandt-and-ruby-franke-accused-of/id1504280230?i=1000688987623"
      }
    },
    {
      "id": "900729c5-8862-4bcc-b864-7e26cd3e7aaf",
      "title": "Evidence Tampering \u0026 Appeals: Does Keith Raniere Have a Shot at a New Trial?",
      "description": "Could a convicted cult leader actually get a new trial because of FBI misconduct? That’s the question hanging over Keith Raniere’s case, as allegations of tampered evidence and manipulated metadata surface. While the branding, coercion, and disturbing power dynamics of NXIVM are well-documented, former FBI agents now claim that crucial digital evidence—particularly in relation to an alleged minor—may have been altered. If true, does that mean Raniere gets a second shot at freedom, or does the mountain of other evidence against him still seal his fate? Defense attorney and former prosecutor Eric Faddis joins the discussion, breaking down what this could mean for the future of the case. If the FBI cut corners, should it matter when the defendant is someone like Keith Raniere? #NXIVM #KeithRaniere #TrueCrime #FBI #EvidenceTampering #CultMindset #Justice Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-02-04T16:00:00Z",
      "duration": "00:11:47.9440000",
      "explicit": false,
      "spotifyId": "6ReFqtSPkMziSorHJtEKvS",
      "appleId": 1000688947110,
      "youTubeId": "bs3iQ0N00R0",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ReFqtSPkMziSorHJtEKvS",
        "apple": "https://podcasts.apple.com/podcast/evidence-tampering-appeals-does-keith-raniere-have/id1504280230?i=1000688947110",
        "youtube": "https://www.youtube.com/watch?v=bs3iQ0N00R0"
      }
    }
  ]
}