{
  "id": "e6567353-4669-4a62-b2ee-6f03b4c7349f",
  "name": "True Crime New England",
  "spotifyId": "31gk7vHwSmFuMwT15i51If",
  "appleId": 1572851614,
  "episodes": [
    {
      "id": "fca7ae60-882c-466d-bd2a-37217126ccc3",
      "title": "Episode 162: The Children of Attleboro Cult",
      "description": "Join Katie and Liz on the first installment of their annual True Crime New England Halloween Extravaganza VIP Spooky Scary Special ™! To kick things off, the girls talk about the children of the Attleboro Cult, founded as “The Church of Mansfield” in 1977 by Roland Robidoux in Massachusetts. Controversy and scandal surrounded the sect in 1999 when it was discovered by a former member that a toddler had been starved to death on the command of his estranged wife’s “vision from God.” Investigation into the cult also revealed another missing infant while searching for the murdered child. Tune in to hear the origins of this cult and the lead up to what turned out to be a brutal and maniacal ending to something that started out so harmlessly. --- Support this podcast: https://podcasters.spotify.com/pod/show/truecrimene/support",
      "release": "2024-10-03T12:00:00Z",
      "duration": "01:12:14.4220000",
      "explicit": true,
      "spotifyId": "0YEQOI0MG6X3elzz4BXYMr",
      "appleId": 1000671664484,
      "subjects": [
        "Attleboro Sect"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0YEQOI0MG6X3elzz4BXYMr",
        "apple": "https://podcasts.apple.com/podcast/episode-162-the-children-of-attleboro-cult/id1572851614?i=1000671664484"
      }
    },
    {
      "id": "c5a52a1f-1b85-43d7-b1d7-9e39b29fad93",
      "title": "Episode 116: The Wakemanites",
      "description": "Join the girls on the last installment of the 2023 Halloween episodes, as they discuss an 1850s cult based out of Connecticut... The Wakemanites. Hardworking housewife Rhoda Wakeman suffered abuse at the hands of her husband for far too long, until one day, she claims he killed her. She then went to Heaven for seven hours, where she met God himself, who bestowed upon her a prophetic mission and sent her back to Earth. Using this supposed journey, Rhoda formed The Wakemanites and gathered around a dozen followers, spreading the word of her experience. However, like most cults, the story of these religiously-bonkers people would end in several instances of murder.   ---   Support this podcast: https://podcasters.spotify.com/pod/show/truecrimene/support",
      "release": "2023-10-26T00:00:00",
      "duration": "00:59:05.4540000",
      "explicit": true,
      "spotifyId": "4tkf8XrSV5R1IwMGeBwTOX",
      "appleId": 1000632693923,
      "subjects": [
        "Wakemanites"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4tkf8XrSV5R1IwMGeBwTOX",
        "apple": "https://podcasts.apple.com/podcast/episode-116-the-wakemanites/id1572851614?i=1000632693923"
      }
    }
  ]
}