{
  "id": "8347d683-17d7-47d5-a9ff-2ab0bc6b3fdb",
  "name": "TrumpWorld",
  "spotifyId": "4dYeBSxwYRLxnCn0482T7M",
  "appleId": 1838475656,
  "youTubeChannelId": "UCTrQ7HXWRRxr7OsOtodr2_w",
  "episodes": [
    {
      "id": "7803d20a-e0df-4792-9c58-d8cea07a41de",
      "title": "Trump and Epstein: what do the new emails tell us?",
      "description": "A new tranche of Epstein emails have been released, exposing more details about one of the most notorious scandals in modern politics - and putting fresh pressure on Donald Trump. All this in the week that Donald Trump has threatened to sue the BBC for $1 billion for ‘defamatory’ statements, plunging the BBC into an existential crisis. On this week’s episode of TrumpWorld, Matt Frei and Anushka Asthana explore how the revelations are reverberating through Washington and Westminster, unpack what the Epstein revelations could mean for Trump, and discuss his relationship with the media. And we speak to former Washington Post editor Martin Baron about what this moment reveals about the future of journalism, and accountability in the age of Trump. The White House has responded to this release of emails by House Democrats. Press Secretary Karoline Leavitt says: “The Democrats selectively leaked emails to the liberal media to create a fake narrative to smear President Trump. \u0022The ‘unnamed victim’ referenced in these emails is the late Virginia Giuffre, who repeatedly said President Trump was not involved in any wrongdoing whatsoever and “couldn’t have been friendlier” to her in their limited interactions. \u0022The fact remains that President Trump kicked Jeffrey Epstein out of his club decades ago for being a creep to his female employees, including Giuffre. \u0022These stories are nothing more than bad-faith efforts to distract from President Trump’s historic accomplishments, and any American with common sense sees right through this hoax and clear distraction from the government opening back up again.”",
      "release": "2025-11-12T21:00:08Z",
      "duration": "00:38:20.0530000",
      "explicit": false,
      "spotifyId": "3MyqPITWg0FWyA9Zb3VgvA",
      "appleId": 1000736492345,
      "youTubeId": "yXrGtqWymZY",
      "subjects": [
        "Human Trafficking",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3MyqPITWg0FWyA9Zb3VgvA",
        "apple": "https://podcasts.apple.com/podcast/trump-and-epstein-what-do-the-new-emails-tell-us/id1838475656?i=1000736492345",
        "youtube": "https://www.youtube.com/watch?v=yXrGtqWymZY"
      }
    }
  ]
}