{
  "id": "a81a4113-59f4-45b4-96ba-836614948d11",
  "name": "Trust Me Bro",
  "youTubeChannelId": "UC4GYgpgZzfMhYr9y6rs5O6Q",
  "episodes": [
    {
      "id": "6f8f1c0f-6780-4332-92f2-c1eaf52675e5",
      "title": "Crazy Cults That Are Still Active Today",
      "description": "Are you curious about crazy, scary and deadly cults that still exist today? Well, you came to the right video! In this video, I discuss the 4 of the craziest cults still actively operating right now. If you like stories about crazy cults, snake cults, doomsday cults or worse, you\u0027re at the right video, trust me bro.\n   \nSubscribe To “Trust Me Bro” Today!\n\nBookmarks: \n\n00:03 - The Church Of God With Signs Following\n05:13 - Happy Science\n12:26 - Grace Road\n20:18 - Superior Universal Alignment\n\nFor business \u0026 sponsor inquiries please send an email to trustmebrobusiness@gmail.com.\n\nOfficial TMB Socials: \nhttps://www.instagram.com/trustmebroyt/\nhttps://x.com/trustmebroyt\n\nDISCLAIMER: All “Trust Me Bro” videos are based on publicly available information unless otherwise noted. All materials in these videos are used for entertainment purposes and fall within the guidelines of fair use. No copyright infringement intended. If you are, or represent, the copyright owner of materials used in this video, and have an issue with the use of said material, please send an email to trustmebrobusiness@gmail.com.  \n\n*Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \u0022fair use\u0022 for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use. No copyright infringement intended. ALL RIGHTS BELONG TO THEIR RESPECTIVE OWNERS.\n\nFor entertainment purposes only. Based on actual events.\n\nSource: Trust Me bro\n\nVideo inspired by \u0026 other sources:\nhttps://youtu.be/-gELYROMRLk?si=SEflXMk6bbtf4YRX\nhttps://youtu.be/QSTA_aAMoqs?si=OfLMxSDh5OQDyIlY\nhttps://youtu.be/ccnvYegunQ0?si=m6WTbWZ-7v7ihTMu\nhttps://youtu.be/zVgj3dFjWhs?si=mvmM2LC7eyZOGn8D\nhttps://youtu.be/mwavrbXymV4?si=MCWpAgkH9JQAGfui",
      "release": "2025-12-26T21:31:16Z",
      "duration": "00:25:51",
      "explicit": false,
      "youTubeId": "qmHEMvu4RO8",
      "subjects": [
        "Happy Science",
        "Superior Universal Alignment",
        "Grace Road Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qmHEMvu4RO8"
      }
    }
  ]
}