{
  "_ts": 0,
  "id": "40b7cf3a-b438-41ba-92e2-2eab83179b50",
  "name": "Truth Wanted",
  "youTubeChannelId": "UCKzYd1mJ8M1pUZ7cM1nwyPA",
  "episodes": [
    {
      "id": "cb7bb835-6f69-45c2-9d60-86421726b7f6",
      "title": "Andey Fellowes, Ex-Teal Tribe/Teal Swan Cult Member | Truth Wanted 03.03",
      "description": "Truth Wanted 03.03 for February 7, 2020 with ObjectivelyDan \u0026 Andey Fellowes.\n\nCall the show Fridays 7-8:30pm CT at: 1-512-686-0279 or use our green call the show button to save on long-distance charges: http://www.atheist-experience.com/\n\n► Don\u0027t like ads? Consider becoming a patron for commercial-free episodes: https://www.patreon.com/TruthWanted\n\n► Podcasts may be found @: \nhttps://www.spreaker.com/show/truthwanted\n\n► Shop Truth Wanted merchandise @: http://bit.ly/aenmerch\n\nWe welcome your comments on the thread for this show. \n► https://www.facebook.com/groups/TruthWanted\n► Contact us with questions or news stories at: truth@atheist-community.org\n\n► Chat room rules: \nhttp://atheist-experience.org/chat-rules/?fbclid=IwAR3usB-Aon_0Tzid23KizA3qgTk83Q_HQnrRe2nXOH6Sc5yGY2_vhl5yx_c\n-------\n\nWHAT IS TRUTH WANTED?\n\nTruth Wanted is a show about getting to the bottom of beliefs, whether it’s karma or Christ, Bigfoot or crystals. Truth Wanted would like to know how you know it’s true. Hosted by ObjectivelyDan, Truth Wanted takes calls from the community (that means YOU!) and features new guests every week, emphasizing thorough conversations over name-calling and scoffing (most of the time). Truth Wanted focuses on how and why people believe what they believe, and how you can talk about beliefs in more effective ways. Join us for truth investigations and lively conversations every Friday at 7:00pm CT! \n\nThe Atheist Community of Austin is organized as a nonprofit educational corporation to develop and support the atheist community, to provide opportunities for socializing and friendship, to promote secular viewpoints, to encourage positive atheist culture, to defend the first amendment principle of state-church separation, to oppose discrimination against atheists and to work with other organizations in pursuit of common goals.\n\nWe define atheism as the lack of belief in gods. This definition also encompasses what most people call agnosticism.\n\n► http://www.atheist-community.org (The Atheist Community of Austin)\n► Check out Dan\u0027s other channel @ https://www.youtube.com/objectivelydan\n\nNOTES\n\nTruthWanted is the official channel of Truth Wanted. \u0022Truth Wanted\u0022 is a trademark of the ACA.\n\nThumbnail artwork by: https://www.instagram.com/princepsed \n\nIntro Music:\nCold Funk - Funkorama by Kevin MacLeod is licensed under a Creative Commons Attribution license (https://creativecommons.org/licenses/by/4.0/)\nSource: http://incompetech.com/music/royalty-free/index.html?isrc=USUAN1100499\nArtist: http://incompetech.com/\n\nCopyright © 2018 Atheist Community of Austin. All rights reserved.",
      "release": "2020-03-13T23:00:04Z",
      "duration": "00:23:35",
      "explicit": false,
      "youTubeId": "Gd7s1DfquPU",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Gd7s1DfquPU"
      }
    }
  ]
}