{
  "id": "c7ac0c80-be02-4423-94dd-c7703ed389be",
  "name": "Truth Be Found",
  "spotifyId": "7eZUbPYorsiQ27ZgRnOtY4",
  "appleId": 1746205650,
  "youTubeChannelId": "UCUkjO5Rz7FkPrGFGy_leY7w",
  "episodes": [
    {
      "id": "90ee4d9c-5872-450f-b9c3-78b662bf228a",
      "title": "Breaking Faith, Part 2: Rachel Jeffs on Healing and Helping Others Escape the FLDS ",
      "description": "She escaped the walls of control; now she’s shedding light on the abuse that keeps others trapped. In this powerful continuation of our two-part conversation, Justin Yentes sits down once again with Rachel Jeffs, survivor, author, and daughter of FLDS leader Warren Jeffs, and Tawni Browning, an advocate for survivors. Together, they go deeper into what comes after escape, the struggle to learn how to exist in a world you don’t understand while finding the basics needed to survive... and all of that has to be done while healing from abuse, parenting, and building a sustainable life. Rachel’s story doesn’t end with freedom; it begins there. In Part 2, she and Tawni open up about the backlash survivors face, the systems that fail them, and the community it takes to help people truly start over. This episode is a lesson in resilience, advocacy, and the enduring power of truth. How Rachel continues to receive hate from within the FLDS community. What it takes to help survivors rebuild: housing, mental health support, etc. The impact of the series “Escaping Polygamy” on those still inside the FLDS. The fear, relearning, and healing needed to step into a world you were taught to fear. What you can do to support survivors by advocating for protections and accountability. This episode is for anyone who believes that awareness isn’t enough, that survival stories must lead to systemic change. Whether you’re a survivor, an advocate, or someone trying to understand the realities of cult control and coercive systems, this conversation will deepen your understanding and strengthen your resolve. Be sure to listen to Part 1 first to hear Rachel’s full story of survival and escape, then join us for this powerful continuation. Follow Justin and the pod: @truthbefoundpodcast Link to Justin’s agency, AIA: https://azprivateinvestigator.com/ Follow Rachel Jeffs: @racheljeffsofficial Buy Rachel\u0027s book Breaking Free: https://www.harpercollins.com/products/breaking-free-rachel-jeffs?variant=32117440348194 Watch the Lifetime series Escaping Polygamy: https://www.mylifetime.com/shows/escaping-polygamy Watch the Lifetime movie Surviving My Father: https://www.mylifetime.com/movies/surviving-my-father-the-rachel-jeffs-story",
      "release": "2025-10-28T18:00:10Z",
      "duration": "00:50:15.5830000",
      "explicit": false,
      "spotifyId": "47ZxBa70nfpV7TSuqerY4c",
      "appleId": 1000733907590,
      "youTubeId": "c6urEwIPqLE",
      "subjects": [
        "FLDS Church",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/47ZxBa70nfpV7TSuqerY4c",
        "apple": "https://podcasts.apple.com/podcast/breaking-faith-part-2-rachel-jeffs-on-healing-and/id1746205650?i=1000733907590",
        "youtube": "https://www.youtube.com/watch?v=c6urEwIPqLE"
      }
    },
    {
      "id": "f58492ce-bf9d-4dc1-ac22-b79a35fe20d8",
      "title": "Breaking Faith, Part 1: Rachel Jeffs on Escaping the FLDS and Reclaiming Her Life ",
      "description": "What happens when your father is worshiped as a prophet and feared as a predator? In this powerful episode, Justin Yentes sits down with Rachel Jeffs, daughter of infamous FLDS leader Warren Jeffs, and Tawni Browning, a survivor advocate who helps people rebuild after escaping cults and trafficking. Together, they pull back the curtain on the hidden world of the FLDS, its control, secrecy, and the deep trauma it inflicts on everyone, especially the women and children. But this isn’t just a story of suffering. It’s a story of power reclaimed.\n\nKey Moments:\nInside the FLDS: Rachel grew up cut off from the outside and controlled by fear.The Prophet’s Daughter: Warren Jeffs’ rise to power, controlling tactics, and abuse.The Breaking Point: The revelation that spurred her to find the courage to escape.Rebuilding a Life: Discovering her strength and voice as she raised her children alone.Empowering Others: Tawni and Rachel discuss the strength of those who stand up and bring the truth to light.\nThis episode is for anyone who’s ever felt trapped, silenced, or powerless, and for those who want to understand how faith, fear, and control can intertwine in dangerous ways. You’ll walk away with a deeper understanding of resilience, advocacy, and what it truly means to rebuild a life after trauma.\n\nListen now to hear this story of truth, strength, and hope!\n\nFollow Rachel Jeffs: @racheljeffsofficial\nBuy Rachel\u0027s book Breaking Free: https://www.harpercollins.com/products/breaking-free-rachel-jeffs?variant=32117440348194\nWatch the Lifetime movie Surviving My Father: https://www.mylifetime.com/movies/surviving-my-father-the-rachel-jeffs-story\n\nConnect with Truth Be Found on Instagram: https://www.instagram.com/truthbefoundpodcast/\nConnect with Truth Be Found on Facebook: https://www.facebook.com/share/1A4b7PjhaG/?mibextid=wwXIfr\nConnect with Truth Be Found on TikTok: https://www.tiktok.com/@truthbefoundpodcast\nConnect with Truth Be Found on YouTube: https://www.youtube.com/playlist?list=PL3gAFoH_AQSvPYhsQ6Lw7rr0tYrg0wIiW\n\nLink to Justin’s agency, AIA: https://azprivateinvestigator.com/",
      "release": "2025-10-14T17:53:11Z",
      "duration": "00:53:20",
      "explicit": false,
      "spotifyId": "6i4Bt6yTfNiDqapXqAWyPy",
      "appleId": 1000731835754,
      "youTubeId": "wX8OpaLTXzw",
      "subjects": [
        "FLDS Church",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6i4Bt6yTfNiDqapXqAWyPy",
        "apple": "https://podcasts.apple.com/podcast/breaking-faith-part-1-rachel-jeffs-on-escaping-the/id1746205650?i=1000731835754",
        "youtube": "https://www.youtube.com/watch?v=wX8OpaLTXzw"
      }
    }
  ]
}