{
  "_ts": 0,
  "id": "7372fdae-db95-498a-874d-3f9cf5c23ad1",
  "name": "Truth 2x2 Cult Kids",
  "spotifyId": "74t0JRlWEDeZB0xhUSXP32",
  "appleId": 1788240941,
  "episodes": [
    {
      "id": "c7030071-2cef-4e8e-b87c-eff7b83a8c8a",
      "title": "An Introduction to the Truth 2x2 Cult",
      "description": "This is an introduction to the Truth 2x2 cult, an overview of group, its history, culture and behaviours.\nThis episode is broadly based on a presentation that I gave at DeCult conference in Christchurch in October 2024. Information about that conference, access to resources and information can be found on the Decult website, which I’d recommend as a good resource for cult survivors in general, not just from the Truth 2x2s.\nA copy of my presentation at DeCult can be found on substack, link in the show notes. This presentation was written and designed to be used as a resource for 2x2 Truth survivors, so they could share information with therapists, new partners, outsider family and friends. Because the group is so secretive, and resources not easily accessible for survivors, I wanted the DeCult presentation to be available in a digestible, accessible format that could be shared to support survivors and raise awareness of the cult and our lives.\nThere are several books on the Truth 2x2 history which have been published. These are referenced in this podcast and in the DeCult presentation. Im grateful to the authors who’ve written, published and made other resources available. I also want to acknowledge that their historical work underpins the historical information I have shared, in particular Cherie Kropp Erigs work.\nShownotes - Introduction Episode:\nDecult Website: https://decult.net/\nMy presentation at Decult: https://lauramcconnell.substack.com/p/decult-2024-presentation\nPreserving The Truth Book: https://www.amazon.com.au/Preserving-Truth-without-Founder-William\nElizabeth Coleman Book: https://www.amazon.com.au/Cult-Christ-Church-Witness-Doctrine-ebook\nKids book - Little Mouse Purple Door: https://www.amazon.com.au/Little-Mouse-Purple-Meliesa-Tigard\nFBI form: https://forms.fbi.gov/2x2\nLinks to my work:\nSubstack: https://substack.com/@fierceladyfeminist\nTiktok: https://www.tiktok.com/@fierceladyfeminist\nInstagram: https://www.instagram.com/lauramc.au/\nWebsite: https://www.lauramcconnell.com.au/\nLinks to Support:\nGood trauma informed, cult sensitive therapists and support are hard to find. Please persist and try to find one that works for you. If you’re in a tough spot right now, please know you’re not alone. Here are some links to AU NZ supports and therapists which might be useful.\nhttps://www.thereligioustraumacollective.com/\nAs an Australian CSA survivor, the best support I’ve accessed at my lowest points, has been through Survivor Hub - https://www.thesurvivorhub.org.au/\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-01-12T10:02:25Z",
      "duration": "00:25:55",
      "explicit": false,
      "spotifyId": "07Nh9SAps591oiYLV8BG2S",
      "appleId": 1000683649341,
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07Nh9SAps591oiYLV8BG2S",
        "apple": "https://podcasts.apple.com/podcast/an-introduction-to-the-truth-2x2-cult/id1788240941?i=1000683649341"
      }
    },
    {
      "id": "c5462239-adcb-4051-87fe-ae4f9dab10a7",
      "title": "Truth 2x2 Cult Kids - Welcome",
      "description": "Welcome to the Truth 2x2 Cult Kids Podcast, by your host Laura McConnell Conti This is a short intro to the podcast, what you can expect and some background on your host. The next eposide will be focused on the background of the Truth 2x2 Cult. Show Notes: Links to my work: Substack: https://substack.com/@fierceladyfeminist Tiktok: https://www.tiktok.com/@fierceladyfeminist Instagram: https://www.instagram.com/lauramc.au/ Website: https://www.lauramcconnell.com.au/ Links to Support: LBH good trauma informed, cult sensitive therapists and support are hard to find. Please persist and try to find one that works for you. If you’re in a tough spot right now, please know you’re not alone. Here are some links to AU NZ supports and therapists which might be useful. https://www.thereligioustraumacollective.com/ As an Australian CSA survivor, the best support I’ve accessed at my lowest points, has been through Survivor Hub - https://www.thesurvivorhub.org.au/ Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-01-01T11:00:18Z",
      "duration": "00:05:53.0710000",
      "explicit": false,
      "spotifyId": "6lPjs1xd5sMoC8YjlV90nE",
      "appleId": 1000682359132,
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6lPjs1xd5sMoC8YjlV90nE",
        "apple": "https://podcasts.apple.com/podcast/truth-2x2-cult-kids-welcome/id1788240941?i=1000682359132"
      }
    }
  ]
}