{
  "id": "f64053e0-39a9-4b82-9f94-6d123a2d8eff",
  "name": "Tub3dYou",
  "youTubeChannelId": "UCpdy6mXRELJX3hr1KklJI9Q",
  "episodes": [
    {
      "id": "01a94d20-8bc8-4cf7-b1e5-78f15a94cb23",
      "title": "Anonymous",
      "release": "2012-06-25T06:00:06Z",
      "duration": "00:07:14",
      "explicit": false,
      "youTubeId": "-elZs3G2rvk",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-elZs3G2rvk"
      }
    },
    {
      "id": "bb3bb05c-5994-452d-a6e0-579479e9a919",
      "title": "Bryan Seymour interviews Mike Rinder in Australia Part 2",
      "description": "Today tonight again delivers damning evidence against scientology. Mike Rinder travels to Aus and meets with Senator Xenaphon and speaks with Bryan Seymour about the abuse in scientology",
      "release": "2010-07-22T09:53:18Z",
      "duration": "00:03:58",
      "explicit": false,
      "youTubeId": "wWEZJEOMHdw",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wWEZJEOMHdw"
      }
    },
    {
      "id": "8b78ce82-1fd9-48c8-bee3-a15688cc92a7",
      "title": "Bryan Seymour interviews Mike Rinder in Australia Part 1",
      "description": "Today tonight again delivers damning evidence against scientology. Mike Rinder travels to Aus and meets with Senator Xenaphon and speaks with Bryan Seymour about the abuse in scientology",
      "release": "2010-07-22T09:38:25Z",
      "duration": "00:08:16",
      "explicit": false,
      "youTubeId": "jIN3K1vAPu4",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jIN3K1vAPu4"
      }
    },
    {
      "id": "79c495b7-415d-4e3f-a7ec-ed0345b6d7d8",
      "title": "Today Tonight exposes scientology yet again",
      "description": "Bryan Seymour shares a view 3 years on after seeing behind the veil of deceit scientology hides behind",
      "release": "2010-07-08T09:16:00Z",
      "duration": "00:06:55",
      "explicit": false,
      "youTubeId": "ctngHrqRmrA",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ctngHrqRmrA"
      }
    },
    {
      "id": "8e805c49-3db4-4578-a754-e9e8fe270938",
      "title": "Scarlett Hanna- report done by A Current Affair Australia",
      "description": "Today Tonight\u0027s Bryan Seymour speaks directly to Scarlett on channel 7  \r\nhttp://au.todaytonight.yahoo.com/\r\n(video box to the right select \u0027scientology head\u0027\r\n\r\n\r\nACA\u0027s report features mostly the Lateline report footage, but includes ACA speaking to Steve Cannane about his interview with Scarlett\r\n\r\nhttp://www.abc.net.au/news/stories/2010/05/18/2903065.htm",
      "release": "2010-05-19T11:30:43Z",
      "duration": "00:04:38",
      "explicit": false,
      "youTubeId": "tevSVM8HgDQ",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tevSVM8HgDQ"
      }
    },
    {
      "id": "c20a5f55-0db3-48a7-9354-2eba2d165d0c",
      "title": "Scarlett Hanna-- talks about life in scientology as a child",
      "description": "Daughter of the president of the church of scientology australia Scarlett Hanna talks about life in scientology as a child. Shiela Huber speaks as someone left in charge of dozens of children in the Cadet Org.",
      "release": "2010-05-18T13:34:56Z",
      "duration": "00:09:26",
      "explicit": false,
      "youTubeId": "x8ku8igRoJU",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x8ku8igRoJU"
      }
    },
    {
      "id": "7e11872b-670e-4365-b960-0c30d4d7f90e",
      "title": "Tommy Davis attacks Senator Xenuphon",
      "description": "Bryan Seymour goes to hollywood part 3",
      "release": "2010-02-23T08:13:50Z",
      "duration": "00:05:04",
      "explicit": false,
      "youTubeId": "4-zjVZ6V0zk",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4-zjVZ6V0zk"
      }
    },
    {
      "id": "3b9ba6a5-4bc4-4aaa-9507-b8b65e7dc729",
      "title": "Bryan Seymour goes to Hollywood -Pt 1",
      "description": "Bryan Seymour goes to Hollywood and reports on Ex-scientologists speaking out at a press conference. Bryan interviews Tommy Davis, along with some high profile scientologists like Anne Archer, Nancy (bart simpson) Cartwright",
      "release": "2010-02-22T12:41:42Z",
      "duration": "00:10:02",
      "explicit": false,
      "youTubeId": "uOuwgRwgvjk",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uOuwgRwgvjk"
      }
    },
    {
      "id": "9669071d-95e1-4458-9538-0e1138ed874a",
      "title": "Bryan Seymour goes to Hollywood -Pt 2",
      "description": "Bryan Seymour goes to Hollywood and reports on Ex-scientologists speaking out at a press conference. Bryan interviews Tommy Davis, along with some high profile scientologists like Anne Archer, Nancy (bart simpson) Cartwright",
      "release": "2010-02-22T12:22:50Z",
      "duration": "00:09:33",
      "explicit": false,
      "youTubeId": "V2CsVcQgU_M",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V2CsVcQgU_M"
      }
    },
    {
      "id": "d2b8959d-d801-437c-9627-4dcfdae043c3",
      "title": "Today Tonight teaser",
      "description": "Bryan Seymour goes to Hollywood",
      "release": "2010-02-22T06:03:45Z",
      "duration": "00:00:23",
      "explicit": false,
      "youTubeId": "c80y564I8TQ",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c80y564I8TQ"
      }
    },
    {
      "id": "0c73c13b-6311-4dcc-957e-e85ab16a1fae",
      "title": "Scientology attacks Aaron Saxton - Today Tonight report",
      "description": "Today Tonight reports on the AVO sought to silence Aaron Saxton\r\nhttp://au.todaytonight.yahoo.com/article/6762612/general/scientology-avo\r\n\r\nA MANUAL ON THE DISSEMINATION OF MATERIAL-1955\r\nBy L Ron Hubbard\r\n\r\n\u0022The purpose of the suit is to harass and discourage rather than win.\r\n\r\nThe law can be used very easily to harass, and enough harassment on somebody who is simply on the thin edge anyway, well knowing that he is not authorized, will generally be sufficient to cause professional decease. If possible, of course, ruin him utterly.\u0022\r\n\r\nhttp://www-2.cs.cmu.edu/~dst/Fishman/Declaration/exhibg.html\r\n\r\n\r\n\r\n\u0022People attack Scientology, I never forget it, always even the score. People attack auditors, or staff, or organisations, or me. I never forget until the slate is clear.\u0022 \r\n\r\n- L. Ron Hubbard, MANUAL OF JUSTICE, 1959  \r\n\r\n\u0022So we listen. We add up associations of people with people. When a push against Scientology starts somewhere, we go over the people involved and weed them out. Push vanishes.\u0022 \r\n\r\n- L. Ron Hubbard, MANUAL OF JUSTICE, 1959",
      "release": "2010-02-04T10:36:42Z",
      "duration": "00:05:12",
      "explicit": false,
      "youTubeId": "CWPJuke7YyE",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CWPJuke7YyE"
      }
    },
    {
      "id": "9a19227e-ec01-49ab-b89b-1d4ac22b6fa3",
      "title": "Scientology fraud conviction in France- Today Tonight report",
      "description": "Today Tonight covers scientology conviction in France, Tommy Davis\u0027 dummy spit and Paul Haggis leaving scientology. Oh, and of course our Lord Xenu makes an appearance.\nOr was his name X E M U?",
      "release": "2009-10-28T08:08:14Z",
      "duration": "00:04:34",
      "explicit": false,
      "youTubeId": "QQeUtfFoRG0",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QQeUtfFoRG0"
      }
    },
    {
      "id": "6b5efbf8-1c09-497e-a4a1-67a73a253d9b",
      "title": "Scientology : Travolta will be an enemy if he leaves",
      "description": "Bryan Seymour and Today Tonight Australia report on Travolta\u0027s reported misgivings about his religion that may well have cost him his son Jett his life. Bryan Seymour speaks with long time high ranking ex-scientologist David Graham",
      "release": "2009-08-21T09:09:39Z",
      "duration": "00:05:11",
      "explicit": false,
      "youTubeId": "Q00fuXHMlwc",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q00fuXHMlwc"
      }
    },
    {
      "id": "f5870d29-6a16-4596-a35c-ca103973c957",
      "title": "Scientology Fraud--Today Tonight AU reports",
      "description": "Scientology fraud\r\n\r\nReporter: Bryan Seymour\r\nBroadcast Date: May 29, 2009\r\n\r\nThe church of Scientology is fighting one of the biggest battles in its 50-year history.\r\n\r\nForget Xenu the alien overlord and Tom Cruise\u0027s bizarre outbursts, this time they\u0027re in court facing serious fraud charges.\r\n\r\nA woman in France alleges she was manipulated into handing over her life savings.\r\n\r\nBryan Seymour reports the case has ignited questions here about how Scientology minds its own business.\r\n\r\nScientology is under siege.\r\n\r\n\u0022Well in Germany Scientology isn\u0027t recognised as a religion and in France it\u0027s leaders are facing fraud charges,\u0022 said Nick Xenophon, the Independent Federal Senator from South Australia.\r\n\r\nIn Paris a court will decide if Scientology fraudulently manipulated a woman into handing over $36,000.\r\n\r\n\u0022The only purpose of Scientology is to take money from people,\u0022 said the French prosecutor in the case. He is seeking to have Scientology\u0027s leaders found guilty and fined over ten million dollars and to have the group banned from France altogether.\r\n\r\nThe French spokeswoman for Scientology was blunt in her assessment of the case: \u0022â?¦it\u0027s nothing really, it\u0027s bullshit really.\u0022\r\n\r\nShe added that the judge may have been influenced \u0022by the media and the climate\u0022 to allow the trial to proceed, which is a serious and unfounded allegation.\r\n\r\nOriginally four people were accusing Scientology of fraud but two of them came to a financial settlement with the organisation.\r\n\r\nThe woman at the centre of the trial says she was walking past Scientology headquarters in Paris in 1998. She was approached in the street and offered a free personality test.\r\n\r\n\u0022She was humiliated and defrauded for a long time, she bought cases full of expensive books and cassettes all cloaked in this goal of self-improvement to become this incredible person,\u0022 said the French Prosecutor trying the case\r\n\r\nNot surprisingly, the test revealed she had shortfalls. She says she was told Scientology had the cure and was then scammed into buying books, courses, vitamins and even an electrometer, which is supposedly able to measure mental energy.\r\n\r\nScientology says the case is one of religious discrimination rather than the alleged fraud leading to members handing over their life savings.\r\n\r\n\u0022There\u0027s no witch-hunt, France respects freedom but even with religious freedom France can\u0027t ignore people breaking the law, if you have religious freedom if you can\u0027t do things that are above the law,\u0022 said a French Government official.\r\n\r\nAfter a nine year inquiry into the group, a French judge declared Scientology \u0022...is first and foremost a commercial business.\u0022\r\n\r\nProsecutors allege the director of Scientology in France, Alain Rosenberg, and six other top officials preyed on vulnerable would-be followers \u0022...with the goal of seizing their fortune by exerting a psychological hold.\u0022\r\n\r\nToday Tonight were contacted by a woman who claimed she had been recruited into Scientology as a child and manipulated into handing over a vast sum of money. When Today Tonight approached Scientology to respond to her claims, they said the woman had signed a confidentiality contract with them and they sent their lawyers scurrying to court seeking an injunction on the story.\r\n\r\nBut that\u0027s not why Today Tonight decided not to show the interview. Her family asked that the the interview not be aired - and Today Tonight agree... her best interests should come first.\r\n\r\nFederal senator Nick Xenophon says it\u0027s time to re-examine Scientology\u0027s claims as a religion and to change the laws to force the group to start paying tax.\r\n\r\n\u0022We need to have a close look at those laws because I think there\u0027s a lot of community concern that an organisation such as Scientology gets the huge benefits of having the tax exempt status as a religion,\u0022 Senator Xenophon said.\r\n\r\nHistorically Scientology brands anyone who questions their organisation a religious bigot.\r\n\r\n\u0022This is not about religious bigotry, this is about accountability and I think it\u0027s pretty cowardly of an organisation to start accusing those that just want to question they way they operate, to make sure what they do is transparent, accountable and fair,\u0022 Senator Xenophon said.\r\n\r\nAs always, the church of Scientology declined a request to be interviewed.\r\n\r\nNo doubt they\u0027ll be closely watching what happens in France.\r\n\r\n\u0022I think there is a role for regulators, for governments to have a very close look at these tactics because if they don\u0027t we\u0027ll continue to see more and more of these cases emerging where people\u0027s lives are being destroyed because they\u0027ve handed over their life savings, they\u0027ve handed over their inheritances to Scientology,\u0022 Senator Xenophon said.\r\n\r\nThe cult information and family support network has branded Scientology a cult, not a religion and say ex-members can contact them for help and advice.",
      "release": "2009-05-29T10:02:48Z",
      "duration": "00:04:53",
      "explicit": false,
      "youTubeId": "-lbByKVj_20",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-lbByKVj_20"
      }
    },
    {
      "id": "e6366b0a-b4d3-466a-ba6a-d0065a4e194e",
      "title": "The Tommy Davis Effect--XENU",
      "description": "Maor Xenu from Tommy Davis",
      "release": "2009-03-19T08:08:34Z",
      "duration": "00:04:26",
      "explicit": false,
      "youTubeId": "ZjsfOVHHlsY",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZjsfOVHHlsY"
      }
    },
    {
      "id": "5a15fcf6-2e1c-467f-84f0-67cfa898b718",
      "title": "Scientology Success PT2",
      "description": "HCO BULLETIN OF 16 MARCH 1977\r\nRemimeo\r\nExpanded Dianetics Series 25\r\n\r\nTHE GAMBLER\r\n\r\nAn obsessive gambler is a psychotic just like a drug addict or an alcoholic.\r\n\r\nThey are handled the way you handle any other psychotic. They don\u0027t have to do anything for real in life because it all depends on chance and never on themselves. So you have them on the minus effect scale.\r\n\r\nLife isn\u0027t real to a psychotic gambler and therefore they never really buckle down to anything. Consequences are unreal to them and criminal acts are incomprehensible as nothing is real anyway.\r\n\r\nGetting off overts is nothing to such people because they are not there and take no responsibility for them. Everything else is responsible -- not them. Thus you have to find the trail to the R/Ses on the subject and discharge those.\r\n\r\nThis aspect of such a case is the emergency number one handling.\r\n\r\nIt has to be recognized for what it is -- PSYCHOSIS.\r\n\r\nL. RON HUBBARD",
      "release": "2009-03-18T07:45:59Z",
      "duration": "00:07:02",
      "explicit": false,
      "youTubeId": "0hHaI6-VIJg",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0hHaI6-VIJg"
      }
    },
    {
      "id": "3c8588de-16be-401a-9862-b4c18f6cf812",
      "title": "Scientology Success PT1",
      "description": "James Packer had previously stated he no longer needed scientiology in his life. \nhttp://www.livenews.com.au/Articles/2008/05/10/James_Packer_bins_Scientology\nJamie\u0027s problem is, that maybe it\u0027s just too late after him listening to the lunacies peddled by the cult of scientology",
      "release": "2009-03-18T07:21:18Z",
      "duration": "00:07:56",
      "explicit": false,
      "youTubeId": "zES8j-o2C2k",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zES8j-o2C2k"
      }
    },
    {
      "id": "4f291371-bc82-42f9-bc18-c92328868e0f",
      "title": "Today Tonight follow-up report on Xenu",
      "description": "After TT aired their report about Xenu and Hubbard speaking, TT and Bryan Seymour were bombarded with emails from scientologists screaming many things. If scientology raises spiritual awareness, then why do scientologists get so abusive when they are confronted with the truth about hubbard and scientology?",
      "release": "2009-02-05T08:26:52Z",
      "duration": "00:03:30",
      "explicit": false,
      "youTubeId": "PUeZ1bbFI70",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PUeZ1bbFI70"
      }
    },
    {
      "id": "5d7fce29-4d9f-49e7-9ef5-a22364e3e751",
      "title": "Xenu features on National broadcaster in Australia",
      "description": "Today Tonight exposes the lies told by scientologists that have attested to OT III and above on national TV about Xenu and his existance in the core belief of scientology and body thetans",
      "release": "2009-02-04T08:59:53Z",
      "duration": "00:05:04",
      "explicit": false,
      "youTubeId": "E-FnGROF3J8",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E-FnGROF3J8"
      }
    },
    {
      "id": "5ffced87-ca98-4589-b9e3-9d29192d22f4",
      "title": "Tom Cruise talks about Scientology--Jan 2009",
      "description": "A Current Affair (Channel Nine) australia airs an interview with Tom Cruise. CONveniently, the interviewer is none other than Leila McKinnon, who just so happens to also be the wife of Channel Nine\u0027s CEO, who is best buds with James Packer and Tom Cruise.\r\n\r\nYet another puff piece done by Channel Nine, because having mates in the right places allows puff pieces to run on Tom Cruise and his $cientology.\r\nThis portion of the interview is only about half the entire interview and is related to Cruise\u0027s cult. The rest of the interview is even more puff about Cruise and Valkryie. Leil even has the gaul to say Valkryie is \u0022a hit movie\u0022. Well, if it is a \u0022hit movie\u0022, then why has it only earned $7mil over the $70Mil MGM poured out to convince people to watch it. Also, if the movie is \u0022a hit\u0022, then why have 801 movie theatres in Nth America just dumped Valkryie?\r\n\r\nWell done Channel Nine and ACA. You again run another puff piece on your buddy Tom Cruise",
      "release": "2009-01-20T08:13:04Z",
      "duration": "00:05:16",
      "explicit": false,
      "youTubeId": "ewm7dtEtK50",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ewm7dtEtK50"
      }
    },
    {
      "id": "4477cc6a-72de-41d7-8c32-355f2b94e468",
      "title": "Bill O\u0027Reilly about Tom Cruise",
      "description": "Billy\u0027O speaks to Barbara Walters about Cruise on her list of most fascinating people.",
      "release": "2008-12-05T05:27:18Z",
      "duration": "00:04:47",
      "explicit": false,
      "youTubeId": "ZBe-kUx8woU",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZBe-kUx8woU"
      }
    },
    {
      "id": "9d1433a3-aed6-42b8-8dec-5eff54beadd5",
      "title": "Scientology: The real story   Part  5",
      "description": "This series of clips is courtesy of youtube user AboutScientology\r\nhttp://www.youtube.com/user/AboutScientology\r\nWho was generous enough to permit me to reupload his original content from the \u0022THAT IS SCIENTOLOGY! - Reports from the USA\u0022 conference held by Ursula Caberta\u0027s Task Force Scientology in Hamburg Sept 4th.\r\n\r\nThis series of 5 clips is of Graham Berry, who has for many years opposed the criminality of the Church of Scientology. Graham speaks of many things about the true purposes and aims of \u0022The Church of Scientology\u0022. One of which is, Hubbard \u0027Targets,Defense\u0027 policy\r\nhttp://www.xs4all.nl/~johanw/CoS/targets-defence.txt\r\n\r\nThis talk given by Graham is a MUST see, so people can get a look behind the facade that Scientology has been hiding behind since it morphed from Hubbard\u0027s Dianetics, into a religion.",
      "release": "2008-09-10T11:42:42Z",
      "duration": "00:06:31",
      "explicit": false,
      "youTubeId": "u10hhuW-pco",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u10hhuW-pco"
      }
    },
    {
      "id": "7626b24c-a636-4e78-8923-4f83fdd2a821",
      "title": "Scientology: The real story   Part  4",
      "description": "This series of clips is courtesy of youtube user AboutScientology\r\nhttp://www.youtube.com/user/AboutScientology\r\nWho was generous enough to permit me to reupload his original content from the \u0022THAT IS SCIENTOLOGY! - Reports from the USA\u0022 conference held by Ursula Caberta\u0027s Task Force Scientology in Hamburg Sept 4th.\r\n\r\nThis series of 5 clips is of Graham Berry, who has for many years opposed the criminality of the Church of Scientology. Graham speaks of many things about the true purposes and aims of \u0022The Church of Scientology\u0022. One of which is, Hubbard \u0027Targets,Defense\u0027 policy\r\nhttp://www.xs4all.nl/~johanw/CoS/targets-defence.txt\r\n\r\nThis talk given by Graham is a MUST see, so people can get a look behind the facade that Scientology has been hiding behind since it morphed from Hubbard\u0027s Dianetics, into a religion.",
      "release": "2008-09-10T11:33:46Z",
      "duration": "00:09:17",
      "explicit": false,
      "youTubeId": "t9YiHiXsVAg",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=t9YiHiXsVAg"
      }
    },
    {
      "id": "3ff3a8f3-2fae-4f16-8cf4-88ef549d4a9e",
      "title": "Scientology: The real story   Part  3",
      "description": "This series of clips is courtesy of youtube user AboutScientology\r\nhttp://www.youtube.com/user/AboutScientology\r\nWho was generous enough to permit me to reupload his original content from the \u0022THAT IS SCIENTOLOGY! - Reports from the USA\u0022 conference held by Ursula Caberta\u0027s Task Force Scientology in Hamburg Sept 4th.\r\n\r\nThis series of 5 clips is of Graham Berry, who has for many years opposed the criminality of the Church of Scientology. Graham speaks of many things about the true purposes and aims of \u0022The Church of Scientology\u0022. One of which is, Hubbard \u0027Targets,Defense\u0027 policy\r\nhttp://www.xs4all.nl/~johanw/CoS/targets-defence.txt\r\n\r\nThis talk given by Graham is a MUST see, so people can get a look behind the facade that Scientology has been hiding behind since it morphed from Hubbard\u0027s Dianetics, into a religion.",
      "release": "2008-09-10T11:26:31Z",
      "duration": "00:09:21",
      "explicit": false,
      "youTubeId": "7nSZNy5uOu0",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7nSZNy5uOu0"
      }
    },
    {
      "id": "5fb00970-12e4-45ae-97b5-81646db0b228",
      "title": "Scientology: The real story   Part  2",
      "description": "This series of clips is courtesy of youtube user AboutScientology\r\nhttp://www.youtube.com/user/AboutScientology\r\nWho was generous enough to permit me to reupload his original content from the \u0022THAT IS SCIENTOLOGY! - Reports from the USA\u0022 conference held by Ursula Caberta\u0027s Task Force Scientology in Hamburg Sept 4th.\r\n\r\nThis series of 5 clips is of Graham Berry, who has for many years opposed the criminality of the Church of Scientology. Graham speaks of many things about the true purposes and aims of \u0022The Church of Scientology\u0022. One of which is, Hubbard \u0027Targets,Defense\u0027 policy\r\nhttp://www.xs4all.nl/~johanw/CoS/targets-defence.txt\r\n\r\nThis talk given by Graham is a MUST see, so people can get a look behind the facade that Scientology has been hiding behind since it morphed from Hubbard\u0027s Dianetics, into a religion.",
      "release": "2008-09-10T11:03:45Z",
      "duration": "00:09:31",
      "explicit": false,
      "youTubeId": "k4OIGOPZ_dk",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k4OIGOPZ_dk"
      }
    },
    {
      "id": "69aa6caf-1535-4718-bcd7-3ab70995ce95",
      "title": "Scientology: The real story Part 1 of 5",
      "description": "This series of clips is courtesy of youtube user AboutScientology\r\nhttp://www.youtube.com/user/AboutScientology\r\nWho was generous enough to permit me to reupload his original content from the \u0022THAT IS SCIENTOLOGY! - Reports from the USA\u0022 conference held by Ursula Caberta\u0027s Task Force Scientology in Hamburg Sept 4th.\r\n\r\nThis series of 5 clips is of Graham Berry, who has for many years opposed the criminality of the Church of Scientology. Graham speaks of many things about the true purposes and aims of \u0022The Church of Scientology\u0022. One of which is, Hubbard \u0027Targets,Defense\u0027 policy\r\nhttp://www.xs4all.nl/~johanw/CoS/targets-defence.txt\r\n\r\nThis talk given by Graham is a MUST see, so people can get a look behind the facade that Scientology has been hiding behind since it morphed from Hubbard\u0027s Dianetics, into a religion.",
      "release": "2008-09-10T10:48:26Z",
      "duration": "00:09:29",
      "explicit": false,
      "youTubeId": "5JajaeYjJRo",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5JajaeYjJRo"
      }
    },
    {
      "id": "419a323d-1aa6-4db3-ab3b-21fb189c2996",
      "title": "Dr Pawz--Butthurt cult agent?",
      "description": "Dr Pawz, what a tragic furfag",
      "release": "2008-07-27T06:44:11Z",
      "duration": "00:01:17",
      "explicit": false,
      "youTubeId": "3xUfRHfjTqU",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3xUfRHfjTqU"
      }
    },
    {
      "id": "f8f1e5ba-c58a-458f-a0cb-65d2ee176af4",
      "title": "Scientology communication--Talking with an OT V",
      "description": "An old timer scientologist admits to handing out anti-Anonymous flyers, but can\u0027t even quote the web address of Anonymous?\r\nThank you Vicki Dunstan, you make the fight oh so easy.",
      "release": "2008-07-26T22:49:13Z",
      "duration": "00:02:06",
      "explicit": false,
      "youTubeId": "MzJAqiyLtq0",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MzJAqiyLtq0"
      }
    },
    {
      "id": "bb816350-ad9f-487b-b944-9452ed9b83b1",
      "title": "Katie Holmes and her purple hands",
      "description": "Inside Edition report.\r\nWhat happens when you take too much Niacin?\r\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/04/27/AR2007042702610.html\r\nhttp://www.cs.cmu.edu/~dst/Narconon/detox.htm\r\n\r\nhttp://www.cs.cmu.edu/~dst/Narconon/",
      "release": "2008-07-25T06:22:46Z",
      "duration": "00:01:39",
      "explicit": false,
      "youTubeId": "OZbaHkqZUYI",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OZbaHkqZUYI"
      }
    },
    {
      "id": "ff0002a8-c84e-4837-b0ab-76c79d51953a",
      "title": "Jason Beghe speaks to Today Tonight about Scientology",
      "description": "Byan Seymour speaks with Jason Beghe, who was a class 5 auditor and OT V, that eventually realized that scientology was a scam.",
      "release": "2008-07-08T09:09:16Z",
      "duration": "00:05:34",
      "explicit": false,
      "youTubeId": "YaU4H_NvOj0",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YaU4H_NvOj0"
      }
    },
    {
      "id": "65d40caa-c9d3-4394-b420-01ba418c62cd",
      "title": "Scientology\u0027s child labour in Aus(Today Tonight report PT2)",
      "description": "Part 2\r\nToday Tonight reports on the use of child labour and the breaking of Australian labour laws. The report features an ex staff member from Melbourne, and David Graham, once a long time highly trained and positioned scientologist",
      "release": "2008-07-07T11:21:02Z",
      "duration": "00:07:09",
      "explicit": false,
      "youTubeId": "9ZMU8T1z53Q",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9ZMU8T1z53Q"
      }
    },
    {
      "id": "ca37bfdc-84eb-446c-9daa-47b3ef400edc",
      "title": "Scientology\u0027s child labour in Aus(Today Tonight report PT1)",
      "description": "Part 1\r\nToday Tonight reports on the use of child labour and the breaking of Australian labour laws. The report features an ex staff member from Melbourne, and David Graham, once a long time highly trained and positioned scientologist",
      "release": "2008-07-07T10:58:10Z",
      "duration": "00:06:09",
      "explicit": false,
      "youTubeId": "mJRyC87V074",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mJRyC87V074"
      }
    },
    {
      "id": "14971271-8c42-481d-a81f-b7cc614ca25f",
      "title": "Scientology child labour in Australia (Today Tonight teaser)",
      "description": "This is a promo for an expose being aired this coming Monday",
      "release": "2008-07-04T09:34:39Z",
      "duration": "00:00:53",
      "explicit": false,
      "youTubeId": "MxTOmHuC4Ws",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MxTOmHuC4Ws"
      }
    },
    {
      "id": "85309c1b-368b-4313-adcc-6fc830f4e18d",
      "title": "Panorama\u0027s Scientology and Me replay July 13 in Australia",
      "description": "SP\u0027s at Foxtel?\r\nCoincidental that C.I on Foxtel are showing John Sweeney\u0027s \u0022Scientology and Me\u0022 the day after global protests about the cult of scientology?\r\n\r\nDoesnt matter which of the above is most liekly. Well over 2 million households now have PayTV and C.I is a very popular channel. \r\n\r\nThis 60 second promo that is currently running will induce many to want to watch the cult of scientology in action. Free to air Channel 7 aired John Sweeney\u0027s report over a year ago, and it caused quite a flap for the cult. Can this history repeat itself?\r\nIt *is* going to be a bad week for the cult of swcientology in Australia, starting Monday night at 6.30pm and Today Tonight",
      "release": "2008-07-04T09:00:33Z",
      "duration": "00:01:01",
      "explicit": false,
      "youTubeId": "vBid-v4DVIA",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vBid-v4DVIA"
      }
    },
    {
      "id": "9da4bb29-3edd-4610-b0ae-aa5164cf4f42",
      "title": "Secret I.R.S deal with Scientology",
      "description": "Scientology afforded protections like no other religion in the U.S",
      "release": "2008-06-20T05:37:24Z",
      "duration": "00:07:36",
      "explicit": false,
      "youTubeId": "moXr_8-1-Jg",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=moXr_8-1-Jg"
      }
    },
    {
      "id": "3baf77c7-fc0f-496f-91da-1056bad65566",
      "title": "Alien Bag-Lady, scientologist, shares her wisdom",
      "description": "The woman is totally scientology, really.\r\nhttp://www.ahbl.org/notices/barbschwarz\r\n\r\n\r\nhttp://en.wikipedia.org/wiki/Freedom_of_Information_Act_(United_States)\r\nWikisource has original text related to this article: \r\nCivil Action 98-2406 (HHK), Schwarz v. United States Department of Treasury, et al.\r\n\r\nRecords at the United States Department of Justice (DOJ) show Barbara Schwarz, a German citizen,[15] has made more requests under the FOIA than any other person since it became law in 1966.[15] For more than ten years Schwarz has made repeated requests with many federal departments and agencies for public records the government says don\u0027t exist. Schwarz believes, and her requests are aimed to prove, that rather than having been born in Germany her actual birth was around 1956 inside a secret government submarine base called Chattanooga under the Great Salt Lake. She further believes herself to be daughter of Church of Scientology founder L. Ron Hubbard, himself the son of Dwight Eisenhower.[15][17] Further saying that she was then kidnapped, taken to Germany, and given a false identity including a German birth certificate which was doctored to conceal her actual birth in Utah.[15] Working from her Salt Lake City, Utah apartment or a nearby library at least one of Schwarz\u0027s lawsuits has been considered by a U.S. District or U.S. Circuit Court of Appeals somewhere in the nation every year since 1993 and has filed unsuccessful appeals to the U.S. Supreme Court.[15] One of her complaints to the U.S. District Court in Washington, D.C., set a record for voluminous litigation at 2,370 pages, naming 3,087 defendants, all of whom were employed as FOIA or \u0022Privacy Act\u0022 officers in the federal government claiming their denials to be part of a conspiracy to keep the truth from her. U.S. District Court Judge John Bates said the FOIA\u0027s \u0022admirable purpose is abused when misguided individuals are allowed (in this case repeatedly) to submit requests to every agency and subdivision of the government, seeking information about an imaginary conspiracy,\u0022 in a ruling against her.[15] Unencumbered by a lack of education in law or realistic requests, the foil to her quest is financial. She has mounted pro se litigation in the hopes of forcing these agencies to do more detailed searches and to waive the costs, claiming poverty, so far without success.[15] The Justice Department has advised federal employees charged with responding to FOIA requests that until Schwarz satisfies outstanding search and copying fees incurred by previous filings, future requests may legally be denied.\r\nhttp://home.snafu.de/tilman/Barbara_Schwarz_8.8.2006.html",
      "release": "2008-05-29T09:27:26Z",
      "duration": "00:00:09",
      "explicit": false,
      "youTubeId": "DMH94cJHXL4",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DMH94cJHXL4"
      }
    },
    {
      "id": "9086fee7-59f8-4c0e-bf8f-0a054ab2b5c7",
      "title": "Did hippies give birth to Anonymous?",
      "description": "?",
      "release": "2008-05-29T08:04:13Z",
      "duration": "00:04:35",
      "explicit": false,
      "youTubeId": "bnFF5sar9FA",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bnFF5sar9FA"
      }
    },
    {
      "id": "5d145185-0be2-4a2a-b5a4-21ed09720091",
      "title": "Charles Manson, a scientologist",
      "description": "http://web.archive.org/web/20070806024608/http://whale.to/b/manson.html\r\nhttp://www.xenu-directory.net/topics/charlesmanson.html\r\nhttp://www.lermanet.com/scientologyscandals/charlesmanson.htm\r\nhttp://www.lermanet.com/scientologyscandals/more-charlesmanson.htm",
      "release": "2008-05-29T07:23:01Z",
      "duration": "00:03:06",
      "explicit": false,
      "youTubeId": "yCIXf_nB_fc",
      "subjects": [
        "Scientology",
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yCIXf_nB_fc"
      }
    },
    {
      "id": "6cbe4fb0-d982-4598-a02a-8c9d3d4d3523",
      "title": "Will Smith\u0027s Scientology School",
      "description": "Australia\u0027s Sunrise program has Nelson Aspen discussing Hollywood and celebrities. Nelson discusses how people are pointing out the scientology connection with Will\u0027s new school\r\n\r\nCheck out the extensive rezsearch and see the scientology connections\r\nhttp://ocmb.xenu.net/ocmb/viewtopic.php?t=27487\r\nhttp://forums.enturbulation.org/15-breaking-news/will-smith-opens-scientology-school-14380/",
      "release": "2008-05-18T21:10:17Z",
      "duration": "00:01:18",
      "explicit": false,
      "youTubeId": "vbDPv9JKhys",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vbDPv9JKhys"
      }
    },
    {
      "id": "1629f1cf-99e0-4fc4-8fdc-5a70fc9e8684",
      "title": "Oprah Interviews Tom Cruise-Today Tonight Australia reports",
      "description": "Tom Taylor gives his perspective/insight into Oprah interviewing Tom Cruise.\r\n\r\nToo bad most people see scientology and cruise as whackos",
      "release": "2008-05-06T09:44:55Z",
      "duration": "00:03:48",
      "explicit": false,
      "youTubeId": "xcy8UIOQYlE",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xcy8UIOQYlE"
      }
    },
    {
      "id": "5deb9015-90a1-4521-8cf8-2e17b6f4426d",
      "title": "Jason Beghe :Scientology report on A Current Affair",
      "description": "Coincidence they did this as Today Tonight ran a killer report?\r\n\r\nNote the stark differences in the 2 reports.\r\n\r\nWho has a 25% share in Nine and has his best mate CEO of the network?",
      "release": "2008-04-17T09:23:07Z",
      "duration": "00:04:07",
      "explicit": false,
      "youTubeId": "DCxI1Gl1SXg",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DCxI1Gl1SXg"
      }
    },
    {
      "id": "eb779ae2-36ca-4566-a0dd-779602a50fe9",
      "title": "Jason Beghe on Scientology (Today Tonight report)",
      "description": "Bryan Seymour reports on Jason Beghe speaking out. Will there be more from Jason? If you take what A Current Affair said at the end of its report, then more \u0022dirt\u0022 will be \u0022dished\u0022. But what would ACA know about reporting the absolute facts about the cult of scientology? It\u0027s not as if their network is still partially owned by a scientologist and the CEO is his best friend.\r\n\r\nOOPS!!\r\nhttp://www.youtube.com/watch?v=GRMvOy7911Q\r\nhttp://www.youtube.com/watch?v=P6XK1uoQDAY\r\n\r\nhttp://www.news.com.au/story/0,23599,21750881-2,00.html",
      "release": "2008-04-17T09:11:12Z",
      "duration": "00:05:41",
      "explicit": false,
      "youTubeId": "--61oEkWGvM",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=--61oEkWGvM"
      }
    },
    {
      "id": "a6e36761-9bdd-48c9-bca9-9150d7eb8928",
      "title": "Narconon EXPOSED in Australia (A Current Affair report)",
      "description": "A current affiar yet again comes to the party for its buddy the cult of scientology. Although this report looks somewhat as being critical, for people that know enough, it was full of obfuscation and scientology styled \u0027apparency\u0027.\r\n\r\nACA even managed to pimp the bullshit success rates that narconon claim, via spokesclam  Nerida James. James was the very same lady that abruptly ended the Today Tonight interview, because the questions were formulated from a pro-scientology perspective.",
      "release": "2008-04-04T08:20:39Z",
      "duration": "00:04:23",
      "explicit": false,
      "youTubeId": "UzDCBPfFbjg",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UzDCBPfFbjg"
      }
    },
    {
      "id": "ffc698dd-6f61-4a0e-9a8b-cc17c611c300",
      "title": "NarCONon EXPOSED in Australia (Today Tonight Report)",
      "description": "Today Tonight again report on the facts and the facts only. Former high level scientologist Patty Pieniadz ran a narCOnon tentacle before she eventually left the church of scientology. Patty knows plenty about the con in NarCONon and tells it how it is.\r\n\r\nWhereas the NarCONon spokeshole, abruptly ended the interview, because formulated pro-cult questions werent haqppening.\r\n\r\nI guess thats why A Current Affair had Nerida James (ended the TT interview) on ACA\u0027s version and let the bullshit success rate get pimped more quite a bit.\r\n\r\nNine are lackey for the cult. Look through some of my clips and see what I mean",
      "release": "2008-04-04T08:05:08Z",
      "duration": "00:05:41",
      "explicit": false,
      "youTubeId": "JEX2cy3_hO8",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JEX2cy3_hO8"
      }
    },
    {
      "id": "c439505d-237e-4570-9f60-4eeb0b633c73",
      "title": "NarCONon EXPOSED in Australia (teaser/promo)",
      "description": "Today Tonight Australia, again step up to the plate in exposing the \r\ncon of scientology. TT have stated their \u0022special investigations unit\u0022 \r\nare reporting on the cults plans to recruit the vulnerable. \r\n\r\n\r\nIn just under 24 hours, the national broadcaster will be airing \r\nanother suppressive report about the cult of scientology, and how it \r\nuses NarCONon to recruit into the \u0027church\u0027. \r\n\r\n\r\nPatty P\u0027s interview of late is apparently included in the report. Dont \r\nknow how much if it though.\r\n\r\nThis is only the teaser/promo",
      "release": "2008-04-03T09:11:18Z",
      "duration": "00:00:33",
      "explicit": false,
      "youTubeId": "nlF5UDXhOyw",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nlF5UDXhOyw"
      }
    },
    {
      "id": "68372212-e303-4953-9645-d28ad16a5ccf",
      "title": "Scientology employs man with a gun to watch Anonymous?",
      "description": "Why would anyone have a concealed weapon at a protest about scientology?\r\nWas this man paid muscle by the cult? Why was this man seen exiting the cults own building?\r\nWho is this guy?",
      "release": "2008-03-17T01:59:45Z",
      "duration": "00:03:03",
      "explicit": false,
      "youTubeId": "zR8cd4Mp2dc",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zR8cd4Mp2dc"
      }
    },
    {
      "id": "bc34c633-111f-4c95-bf6d-59bd8c434b9c",
      "title": "Scientolgist James Barbour, convicted for sex with a child",
      "description": "In this clip, James Stacy Barbour is MC at the CCHR Gala at the Beverly Wilshire 25 Feb 2006. He thanks all those attending for the great work in CCHR\u0027s accomplishments. He welcomes State Senators, dignitaries including representatives of the consultates of Chile, Chec republic, Ireland, St Vincent and The Grenadines.\r\n\r\n\r\nJames Barbour was sentenced Friday 29 April 2008  to 60 days in jail and three years\u0027 probation for sexual encounters with a 15-year-old drama student.\r\nhttp://news.yahoo.com/s/ap/20080301/ap_en_mu/broadway_actor_sentence;_ylt=AmhNg7jeCuAdcta0zUIgJBZxFb8C\r\n\r\nBarbour had fought long and hard after being indicted on nine counts charging him with sexually abusing and endangering the welfare of minor.\r\nhttp://www.realitytvworld.com/news/broadway-actor-james-barbour-in-court-on-sexual-abuse-charges-1010787.php\r\n\r\nBarbour wasnt apparently a scientologist at the time he was having sex with a child.\r\nhttp://www.truthaboutscientology.com/stats/by-name/j/james-barbour.html\r\nBut since his joining scientology and practicing the \u0022applied religious philosophy\u0022, he has applied scientology \u0022ethics\u0022 right down to its true mean. To wit:\r\nThe Purpose of Ethics is\r\nTO REMOVE COUNTER INTENTIONS FROM THE ENVIRONMENT.\r\nAnd having accomplished that the purpose becomes\r\nTO REMOVE OTHER INTENTIONNESS FROM THE ENVIRONMENT.\r\n\r\nBarbour took a plea bargain for a very good reason, its because he was guilty of having sex with a minor and lied about it from the beginning\r\nhttp://www.nytimes.com/2008/01/04/nyregion/04actor.html?_r=1\u0026oref=slogin\r\n\r\nIt was just over a year ago Barbour and his laywer were trying to have evidence disqualified, that would see barbour do much more than the poulty 60 days he weasled\r\nhttp://www.nypost.com/seven/02082007/news/regionalnews/sex_tape_is_illegal_says_beast_regionalnews_laura_italiano.htm\r\n\r\nThen, only a matter of months later, Barbour and his lawyer seek orders to have the victims name published.\r\nThis is a typical scientology tactic, to discredit and destroy the enemy.\r\n\r\nThe Church of Scientology have protected child molesters and child rapists before.\r\n\r\nhttp://www.shipbrook.com/jeff/CoS/strawn/index.html\r\nhttp://www.whyaretheydead.net/childabuse/pedophile/Gabriel_Williams.html\r\n\r\n\r\nIf people arent starting to wonder that something just isnt quite right about this \u0022applied religious philosophy\u0022 that is from the church of scientology, then they need to learn what the church is trying to achieve and suppress.\r\n\r\nThese details above are not a slight on scientologists in general, as the vast majority are good people. But as Voltaire once said:\u0022Those who can make you believe absurdities can make you commit atrocities\u0022\r\n\r\nhttp://sexual.taxexemptchildabuse.net/\r\nhttp://www.taxexemptchildabuse.net/\r\nhttp://exscientologykids.com/",
      "release": "2008-03-05T03:00:59Z",
      "duration": "00:00:26",
      "explicit": false,
      "youTubeId": "Tca-FCcBbAc",
      "subjects": [
        "Scientology",
        "_Ireland"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Tca-FCcBbAc"
      }
    },
    {
      "id": "dbce5fcb-7c3e-4140-b994-3365a786f87d",
      "title": "Anonymous protest of Cof$ in Sydney on A Current Affair",
      "description": "This is the packer/scientology influenced version of events in Sydney. No mention of anything global, just that protesters are \u0022cyber terrorists\u0022. Note the implication that Jenna has decided to speak out to \u0022embarrass\u0022 Miscavige and Cruise. Also note how Howard Gipps(the reporter) calls them all paranoid etc. Also note that Howard all but says internet protesters are responsible for computer problems CSA Inc now mysteriously have.\r\n\r\nYOU SUCK Channel 9, seriously",
      "release": "2008-02-11T08:39:16Z",
      "duration": "00:03:48",
      "explicit": false,
      "youTubeId": "Vx1NObrUlzk",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Vx1NObrUlzk"
      }
    },
    {
      "id": "efe1b6cf-0561-475e-bf87-26af3c06a558",
      "title": "Anonymous Protest in Sydney on Today Tonight",
      "description": "TT opens with how this is global. Footage of Evie again appears as she explains where the term Anonymous came from, and how anyone can claim it as their own. The Fox News reports get a mention in the report, but it didnt seem to come across as though the reporter was attributing the Stadium/van report as being from Anonymous of the now. Watch it and decide for yourselves. The opposing network also ran a story on the pickets, it was starkingly different and not in a positive way either",
      "release": "2008-02-11T08:16:20Z",
      "duration": "00:03:41",
      "explicit": false,
      "youTubeId": "5WSHTPw65EM",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5WSHTPw65EM"
      }
    },
    {
      "id": "db6001e4-f66b-4236-89fb-db84af0f0ecc",
      "title": "Anonymous protest in Sydney --Feb 10",
      "description": "Why are video\u0027s now stopping 1 second short of playing the whole video?",
      "release": "2008-02-10T03:48:14Z",
      "duration": "00:01:02",
      "explicit": false,
      "youTubeId": "_TVXLU2mRsI",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_TVXLU2mRsI"
      }
    },
    {
      "id": "c5d2b7f0-4628-434f-9390-c0ff5b114a26",
      "title": "Scientology: Anonymous Interviewed on Australian TV 7/2/08",
      "description": "I am you, you are me.\r\n\r\nWe are Anonymous",
      "release": "2008-02-07T08:11:11Z",
      "duration": "00:04:10",
      "explicit": false,
      "youTubeId": "cyvULIxHJlE",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cyvULIxHJlE"
      }
    },
    {
      "id": "d4d6f984-dc58-4262-932d-e43d544dc867",
      "title": "David Miscavige\u0027s NIECE talks of SCIENTOLOGY\u0027s disconnection",
      "description": "David Miscavige\u0027s own niece now speaks out about disconnection.",
      "release": "2008-02-06T02:54:26Z",
      "duration": "00:04:08",
      "explicit": false,
      "youTubeId": "P3i1EuvuL1U",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P3i1EuvuL1U"
      }
    },
    {
      "id": "e1f187c3-ac98-4c3f-ba4c-df0fd207e931",
      "title": "Inside Edition: Jenna Miscavige Interview (trailer)",
      "description": "How can scientology bring families together, when its own C.O.B disconnects himself?",
      "release": "2008-02-06T00:40:45Z",
      "duration": "00:00:20",
      "explicit": false,
      "youTubeId": "4jjT9S4WLMo",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4jjT9S4WLMo"
      }
    },
    {
      "id": "bda3dc8d-c34e-460e-8d78-e1a5ea710ae2",
      "title": "Bart Simpson the Scientologist",
      "description": "After Nancy using her Bart Simpson character to invite scientologists to an event soon, this video description now includes a link to the recorded message by Nancy Cartwright. on Gawker.com and their report\r\nhttp://gawker.com/5141600/foxs-limp-rebuke-to-scientology-bart-simpson-calls\r\n\r\nToday Tonight originally reports on contributions to the \u0027church\u0027.including Nancy(Bart Simpson) Cartwright and her donating 10mil, twice what Cruise donated .",
      "release": "2008-01-31T08:07:34Z",
      "duration": "00:03:27",
      "explicit": false,
      "youTubeId": "gPnwvZQai9c",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gPnwvZQai9c"
      }
    },
    {
      "id": "f16318a5-6c9d-4195-8843-26172f67de9e",
      "title": "Nicole Kidman disconnected from her children by Tom Cruise",
      "description": "This report is on the surface critical/questioning of scientology. Not once did the word \u0022disconnection\u0022 appear at any stage.",
      "release": "2008-01-28T08:25:30Z",
      "duration": "00:07:34",
      "explicit": false,
      "youTubeId": "2tsWahyf18o",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2tsWahyf18o"
      }
    },
    {
      "id": "1e78920c-c78a-4bd9-982c-5212b323cb66",
      "title": "Bill O\u0027Reilly reports on threat of litigation by Scientology",
      "description": "The Church of Scientology again shows what hubbards \u0022A Manual on the Dissemination of Material\u0022 is all about.\r\n\r\n\u0022The purpose of the suit is to harass and discourage rather than to win. The law can be used very easily to harass, and enough harassment on somebody who is simply on the thin edge anyway, well knowing that he is not authorized, will generally be sufficient to cause his professional decease. If possible, of course, ruin him utterly.\u0022\r\nL Ron Hubbard",
      "release": "2008-01-25T04:58:52Z",
      "duration": "00:06:05",
      "explicit": false,
      "youTubeId": "2BeosWfs8yg",
      "subjects": [
        "Scientology",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2BeosWfs8yg"
      }
    },
    {
      "id": "e5069e9f-63ba-40f1-bb22-7c50b0ddc950",
      "title": "ACA Australia interviews Andrew Morton on his Cruise bio",
      "description": "Andrew Morton is interviewed on A Current Affair Australia. Nine yet again demonstrates its fluff styled reporting on the cult of scientology. James Paker;s best mate heads up mamagement at Nine and this report only show a small clip of the leaked 2004 AIS event videos. Certainly none of the footage that shows what scientology does to people and how brianwashed and deluded they become as scientologists.",
      "release": "2008-01-21T08:49:25Z",
      "duration": "00:08:56",
      "explicit": false,
      "youTubeId": "DW7kiKUJnT8",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DW7kiKUJnT8"
      }
    },
    {
      "id": "7cebf1bd-abd6-4176-bd9e-51e99b5055d3",
      "title": "Today Tonight report on Packer at 2004 leaked video event",
      "description": "Scientology is against gambling, ron said so. He even wrote a bulletin called \u0022The Gambler\u0022 and how they are psychotic. So wwhy does james Packer want to earn money from peoples \u0022overts\u0022, if he as a scientologist is suppose to help people?\r\n\r\nHCO BULLETIN OF 16 MARCH 1977 \r\nRemimeo \r\nExpanded Dianetics Series 25 \r\n\r\nTHE GAMBLER \r\n\r\nAn obsessive gambler is a psychotic just like a drug addict or an alcoholic. \r\n\r\nThey are handled the way you handle any other psychotic. They don\u0027t have to do anything for real in life because it all depends on chance and never on themselves. So you have them on the minus effect scale. \r\n\r\nLife isn\u0027t real to a psychotic gambler and therefore they never really buckle down to anything. Consequences are unreal to them and criminal acts are incomprehensible as nothing is real anyway. \r\n\r\nGetting off overts is nothing to such people because they are not there and take no responsibility for them. Everything else is responsible -- not them. Thus you have to find the trail to the R/Ses on the subject and discharge those. \r\n\r\nThis aspect of such a case is the emergency number one handling. \r\n\r\nIt has to be recognized for what it is -- PSYCHOSIS. \r\n\r\nL. RON HUBBARD \r\nFounder",
      "release": "2008-01-21T08:08:45Z",
      "duration": "00:04:11",
      "explicit": false,
      "youTubeId": "GRMvOy7911Q",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GRMvOy7911Q"
      }
    },
    {
      "id": "3d3f2e47-05bf-493e-9ec9-ec9751d96c0d",
      "title": "A Current Affair to DEAD AGENT Andrew Morton in interview?",
      "description": "James Packers old network are airing an interview with Andrew Morton tonight. As can be seen in this very small promo-clip of the interview, it sounds just like DEAD AGENTING ala Hubbard and scientology. Channel 9 is still run my Packers best mate and obviously Nine may be as influenced by Packer and his mates than ever.\r\n\r\nThe link is to DEAD AGENTING and how it all works.\r\nhttp://www.xs4all.nl/~johanw/CoS/hostile-contacts.txt",
      "release": "2008-01-21T06:12:31Z",
      "duration": "00:00:17",
      "explicit": false,
      "youTubeId": "Az7dkKJd41I",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Az7dkKJd41I"
      }
    },
    {
      "id": "042578bd-b5fd-4deb-a949-b3c0e2dafb1a",
      "title": "Tom Cruise on Scientology -Today Tonight Australia",
      "description": "Very good report from Today Tonight Australia that covers various aspects of scientology, including some of its front groups. Bryan Seymour explores several aspects of the hidden and dark side of scientology that the world is becoming much more aware of.",
      "release": "2008-01-17T12:16:08Z",
      "duration": "00:10:29",
      "explicit": false,
      "youTubeId": "WsCqJLvXSMY",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WsCqJLvXSMY"
      }
    },
    {
      "id": "602ee45c-2940-4d9a-9364-f7141eee02de",
      "title": "Tom Cruise Videos : About those videos of you",
      "description": "A video message from an SP to Tom Cruise",
      "release": "2008-01-16T02:12:31Z",
      "duration": "00:06:25",
      "explicit": false,
      "youTubeId": "UzCLuRRnaWM",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UzCLuRRnaWM"
      }
    },
    {
      "id": "dc06b6f5-d615-40fe-a538-0716c9086136",
      "title": "Scientology:Andrew Morton\u0027s Tom Cruise Biography controversy",
      "description": "Today Tonight Australia reports on Andrew Morton\u0027s book not being carried by the two largest book retailers in Australia. Problem is, the retailers said they wouldnt stock the book through fear of litigation at first. Now it seems as though another excuse was given by Dymocks. The Andrew Morton book is available in Australia and people are going to buy it. Tom Cruise is included in the report and shows a little of what all you \u0022wogs\u0022 (\u0022common ordinary run-of-the-mill garden-variety \r\nhumanoid\u0022--Scientology dictionary definition) are missing in the \u0027game\u0027",
      "release": "2008-01-15T08:55:30Z",
      "duration": "00:05:24",
      "explicit": false,
      "youTubeId": "xF3Jg-FiZRA",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xF3Jg-FiZRA"
      }
    },
    {
      "id": "82874e7e-f68b-4629-9771-11619120a304",
      "title": "Scientology: Blackmailing Celebrities to control them",
      "description": "A report on Today Tonight Australia about the unauthorized bio of Tom Cruise by Andrew Morton. Bruce Hines is interviewed about his auditing of Nicole Kidman, who may well be being blackmailed into silence to control her from speaking out. The Morton Bio about Cruise may well shake the foundations of the cult of scientology not seen in many decades.",
      "release": "2008-01-07T08:43:35Z",
      "duration": "00:05:18",
      "explicit": false,
      "youTubeId": "V0P2Nd3O0Qc",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V0P2Nd3O0Qc"
      }
    },
    {
      "id": "2c665d90-678e-468c-987b-5d4470df081c",
      "title": "Scientology: Bill O\u0027reilly calls Cruise a nut",
      "description": "In todays body language segment, Posh is examined RE her appearence on Larry King and her being questioned about Cruise pushing $cientology on her and Becks.\r\n\r\nRight at the 1m22sec mark, Bill O\u0027reilly says \u0022Tom is a nut\u0022",
      "release": "2007-12-18T10:46:04Z",
      "duration": "00:01:27",
      "explicit": false,
      "youTubeId": "UxxzRVmW7tM",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UxxzRVmW7tM"
      }
    },
    {
      "id": "4518c35c-87a9-4c6b-8562-41d42b4dca52",
      "title": "Scientology in peril",
      "description": "CNN report on Germany\u0027s scientology tentacle in peril",
      "release": "2007-12-15T22:05:14Z",
      "duration": "00:02:50",
      "explicit": false,
      "youTubeId": "xLnaWGXjpOU",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xLnaWGXjpOU"
      }
    },
    {
      "id": "fecf2e55-5562-420a-8bed-8be2590bab5c",
      "title": "Scientology: Germany and Cruise controversy",
      "description": "Video report from CNN that speaks of Germany\u0027s exposing of Scientology and Cruise\u0027s involvement.",
      "release": "2007-12-13T00:34:10Z",
      "duration": "00:04:06",
      "explicit": false,
      "youTubeId": "rg4I7RNi6zc",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rg4I7RNi6zc"
      }
    },
    {
      "id": "bff3ee36-72d8-4c3f-80af-57abf8f2bc07",
      "title": "Pink Munky:\u0022 Wassa madda wit you, hat\u0022?",
      "description": "Pink Munky nails it with a funky mix to hubbards own insane ramblings from his lectures",
      "release": "2007-12-08T20:34:33Z",
      "duration": "00:05:40",
      "explicit": true,
      "youTubeId": "2iy0HMrRcYs",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2iy0HMrRcYs"
      }
    },
    {
      "id": "53daebb7-cff3-4b66-9769-b55875b094df",
      "title": "Scientology: Contractor Scuffling with Church of Scientology",
      "description": "A contractor is caught in a business battle over religion. He is struggling to get the Michigan Church of Scientology to pay its bill for air conditioning work performed in June. FOX 2\u0027s Bill Gallagher worked to get some answers and got stonewalled.\r\n\r\nALWAYS ATTACK AND NEVER DEFEND!",
      "release": "2007-11-21T21:52:50Z",
      "duration": "00:01:39",
      "explicit": false,
      "youTubeId": "I9uXd_71yrM",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I9uXd_71yrM"
      }
    },
    {
      "id": "813bdf20-9475-4c9e-85c0-66a8fca41b7f",
      "title": "Scientology: Tom Cruise biography",
      "description": "Will Andrew Morton\u0027s bio of the cruiser enturbulate both KatIE and Tom?\r\n\r\nFirst 1m30 is about the Morton upcoming bio that will shake TC\u0027s MEST.",
      "release": "2007-11-11T03:10:31Z",
      "duration": "00:03:52",
      "explicit": false,
      "youTubeId": "e_LjMTsGX18",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e_LjMTsGX18"
      }
    },
    {
      "id": "9a691fb3-16c7-4e91-8ae4-e4984b070f09",
      "title": "Landmark Education",
      "description": "Landmark Education\r\nEST = Landmark = Scientology?\r\nAre they all mind control from the same poisoned L Ron Hubbard tree of \u0022human discovery\u0027?",
      "release": "2007-11-02T08:59:01Z",
      "duration": "00:07:03",
      "explicit": false,
      "youTubeId": "hilv39oLOss",
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hilv39oLOss"
      }
    },
    {
      "id": "5f175566-fbac-444a-99a3-8750f630c111",
      "title": "Scientology: Delusions from new scientologist LaJuan Preston",
      "description": "Imagine someone looking at Scientology via the Internet and then immediately joining staff? RTC have claimed copyright violation on the 4 other videos of indoctrinated clams and youtube removed them.",
      "release": "2007-10-13T13:53:18Z",
      "duration": "00:04:02",
      "explicit": false,
      "youTubeId": "034C8Ri9lKw",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=034C8Ri9lKw"
      }
    },
    {
      "id": "7fec66ed-470b-434c-9038-c1befb52d728",
      "title": "Scientology:Anti-Christ religion?",
      "description": "Listen with your own ears and know what is behind the curtain of this so-called religion. Gumby put this clip together, and it keeps getting taken down because the cult of scientology cannot confront how hubbards own words exposes the con of scientology.",
      "release": "2007-10-13T07:47:53Z",
      "duration": "00:00:59",
      "explicit": false,
      "youTubeId": "HcBHWmvETqM",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HcBHWmvETqM"
      }
    },
    {
      "id": "36d5b820-fb4f-49d5-80a3-9272c6dd5deb",
      "title": "Scientology:Tom Cruise-Through the Lense exposed Pt 5",
      "description": "Tom Cruise the Celebritologist exposed through the lense",
      "release": "2007-10-11T14:18:07Z",
      "duration": "00:08:05",
      "explicit": false,
      "youTubeId": "3L02JS4dRlw",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3L02JS4dRlw"
      }
    },
    {
      "id": "688c08bd-4779-4f26-aefc-84d3bfc93baa",
      "title": "Scientology:Tom Cruise-Through the Lense exposed Pt 4",
      "description": "Tom Cruise the Celebritologist exposed through the lense",
      "release": "2007-10-11T13:53:37Z",
      "duration": "00:09:53",
      "explicit": false,
      "youTubeId": "ur5a5jdinNE",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ur5a5jdinNE"
      }
    },
    {
      "id": "0ab62623-8775-47b7-a192-2d9358aa2c3f",
      "title": "Scientology:Tom Cruise-Through the Lense exposed Pt 3",
      "description": "Tom Cruise the Celebritologist exposed through the lense",
      "release": "2007-10-11T13:16:56Z",
      "duration": "00:08:37",
      "explicit": false,
      "youTubeId": "B_ejhjAltMk",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=B_ejhjAltMk"
      }
    },
    {
      "id": "12260fdb-6094-428b-be04-1e6219a45d30",
      "title": "Scientology:Tom Cruise-Through the Lense exposed Pt 2",
      "description": "Tom Cruise the Celebritologist exposed through the lense",
      "release": "2007-10-11T12:39:07Z",
      "duration": "00:08:02",
      "explicit": false,
      "youTubeId": "ost5eZLkXKE",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ost5eZLkXKE"
      }
    },
    {
      "id": "cf774981-707f-4e28-a32e-137419639f2f",
      "title": "Scientology:Tom Cruise-Through the Lense exposed Pt 1",
      "description": "Tom Cruise the Celebritologist exposed through the lense",
      "release": "2007-10-11T12:16:32Z",
      "duration": "00:07:02",
      "explicit": false,
      "youTubeId": "68hiyHjOzHs",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=68hiyHjOzHs"
      }
    },
    {
      "id": "f37e6953-2848-4c73-a10e-07f015267f0e",
      "title": "Scientology--Exposed in Germany",
      "description": "Documentary outlining a little of why scientology is a danger to everyone not willing to be a scientologist. \r\n\r\n\u0022We\u0027re playing for blood, the stake is EARTH.\u0022 \r\nL. Ron Hubbard -HCOPL 7 November 1962\r\n\r\nThey\u0027d rather have you DEAD then incapable, its called \u0022keeping scientology working\u0022",
      "release": "2007-09-06T01:11:33Z",
      "duration": "00:06:17",
      "explicit": false,
      "youTubeId": "RygvwX-tsss",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RygvwX-tsss"
      }
    },
    {
      "id": "3cbc913d-78bf-477e-a3fa-0c116d117f9d",
      "title": "Scientology: L- Rundowns\u0022I can\u0027t tell you anything about it of course\u0022",
      "description": "Valley Grrrl does L10: \u0022I was like Owwh...mah...Gaawdd!...I wish I could tell you but I signed this waiver.\u0022 \r\n\r\nSee just how irrational scientology makes its adherents. Dont bother asking how it helps them, they cant tell you because all they know is \u0022it works\u0022. Well, if it works, how/why did Mario Majorski end up being so insane?\r\n\r\nhttp://www.truthaboutscientology.com/stats/by-name/m/mario-majorski.html\r\n\r\nPierre Either stated:\r\n\u0022Being highly trained, I read many sessions C/Sed by LRH for XDN, CL VIII, OT 1II repairs, L-10,11,12, when the person had become psychotic, even suicidal. Most of L-11 for instance was developed from the case of a staff member who had become intensely and violently psychotic on the Apollo. (In C/S 22 LRH mentions that a CL XI has a \r\ndifferent approach to handle psychosis). After all throughout those materials, LRH boasts that he has the cure to insanity Unfortunately checking into the later track of all those pcs, one finds the bulk of them, far from being the Supermen they were made to attest to, were for the most part later declared SP, showed very aberrated behaviour and failed as execs. The original psychotic out of whom L-11 was derived was named Peggy McCall and her auditor was Liese Klingsvall. \r\nAccording to the case history she had been found to be raving hostile remarks against LRH and had been \u0022violent\u0022 (no specifics). LRH invented from the top of his head a process later known as C/S series 37R claiming she would be permanently cured of her insanity by it. After auditing that action and a few other steps (which is textually L-11 as given today) she was made to attest and offloaded. This shows that a powerful rundown claimed to cure insanity, was piloted on ONE person beside LRH doing it solo on himself before being labelled as \u0022full3,\u0027 researched and vindicated\u0022. The name of the pc on whom L-11 is based is Peggy McCall who went crazy and was locked up on the Apollo in 1971. \u0022  http://www.lermanet.com/cos/inside.html",
      "release": "2007-08-27T02:14:24Z",
      "duration": "00:02:46",
      "explicit": false,
      "youTubeId": "hZGi7cBvd5w",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hZGi7cBvd5w"
      }
    },
    {
      "id": "2f6e9964-1a65-4dca-83b5-2697a8579cb8",
      "title": "Scientology--Rig  online polls so they look legitimate",
      "description": "Today Tonight Australia reports on an online poll open to Australians run at The Sydney Morning Herald\u0027s website. The poll wasnt going well for the cult, but after an email was circulated from the Grade V in Sydney, a funny thing happened when us aussies were supposed to be asleep. The vote was soon turned around and is reported by the SMH Editor as \u0027odd\u0027 and indicative something wasnt quite right. It isnt the first time an online poll had some \u0027oddities\u0027 when it involves Scientology. The report includes how a Tom Cruise poll had 14,000 votes cast from only 10 computers at a parade.com poll on Tom Cruise",
      "release": "2007-07-12T09:15:23Z",
      "duration": "00:03:12",
      "explicit": false,
      "youTubeId": "isDG_FrHffo",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=isDG_FrHffo"
      }
    },
    {
      "id": "fec0657a-fe26-410f-b833-8f08296cb1d7",
      "title": "Scientology admits being connected to murdered parishoners",
      "description": "Denials were made intitially by CSA President Vicki Dunstan, that the victims of the murders in Sydney were not in fact scientologists at all and had zero connection to the church. In this footage there is no doubt anymore that scientology is the religion of the family involved as per Scientology\u0027s spokesclams admissions",
      "release": "2007-07-11T02:09:50Z",
      "duration": "00:01:24",
      "explicit": false,
      "youTubeId": "BOA42DDacCo",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BOA42DDacCo"
      }
    },
    {
      "id": "fbb6ca9e-2711-422c-9aa7-220345f9c51d",
      "title": "Scientology kills via belief",
      "description": "A Current Affair  reports on a young women from a family of scientologists who is primarily denied real science based medicine because of her faith in scientology\u0027s quackery. The woman ended up murdering her own father and 15 yr old sisiter. This story is remarkably similar to the Perkins tragedy in 2003 where another scientologist stabbed his own scientologist mother 77 times...she died a brutal death",
      "release": "2007-07-10T10:08:04Z",
      "duration": "00:04:34",
      "explicit": false,
      "youTubeId": "BXGQChT4-ik",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BXGQChT4-ik"
      }
    },
    {
      "id": "5ca9284c-d4c4-4f7d-9ebe-0008daa977d8",
      "title": "Scientology Murders --Belief can lead to murder",
      "description": "Today Tonight reports on a young women from a family of scientologists who is primarily denied real science based medicine because of her faith in scientology\u0027s quackery. The woman ended up murdering her own father and 15 yr old sisiter. This story is remarkably similar to the Perkins tragedy in 2003 where another scientologist stabbed his own scientologist mother 77 times...she died a brutal death",
      "release": "2007-07-10T09:51:52Z",
      "duration": "00:05:25",
      "explicit": false,
      "youTubeId": "S4AwDLKb_YE",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S4AwDLKb_YE"
      }
    },
    {
      "id": "05b1c511-22b0-43df-8b05-393d9736f7f6",
      "title": "Scientology--James Packer wasting away his fathers fortune",
      "description": "Kerry would be kicking Jamies arse if he knew what has been done to his once flourishing multi-billion dollar business.",
      "release": "2007-06-22T02:19:24Z",
      "duration": "00:04:45",
      "explicit": false,
      "youTubeId": "M_z0B45r1AA",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=M_z0B45r1AA"
      }
    },
    {
      "id": "118a55a5-e2eb-4ed5-8e42-511c110f8c3b",
      "title": "Scientology--James Packer the scientologist",
      "description": "Jamie has been systematically selling off his PBL interests to fuel his interests in Gaming and Gambling since he became a scientologist. How elronic that since he was introduced to scientology by Tom Cruise, that he wants to make money in a business that is fuelled by \u0027overts\u0027 according to his own religion of $cientology.\r\n\r\nWell done Jamie, your father Kerry would kick your arse if alive.",
      "release": "2007-06-01T07:41:01Z",
      "duration": "00:03:59",
      "explicit": false,
      "youTubeId": "P6XK1uoQDAY",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P6XK1uoQDAY"
      }
    },
    {
      "id": "7a8c3038-7dae-4f2c-88ba-fff95727b0cb",
      "title": "Scientology report on Today Tonight Australia",
      "description": "TT in Australia does a follow up story after it aired Panorama and local scientologists were emailed to DEAD AGENT what TT had shown the previous night.\r\nSubject : PLEASE SEE - WE NEED YOUR HELP NOW TO DEAD AGENT WHAT AIRED TONIGHT \r\n\r\nDear Scientologist, \r\n\r\nYou may have seen the TV tonight Church spokesperson Virginia Stewart was interviewed on a Current Affair regarding the BBC panorama TV show that Channel 7 showed tonight. \r\n\r\nChannel 7 set up the whole show and aired the UK program and showed nothing of our side of the story however Channel 9 came and interviewed us and gave our side of the story. The program is completely biased and full of lies. \r\n\r\nGo to www.freedommag.org to watch the Church\u0027s documentary about the making of the BBC show. This gives the real story. \r\n\r\nPlease we need to have our voices heard. Put your story about Scientology and what you got out of it on http://au.todaytonight.com/contact \r\n\r\nAlso go to A Current Affair website and write down what you got out of Scientology as well. \r\n\r\nTell all of your friends. \r\n\r\nML, \r\nGina and Virginia",
      "release": "2007-05-20T01:02:53Z",
      "duration": "00:06:55",
      "explicit": false,
      "youTubeId": "cb5yRv3r3L4",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cb5yRv3r3L4"
      }
    }
  ]
}