{
  "id": "c28c8c49-1b67-4da5-b0e8-54f6e419f3af",
  "name": "Tuko / Tuco - Kenya",
  "youTubeChannelId": "UCl6ICaB9meBcSMQ5Zmr446g",
  "episodes": [
    {
      "id": "87e69e74-3097-41bc-8457-74e81072ce59",
      "title": "I married a demonic husband who recruited our children into the cult | Tuko TV",
      "description": "Watch as Annah narrates how her ex husband sourced wealth from the devil and recruited their kids into the demonic cult.\n\nFor business inquiries you can reach us at marketing@tuko.co.ke\n\n⚡️ Join TUKO Membership and get extra content and gifts:\nhttps://www.youtube.com/channel/UCl6ICaB9meBcSMQ5Zmr446g/join\n❗️ Help us share more untold stories! Support us via the link: https://www.patreon.com/tuko \n🌟 TO READ MORE STORIES LIKE THIS ONE, CHECK https://www.tuko.co.ke/people/\n\nTuko Talks | Tuko TV\nOne-on-one interviews at Tuko\u0027s, just the guest and their story. People open up on their real-life experiences, share their stories for other people to learn, get inspiration, and find a solution when there seems to be none. On Tuko Talks you will hear stories that people never tell in public, you will see that you are not alone in this world and that you can protect yourself!\nhttps://youtube.com/playlist?list=PLcx7jxmk8lD-fT_Q9YPXI2jsD-yPVZN6-\n\nMy Story | Tuko TV\nHighlighting underreported stories across the country by traveling and meeting people at the place of their living. In this playlist, Tuko.co.ke is ready to present to you the most interesting feature stories across the country. Watch as people open up and share their deepest stories for the first time with our audience. From a mother being told her daughter has less than eight months to live to a Kenyan woman who decides to marry herself.\nhttps://youtube.com/playlist?list=PLcx7jxmk8lD8gMi_yFEgAXVc0E1zbRo_G\n\nWebsite: https://www.tuko.co.ke/​​​​​​\nVisit TUKO’s official YouTube channel to get today’s breaking news, the latest and most relevant updates, find out more about the most pressing issues in Kenya, Nairobi news, and entertainment news.\n#tukotv​​​​​​​​​​​​​​ #tukonews​​​​​​​​​​​​​​ #tukocoke​​​​​​​​​​​ #tukotalks #kenyapeoplelife",
      "release": "2025-10-29T06:33:56Z",
      "duration": "01:56:56",
      "explicit": false,
      "youTubeId": "9cvTirf5VBw",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9cvTirf5VBw"
      }
    }
  ]
}