{
  "id": "dc17623d-0572-40b8-901d-f48a400aaabd",
  "name": "Two Crime Besties",
  "spotifyId": "2rxqw0pAVZuFhUL8xFvtNO",
  "appleId": 1751468932,
  "episodes": [
    {
      "id": "c8092b00-b9a2-4307-860b-27744591961d",
      "title": "Episode 67 - Elizabeth Struhs \u0026 The Saints Cult",
      "description": "Summary: This conversation delves into the tragic case of Elizabeth Struhs, an eight-year-old girl who died due to medical neglect stemming from her family\u0027s extreme religious beliefs. The discussion covers the family\u0027s background, the cult they were involved in, the neglect Elizabeth faced when she fell ill, and the subsequent legal consequences for her parents and other cult members. The conversation highlights systemic failures in child protection and the need for changes to prevent such tragedies in the future. Keywords: Elizabeth Struhs, cult, medical neglect, child protection, manslaughter, Queensland, family tragedy, systemic failures, religion, child welfare Sources and other links Sins of the Saints, A Current Affair The Saints, 9Podcasts If any of our content is distressing \u0026 you need to talk (Australia): Lifeline Phone: 13 11 14 https://www.lifeline.org.au/ Or please seek assistance in your country Check us out on our socials for images and updates: ⁠TikTok⁠ ⁠Instagram⁠ ⁠Facebook⁠ Join us on Patreon: Our brand new Patreon Two Crime Besties: Crime Adjacent is here! More laughs, more banter, more crime-adjacent chaos. Join us for bonus episodes — subscribe now! ⁠Patreon.com/twocrimebesties We have set up “Buy Me a Coffee”. If you\u0027d like to keep us caffeinated (or wined \u0026#x1f609;) while we prep our next episode, please feel free to ⁠Click Here⁠ to buy us a coffee. Stay curious, crime besties! Disclaimer: The content of this podcast is intended for mature audiences. The topics discussed may contain sensitive material related to real-life crimes, violence, and distressing events that may be disturbing or triggering. All opinions expressed are those of the hosts and guests and do not reflect the views of any organisations or entities associated with the production. While we strive to provide accurate and factual information, true crime stories may involve speculation, theories, and varying interpretations of events. Some details may be presented in a way that is meant to engage and educate rather than to sensationalise. Listener discretion is advised. Chapters: 00:00 The Passage of Time and Holiday Preparations 09:47 Introduction to Elizabeth Struhs\u0027 Case 20:03 The Struhs Family Background and Beliefs 29:51 The Cult of the Saints and Its Impact 39:52 Elizabeth\u0027s Illness and Medical Neglect 49:42 The Tragic Death of Elizabeth Struhs 59:34 Aftermath and Legal Consequences 01:09:36 Reflections on Systemic Failures and Future Changes",
      "release": "2025-10-27T14:00:00Z",
      "duration": "01:28:11.5950000",
      "explicit": true,
      "spotifyId": "2XldWTwXavnu6sew0CJtPk",
      "appleId": 1000733702549,
      "subjects": [
        "The Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2XldWTwXavnu6sew0CJtPk",
        "apple": "https://podcasts.apple.com/podcast/episode-67-elizabeth-struhs-the-saints-cult/id1751468932?i=1000733702549"
      }
    }
  ]
}