{
  "id": "83380f77-c02b-4b2b-bde6-793cb3a9985c",
  "name": "UK Soap Spoilers_Coronation Street",
  "youTubeChannelId": "UCT_c5OK5vTy5ex_eYvNJdsA",
  "episodes": [
    {
      "id": "b23d00cd-f55a-4fea-bcc7-fe167c8206e1",
      "title": "Coronation St Spoilers: Jane Danson Doubts Leanne Cult Story, Carla Connor Romance Rumors Addressed",
      "description": "Coronation Street: Carla Connor Romance Rumors Addressed - BAD NEWS | Coronation Street spoilers\nIcon Returns to Coronation Street and Gets HUGE Shock! Episode Spoilers | Coronation Street spoilers\nCoronation Street Spoilers: Star Jane Danson Doubts Leanne Cult Story | Coronation Street spoilers\nFuture Stories for 9 Key Characters Revealed | Coronation Street spoilers\nYou guys just watched a product of Coronation Street Spoilers New channel ,see you in the next video\nWe talk soaps:Coronation Street spoilers\n\nVideos use google search images, so if there\u0027s a copyrighted image, please contact me. I have searched for other materials through domestic and foreign newspaper sources to get information for the video above\nVideos refer to the documents at the website: digitalspy, metro\n\n#Coronation Street #Laurel #ShockingTwist #Kidnap #DeadlyConsequences #Peril #SoapOpera #Drama #TVShow #Twist #Suspense #PlotTwist #MustWatch #Emotional #Unveiling #FamilyDrama #EdgeOfYourSeat #AddictiveTV #Coronation StreetFan #mustsee #Coronation Street2024, #Coronation \n\nCoronation Street (colloquially referred to as Corrie) is a British television soap opera created by Granada Television and shown on ITV since 9 December 1960. The programme centres on a cobbled, terraced street in the fictional Weatherfield, a town based on inner-city Salford, England.\n\nOriginally broadcast twice weekly, the series began airing six times a week in 2017. The programme was conceived by scriptwriter Tony Warren. Warren\u0027s initial proposal was rejected by the station\u0027s founder Sidney Bernstein, but he was persuaded by producer Harry Elton to produce the programme for 13 pilot episodes. The show has since become a significant part of British culture",
      "release": "2024-06-04T01:30:53Z",
      "duration": "00:09:00",
      "explicit": false,
      "youTubeId": "MUUvRkapzpU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MUUvRkapzpU"
      }
    }
  ]
}