{
  "_ts": 0,
  "id": "0bd16515-fac0-47a4-9543-c083027b99bd",
  "name": "Unburdened",
  "spotifyId": "4uXSrhs48vTIo8vSEKRqts",
  "appleId": 1738930100,
  "episodes": [
    {
      "id": "d7f24537-aaf9-46d8-b551-de656dd03dbe",
      "title": "“I guess I’ll just be celibate” with Jillian Houghton",
      "description": "Our conversation with Jillian Houghton, licensed psychotherapist, spiritual/intuition recovery coach, religious trauma consultant, and undue influence educator.\nIn this episode of Unburdened, we welcome Jillian Houghton, a licensed trauma therapist who specializes in religious trauma. Jillian shares her personal journey of healing and faith deconstruction, including experiences with a high-control religious environment. She discusses the complexities of balancing her clinical work with her personal healing, especially around issues of identity and acceptance.\nThey delve into the role of love and fear in navigating personal beliefs and boundaries, as well as her path toward self-acceptance and reconciling family dynamics. Finally, Jillian shares about her coaching practice, dedicated to guiding others in building a self-aligned life after deconstruction.\nWe discussed: \n\nJillian’s eye-opening journey of realizing her involvement in a religious cult and the mental toll of that environment.  \nHow some religious teachings can instill a pervasive sense of personal inadequacy or “badness” that clients bring into therapy. \nThe challenges of reconciling her sexuality with religious teachings and her journey toward acceptance. \nEmotional complexity of setting boundaries with family members who maintain strict religious beliefs. \nHow Jillian’s clinical techniques help clients reframe damaging beliefs and rediscover self-worth outside of rigid religious systems. \nLearn more about Jillian Houghton at:\nWebsite: https://www.jillianhoughton.com/ \n\nLearn more about the Unburdened podcast: \nInstagram: @theunburdenedpodcast\nPatreon: https://www.patreon.com/Unburdened\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-11-16T12:00:29Z",
      "duration": "00:47:20",
      "explicit": false,
      "spotifyId": "1gtiStBCtzcI8BGlhhQxCJ",
      "appleId": 1000677165085,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gtiStBCtzcI8BGlhhQxCJ",
        "apple": "https://podcasts.apple.com/podcast/i-guess-ill-just-be-celibate-with-jillian-houghton/id1738930100?i=1000677165085"
      }
    }
  ]
}