{
  "id": "98c5ce21-162d-44f8-b749-2e9a171bc339",
  "name": "Unchurchable",
  "spotifyId": "0l3gXv1VUjU4AkGoxXv8Ov",
  "appleId": 1505418217,
  "episodes": [
    {
      "id": "2857892e-b169-4631-9b86-21c50a591fb3",
      "title": "T Matthew Brown - A cult piece and a trip down a waterslide",
      "description": "T Matthew Brown was raised in a secular, supportive household that valued intellect. He was out as gay from when he was 12. So how did he end up in a Sufi cult, with his named change, and married to a woman. It\u0027s not a wild story. Its indoctrination and inculturation by degrees. But its such an interesting story. Tee is bringing his performance art piece to Melbourne from the 30th of September to the 5th Octover, 5:30pm every night at Spielhaus in Melbourne. Get your tickets here melbournefringe.com.au/whats-on/events/cult-piece and follow him on Instagram at @quityourcult",
      "release": "2025-09-10T02:28:04Z",
      "duration": "01:13:02.4720000",
      "explicit": true,
      "spotifyId": "5lZrxjZofZISsIhO3Xqj3q",
      "appleId": 1000725817639,
      "subjects": [
        "Sufi"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5lZrxjZofZISsIhO3Xqj3q",
        "apple": "https://podcasts.apple.com/podcast/t-matthew-brown-a-cult-piece-and-a-trip-down-a-waterslide/id1505418217?i=1000725817639"
      }
    },
    {
      "id": "86785628-1ea0-4e6e-973a-0c77cd7ad5f2",
      "title": "Cynane Shay - A Thousand Years of Bullshirt (The Taxil Hoax)",
      "description": "Yes, I used \u0022The Good Place\u0022 naming paradigm for this one. Cynane Shay joins me to talk about the wildest thing I\u0027ve heard in a while. Well, the wildest thing I\u0027ve heard since this morning when I read the latest Trump Headlines, because thats the world we live in at the moment. Cynane is a nuclear engineer whose fascination for conspiracy theories and the far-right has caused to her to look deep into what we believe and why. And this one is a doozy. Follow her On instagram (taking off the tinfoil hat) or check out her website below. www.TakingOffTheTinfoilHat.com",
      "release": "2025-08-06T06:16:20Z",
      "duration": "01:45:47.1360000",
      "explicit": true,
      "spotifyId": "5AlrFX6n5zLGiCZ4lnOmjE",
      "appleId": 1000720851081,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5AlrFX6n5zLGiCZ4lnOmjE",
        "apple": "https://podcasts.apple.com/podcast/cynane-shay-a-thousand-years-of-bullshirt-the-taxil-hoax/id1505418217?i=1000720851081"
      }
    },
    {
      "id": "133d9b66-6c5f-484c-acfc-d824845eb820",
      "title": "Celeste Irwin - the exvangelical trans life in Trumps America",
      "description": "I\u0027ve been wanting to get Celeste on the podcast for a while. As an out and proud trans woman who doesn\u0027t hold the same hatred for church as what the modern day Church seems to hold for trans people, she is a gentle and calm voice in a turbulent sea. In the lead up to the second inauguration of Donald Trump, she was rushing facial feminisation surgery, and now she\u0027s living authentically as a parent and partner in a country in which being herself is a revolutionary act. She is trans. And she is Christian. And you should follow her on substack at https://www.celestefinally.com or on instagram @celestefinally",
      "release": "2025-07-16T10:18:34Z",
      "duration": "01:24:21.7680000",
      "explicit": true,
      "spotifyId": "3wBcwjdocMJpE1IBCdCR7y",
      "appleId": 1000717504708,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3wBcwjdocMJpE1IBCdCR7y",
        "apple": "https://podcasts.apple.com/podcast/celeste-irwin-the-exvangelical-trans-life-in-trumps/id1505418217?i=1000717504708"
      }
    },
    {
      "id": "9cc8e542-ed17-40fb-ab7c-9bcbc8a610db",
      "title": "Renee Spencer - Estranged Parents are cult victims too. A survivor story",
      "description": "Today\u0027s episode is a special one. When my friend and co-runner of the Victorian Cult Survivors Network told me she had finally found the courage to tell her story in its full and raw form, I shot my hand up to host it here with the Unchurchables. Renee lost her daughter to the Kidney Cult (also known as the Jesus Christians). Somewhere, her daughter still exists. She is still loved and missed, but mother and daughter are on opposite sides of the ocean, and of an idealogical divide brokered by a cruel cult leader - one who Renee successfully sued for defamation and won. Todays episode is a heartbreaking tale with all of the trigger warnings. But I hope it serves as a reminder that the damage of cults isn\u0027t limlited to the one on the inside. Estranged parents and family of those radicalised into coercive cults are part of that damage too, and their stories matter greatly. Go kindly as you listen. Thank you Renee for finding your voice, and fighting for reform. One day, I hope to celebrate with you as your daughter finds her way back to you. Find her work at the links below: www.recoverfromcoercivecontrol.com⁩ ⁦https://youtube.com/@recoverfromcoercivecontrol?si=erwBTZuadZn17PYH⁩ ⁦https://www.tiktok.com/@renee_rfcc?_t=ZS-8xH0nR18CoC\u0026_r=1⁩",
      "release": "2025-06-17T05:52:40Z",
      "duration": "00:58:06.2160000",
      "explicit": true,
      "spotifyId": "39OOGpuFq84XruhmnZnpww",
      "appleId": 1000713205114,
      "subjects": [
        "Jesus Christians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39OOGpuFq84XruhmnZnpww",
        "apple": "https://podcasts.apple.com/podcast/renee-spencer-estranged-parents-are-cult-victims-too/id1505418217?i=1000713205114"
      }
    },
    {
      "id": "e28913db-6f1f-4c13-9a77-9d47cfa8ffdc",
      "title": "Ari Sherwood and a Jesus Named Jeff",
      "description": "This episode comes with a content warning: we are discussing heavy themes including coerced marriage and modern slavery. Please look after yourself as you read. This is an important episode. Art Sherwood, host of the DisAllusioned podcast, joins me to talk about how she applied for a job as a massage therapist and got radicalised into a philosophy cult that later coerced her into marrying the cult leader. He was blind, riddled with physical health issues, and 37 years her senior. Ari did not fit any of the \u0027normal\u0027 risk factors for joining a cult. She was just looking for a job. Her parents did everything right to keep contact with her. Still, this happened. As the Victorian Government undertakes an inquiry into cults and fringe groups, stories like this matter. Not all cults are religious. Not all cult recruits fit the same profile. Listen well. THIS is the harm we have to stop",
      "release": "2025-05-28T00:13:50Z",
      "duration": "01:29:12.1430000",
      "explicit": true,
      "spotifyId": "2ymmqz2d7LfHoySNfxE8zU",
      "appleId": 1000710202710,
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ymmqz2d7LfHoySNfxE8zU",
        "apple": "https://podcasts.apple.com/podcast/ari-sherwood-and-a-jesus-named-jeff/id1505418217?i=1000710202710"
      }
    },
    {
      "id": "46bf78b1-737b-451f-82d5-4335a2ed3ef8",
      "title": "The Pipelines - Under the hands of Gods General to exposing the New Apostolic Reformation",
      "description": "This episode lands at a crucial point of religiopolitical history, as we talk about all things New Apostolic Reformation. Academic Jon Sawyer joins me as we talk about some juicy, heavy hitting topics - conspiratorial demonology, weaponisation of testimony culture, self-invisible LGBT Christians, sexual orientation and gender identity change efforts, load language inside Evangelicalism, white supremacy and indoctrination techniques used in Christian Nationalism. I mean...that about covers whats wrong in the world, doesn\u0027t it? You really should look at the rest of Jon\u0027s work at https://www.jonsawyer.org/ and of course his contribution to Dr Lucas Wilsons, book \u0022Shame Sex Attraction.\u0022 (Find it here https://amzn.asia/d/5Et3wfT ) Its a vital time in history to be informed, especially if you are in a Westernised nation where the backlash against progress, and the decrying of \u0022Wokeism\u0022 (ie. Empathy and respect for others) threatens a Christian Nationalist uprising masked as resurging religiopolitial conservatism. This episode, Blake Chastains episode (and book), and Lukes episode (and book) need to be top of your to-listen lists. And I\u0027m not often demanding like that.",
      "release": "2025-01-22T04:21:13Z",
      "duration": "01:17:18.3840000",
      "explicit": true,
      "spotifyId": "6JEY9ZOvHIEKTuaM95SS23",
      "appleId": 1000684942117,
      "subjects": [
        "New Apostolic Reformation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6JEY9ZOvHIEKTuaM95SS23",
        "apple": "https://podcasts.apple.com/podcast/the-pipelines-under-the-hands-of-gods-general/id1505418217?i=1000684942117"
      }
    },
    {
      "id": "9f74af77-0b41-4927-a4c9-78c26ec8027b",
      "title": "The Pipelines -  Closetted to Out, Proud Academic Researcher",
      "description": "When Dr Luke Wilson reached out to me with a copy of his book, I was struck by the most obvious thing in the world - I\u0027m the ex-wife of a gay conversion therapy survivor but I\u0027ve never had someone on the podcast who could actually talk in depth about that very thing. I guess it was too close to home. But its time. We need to move from representation to meaningful change, and that means understanding on a deep and nuanced level that sexual orientation and gender identity change efforts aren\u0027t always what you think they are. This episode hits on some big topics. Mental health, sexuality, genocide. Look after yourself as you listen. And remember you can call helplines if you need. In Australia, Lifeline is 13 11 14 and Qlife is 1800 184 527. In America, you can call 988. This is important stuff for all of us. But if its you, its REALLY important. There are safe hands to catch you as you recover. The long-ass URL for Dr Luke\u0027s book, Shame-Sex Attraction is as follows: https://www.amazon.com.au/Shame-Sex-Attraction-Survivors-Stories-Conversion-ebook/dp/B0D1S6SHC8/ref=sr_1_1?dib=eyJ2IjoiMSJ9.68eQVaWIgXB4gJREAz4RVPbwpkkCcVmdfJlm2WsT94Mnu2tfgUqzMhIVzDdME3t13Eth7h1oBh8slz8hQdk24wKq0TW4WLFIA3DIhDNVaV4.FxuRjpQ7Xp9MBxN-GqDYKhC_ZWqJX3TOy0nUcAmUzl4\u0026dib_tag=se\u0026keywords=shame-sex\u0026#43;attraction\u0026qid=1733923623\u0026sr=8-1 Luke\u0027s social media handles are as follows. Instagram: @lukeslamdunkwilson Threads: @lukeslamdunkwilson Bluesky: @lukeslamdunkwilson.bsky.social Twitter/X: @wilson_fw LinkedIn: https://www.linkedin.com/in/lucas-wilson-2a0753b1/ Facebook: https://www.facebook.com/luke.wilson.96",
      "release": "2024-12-19T05:04:53Z",
      "duration": "01:22:10.3440000",
      "explicit": true,
      "spotifyId": "5qfxvidxmRTbOzpb7XmQFs",
      "appleId": 1000680923079,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qfxvidxmRTbOzpb7XmQFs",
        "apple": "https://podcasts.apple.com/podcast/the-pipelines-closetted-to-out-proud-academic-researcher/id1505418217?i=1000680923079"
      }
    },
    {
      "id": "90e594f2-75ab-4cb7-9d1d-13e3446052dd",
      "title": "The Pipelines - \u0022Jane Kennedy Must Save the World\u0022 to \u0022She Doesn\u0027t Actually\u0022",
      "description": "In this episode of \u0022The Pipelines\u0022 series, we meet Jane Kennedy. While she is now a religious trauma therapist and co-founder of the Religious Trauma Collective in Australia (which compiles resources and religious trauma-informed therapists for those of us who are recovering), she was once a youth leader and church planter. In this episode, Jane and I talk about some of the big themes that have emerged in her walk into and out of church, and the things that pop up in therapy a lot: from white saviourism, to dissociation, body awareness, \u0022the father heart of God\u0022 and other recruitment tactics. Jane\u0027s calm presence and hard-won wisdom makes this episode a lot more relaxing than it could be! Find her at: on Substack at https://jane748.substack.com and on Instagram at @janekennedycounselling Find me at: clareheathmcivor.substack.com and on instagram at @unchurchablepod or @clare_heathmcivor",
      "release": "2024-12-02T23:31:48Z",
      "duration": "01:19:05.9030000",
      "explicit": true,
      "spotifyId": "0qXUqbxhxDuJ1vyyY9Fb3c",
      "appleId": 1000678972296,
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0qXUqbxhxDuJ1vyyY9Fb3c",
        "apple": "https://podcasts.apple.com/podcast/the-pipelines-jane-kennedy-must-save-the-world-to/id1505418217?i=1000678972296"
      }
    },
    {
      "id": "00fa108b-944f-4a17-bae3-d744b0eb829a",
      "title": "Blake Chastain - Christian Nationalism, the wild right-wing lurch and how to fight back",
      "description": "In an episode that was recorded two days after the Trump victory, and less than 200 days from the next Australian Federal Election, this episode could not be more important or timely. In it, I chat to Blake Chastain, who launched the Exvangelical Podcast back in 2016 as he talks about his new book \u0022Exvangelical and Beyond: How American Christianity Went Radical and the Movement That\u0027s Fighting Back.\u0022 We have long known that, where America goes religiously and politically, the western world tends to follow. In line with this, strains of Christian Nationalism, even white Christian nationalism, and other forms of fringe and extreme right-wing politics has spiked both here and overseas. Its one to pay attention to. Make sure you give it a listen. And if you\u0027re in Australia in the political scene, make sure you take the warnings and the advice seriously. www.blakechastain.com https://www.penguinrandomhouse.com/books/747796/exvangelical-and-beyond-by-blake-chastain/ Instagram @brchastian_",
      "release": "2024-11-11T07:51:44Z",
      "duration": "01:17:46.2710000",
      "explicit": true,
      "spotifyId": "05h3qIMgKrmPy4F2fXK2v6",
      "appleId": 1000676461658,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/05h3qIMgKrmPy4F2fXK2v6",
        "apple": "https://podcasts.apple.com/podcast/blake-chastain-christian-nationalism-the-wild-right/id1505418217?i=1000676461658"
      }
    },
    {
      "id": "b3d58fa8-3da5-440e-97ac-a461b45d74de",
      "title": "William Egginton - Borges, Kant, Heisenberg and the meaning of self and the universe",
      "description": "You know I like to get existential. This time last year, I sat down with author and academic, William/Bill Egginton to talk about his book, \u0022The Rigor of Angels.\u0022 I\u0027d been contacted by his publicist and was intrigued about the book and what it might offer exvangelicals who are reinventing themselves and might not know anything about poetry, philosophy, and quantum mechanics, much less the meaning of the Universe. It was too good a conversation to let sit in the archives after my year of hiatus. Since our chat, his book has won some awards including New York Times and New Yorker book of the year. You\u0027ll love it. And I hope you love this chat. Find out more here https://www.williamegginton.com/ or here https://www.amazon.com.au/Rigor-Angels-Heisenberg-Ultimate-Reality/dp/0593316304",
      "release": "2024-11-04T05:52:22Z",
      "duration": "00:59:32.7360000",
      "explicit": true,
      "spotifyId": "3kBWZd0s7uN5iFh7fn6ZZo",
      "appleId": 1000675569122,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3kBWZd0s7uN5iFh7fn6ZZo",
        "apple": "https://podcasts.apple.com/podcast/william-egginton-borges-kant-heisenberg-and-the/id1505418217?i=1000675569122"
      }
    },
    {
      "id": "dddf78fe-d64d-406c-b7c4-884b70ffffcd",
      "title": "The Pipelines! From PK to Forest Witch (or something like that anyway) with Jess Manusama",
      "description": "Its quite a journey to go from eldest pastors kid, with full worship leader, Sunday school teacher, \u0027dating revelation\u0027 adherent and homeschool survivor to forest walking animistic spiritualist who runs womens circles. But that\u0027s Jess Manusama. She\u0027s a breath of fresh air. She runs the insta account @the.connectedself and the web page www.theconnectedself.com.au If you\u0027re one of those people who lost touch with themself, their sense of embodiment, the right to own your story and feel it, give her a follow. If you want to work with her in womens circles, deconstructors circles, or one to one mentoring, head over to her socials or website. Jess is such a soothing and non-judgemental presence, with a sense of humour but an ability to create and hold space where we connect with the medicine within. All outside of dogma. Because the last thing we need as we deconstruct is more of that.",
      "release": "2024-10-25T02:11:14Z",
      "duration": "01:17:00.6000000",
      "explicit": true,
      "spotifyId": "1QfW3KH2jzCTdMbq7hnbjF",
      "appleId": 1000674384417,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1QfW3KH2jzCTdMbq7hnbjF",
        "apple": "https://podcasts.apple.com/podcast/the-pipelines-from-pk-to-forest-witch-or-something/id1505418217?i=1000674384417"
      }
    },
    {
      "id": "b5897023-04ac-4052-bac7-14c2a0623bc2",
      "title": "The Pipelines! Part One: Christian professor to Asian American Apostate With R. Scott Okamoto",
      "description": "Unchurchable is back from a long hiatus, and kicking off \u0022The Pipelines\u0022 series is the incredible R. Scott Okamoto. Scott was a teacher at a Christian college when his deconstruction started. Rather than solidifying a waning faith, Scott got the same Sunday School answers to life\u0027s big questions. Join us as we talk about Zionism, white supremacy, the chinks in the armour of Biblical literacy, and finally, his journey into authorhood and podcaster-ness. Find Scott hosting the \u0022Horny Chapel\u0022 and \u0022Chapel Probation\u0022 podcasts, as well as his instagram (@rsokamoto) and Twittere (@rsokamoto) for more good stuff!",
      "release": "2024-10-15T10:40:18Z",
      "duration": "01:14:07.3430000",
      "explicit": true,
      "spotifyId": "2keLejiwCOSUFL23bU1zEN",
      "appleId": 1000673153940,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2keLejiwCOSUFL23bU1zEN",
        "apple": "https://podcasts.apple.com/podcast/the-pipelines-part-one-christian-professor-to-asian/id1505418217?i=1000673153940"
      }
    },
    {
      "id": "421ff898-854a-4274-9cac-9557038d428b",
      "title": "Teaser: Unchurchable is coming back!",
      "description": "Hey all! Yes, I know I disappeared. But I\u0027m back, and so is unchurchable. If you\u0027ve got ten minutes, have a listen to this teaser and, if you feel like it, slide into my DM\u0027s on twitter (@clare_mcivor) or on Instagram @unchurchablepod or @clare_heathmcivor) to let me know your thoughts. This season is going to get nerdy! Go deeper into themes rather than focusing solely on survival stories, and talk about the pipelines. \u0022The pipelines?\u0022, you say... \u0022What do you mean by that?\u0022 Have a listen and find out",
      "release": "2024-10-07T02:24:33Z",
      "duration": "00:14:12.3110000",
      "explicit": true,
      "spotifyId": "4jeFOkJrTp5UjMeTTiulco",
      "appleId": 1000672002012,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4jeFOkJrTp5UjMeTTiulco",
        "apple": "https://podcasts.apple.com/podcast/teaser-unchurchable-is-coming-back/id1505418217?i=1000672002012"
      }
    },
    {
      "id": "5bc9dc1f-7e10-4542-a0e9-b9fe6f8ccee1",
      "title": "Ronna Derrick -What if we let women tell their own stories?",
      "description": "In this months episode, the lovely, courageous, intelligent Ronna Detrick joins me to talk about her newly-released book \u0022Rewriting Eve.\u0022 It started from a simple place: in seminary, when the guys translated a passage of scripture, it came out vastly different to how the women\u0027s translations came out. The subjects and verbs were correct. But the nuance, the subtext, the angle - all vastly different. And so Ronna set about rewriting Eve (and other Biblical women). The result is powerful insight into what happens when we let women tell their own stories. I\u0027ll admit this one hit heavy for me. After all, I am a woman who is only just learning to write her own story. I suspect many Exvangelical women may feel the same. We\u0027ve been called crazy, headstrong, unstable, divisive, emotional, Jezebelic and all sorts. But maybe that was patriarchy writing our stories for us. Find out more about Ronna on Insta, FB or here https://ronnadetrick.com And enjoy the episode",
      "release": "2023-11-15T01:41:22Z",
      "duration": "01:03:11.9030000",
      "explicit": true,
      "spotifyId": "34LuUWiz4oo3YfnFaQHXCi",
      "appleId": 1000634849500,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34LuUWiz4oo3YfnFaQHXCi",
        "apple": "https://podcasts.apple.com/podcast/ronna-derrick-what-if-we-let-women-tell-their-own-stories/id1505418217?i=1000634849500"
      }
    },
    {
      "id": "67297d2e-c1da-4cc3-8c4e-0d9d1d2f082a",
      "title": "Cynane Shay - A Crash Course in Conspiracy Theories and Totalitarianism",
      "description": "This is a \u0022Listen hard\u0022 kind of episode. What do conspiracy theories, anti-semitic handbooks, lizard people, space lasers, Qanon, 5G towers and cults have in common? It\u0027s mindboggling how the checkered history of Evangelicalism is imbued with anti-semitism and white supremacy. I\u0027m not sure why I\u0027m surprised, when evangelicalism itself is a very whitewashed sort of reality. This episode talks about how totalitarianism, conspiracy theories and cults are built on a very similar, very toxic sort of foundation. Find Cynane on Instagram - @taking.off.the.tinfoil.hat - or on the interwebs where you can find her booklist - www.takingoffthetinfoilhat.com",
      "release": "2023-08-29T10:13:14Z",
      "duration": "01:22:39.6000000",
      "explicit": true,
      "spotifyId": "1HgnMRkX24bzyIIVDq8QXP",
      "appleId": 1000626064276,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1HgnMRkX24bzyIIVDq8QXP",
        "apple": "https://podcasts.apple.com/podcast/cynane-shay-a-crash-course-in-conspiracy-theories/id1505418217?i=1000626064276"
      }
    },
    {
      "id": "259946de-9894-49d1-bf95-374c60fd5d6f",
      "title": "Troy Waller and Brian McDowell - Teenage Fundamentalists Learn to Call Bullshit",
      "description": "In this episode, the voices from the \u0022I was a teenage fundamentalist\u0022 podcast join me to talk about the things they\u0027ve learned along the way as exvangelicals, as people, as podcast hosts and community builders...and as two guys who had to learn to call bullshit sometimes. Troy Waller and Brian McDowell take an irreverent walk through their lives and talk about the commonalities we all seem to share when it comes to our individual journeys post-church. \u0022I was a teenage fundamentalist\u0022 is an Australian-based deconstruction podcast and community that is making waves, and its a treat to have another couple of Aussie accents in my own corner of the interwebs. If you want to listen or subscribe to their pod, its here https://open.spotify.com/show/5tbYeCgmIuYwZBiZ9yGKbw?si=31d555756c5d491f and my episode is here https://open.spotify.com/episode/24L6bYEQEtQ0yQiF1FeLwq?si=db432056f890453e",
      "release": "2023-08-02T10:01:29Z",
      "duration": "01:26:31.8940000",
      "explicit": true,
      "spotifyId": "0jihcTvDvbnVK2dWy7VL8i",
      "appleId": 1000623160922,
      "subjects": [
        "Christian Fundamentalist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0jihcTvDvbnVK2dWy7VL8i",
        "apple": "https://podcasts.apple.com/podcast/troy-waller-and-brian-mcdowell-teenage/id1505418217?i=1000623160922"
      }
    },
    {
      "id": "9096b2bd-8d12-41dd-8c60-0c759030721c",
      "title": "Brent Hodgson - Australian Political Dumpster Fires and the Right Wing March to the Fringe",
      "description": "Planetshakers, politics, porn scandals, branch stacking, coercive control, puppy dogs and exvangelical life - this episode has it all. Brent Hodgson is a political commentator, campaign data guy and marketing guru who provides immense insight into the trends and tendencies in the Australian political scene. It just also happens that is ex-Planet-shakers and watched from the pews as the Australian megachurch faced down a scandal for the history books. In this episode, Brent shares his insights into the potential demise of the Australian Liberal Party following right-wing infiltration (thanks dominionists and faltering micro parties). If you\u0027re an Aussie and you\u0027re lost in the wind as to what is going on here, or if you\u0027re from overseas and wondering what the political situation is over here - settle in with a cuppa. This episode has all the tea",
      "release": "2023-04-19T10:32:26Z",
      "duration": "01:27:13.5120000",
      "explicit": true,
      "spotifyId": "1GmjFIDZeWc4VFHXtgcSv5",
      "appleId": 1000609621806,
      "subjects": [
        "Cult Psychology",
        "Evangelicalism",
        "Shakers"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1GmjFIDZeWc4VFHXtgcSv5",
        "apple": "https://podcasts.apple.com/podcast/brent-hodgson-australian-political-dumpster-fires-and/id1505418217?i=1000609621806"
      }
    },
    {
      "id": "a4048c63-9b71-4577-a4a9-1932be9b89c8",
      "title": "Emma Ocean - Post-church philosophy, escaping the panopticon and duvet dilemmas",
      "description": "It was hard to know what to call this one. Emma Ocean is, pun intended, an ocean of wisdom based on the lived experience of escaping toxic religion and the qualified experience of a psychologist with a bit of mysticism, cosmetology, philosophy and shadow-working brilliance thrown in. It was a conversation full of light-bulb moments for me as we talked about the healing journey, the scintilla or spark of that universal light in all of us, and some gentle wisdom for people from all spaces in deconstruction as we wade through the work of healing and finding ourselves. Oh, and there are Julia Roberts references in here too.",
      "release": "2023-03-23T23:08:33Z",
      "duration": "01:00:53.0970000",
      "explicit": true,
      "spotifyId": "1UOUOGjkN86f7LSteFK6UD",
      "appleId": 1000605646863,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1UOUOGjkN86f7LSteFK6UD",
        "apple": "https://podcasts.apple.com/podcast/emma-ocean-post-church-philosophy-escaping-the/id1505418217?i=1000605646863"
      }
    },
    {
      "id": "7f866fe3-af72-4e8c-8b61-61ebda9b067f",
      "title": "Angela Herrington - Grief, deconstruction and this quirky sort of elevator thing",
      "description": "Angela Herrington is a deconstruction coach. What exactly is that? She\u0027s not going to tell you, because every deconstruction journey is different. But one thing is for sure, we all need someone in our corner who will hold space for us, refuse to embody any sort of control or coerciveness, and who can help us understand that deconstruction is as much about grief and loss as it is about anything else. Join us as we talk about all the things, and find Angela on the interwebs at www.angelajherrington.com",
      "release": "2023-03-06T07:19:07Z",
      "duration": "01:05:07.3570000",
      "explicit": true,
      "spotifyId": "69qCy69VctQWOthWE3kjhq",
      "appleId": 1000602909780,
      "urls": {
        "spotify": "https://open.spotify.com/episode/69qCy69VctQWOthWE3kjhq",
        "apple": "https://podcasts.apple.com/podcast/angela-herrington-grief-deconstruction-and-this/id1505418217?i=1000602909780"
      }
    },
    {
      "id": "24a1cc1a-67ce-4aed-b31e-e0ac75144dd5",
      "title": "Andrew Lang - How to not skim over the depths of your own life and other misc. wisdom",
      "description": "This session lead off with me forgetting to cancel the podcast, dropping the kids off at school late, and turning up to do an interview unprepared, unshowered, and without a stitch of makeup. For reference, Kit Kennedy is glam af and never unprepared. But Andrew lead off with \u0022if it aint messy it aint worth it,\u0022 and we were friends straight away. Actually, what I felt from my conversation with Andrew was safety...and thats what he offers people who are dipping their toes into the uncertain waters of deconstruction, or who are trying to hold onto faith in a way that feels safe. Its a great sesh. Enjoy",
      "release": "2022-07-07T04:09:18Z",
      "duration": "01:01:00.8280000",
      "explicit": true,
      "spotifyId": "60uTG9NVaeIIXvnsVDTpJz",
      "appleId": 1000569098477,
      "urls": {
        "spotify": "https://open.spotify.com/episode/60uTG9NVaeIIXvnsVDTpJz",
        "apple": "https://podcasts.apple.com/podcast/andrew-lang-how-to-not-skim-over-the-depths-of-your/id1505418217?i=1000569098477"
      }
    },
    {
      "id": "4339a7e2-4c9b-4ac5-9b0f-5842e1926710",
      "title": "Becki Beasley - Rage humor, boundaries, and being whoever the hell you want to be",
      "description": "In the first episode of unchurchable for 2022, I chat with Becki from \u0022Also Your Daughters\u0022 on Instagram. Her\u0027s is a brand of deconstruction that I so badly needed to witness: a woman calling things what they are and doing it with humor. It\u0027s a strange muscle to have to learn to flex when you\u0027ve been told that emotions like anger, assertiveness or blunt honesty are not feminine or acceptable. Guess what! They are both! In this chat, we talk about boundaries, rage humour, feminism, and life in general - and I confess I laughed entirely too much in this episode because I was perhaps a bit excited to be back, and perhaps a bit nervous to be in the interviewers chair after so long out of it! This conversation is as much about finding your resolve and your supportive community as it is finding your voice and your right to exist in the unique space you want to, rather than the role you were cast in but never wanted. Enjoy!",
      "release": "2022-03-25T06:17:03Z",
      "duration": "01:14:28.8610000",
      "explicit": true,
      "spotifyId": "6hgEEJjuq9gaz6IjVv8j7V",
      "appleId": 1000555189475,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6hgEEJjuq9gaz6IjVv8j7V",
        "apple": "https://podcasts.apple.com/podcast/becki-beasley-rage-humor-boundaries-and-being-whoever/id1505418217?i=1000555189475"
      }
    },
    {
      "id": "9b03e27f-78d4-46e3-900d-57bf3bb559d4",
      "title": "Rev. Dr Beverley Dale - Sex positive Christianity",
      "description": "A big part of deconstruction is re-looking at anti-feminist theology, purity culture and the way these impacted attitudes to women, sexuality, sensuality and pleasure. Now look, I\u0027ll be straight up and say I\u0027m only just learning to be comfortable talking about it and I still feel a bit heretical thinking that maybe its okay to be sex-positive and still call myself a sorta-kinda-okay-Jesus post-Christian something something. To this end, this episode has been positively medicinal for me, as Reverend Doctor Beverley Dale takes us inside the Bible and shows us that the Bible has been shown to us in a way that sanitises it, but pleasure, sexuality and sensuality are there in black (and red) and white. Certainly not contraband like so many of us have been taught.",
      "release": "2021-10-11T01:27:26Z",
      "duration": "01:20:30.7360000",
      "explicit": true,
      "spotifyId": "2cRkcnHiyjjRF5Uy8s3RJL",
      "appleId": 1000538159825,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2cRkcnHiyjjRF5Uy8s3RJL",
        "apple": "https://podcasts.apple.com/podcast/rev-dr-beverley-dale-sex-positive-christianity/id1505418217?i=1000538159825"
      }
    },
    {
      "id": "9661b76a-b914-4655-8bd3-e656dc8b0559",
      "title": "Meg Cowan - Recovering from purity culture and finding sexual freedom",
      "description": "The wonderful Meg Cowan has been on my list of interviewees for a while - a fellow Southern Hemisphere girl from across the ditch in New Zealand. Her work as a sex and intimacy coach has seen Meg in the long grass of helping purity culture survivors reclaim and heal their relationship with their bodies. This conversation was one we had a couple of goes at, and I promise you its worth a listen. It goes without saying that this episode carries a content warning. But don\u0027t all the good tings in life. Enjoy",
      "release": "2021-09-22T04:35:28Z",
      "duration": "01:06:53.5080000",
      "explicit": true,
      "spotifyId": "6nNHoTfwuxaSzFHx1ZMmcO",
      "appleId": 1000536233065,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nNHoTfwuxaSzFHx1ZMmcO",
        "apple": "https://podcasts.apple.com/podcast/meg-cowan-recovering-from-purity-culture-and-finding/id1505418217?i=1000536233065"
      }
    },
    {
      "id": "72b7a66d-99e6-4a90-8e07-f42501b656cd",
      "title": "Steven Denler - But what is sin, really?",
      "description": "I\u0027m more than happy to admit it: I\u0027ll happily talk about a lot of things in the deconstruction space, but sin hasn\u0027t been one of them. Its been too big of a concept - too scary even. It\u0027s also a confusing one when you delve into it. If God is love, why are we all \u0022born with a sin nature\u0022 that means we get dropped into a lake of fire for eternity unless we belief the right thing, say the magic words and never do wrong. Bit of a high bar wouldn\u0027t you say? Bit unloving maybe? Steven Denler, the man behind TAP Theology has been doing some serious work on this and I\u0027m so glad he took a moment to stop by the pod and talk about it. I can tell you now: the sin means something completely different to me now. And somehow, God is kinder too. I\u0027m down with that. Get ready for the most philosophically heavy chat I\u0027ve had in a while. Enjoy!",
      "release": "2021-08-03T07:57:54Z",
      "duration": "01:20:42.0800000",
      "explicit": true,
      "spotifyId": "5T7eMElCkwgY78ubVe2y0j",
      "appleId": 1000530844700,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5T7eMElCkwgY78ubVe2y0j",
        "apple": "https://podcasts.apple.com/podcast/steven-denler-but-what-is-sin-really/id1505418217?i=1000530844700"
      }
    },
    {
      "id": "7fc61866-ea43-4075-aaa2-25fdaec16a5e",
      "title": "Jordan White - Deconstructing towards social justice (and holding on to your hobbies while you do it)",
      "description": "This is one of those fortuitous internet meetings where you go \u0022Hey! This person is interesting! I\u0027m gunna interview them.\u0022 Jordan White and I began talking on instagram about parenting post deconstruction when I realised this guy had managed to do something I had failed miserably at: he held on to music when he left church. To this day, a long time after leaving church, I find it too emotionally fraught to sit down at the piano and do what used to come so easily. I used to play, sing, compose and generally move the emotion that would otherwise stagnate and ulcerate. So I wanted to talk - how do you hold onto something that had been completely tied up with something you no longer identify with. As it turned out, the conversation spanned a whole lot more than this. I know you\u0027ll enjoy it.",
      "release": "2021-07-26T04:53:35Z",
      "duration": "01:01:00.1080000",
      "explicit": true,
      "spotifyId": "3nVVdiY9YbaUmHARPnPkmD",
      "appleId": 1000530006050,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3nVVdiY9YbaUmHARPnPkmD",
        "apple": "https://podcasts.apple.com/podcast/jordan-white-deconstructing-towards-social-justice/id1505418217?i=1000530006050"
      }
    },
    {
      "id": "23a29152-5f6c-4399-b5aa-d3815c1260dd",
      "title": "Tia Levings - Self-Empowerment after Religious Trauma and Domestic Abuse",
      "description": "She married \u0022the one God sent.\u0022 Like so many of us, she did so without knowing fully what she was getting into. When the relationship became abusive, she sought help inside the church but what she found was advice tantamount to entrapping her in what she calls \u0022church sanctioned domestic abuse. Sadly, Tia Levings story is unlikely to be the only one of its kind, but unlike so many others, Tia found the courage to get herself and her five kids out of that situation. Years on, she is thriving - in love, in life, and in parenthood beyond religious trauma and domestic abuse. Its a story of hope and Tia\u0027s gentle wisdom covers could indeed be life-saving. There is life after, and it is so worth pursuing.",
      "release": "2021-07-05T03:32:48Z",
      "duration": "01:10:22.1290000",
      "explicit": true,
      "spotifyId": "6p04qxkSWxqE18Vfrnb3Hr",
      "appleId": 1000527831373,
      "subjects": [
        "Institute In Basic Life Principles",
        "Psychology",
        "Quiverfull",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6p04qxkSWxqE18Vfrnb3Hr",
        "apple": "https://podcasts.apple.com/podcast/tia-levings-self-empowerment-after-religious-trauma/id1505418217?i=1000527831373"
      }
    },
    {
      "id": "ace269c1-5300-4286-b654-5807bf6da68a",
      "title": "Angry Church Kid - Everything is a Dick Joke",
      "description": "Now, I\u0027m sure that\u0027s not a title you expected to read on a podcast for people who are navigating life post-church and deconstructing their faith. But can I point something out? Deconstruction is hard work. And it\u0027s not even like you get to choose whether or not to deconstruct. It seems to choose you! So finding the humour in the journey is vital to maintaining your place on the happy wagon while you also deal with grief, existential questions and all the overthinking that comes with deconstructing faith or making your way towards something like a new lens through which to view life, the universe and other things. A friend of mine once told me that \u0022the humour is part of the healing.\u0022 And I\u0027m 100% there with her on that. When I found Angry Church Kid on the gram, I loved her humour. Now that I\u0027ve interviewed her, I love her fearlessness, her irreverence and her understanding of what it is to deconstruct out of church but not land quite at atheism. Enjoy this sweary, dick-jokey session!",
      "release": "2021-06-14T04:11:01Z",
      "duration": "01:04:17.0320000",
      "explicit": true,
      "spotifyId": "6gFUMiAd5g2RWY9BmUdUiA",
      "appleId": 1000525392312,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6gFUMiAd5g2RWY9BmUdUiA",
        "apple": "https://podcasts.apple.com/podcast/angry-church-kid-everything-is-a-dick-joke/id1505418217?i=1000525392312"
      }
    },
    {
      "id": "383f96d9-ffd0-4326-b0b0-114dc0d8e2c2",
      "title": "Marc-Henri Sandoz Paradella - Dethroning Toxic Jesus and Finding Spiritual Healing",
      "description": "In Sunday school, kids learn about the golden calf - the moment the Hebrews banded behind Moses\u0027 brother Aaron and made a god of their own to worship while their leader was up on the mountain. It was the perhaps the first time in recorded history, but certainly not the last time that we would make a god in our own image. Today, in Evangelical churches across the world, we cherry pick and reinterpret scripture to make Jesus fit our needs. These incarnations, according to Marc-Henri Sandoz Paradella, are the Toxic Jesus\u0027s we need to remove from our lives if we are going to move from \u0022holy shit\u0022 to spiritual healing. I loved this interview and the humble wisdom of the man who wrote the book. Enjoy!",
      "release": "2021-04-28T13:33:07Z",
      "duration": "01:04:59.1170000",
      "explicit": true,
      "spotifyId": "2j5kmNQYzoVEiAC1jFnmBj",
      "appleId": 1000519023430,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2j5kmNQYzoVEiAC1jFnmBj",
        "apple": "https://podcasts.apple.com/podcast/marc-henri-sandoz-paradella-dethroning-toxic-jesus/id1505418217?i=1000519023430"
      }
    },
    {
      "id": "8edea4d9-2cd8-4d54-b4f2-f5788e369355",
      "title": "ALPHAMAMA - The Journey to Authentic Spirituality and Personal Agency",
      "description": "What do you do when you move away from a form of spirituality that came with a prepackaged set of rules, regulations and existential dread? For many if not most, you feel a little lost at sea. Anchorless. So how do you find purpose and the freedom to explore spirituality within healthy boundaries that don\u0027t trample on who you are as a person? I caught up with the musical, the magical, the free-spirited musician / boss lady that is Alphamama to talk about her journey into being, well, Alphamama.",
      "release": "2021-04-08T02:01:38Z",
      "duration": "01:06:48.3330000",
      "explicit": true,
      "spotifyId": "520xHzrFJryDQRht3KS4f4",
      "appleId": 1000516233611,
      "urls": {
        "spotify": "https://open.spotify.com/episode/520xHzrFJryDQRht3KS4f4",
        "apple": "https://podcasts.apple.com/podcast/alphamama-the-journey-to-authentic-spirituality/id1505418217?i=1000516233611"
      }
    },
    {
      "id": "238ac5ee-bd1d-4f9e-99fc-0e8628088ba8",
      "title": "Jess Hugenberg - Welcome to the Process",
      "description": "In this session, Jess Hugenberg and I talk about two topics that could not be more important as we walk through recovery from all the things that 2020 brought us: spiritual bypassing, spiritual integrity, and the importance of churches being trauma informed. It\u0027s important for a number of reasons. 2020 saw many things revealed; political upheaval, church abuse scandals, continued scandals in Hollywood as a result of the Me Too movement, the pandemic which saw many of us face escalations in our personal lives or our mental health. In line with this, it is not only unhelpful but it should be unacceptable for churches to sweep such things under the rug with thought-terminating cliches like \u0022just forgive\u0022 or \u0022have faith in God and don\u0027t be bitter.\u0022 We need to be trauma informed. And we need people like Jess who can walk us through how to do better. Enjoy this session!",
      "release": "2021-03-08T05:06:35Z",
      "duration": "01:09:36.2080000",
      "explicit": true,
      "spotifyId": "2GK1CNhTUf634hAc68BrXX",
      "appleId": 1000512142263,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2GK1CNhTUf634hAc68BrXX",
        "apple": "https://podcasts.apple.com/podcast/jess-hugenberg-welcome-to-the-process/id1505418217?i=1000512142263"
      }
    },
    {
      "id": "360e3654-5912-48a4-9d61-d430c03ffb1b",
      "title": "Nia and Katie Chairamonte - Love in the face of all the things",
      "description": "I\u0027ve always been of the belief that the best relationships were the ones where partners are able to see and celebrate the evolution that occurs over the lifetime of their spouse. It takes grace, commitment, self-awareness, consideration, selflessness and no one embodies this better than Nia and Katie. Their\u0027s is a relationship that started as high school sweethearts, and travelled through churchianity, deconstruction, and one partner coming out as transgender. This is a story that will inspire you to realise that while life isn\u0027t always simple, love causes us to go to great heights and great depths for the ones we love. And that is brilliant and beautiful.",
      "release": "2020-12-21T03:45:40Z",
      "duration": "01:20:33.7240000",
      "explicit": true,
      "spotifyId": "5qFiwe6qBSeRrHQRyrsRl1",
      "appleId": 1000503113309,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qFiwe6qBSeRrHQRyrsRl1",
        "apple": "https://podcasts.apple.com/podcast/nia-and-katie-chairamonte-love-in-the-face-of-all-the-things/id1505418217?i=1000503113309"
      }
    },
    {
      "id": "fd8cd84f-ea8a-4386-8646-4fc0ac227b3b",
      "title": "Brit Herbert - Globe Trotting, Spiritual Colonialism, and the Do Better Church Movement",
      "description": "Brit Herbert\u0027s journey with Christianity started in a rather unique manner, and as a youngster she was quickly plunged into a world of missions work in countries as far flung from Louisiana USA as Russia. It\u0027s a powerful story of recognising the good in the bad and the bad in the good, of grappling with our role in spiritual colonialism, deconstructing, finding your feet, and being part of birthing the \u0022Do Better Church\u0022 movement. It\u0027s a fascinating ride through the thrills and damage of Evangelical egocentricity in an episode that could otherwise be called \u0022The adventures of Brit and Kit.\u0022",
      "release": "2020-12-02T09:28:10Z",
      "duration": "01:18:24.5830000",
      "explicit": true,
      "spotifyId": "5nImHWAXoAT0G8upUNgwsT",
      "appleId": 1000501187983,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5nImHWAXoAT0G8upUNgwsT",
        "apple": "https://podcasts.apple.com/podcast/brit-herbert-globe-trotting-spiritual-colonialism-and/id1505418217?i=1000501187983"
      }
    },
    {
      "id": "e9406090-91e5-4f39-8101-34d66fa87d94",
      "title": "Dr Anica - Race Positive Approaches to Hard Conversations, and PTSD in the real world (Double Episode)",
      "description": "Sometimes a guest comes along with such an impressive CV that you really have to get her to cover off on two different topics. Dr Anica is that lady. A proud woman of colour, daughter of immigrants, clinical psychologist and general badass, she is the pioneer behind the \u0022Race Positive\u0022 program which aims to bring a strengths-based approach to a topic often loaded with deficit language. In life post BLM, its important to keep talking about systemic racism until we can dismantle it! But the reason I found her was another topic altogether, when a listener asked me how I handle my PTSD. It wasn\u0027t something I\u0027ve talked about much, but perhaps I should. Because normalising trauma responses and their treatment matters. And so do you! Thanks for tuning in.",
      "release": "2020-11-16T02:08:28Z",
      "duration": "01:39:14.2080000",
      "explicit": true,
      "spotifyId": "0Q1v2wH1NR76E1kqXECPpV",
      "appleId": 1000498766752,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Q1v2wH1NR76E1kqXECPpV",
        "apple": "https://podcasts.apple.com/podcast/dr-anica-race-positive-approaches-to-hard-conversations/id1505418217?i=1000498766752"
      }
    },
    {
      "id": "de6ea144-e1bd-4e99-83e8-97803aeee3ba",
      "title": "Jonathan Merritt - The ongoing evolution of faith and church",
      "description": "I\u0027ve long watched on as Jonathan Merritt has penned noteworthy books, and written a swath of articles that have helped me understand and grapple with the big issues in Christianity as I deconstructed from conservative faith to something markedly more progressive and affirming. Yet as I lost faith in the institution we call \u0022church\u0022, his work has challenged me that it may yet have something to offer society. It is this idea, along with commentary on the incredibly vast array of historical moments 2020 has served up, that we explore on this episode of unchurchable. Enjoy!",
      "release": "2020-11-02T08:12:00Z",
      "duration": "01:02:49.8020000",
      "explicit": false,
      "spotifyId": "7uAl9TdBDyYI3QSeSevqa5",
      "appleId": 1000497009721,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7uAl9TdBDyYI3QSeSevqa5",
        "apple": "https://podcasts.apple.com/podcast/jonathan-merritt-the-ongoing-evolution-of-faith-and-church/id1505418217?i=1000497009721"
      }
    },
    {
      "id": "0952fbdb-7c91-4f52-89ce-3686decfa540",
      "title": "Sanny - Churching, Dechurching, and handing the power back to the marginalised",
      "description": "I met Sanny on the great connector called Instagram. I instantly knew we had a lot in common, but also that hers was a perspective on the phenomenon of deconstruction that would be quite different to mine as well. And thus, I knew I wanted to interview her. You see, deconstruction can lead us to question our faith and interaction with church, but it is as individual as we are. The moment we think there is one way to deconstruct, we miss the nuanced and complex ways in which it affects each of us. Sanny brings wit, wisdom, strength and intelligence to this conversation and I just loved hearing what she had to say. Enjoy!",
      "release": "2020-10-10T03:07:52Z",
      "duration": "01:05:23.2080000",
      "explicit": false,
      "spotifyId": "148BBIAfz3Yus7GbyCuU97",
      "appleId": 1000494286791,
      "urls": {
        "spotify": "https://open.spotify.com/episode/148BBIAfz3Yus7GbyCuU97",
        "apple": "https://podcasts.apple.com/podcast/sanny-churching-dechurching-and-handing-the-power-back/id1505418217?i=1000494286791"
      }
    },
    {
      "id": "d172e29d-9b22-4c7d-9436-b033049c93a9",
      "title": "Abby Norman - Parenting Post Deconstruction",
      "description": "Growing up inside evangelicalism, its likely you knew what \u0022Train up a child in the way he should go\u0022 meant. It was clear how parenting should be done. We already knew all the answers - God\u0027s way or the highway. Enter deconstruction, and all the things once taken for granted about how we would raise our kids went out the window. Todays guest is a pastor, author and a mother who has been through deconstruction so she knows this territory. Abby Norman sheds some light on how to parent, and how to \u0022person\u0022 post deconstruction.",
      "release": "2020-10-02T11:08:50Z",
      "duration": "00:57:33.7080000",
      "explicit": false,
      "spotifyId": "687EPhiAc6vLSjjez5VZ6B",
      "appleId": 1000493348780,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/687EPhiAc6vLSjjez5VZ6B",
        "apple": "https://podcasts.apple.com/podcast/abby-norman-parenting-post-deconstruction/id1505418217?i=1000493348780"
      }
    },
    {
      "id": "a5387d11-38aa-4718-82f6-bc873fda1adf",
      "title": "Tim Fall - Running for Judge",
      "description": "When Tim Fall mentioned that he had some availability for podcast interviews, I was pretty darn quick to put my hand up and say \u0022pick me!\u0022 His is a fair, reasonable voice in an often polarised and adversarial world. It stands to reason, then that the man is a judge! What ensued was a conversation about the validity of Judea-Christian claims on ethics, equality in church, and how a Christian should respond when those above us don\u0027t act in ways that are ethical or befitting of a Christian. Tune in! Its one you won\u0027t want to miss.",
      "release": "2020-09-23T04:47:52Z",
      "duration": "01:01:28.2470000",
      "explicit": false,
      "spotifyId": "5EtfcBN9x9yG4tHaYxe5zC",
      "appleId": 1000492317193,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5EtfcBN9x9yG4tHaYxe5zC",
        "apple": "https://podcasts.apple.com/podcast/tim-fall-running-for-judge/id1505418217?i=1000492317193"
      }
    },
    {
      "id": "ae121b31-5f07-4fac-90a3-1a90aec32dfa",
      "title": "Phil Drysdale - Deconstructing Faith and Surviving It",
      "description": "When Phil Drysdale first started speaking at churches on the topic of deconstruction, it didn\u0027t take him long to realise it was happening in epidemic proportions. Years on, he has devoted his professional life to supporting the people who started pulling at the thread of doctrine and institutional Christianity and ended up holding a ball of twine but finding themselves with nothing to stand on. So what is deconstruction, what does the research say about it, and how do you survive it? Its all on todays session (along with some interesting stuff on the fear of hell!)",
      "release": "2020-08-17T08:25:20Z",
      "duration": "01:02:50.1250000",
      "explicit": false,
      "spotifyId": "74cyCxKN8w8DdbRJJ9Y5jc",
      "appleId": 1000488435968,
      "urls": {
        "spotify": "https://open.spotify.com/episode/74cyCxKN8w8DdbRJJ9Y5jc",
        "apple": "https://podcasts.apple.com/podcast/phil-drysdale-deconstructing-faith-and-surviving-it/id1505418217?i=1000488435968"
      }
    },
    {
      "id": "bb762895-012e-49c5-ac6e-48fbba00119b",
      "title": "Cait West: faith, feminism and leaving patriarchy",
      "description": "Cait West grew up inside a form of Christian patriarchy that many wouldn\u0027t have even heard of - the stay-at-home-daughter movement. This form of conservative Christianity protected male headship to the point where courtships were quite strict and women were meant to serve men in the home. Her deconstruction into a more empowered version of faith and femininity involved leaving behind that movement. Now she is a University graduate, a writer taking on big topics, and has a job in publishing - proof that self-empowerment is possible even when the stakes are high.",
      "release": "2020-08-11T06:05:18Z",
      "duration": "00:57:31.4580000",
      "explicit": false,
      "spotifyId": "5Zzd5rBuiXExNTYfII9Kt9",
      "appleId": 1000487843256,
      "subjects": [
        "Christian Fundamentalist",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Zzd5rBuiXExNTYfII9Kt9",
        "apple": "https://podcasts.apple.com/podcast/cait-west-faith-feminism-and-leaving-patriarchy/id1505418217?i=1000487843256"
      }
    },
    {
      "id": "8f86a68f-d78e-4f1b-a30c-e73d9bdd96e5",
      "title": "Zach Cave: Purity Culture, Klinefelter Syndrome and Trauma Recovery",
      "description": "Trauma recovery is difficult enough when it is a single issue. But when you layer complex trauma with purity culture, religious pressure, murder, suicide, Klinefelter syndrome (also known as being Intersex), you have a potential recipe for disaster. Zach Cave is now a therapist, and has waded his way through difficult waters. His wisdom and discoveries on the journey to recovery make for a surprisingly calming and hopeful podcast episode. I hope you enjoy it.",
      "release": "2020-08-03T07:33:28Z",
      "duration": "00:59:41.1740000",
      "explicit": false,
      "spotifyId": "1EdMs6TASTfUr9M1gavoaO",
      "appleId": 1000486989177,
      "subjects": [
        "Purity Culture",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1EdMs6TASTfUr9M1gavoaO",
        "apple": "https://podcasts.apple.com/podcast/zach-cave-purity-culture-klinefelter-syndrome-and/id1505418217?i=1000486989177"
      }
    },
    {
      "id": "32ee366e-0dc7-427d-870f-dce676ffd0da",
      "title": "Keith Kristich: Contemplative spirituality, finding silence and connecting with God within",
      "description": "Many of us have grown up in a Christian tradition with many good things about it: activities, study groups, upbeat worship, active prayer traditions are more. But the downside to this is that, when we deconstruct our faith or find ourselves unable to engage with church, there can be a feeling of distance from God. Enter contemplative spirituality. Not only is it the antithesis of activities-based faith, but it includes simple ways we can set up our days to pour from a full emotional and spiritual cup rather than an empty or exhausted one.",
      "release": "2020-07-29T01:23:40Z",
      "duration": "00:42:58.9580000",
      "explicit": false,
      "spotifyId": "5TuEZ1n1ngn6wlPbpIwlYL",
      "appleId": 1000486480882,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TuEZ1n1ngn6wlPbpIwlYL",
        "apple": "https://podcasts.apple.com/podcast/keith-kristich-contemplative-spirituality-finding-silence/id1505418217?i=1000486480882"
      }
    },
    {
      "id": "ed9ac11b-ac07-48bb-bb5f-e0cc4e70b367",
      "title": "Blair Rabun - Talk Purity To Me",
      "description": "Contains adult content: Arguably, one of the most memorable movements of the 1990\u0027s or 2000\u0027s was the purity movement. Marked by songs like DC Talk\u0027s \u0022I Don\u0027t Want It\u0022 and Rebecca St. James\u0027 \u0022Wait for me,\u0022 and of course Joshua Harris\u0027s book (now pulled from circulation) \u0022I kissed dating goodbye.\u0022 But how did this movement contribute to body shame and the ongoing experience of sexual desire for those who grew up in it? That is a story still unfolding, and the topic of today\u0027s episode.",
      "release": "2020-07-22T01:16:38Z",
      "duration": "00:57:03.0060000",
      "explicit": false,
      "spotifyId": "1svZB6cRl2lYAkPmeS6UTx",
      "appleId": 1000485673761,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1svZB6cRl2lYAkPmeS6UTx",
        "apple": "https://podcasts.apple.com/podcast/blair-rabun-talk-purity-to-me/id1505418217?i=1000485673761"
      }
    },
    {
      "id": "9e8f46bf-611d-4790-bd2f-6e861566ad99",
      "title": "Erica Smith - Navigating sex and reclaiming sexuality post purity culture",
      "description": "When I read the term \u0022Purity Culture Dropout\u0022 on Erica Smith\u0027s instagram page - I knew I had to talk to her, because frankly, this isn\u0027t a topic I\u0027m comfortable with. And it should be. I\u0027m in my thirties now! Purity culture was a significant movement during my formative years as it was for people all over the world. That, combined with all too common \u0022abstinence only\u0022 sex education left a lot of people with gaps. Gaps in knowledge about their bodies, about consent, about what is and isn\u0027t \u0022normal\u0022 and how to navigate their way through the psychological gifts that keep on giving - those of shame related to sex and sexuality. Erica Smith is fabulous, and knowledgeable, and its an important session today. RATED M Ya\u0027ll!",
      "release": "2020-07-13T08:29:47Z",
      "duration": "00:57:03.1810000",
      "explicit": false,
      "spotifyId": "4xTNteDnxVVHa5xxIRnhZQ",
      "appleId": 1000484819866,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xTNteDnxVVHa5xxIRnhZQ",
        "apple": "https://podcasts.apple.com/podcast/erica-smith-navigating-sex-and-reclaiming-sexuality/id1505418217?i=1000484819866"
      }
    },
    {
      "id": "9924665f-a0fa-4be0-9f2c-dd7f0aa022b5",
      "title": "Kevin Garcia Bad Theology Kills",
      "description": "A chat with Kevin Garcia is always insightful, fun, challenging (in a good way) and a bit mind-bending. This session is no different. The original intent was to have Kevin stop by and talk about their new book \u0022Bad Theology Kills\u0022 - and perhaps there is no better time in history to have this book-baby out there in the world. But in true Kevin style, we couldn\u0027t help but extend the conversion far beyond that - deconstruction, spellcraft, sex, sexuality, civil rights revolutions and the power of red lipstick. Curious? Give it a listen.",
      "release": "2020-06-29T01:00:22Z",
      "duration": "01:01:43.5410000",
      "explicit": false,
      "spotifyId": "6jQZD6rHDLSDMiURHrGMt4",
      "appleId": 1000480095810,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6jQZD6rHDLSDMiURHrGMt4",
        "apple": "https://podcasts.apple.com/podcast/kevin-garcia-bad-theology-kills/id1505418217?i=1000480095810"
      }
    },
    {
      "id": "0272774b-bffc-4fcd-8d2b-ccbf7fd841dd",
      "title": "Mike Phillips: Religious Trauma Recovery and Reclaiming Your Core Self",
      "description": "No episode of this podcast has had as wide-reaching topic material within it as this one. We talk about cults, toxic groups, the Black Lives Matter movement, dominions, toxic evangelicalism, sexuality, trauma recovery, and the reclaiming of your core identity and autonomy after religious trauma. Obviously, there are a few trigger warnings built into this episode, but its truly an unmissable one as so much of it pertains to the big issues of 2020! Be safe. Be well. Be empowered to reclaim your spirituality and self-expression.",
      "release": "2020-06-10T03:58:15Z",
      "duration": "01:01:25.6270000",
      "explicit": false,
      "spotifyId": "4Y108ZU3QECvLjepN9xv8B",
      "appleId": 1000477479082,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Y108ZU3QECvLjepN9xv8B",
        "apple": "https://podcasts.apple.com/podcast/mike-phillips-religious-trauma-recovery-and/id1505418217?i=1000477479082"
      }
    },
    {
      "id": "6be09e3f-ad7f-40e5-9649-8a8aac1b14c9",
      "title": "Tonya Nash - Autism, faith and inclusion",
      "description": "Tonya Nash, the pioneer behind the Autism Faith Network, takes us on an insightful journey through the challenges faced by families and churches when it comes to making church a beautiful experience for families and carers of people with autism or other disabilities. She offers up some simple guidance that can so beautifully enrich the experience of these amazing people, and help us treat them with the dignity and inclusion they deserve.",
      "release": "2020-05-07T00:45:04Z",
      "duration": "00:34:11.4410000",
      "explicit": false,
      "spotifyId": "6X3ge1BhgbtTnCe5xnk0IO",
      "appleId": 1000473906859,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6X3ge1BhgbtTnCe5xnk0IO",
        "apple": "https://podcasts.apple.com/podcast/tonya-nash-autism-faith-and-inclusion/id1505418217?i=1000473906859"
      }
    },
    {
      "id": "76227f5a-471f-4ced-9918-e878d2a9a327",
      "title": "Lance Pyburn - Resilience and authenticity on lockdown",
      "description": "As large portions of the population sit on lockdown, awaiting the decline of coronavirus, many of us sit alone with our thoughts, dreams, relationships and lives. It might be a time for asking \u0022Is the living I\u0027m living congruent with who I am on the inside?\u0022 and indeed for reflecting on whether or not our jobs, economies, or personal lives can bounce back. Lance Pyburn from Brave New Love joins me this week to talk about resilience, authenticity and finding our value on the inside.",
      "release": "2020-04-29T03:57:06Z",
      "duration": "00:53:04.1700000",
      "explicit": false,
      "spotifyId": "2I7RWoPrvDpMey2VYlTdru",
      "appleId": 1000473030028,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2I7RWoPrvDpMey2VYlTdru",
        "apple": "https://podcasts.apple.com/podcast/lance-pyburn-resilience-and-authenticity-on-lockdown/id1505418217?i=1000473030028"
      }
    },
    {
      "id": "5bdb8c0f-564c-4d7a-9f9f-9c97267eb2cc",
      "title": "Carrie Maya - Reclaiming Spirituality and Releasing the Fear of Hell",
      "description": "Leaving a church is a big deal. Leaving a religion \u0026 choosing to explore spirituality on your own terms is an even bigger one. Carrie Maya has carved out an empowered spiritual practice that aligns with her values rather than dictating them. She is wise \u0026 intuitive, and honest about the times when life it isn\u0027t all rosy. What she has to say about working with the shadows in our lives, the archetype of Christ \u0026 releasing the fear of hell is a breath of fresh air.",
      "release": "2020-04-22T09:45:39Z",
      "duration": "00:58:24.8290000",
      "explicit": false,
      "spotifyId": "2cjDHzyZuibIy7VgLSfWK0",
      "appleId": 1000472310111,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2cjDHzyZuibIy7VgLSfWK0",
        "apple": "https://podcasts.apple.com/podcast/carrie-maya-reclaiming-spirituality-and-releasing/id1505418217?i=1000472310111"
      }
    },
    {
      "id": "60927848-af7a-434e-85a0-aa458b3df9ca",
      "title": "The Brave Network - Making Church safe for LGBTQIA\u002B people of faith",
      "description": "Church should be the safest place in the world. It should be a place of safety and refuge for all who want to follow Jesus. Yet the data paints a bleak picture for LGBTQIA\u0026#43; (especially questioning) people of faith. Nathan Despott and the Brave Network have been working to change this. In this weeks episode, Nathan spoke to me about Queer theology, the harm done when a church is \u0022welcoming but not affirming\u0022, and what we need to do to make church a safe place for all. CW: suicide",
      "release": "2020-04-14T03:56:15Z",
      "duration": "00:53:11.8610000",
      "explicit": true,
      "spotifyId": "3xTIVkPEi8fzymQmUvvKuK",
      "appleId": 1000471417957,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3xTIVkPEi8fzymQmUvvKuK",
        "apple": "https://podcasts.apple.com/podcast/the-brave-network-making-church-safe-for-lgbtqia/id1505418217?i=1000471417957"
      }
    },
    {
      "id": "fb29177a-cce7-4bc9-96b6-a9151e9fe91f",
      "title": "D-D-Divorce: Reclaiming Faith When \u0022Til Death Do Us Part\u0022 Didn\u0027t Work Out",
      "description": "For this weeks pod, I interviewed the fabulous Gretchen Baskerville, author of \u0022the Life Saving Divorce.\u0022 Gretchen has been working with people in the divorce recovery space for the past 20 years. Tune in for a well-needed discussion on breaking down the unhelpful narratives around divorce, empowering people to maintain their right to and engagement with faith and church post relationship breakdown, and realising that bringing hope is everyone\u0027s ministry.",
      "release": "2020-04-06T07:20:57Z",
      "duration": "00:38:01.1510000",
      "explicit": false,
      "spotifyId": "7yyFQsYm92TxsngwhEd8vE",
      "appleId": 1000470654455,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7yyFQsYm92TxsngwhEd8vE",
        "apple": "https://podcasts.apple.com/podcast/d-d-divorce-reclaiming-faith-when-til-death-do-us-part/id1505418217?i=1000470654455"
      }
    },
    {
      "id": "11dce634-b201-4148-abe2-3251eb826a37",
      "title": "Revelation, the Great Tribulation and COVID19",
      "description": "If you grew up Evangelical in the 1990\u0027s or 2000\u0027s, then the news right now might be triggering flashbacks of End-Times Doctrine: the four horses of the apocalypse, famine, pestilence, war, the anti-Christ, the Great Tribulation and the Rapture. I caught up with Shari Smith, faith and coffee blogger and Christian feminist, to talk about whether the book of Revelation is prophetic or reflective, fact or fiction, and how to deal with the anxiety that comes with traumatic theology.",
      "release": "2020-03-30T05:33:26Z",
      "duration": "00:38:41.6700000",
      "explicit": false,
      "spotifyId": "3JiIfnvydWfkkTeYex695a",
      "appleId": 1000470014808,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3JiIfnvydWfkkTeYex695a",
        "apple": "https://podcasts.apple.com/podcast/revelation-the-great-tribulation-and-covid19/id1505418217?i=1000470014808"
      }
    }
  ]
}