{
  "id": "b3a506b0-185e-49a6-b7dc-46490577c109",
  "name": "Uncovered: Life Beyond",
  "spotifyId": "4apIxvICrUSRfB7Dwwh4qa",
  "appleId": 1685673620,
  "episodes": [
    {
      "id": "922b7ecb-a132-4da8-a724-701a38453736",
      "title": "38. Book Review: Tia Levings\u0027 A Well-Trained Wife...or Widget? (Part 2)",
      "description": "Send us a Text Message. Ever wondered what it\u0027s like to break free from a high-control environment? Join us as we celebrate Tia Leving\u0027s incredible achievement—her book \u0022A Well-Trained Wife\u0022 has skyrocketed to the New York Times bestseller list. We share stories from our own past about compassionate bystanders who made a big difference and offer practical suggestions for ways to meaningfully support those in a major life transition or in a crisis situation. We also talk about the complex emotions of loss and new beginnings when cherished dreams crumble into dust. We reflect on the inevitable grief of unmet expectations and the magic of learning to hold mystery, uncertainty, and two competing truths at once. Finally, we touch on the unexpected influence of evangelical fundamentalism and Calvinism on contemporary Anabaptist communities, scratching our heads at the seeming contradictions and unlikely resonances between these religious traditions given their vociferous theological differences in past centuries. Show Notes: A Well-Trained Wife by Tia Levings Ep. 37 - Part 1 of our discussion about A Well-Trained Wife Rebecca\u0027s Post: Stepping off the Tightrope: A Journey of Faith, Struggle, and Redemption Naomi’s Post: Unveiling the Unseen: Navigating Obstacles and Opportunities on the Way to College Jana Duggar…A Mennonite? Christian Nationalism among the Evangelicalized Mennonites by Rebekah Mui Straight White American Jesus podcast by Brad Onishi and Dan Miller Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-08-19T00:00:00Z",
      "duration": "01:06:01.6000000",
      "explicit": false,
      "spotifyId": "2cnpqD863cKIo8tLotUqe3",
      "appleId": 1000665820454,
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2cnpqD863cKIo8tLotUqe3",
        "apple": "https://podcasts.apple.com/podcast/38-book-review-tia-levings-a-well-trained-wife-or/id1685673620?i=1000665820454"
      }
    },
    {
      "id": "79a2aaa1-6aeb-4f4a-a939-ec34b6edb23f",
      "title": "37. Book Review: A Well-Trained Wife...or Widget? (Part 1)",
      "description": "Send us a Text Message. What if the very teachings that promise to bring you love and belong are the same ones that will put you in the greatest dangers? Join us as we explore Tia Leving\u0027s phenomenal book, \u0022Well-Trained Wife,\u0022 and the many parts that resonate with us. We discuss the tight grip of rigid faith traditions and societal expectations, and how liberating it can be to seize control of our own destinies. From personal anecdotes to reflections on our younger selves, this episode is packed with heartfelt dialogue about breaking free and growing stronger, with a gentle reminder to brace for heavy content around various forms of abuse. Show Notes A Well-Trained Wife by Tia Levings PODCAST: The Problems with The Excellent Wife by Martha Peace (Bare Marriage) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-08-14T16:00:00Z",
      "duration": "00:54:08.4830000",
      "explicit": false,
      "spotifyId": "48UqD8SjNZqFO15kK0m6PL",
      "appleId": 1000665306244,
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/48UqD8SjNZqFO15kK0m6PL",
        "apple": "https://podcasts.apple.com/podcast/37-book-review-a-well-trained-wife-or-widget-part-1/id1685673620?i=1000665306244"
      }
    },
    {
      "id": "2f55a48e-4d84-4a26-9858-3a0ce7efb130",
      "title": "36. Set up to Fail: Patriarchy\u0027s Femininity Trap",
      "description": "Send us a Text Message. Are women guilty of manipulation and passive-aggressive tendencies? Sure! However, we are here to point out that these tactics are used across the board by women AND men. Moreover, we can\u0027t ignore the unfortunate reality that many of us were trained as young children to avoid more direct ways of communicating, so manipulation is often the only tool available to us to get our needs met. In this episode, we talk about the role of authoritarian religious parenting in conditioning us to use manipulation to get our needs met, the social pressures that further promote manipulation, and the projection that often lurks behind accusations of manipulation. Rather than buying into notions of women as the \u0022weaker sex\u0022 and thus more prone to \u0022emotional irrationality,\u0022 we uncover the power struggle behind these deep-seated sexist ideas to show how they trap women (and men!) in dysfunctional and dissatisfying relationships. We also suggest more healthy alternatives that offer liberation to ourselves and our loved ones. Relevant Articles and Resources: Masculinity might be more toxic than we think: The influence of gender roles on trait emotional manipulation (ScienceDirecrt) Too Sweet, Or Too Shrill? The Double Bind For Women (NPR) Speak Your Mind, but Not Like That: The Double Bind Theory (Psychology Today) What is Religious Authoritarian Parenting? (DL and Krispin Mayfield) Projection (Psychology Today) 10 Signs of Internalized Sexism and Gaslighting (Psychology Today) What You Need to Know About Phobia Indoctrination \u0026 Religious Cults On Our Best Behavior: The Seven Deadly Sins and the Price Women Pay to be Good (Elise Loehnen) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-08-04T17:00:00Z",
      "duration": "00:56:56.3980000",
      "explicit": false,
      "spotifyId": "4cuYiquq7VPc3covLawnPz",
      "appleId": 1000664290101,
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cuYiquq7VPc3covLawnPz",
        "apple": "https://podcasts.apple.com/podcast/36-set-up-to-fail-patriarchys-femininity-trap/id1685673620?i=1000664290101"
      }
    },
    {
      "id": "8a9f28ca-ae9b-486e-a67e-9a772e744e56",
      "title": "35. 15 Summer Hacks to Rock the School Year Before it Starts",
      "description": "Send us a Text Message. What if the best way to get ready for fall is to rest this summer? In this episode we challenge common expectations about productivity and laziness, making the case that rest is not a luxury but is foundational for being the happy, relaxed parent our children need. We\u0027re sharing 15 ways we\u0027re making the most of summer\u0027s remaining weeks. Instead of working harder, we\u0027re trying to work softer, to focus on what really matters, and soak up some low-brow fiction and TV. We discuss practical ways to prepare for the onslaught of school forms and artwork that will soon be pouring in and share our best tips for making housework and meal prep easier come fall. Stay to the end to find out what Rebecca means when she recommends ordering pizza on your time too. Please join us! Resources Excerpt from Rest is Resistance by Tricia Hersey Mom Stays in the Picture by Allison Tate The Durrells in Corfu | Prime Video Happy Valley | Prime Video Last Tango in Halifax | Netflix Ted Lasso - IMDb Good Witch - IMDb Decluttering at the Speed of Life by Dana K. White The Best Paper Clutter Solution I\u0027ve Ever Tried! - Dana K. White Cozi Family Organizer App @fayette_nyehn | Linktree Stay Fit Mom How to Keep House While Drowning by KC Davis or listen to an interview with the author The Lazy Genius Way by Kendra A Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-07-28T17:00:00Z",
      "duration": "01:03:08.4340000",
      "explicit": false,
      "spotifyId": "6Bq9xJ7pQQHmre47hCj4j4",
      "appleId": 1000663599175,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Bq9xJ7pQQHmre47hCj4j4",
        "apple": "https://podcasts.apple.com/podcast/35-15-summer-hacks-to-rock-the-school-year-before-it-starts/id1685673620?i=1000663599175"
      }
    },
    {
      "id": "add111a5-37e9-4b08-9a9f-5bb2795647cf",
      "title": "34. From Judgement to Joy: Navigating Divorce in Conservative Communities (Part 2)",
      "description": "Send us a Text Message. This is a continuation of the previous episode where we pull back the curtain on Naomi\u0027s divorce journey and her perspective six years later. We address systemic issues that often leave women feeling trapped--issues such as financial dependency, lack of education, and inadequate support from family and faith communities. We also discuss the benefits of no-fault divorce laws, which have been proven to reduce female suicides and domestic violence. The evidence makes a compelling case for seeing divorce not as a failure but as a path to empowerment and healthier, more authentic relationships. Resources The high mortality of a low divorce rate: Divorce Laws and Family Violence Flying Free Sisterhood: https://www.instagram.com/flyingfreesisterhood?igsh=MXZmMG95NXUzejV3Yw== To Good to Leave, To Bad to Stay by Mira Kirshenbaum (Read an excerpt) Top 10 Questions to Ask Before Hiring a Divorce Attorney Divorce Headquarters The Divorce Survival Guide Podcast Who Suffers the Most Financially in a Divorce? Financial Mistakes Women Make During Divorce How To Write A BIFF Response® DomesticShelters.org National Domestic Violence Hotline Phone: 1.800.799.SAFE (7233) Text: Text “Start” to 88788 Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-07-21T17:00:00Z",
      "duration": "01:02:47.0660000",
      "explicit": false,
      "spotifyId": "1jdpICQx0ihwJ63kb5Ulg7",
      "appleId": 1000662895221,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1jdpICQx0ihwJ63kb5Ulg7",
        "apple": "https://podcasts.apple.com/podcast/34-from-judgement-to-joy-navigating-divorce-in-conservative/id1685673620?i=1000662895221"
      }
    },
    {
      "id": "49c3bd67-35ea-4557-a34f-b725d44f78d5",
      "title": "33. From Judgment to Joy: Navigating Divorce in Conservative Communities (Part 1)",
      "description": "Send us a Text Message. In this episode we pull back the curtain on Naomi\u0027s divorce journey and her perspective six years later. We address systemic issues that often leave women feeling trapped--issues such as financial dependency, lack of education, and inadequate support from family and faith communities. We also discuss the benefits of no-fault divorce laws, which have been proven to reduce female suicides and domestic violence. The evidence makes a compelling case for seeing divorce not as a failure but as a path to empowerment and healthier, more authentic relationships. Tune in next week for the second installment of this hope-filled conversation. Resources The high mortality of a low divorce rate: Divorce Laws and Family Violence Flying Free Sisterhood: https://www.instagram.com/flyingfreesisterhood?igsh=MXZmMG95NXUzejV3Yw== To Good to Leave, To Bad to Stay by Mira Kirshenbaum (Read an excerpt) Top 10 Questions to Ask Before Hiring a Divorce Attorney Divorce Headquarters The Divorce Survival Guide Podcast Who Suffers the Most Financially in a Divorce? Financial Mistakes Women Make During Divorce How To Write A BIFF Response® DomesticShelters.org National Domestic Violence Hotline Phone: 1.800.799.SAFE (7233) Text: Text “Start” to 88788 Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-07-14T17:00:00Z",
      "duration": "00:46:14.7260000",
      "explicit": false,
      "spotifyId": "0gWQ3k2afQ37pAjwMTdKyl",
      "appleId": 1000662181156,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0gWQ3k2afQ37pAjwMTdKyl",
        "apple": "https://podcasts.apple.com/podcast/33-from-judgment-to-joy-navigating-divorce-in-conservative/id1685673620?i=1000662181156"
      }
    },
    {
      "id": "0df48e3b-a438-42bf-b533-9b8ff8e22f65",
      "title": "32. 10 Things Saving our Summer: Finding Joy in the Chaos",
      "description": "Send us a Text Message. In the mood for a deep, serious discussion? Then keep right on scrolling because this is NOT the episode for you. We\u0027re here to talk about the overwhelm that comes with summer\u0027s chaos--the kind of overwhelm that makes even picking out a watermelon feel like too much. Join us for a feel-good conversation that celebrates the small joys and the strong connections that make life beautiful. Expect to laugh, nod in agreement, and perhaps feel a little less alone in the daily juggle. Links for Rebecca’s List Red Mug Coffee Raised garden beds ( pic ) Redecorated bedroom ( pic ) Links for Naomi’s List DT/Thrifting haul videos ( Pink Squirrel Studios, Do It on a Dime, Liz Fenwick DIY, Living With LK ) Keurig milk frother Cooling throw blanket ( similar item from Amazon ) 5-minute pick-up ( Sam Kelly Guide for Proactive Kids , 5 Minute Pickup (Dana K. White) Blooming Phlox ( pic ) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-07-09T01:00:00Z",
      "duration": "00:40:47.6210000",
      "explicit": false,
      "spotifyId": "0uPrmMV0xThIuBJiSPqfSi",
      "appleId": 1000661602020,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0uPrmMV0xThIuBJiSPqfSi",
        "apple": "https://podcasts.apple.com/podcast/32-10-things-saving-our-summer-finding-joy-in-the-chaos/id1685673620?i=1000661602020"
      }
    },
    {
      "id": "3c28f7b0-8e20-4c64-bc2a-0949290dc1d6",
      "title": "31. From Quilts to Inquiry: Reflections on the Amish Heritage Scholars Symposium",
      "description": "Send us a Text Message. This week we start out with an update on Naomi\u0027s recent health adventures and then turn our attention to recapping the first weekend in June when we attended a Symposium on How Our Amish Heritage Influences Our Education and Career at Elizabethtown College. It all started with a very social Costco run to kick off our girls\u0027 weekend with all the necessary supplies (cheesecake, almonds, and salsa, FTW). Next, we reflect on the Symposium and themes that emerged over the course of the day. Specifically, there was a consensus on what didn\u0027t matter nearly as much as we\u0027d feared (being smart enough) and what did matter (moral support and resources). Surprising challenges included things like the difficulty of finding new social circles and the loneliness of having no one to understand or celebrate your academic successes with you. Finally, we look ahead to possible future Symposia (join us!) and wonder about the need for a memoir writing workshop/group/retreat of some kind. And if you listen to the end, you\u0027ll learn how to enter to win a copy of Lizzie Hershberger\u0027s memoir, Behind Blue Curtains! Links to all the things we mentioned (or should have): Sonder : The profound feeling of realizing that everyone, including strangers passing in the street, has a life as complex as one\u0027s own, which they are constantly living despite one\u0027s personal lack of awareness of it (Wiktionary) A City at Work: 1912 and 2012 , specifically Mercy Hospital Operating Room: 1912 vs. 2012 A Heart for Truth (Cousin Erma’s podcast) How Our Amish Heritage Influences Our Education and Career: A Symposium (event recap on Saloma Furlong’s blog) Young Center for Anabaptist and Pietist Studies at Elizabethtown College Amish Descendant Scholarship Fund (Naomi Kramer Yoder and Emma Miller) Lizzie Hershberger , author of Behind Blue Curtains: A True Crime Memoir of an Amish Woman\u0027s Survival, Escape, and Pursuit of Justice Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-06-30T17:00:00Z",
      "duration": "00:54:50.7750000",
      "explicit": false,
      "spotifyId": "08J4xjFj68ltkHCfGrhkWd",
      "appleId": 1000660708246,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/08J4xjFj68ltkHCfGrhkWd",
        "apple": "https://podcasts.apple.com/podcast/31-from-quilts-to-inquiry-reflections-on-the-amish/id1685673620?i=1000660708246"
      }
    },
    {
      "id": "8d662f55-d641-4da4-a9ea-eabcc3443b10",
      "title": "30. Rereading The Pineapple Story",
      "description": "Send us a Text Message. Have you ever reread a cherished story from childhood only to find your sense of nostalgia replaced by cringe? In this episode, we reflect on The Pineapple Story, a seemingly innocent book that, for us, represents a mashup of influences that colored our upbringing and sense of the world. The Pineapple Story is just one example of a missionary story that at first glance may seem to be an inspirational story of faith and personal growth, but when examined more closely, reveals a colonialist, xenophobic mindset and political agenda. We use research and analytical tools learned in college to question its assumptions and challenge its narratives. Links we (should have) mentioned: The Pineapple Story Western New Guinea (Wikipedia) Peek behind the IBLP curtain in the documentary, Shiny Happy People, that we reviewed last year here and here . The Vatican repudiates \u0027Doctrine of Discovery,\u0027 which was used to justify colonialism (NPR) Missions: Is it Love or Colonization? (Religion News Service) The Poisonwood Bible by Barbara Kingsolver Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-06-23T17:00:00Z",
      "duration": "00:56:34.6120000",
      "explicit": false,
      "spotifyId": "4ox9BeO2IxtEIvYyvKZZyE",
      "appleId": 1000659965588,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ox9BeO2IxtEIvYyvKZZyE",
        "apple": "https://podcasts.apple.com/podcast/30-rereading-the-pineapple-story/id1685673620?i=1000659965588"
      }
    },
    {
      "id": "f6b49af7-bcd7-4538-8aaa-87811e98d748",
      "title": "29. Who is Smart Enough for College?",
      "description": "Send us a Text Message. Have you missed us? We’ve missed you! This episode was recorded in mid-May 2024 but not released until mid-June because of some health issues that threw a wrench in our production plans. We\u0027re happy to report that all is well and we\u0027re back in action. ------- Many of us who are the first in our families to go to college might be held back by the worry that we aren’t smart enough for college. If that’s true for you, you’re in the right place! In this episode, we share our short quiz that will help put that question to rest once and for all. We also suggest more useful questions to ask when considering college and wondering how it might fit into a life that already has a full plate of responsibilities. We conclude that when a strong work ethic and a positive attitude aren’t enough to help us reach big life goals, radical acceptance can often open our eyes to new strategies for overcoming obstacles in life. Tune in for a blend of personal stories, practical advice, and heartfelt encouragement aimed at anyone navigating the barriers to higher education. Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-06-18T15:00:00Z",
      "duration": "00:39:02.2690000",
      "explicit": false,
      "spotifyId": "09i2DY1Awe9qx8F6TNmS9b",
      "appleId": 1000659420834,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09i2DY1Awe9qx8F6TNmS9b",
        "apple": "https://podcasts.apple.com/podcast/29-who-is-smart-enough-for-college/id1685673620?i=1000659420834"
      }
    },
    {
      "id": "ef89a062-bc82-42ae-a151-1a8b6f3e81e6",
      "title": "28. All Talk: When Therapy Feels Pointless",
      "description": "Send us a Text Message. Now that we\u0027ve (nearly) survived the end of semester crunch time, we\u0027re delighted to return to a regular podcasting schedule again. We\u0027re also excited about the new texting option for listeners. (Click the link above to try it out!) Have you ever been overwhelmed by life circumstances beyond your control and wondered what good therapy could do? Maybe you\u0027ve tried everything and concluded there\u0027s nothing to be done so why talk about it? We\u0027ve been there too! Today we\u0027re unpacking those feelings and dishing about the good, bad, and the ugly of our own experiences with therapy. We discuss qualities we look for in a therapist as well as the value of reflecting on our emotional health and what important messages might be embedded in our deepest, darkest emotions. Find a Therapist Near You (Psychology Today) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-05-12T17:00:00Z",
      "duration": "00:52:26.2130000",
      "explicit": false,
      "spotifyId": "50OsQz9RttilcX8MscXqhp",
      "appleId": 1000655329946,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/50OsQz9RttilcX8MscXqhp",
        "apple": "https://podcasts.apple.com/podcast/28-all-talk-when-therapy-feels-pointless/id1685673620?i=1000655329946"
      }
    },
    {
      "id": "7833e6a8-ebaa-4735-b610-597447fa0d03",
      "title": "27. College 101: The Best-Kept Secret to Earning FREE College Credit",
      "description": "Send us a Text Message. Ever wonder how you got here as you blow out the candles on your birthday cake? That\u0027s where we begin in this episode, making space for the bittersweet emotions of milestone birthdays and the impending retirements of colleagues we admire. In our main segment, we talk about the possibilities of the College-Level Examination Program (CLEP) that can save college students serious time and money. Never heard of it? We speculate about why that might be as well as describe what it can (and can’t) do for lifelong learners curious about alternative pathways to college. Wherever you are in your educational journey, it’s never too late to experience the joy of learning and discovery! Show Notes YCBK 230: Interview about CLEP \u0026 Modernstates.org with David Vise (Your College-Bound Kid Podcast) CLEP Tests: Exam Topics (CLEP | College Board) CLEP Classes and Vouchers: Modern States Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-05-06T20:00:00Z",
      "duration": "00:42:45.1980000",
      "explicit": false,
      "spotifyId": "3Pl6EDWIXgBnqHHcvDOuRX",
      "appleId": 1000654731122,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Pl6EDWIXgBnqHHcvDOuRX",
        "apple": "https://podcasts.apple.com/podcast/27-college-101-the-best-kept-secret-to-earning-free/id1685673620?i=1000654731122"
      }
    },
    {
      "id": "9c143de7-c879-4852-90d1-e6dbafa6681c",
      "title": "26. Identity Quilts: Making Peace with the Patches",
      "description": "Send us a Text Message. This episode is for anyone who has called many different places home and often waffles just a bit before answering the question, \u0022Where are you from?\u0022 How do we answer this simple question while accounting for all the twists and turns and layers of experience that make up our identity? How deep do our roots need to go before we can claim to be Amish or Mennonite--or any other particular cultural identity? To help make sense of the patchwork of our lives, we turn to three different ways to understand cultural dynamics and to discuss why we can expect that any two individuals in the same culture will have significantly different experiences. Resources mentioned in the show: Gerald J. Mast, PhD (website and links to writings) Amish and Mennonite Separations and Mergers (Dwight Gingerich Blog) Intercultural Communication by Kathryn Sorrells (2020, SAGE Publications) Ch. 1 Opening the Conversation (pdf) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-04-07T17:00:00Z",
      "duration": "00:55:43.4900000",
      "explicit": false,
      "spotifyId": "2twyD1BBLfYUVBju1q7PzN",
      "appleId": 1000651689646,
      "subjects": [
        "Amish",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2twyD1BBLfYUVBju1q7PzN",
        "apple": "https://podcasts.apple.com/podcast/26-identity-quilts-making-peace-with-the-patches/id1685673620?i=1000651689646"
      }
    },
    {
      "id": "83d35213-6ff1-43e4-8bd4-eca7b6c79d41",
      "title": "25. College 101: What to Ask on a Campus Visit",
      "description": "Send us a Text Message. If the thought of scheduling an official campus tour fills you with uncertainty or even dread, this podcast is for you! Navigating unfamiliar places and institutions can feel daunting for any of us, including first generation students (and their parents) who may not be sure where to start or what to expect beyond the glossy brochures and flashy websites. In this episode, we (Naomi and Rebecca) talk about our own experiences with campus visits--which came much later than you might expect. Now that we have experienced campus visits from a variety of roles, we\u0027re here to give listeners the low-down about what to ask, what to listen for, and what to consider when evaluating your options. The good news is that no one has it all figured out before they get started, but it\u0027s not too soon to start exploring your options today. Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-04-01T08:00:00Z",
      "duration": "00:49:52.5610000",
      "explicit": false,
      "spotifyId": "1awzdMP3ht7PrtUrN8fwAt",
      "appleId": 1000651047021,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1awzdMP3ht7PrtUrN8fwAt",
        "apple": "https://podcasts.apple.com/podcast/25-college-101-what-to-ask-on-a-campus-visit/id1685673620?i=1000651047021"
      }
    },
    {
      "id": "d8208ee7-d702-4408-b559-ec31c0ccdc04",
      "title": "24. Raging Against the Inevitable: When He Gets No Respect",
      "description": "Send us a Text Message. If your win this week is a kitchen floor that\u0027s clean for the first time in ages, you\u0027ve found your people! We start this episode with a pop culture minute where we wonder aloud about the Royal Family\u0027s odd handling of Kate Middleton\u0027s recent absence from the public eye as well as the public\u0027s reaction to the public\u0027s reaction. Then we shift our focus to analyze a short video clip of a domestic argument and the responses it prompted on social media. We discuss some of the different ways respect is defined and interpreted in families and by leaders, and we reflect on what we have personally observed about double standards in expectations for socially acceptable behavior. What kind of risks come with upholding a \u0022united front\u0022 at all costs? What does it mean when popular narratives have a survivorship bias and what is the minimum we all deserve in our relationships? As always, we have more questions than answers, and we hope you\u0027ll join us as we explore them together. Links We Mentioned–or Should Have Dad interrupts video game (video clip) On parenting teens and their emotional development: The Emotional Lives of Teenagers by Lisa Damour, PhD See also Lisa Damor’s suggestions for getting kids off video games “Be Sweet and Quiet” by Rebecca Davis at Untwisting Scriptures Survivorship Bias Why Does He Do That? Inside the Minds of Angry and Controlling Men by Lundy Bancroft Not sure if your situation counts as abuse? Call the Hotline for Domestic Violence Support at 800-799-7233 to chat with someone who cares. You deserve to be safe–no matter what. Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-03-24T18:00:00Z",
      "duration": "00:37:17.0740000",
      "explicit": false,
      "spotifyId": "3n6jdJ0bYOnJidAb5eUOCq",
      "appleId": 1000650277275,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3n6jdJ0bYOnJidAb5eUOCq",
        "apple": "https://podcasts.apple.com/podcast/24-raging-against-the-inevitable-when-he-gets-no-respect/id1685673620?i=1000650277275"
      }
    },
    {
      "id": "307139f8-19e8-4e37-9f68-d7cb2d68420d",
      "title": "23. Listening for Personal Truth Over the Clamor of Social Guilt",
      "description": "Send us a Text Message. Ever wrestled with the weight of a difficult decision, feeling the tug-of-war between what you\u0027ve been taught and what your gut is screaming at you? Join us for this heart-to-heart as we peel back the layers of socialized guilt and its power in our lives. First, we explore some of the reasons we often find ourselves pulled along by social norms even when they aren\u0027t working for us or we fundamentally disagree with them. Next, we turn to some of the shifts in perspective that have helped us focus on what we truly value. Finally, we discuss some of the tools that have helped us make difficult life choices from a place of confidence rather than fear. Links we mentioned (or should have): Stolen Innocence by Elissa Wall \u0022Boundaries 101 for the Recovering People-Pleaser\u0022 by Hailey Magee \u0022Shitty First Drafts\u0022 by Anne Lamott Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-03-17T17:00:00Z",
      "duration": "01:29:27.0920000",
      "explicit": false,
      "spotifyId": "5kCiutghLvhUdxut9AnBt9",
      "appleId": 1000649485809,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5kCiutghLvhUdxut9AnBt9",
        "apple": "https://podcasts.apple.com/podcast/23-listening-for-personal-truth-over-the-clamor/id1685673620?i=1000649485809"
      }
    },
    {
      "id": "3bcca79c-a90d-4b4f-bc97-bdc384dc34b9",
      "title": "22. What if Women Dared to Tell the Truth?",
      "description": "Send us a Text Message. We reflect on last week\u0027s episode and the events that prompted it--such as public figures spreading misconceptions about Amish culture and failing to honor the truths of those living in high-demand religion. We stress the importance of listening to and respecting the broad range of individual experiences that together make up a culture far more dynamic and complex than any fiction writer could imagine. We also ask how our world might change if more women took our professed ideals and values more seriously than we do keeping the secrets of powerful men. Links Mentioned in the Episode Previous episode we referenced: 21. The Fantasy and Fallout of Amish-themed Romance Novels Complete, unedited panel discussion: Coffee with JC, Ruth, Rebecca, and Naomi on YouTube Live; Hosted by Mary Byler (Abe Troyer and Old Order Amish); produced by The Misfit Amish 2024 The danger of a single story (Chimamanda Ngozi Adichie’s TED Talk) Rhetorical Listening (brief summary) Women Talking (Official Trailer) The film takes a Russian Mennonite colony in South America dealing with the fallout of rape culture as its jumping off point and then explores the revolutionary possibility of these devout women taking their future in their own hands. It is self-described as “an act of female imagination.” Women Talking (Miriam Toews; Extended Preview) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-03-10T21:00:00Z",
      "duration": "00:26:23.6730000",
      "explicit": false,
      "spotifyId": "4TMoop0Zf2b3wYyvS1eXaN",
      "appleId": 1000648681179,
      "subjects": [
        "Amish",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4TMoop0Zf2b3wYyvS1eXaN",
        "apple": "https://podcasts.apple.com/podcast/22-what-if-women-dared-to-tell-the-truth/id1685673620?i=1000648681179"
      }
    },
    {
      "id": "c1cf6efd-61f3-4339-a8a8-117245808bae",
      "title": "21. The Fantasy and Fallout of Amish-themed Romance Novels",
      "description": "Send us a Text Message. Ever wonder what it would be like to step into the world represented by Amish-themed romance novels? Well, just as the cottages in a Thomas Kincade painting don\u0027t actually exist (has anyone ever seen glowing windows in the middle of the day?), neither do the communities of Beverly Lewis\u0027 imagination. These books reflect as much about Amish culture as the Little House on the Prairie TV show tells us about pioneer life. But is it all just harmless fluff and fun? Does it really matter since fiction is fiction, after all? Naomi and Rebecca join a few friends to discuss the impact of these books on the lives of actual Amish women and the material harm it does to romanticize a culture as they do. We are publishing the first thirty minutes of our conversation here. Listen to our complete discussion: Coffee with JC, Ruth, Rebecca \u0026 Naomi (Misfit Amish Podcast) Coffee with JC, Ruth, Rebecca, and Naomi (YouTube Live) Hosted by Mary Byler (Abe Troyer and Old Order Amish); Produced by The Misfit Amish 2024 Connect with JC on TikTok: https://www.tiktok.com/@jc_8287?_t=8jpv1gr8jew\u0026_r=1 Sins of the Amish | Official Trailer | Peacock Original Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-03-03T18:00:00Z",
      "duration": "00:34:14.4510000",
      "explicit": false,
      "spotifyId": "5C9Ak9imASG8PX7p0xhOKy",
      "appleId": 1000647843434,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5C9Ak9imASG8PX7p0xhOKy",
        "apple": "https://podcasts.apple.com/podcast/21-the-fantasy-and-fallout-of-amish-themed-romance-novels/id1685673620?i=1000647843434"
      }
    },
    {
      "id": "6cddde7d-a3c5-4f48-9acf-3ba0abd2bb89",
      "title": "20. Daycare Dilemma: Gut vs. Guilt",
      "description": "Send us a Text Message. What if putting my child in daycare is going to mess them up forever? Am I sacrificing their wellbeing for my personal ambition? These are the kinds of questions many mothers face as they consider college and/or joining the workforce. We respond to a listener question about navigating the guilt that is often heaped upon mothers who break the family tradition of being a stay-at-home mom. We reflect on our own experiences with childcare while acknowledging the irony of hesitating to ask for childcare when we\u0027ve been providers ourselves. We unpack some of the challenges that come with making the best choices for our children while pointing out how broader gender norms and social policies shape the limited options available to American parents. (Warning: It gets a little punchy!) In the long run, arbitrary rules and cultural prejudices won\u0027t keep children safe; children thrive when they have curious, connected, and fulfilled parents. Links (we should have) mentioned in the show: Child care and the damage myth - The Conversation What Do We Know About the Effects of Early Child Care? (pdf) 5 Lies I Believed About Childcare - Motherly Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-02-25T17:00:00Z",
      "duration": "00:35:38.2790000",
      "explicit": false,
      "spotifyId": "3JpThstixVgksB3i1rgm3J",
      "appleId": 1000646785410,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3JpThstixVgksB3i1rgm3J",
        "apple": "https://podcasts.apple.com/podcast/20-daycare-dilemma-gut-vs-guilt/id1685673620?i=1000646785410"
      }
    },
    {
      "id": "548275f5-d623-4fd1-9639-2bcf081f91ce",
      "title": "19. When Best-Laid Plans Fail",
      "description": "Send us a Text Message. Ever been sucker-punched by the realization that you\u0027ve dropped the ball on something super important? If so, come sit with us! In this episode we unpack big feelings about a recent slip-up in the balancing act of work, family, and school. We can\u0027t tell you how to prevent the curveballs, but we can assure you that you\u0027re not alone and that it\u0027s all part of being human. In fact, asking for grace and leaning on each other is not only natural—it\u0027s essential for our collective well-being. What shall we talk about next? Click this link to Vote for Upcoming Topics . Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-02-12T19:00:00Z",
      "duration": "00:41:12.0450000",
      "explicit": false,
      "spotifyId": "0EhWOshO9jW479qXwdL5W8",
      "appleId": 1000645100394,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0EhWOshO9jW479qXwdL5W8",
        "apple": "https://podcasts.apple.com/podcast/19-when-best-laid-plans-fail/id1685673620?i=1000645100394"
      }
    },
    {
      "id": "b562cebf-a9da-4e8e-b599-a31184cffedc",
      "title": "18. Cousin Weekend In Review: Processing the Past to Understand the Present",
      "description": "Send us a Text Message. Listen in as Rebecca and Naomi rehash a weekend last fall with a few far-flung cousins where the coffee and conversation flowed freely. Items mentioned in the show: Help plan future episodes! Click this link to Vote for Upcoming Topics Behalt: Amish \u0026 Mennonite Heritage Center Naomi’s Book Haul: The Narrow Way of Self-Denial: An Amish Man’s Counsel for His Children by D.J. Stutzman (1917; reprinted by Sweetwater Publications, 2006) History of our Parochial Schools and Newspaper Clippings of Prosecution Times compiled by Henry and MaryAnn Raber (2021) Ich Kann PA Deitsch Shreiva by Tomas Beachy (Carlisle Press, 2011) Speaking Amish: A Beginner’s Introduction to Pennsylvania German by Lillian Stoltzfus (Eckshank Publishing, 2013) The Amazing Story of the Ausbund: The Oldest Hymnal in the World Known to Still be in Continuous Use by Benuel S. Blank (Blank Family Books, 2021) Grounded upon God’s Word: The Life and Labors of Jakob Ammann by Andrew V. Ste. Marie and Mike Atnip (Cross Bearers, 2020) Report for Duty by Lily A. Bear (Christian Light Publications, 2016) Pacifists in Chains: The Persecution of Hutterites During the Great War by Duane C.S. Stoltzfus (Young Center, 2013) Rebecca’s Book Haul Hope’s Table by Hope Helmuth (Herald Press, 2019) Jacob’s Choice by Ervin R. Stutzman (Herald Press, 2014) Tom Lyons: The Indains among the Amish by Wayne R. Miller (Ohio Amish Library, 2017) The Amish in Switzerland and other European Countries by Betty Miller Memorial History of Peter Bitsche: Complete Family Register 1767-1892 (Trollope Press, 2008) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-02-05T17:00:00Z",
      "duration": "01:07:07.9510000",
      "explicit": false,
      "spotifyId": "6gyc37UaBnxfOqYGjQeMCO",
      "appleId": 1000644251676,
      "subjects": [
        "Amish",
        "Mennonite",
        "Hutterites"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6gyc37UaBnxfOqYGjQeMCO",
        "apple": "https://podcasts.apple.com/podcast/18-cousin-weekend-in-review-processing-the-past-to/id1685673620?i=1000644251676"
      }
    },
    {
      "id": "9112f20c-c261-4e88-a069-e232655049f3",
      "title": "17. The Scandal of Women Protesting Patriarchal Click-Bait",
      "description": "Send us a Text Message. The Scandal of Women Protesting Patriarchal Click-Bait After their unplanned absence, Naomi and Rebecca are back to discuss changes to the podcast, catch up on life, and break down some recent distress expressed online at women taking issue with offensive theology. Help plan future episodes! Click this link to Vote for Upcoming Topics . Articles mentioned in the episode: Josh Butler Resigns as Pastor Following TGC Article Backlash (Christianity Today) Stop Telling Women They’re Crazy (Refinery29) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2024-01-28T21:00:00Z",
      "duration": "00:46:29.9030000",
      "explicit": false,
      "spotifyId": "1MxSyuRop6b6Fx023YQOEn",
      "appleId": 1000643295889,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MxSyuRop6b6Fx023YQOEn",
        "apple": "https://podcasts.apple.com/podcast/17-the-scandal-of-women-protesting-patriarchal-click-bait/id1685673620?i=1000643295889"
      }
    },
    {
      "id": "6ba51cea-5d5b-4668-8d1a-36b6b8a4f370",
      "title": "16. College 101: From Coverings to Camis and Crocs",
      "description": "Send us a Text Message. In this episode, Rebecca and Naomi discuss the fraught issue of fashion and personal style after growing up in plain culture where your clothes not only broadcast your church identity and social status but also are interpreted as indicators of your spiritual health and family cohesiveness. Rebecca and Naomi don\u0027t tell you what to wear, but they do suggest some ways to reframe familiar narratives about modesty and guilt that have helped them feel less judgmental and more accepting of themselves and others. Show Notes Brené Brown on Fitting in vs. Belonging: https://www.instagram.com/reel/CvVPGG7JYVH/?igshid=MWZjMTM2ODFkZg== Sheila Wray Gregoire’s discussion on what modesty means in the Bible: https://baremarriage.com/2019/03/new-look-at-christian-modesty-guidelines/ Sheila Wray Gregoire’s guide for talking to a woman about what she’s wearing: https://baremarriage.com/2023/05/should-you-talk-woman-about-what-shes-wearing-dress-codes-modesty/ Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-09-26T12:00:00Z",
      "duration": "00:54:47.4310000",
      "explicit": false,
      "spotifyId": "2mAHsQI2BPwfKg0wKAEeuF",
      "appleId": 1000629197651,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2mAHsQI2BPwfKg0wKAEeuF",
        "apple": "https://podcasts.apple.com/podcast/16-college-101-from-coverings-to-camis-and-crocs/id1685673620?i=1000629197651"
      }
    },
    {
      "id": "43b7a597-124f-4fdc-ae25-61fa0bb08358",
      "title": "15. Juggling it All: Is it Even Possible?",
      "description": "Send us a Text Message. If you\u0027re wondering how you\u0027re ever going to manage all the caregiving, paid work, and school on your plate this fall, you\u0027re in the right place! In this episode Naomi and Rebecca discuss their own sense of overwhelm at all the things coming at them in the new school year and share survival tips they\u0027ve learned over the years. Come for the solidarity and stay for a vision of a brighter tomorrow. Resources mentioned in this episode: \u0022Other countries have social safety nets. The U.S. has women \u0022 by Anne Helen Petersen Fair Play: A Game-Changing Solution for When You Have Too Much to Do (and More Life to Live) by Eve Rodsky Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-08-28T07:00:00Z",
      "duration": "00:46:54.4580000",
      "explicit": false,
      "spotifyId": "6yupTOhLnzBEmAsynPhuB1",
      "appleId": 1000625905291,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6yupTOhLnzBEmAsynPhuB1",
        "apple": "https://podcasts.apple.com/podcast/15-juggling-it-all-is-it-even-possible/id1685673620?i=1000625905291"
      }
    },
    {
      "id": "24ccb646-97f4-4809-bc80-4f6417e469c8",
      "title": "14. Contradictions and Consequences of Amish Schooling (Part 2)",
      "description": "Send us a Text Message. It may seem that Wisconsin vs. Yoder was a major win for the Amish since today 85-90% of Amish young people continue in the tradition and the Old Order population doubles nearly every twenty years. However, in this episode, Naomi and Rebecca take a closer look at the realities of Amish life more than half a century out from that landmark Supreme Court decision. They find that banning formal high school education not only sabotages the lives of young people who leave (as was intended), but it also shortchanges the lives of those who stay. Show Notes Full Transcript of the 1971 Wisconsin v. Yoder Supreme Court Hearing (The Amish Heritage Foundation) Wisconsin v. Yoder (Audio version of oral testimony) Full text of William O. Douglas’ dissenting opinion: https://en.wikisource.org/wiki/Wisconsin_v._Yoder/Dissent_Douglas \u0022Yoder\u0022 Revisited: Why the Landmark Amish Schooling Case Could—And Should—Be Overturned (Gage Raley in the Virginia Law Review). \u0022Heritage versus History in Amish Tourism\u0022 (Susan Bieseker) Plain Truth (Jodi Picoult) Candid Amish elders quoted by Tom Shachtman in Rumspringa: To Be or Not to Be Amish (p. 261) Do Amish One-Room Schools Make the Grade? The Dubious Data of \u0022Wisconsin v Yoder” (William Fischel) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-08-21T08:00:00Z",
      "duration": "00:46:07.1770000",
      "explicit": false,
      "spotifyId": "4w1kgQDGrMnBIAGSze9TSz",
      "appleId": 1000625104893,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4w1kgQDGrMnBIAGSze9TSz",
        "apple": "https://podcasts.apple.com/podcast/14-contradictions-and-consequences-of-amish/id1685673620?i=1000625104893"
      }
    },
    {
      "id": "714e03f7-96c8-470d-8792-370e13280edd",
      "title": "13. Contradictions and Consequences of Amish Schooling (Part 1)",
      "description": "Send us a Text Message. The reality that Amish teens are prevented from attending high school has been supported by broader American society for more than fifty years–and is often even romanticized as a cultural norm to celebrate. Yet how is this situation possible at a time when education is so crucial to becoming an employable adult? In this episode, Naomi and Rebecca discuss the internal contradictions and inconsistent logic of Wisconsin vs. Yoder, the 1972 Supreme Court decision that exempted youth in Amish (as well as in Amish Mennonite, Old Order Mennonite, and conservative Mennonite) communities from formal schooling beyond eighth grade. Link to Show Transcript Show Notes Full Transcript of the 1971 Wisconsin v. Yoder Supreme Court Hearing (The Amish Heritage Foundation) Wisconsin v. Yoder (Audio version of oral testimony) Full text of William O. Douglas’ dissenting opinion: https://en.wikisource.org/wiki/Wisconsin_v._Yoder/Dissent_Douglas \u0022Yoder\u0022 Revisited: Why the Landmark Amish Schooling Case Could—And Should—Be Overturned (Gage Raley in the Virginia Law Review). \u0022Framing Affirmative Action\u0022 by Kimberlé Crenshaw Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-08-14T05:00:00Z",
      "duration": "00:41:25.8900000",
      "explicit": false,
      "spotifyId": "3FU3on8mvReSu510dPJetS",
      "appleId": 1000624351982,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3FU3on8mvReSu510dPJetS",
        "apple": "https://podcasts.apple.com/podcast/13-contradictions-and-consequences-of-amish/id1685673620?i=1000624351982"
      }
    },
    {
      "id": "52ec7a33-fb8b-4898-a121-b4ad460119f4",
      "title": "12. College 101: Writing a Winning Application Essay",
      "description": "Send us a Text Message. Whether we\u0027re exploring new educational or professional opportunities, writing about ourselves and our accomplishments can blast open doors--or slam them shut. So when we\u0027re feeling inexperienced and uncertain, how do we get started on these high-stakes writing projects? In this episode, Naomi (a writing professor) and Rebecca (a scholarship wizard) discuss strategies to help even the most anxious applicant write with confidence. Show Notes Application Essay Brainstorming Worksheet Advice from Undergraduate Admissions Officers (Purdue OWL) Essays (UNC-Chapel Hill Writing Center) 12 Strategies to Writing the Perfect College Essay (Harvard Summer School) Essays That Worked (Johns Hopkins University Admissions) Audio editing: BethAnnie Hartman Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-08-07T19:00:00Z",
      "duration": "00:28:50.8730000",
      "explicit": false,
      "spotifyId": "4sNoIy2HrwTMPEKw6lOC1a",
      "appleId": 1000623723573,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4sNoIy2HrwTMPEKw6lOC1a",
        "apple": "https://podcasts.apple.com/podcast/12-college-101-writing-a-winning-application-essay/id1685673620?i=1000623723573"
      }
    },
    {
      "id": "21f5d03f-85e8-48a1-a5de-a73802f745f0",
      "title": "11. Reparenting for Cycle-Breakers",
      "description": "Send us a Text Message. Once we\u0027ve left behind our bubble of origin, how do we heal the emotional wounds that may still remain? How do we replace the looping mental tapes that still haunt us years later? In this episode, Naomi and Rebecca reflect on the practice of reparenting as a way adults can offer our younger selves the understanding and compassion we may have longed for but never received. Ultimately, reparenting is a practice for anyone raised by imperfect adults–which is why Naomi and Rebecca are already teaching it to their own children. Resources referenced (or should have been): Reparenting Our Inner Child (YouTube) Healing Inner Child Wounds: The Essential Guide to Reparenting (A helpful bog post with journaling prompts.) Ep. 88 How to Reparent Yourself and Ep. 89 How to Reparent Part 2 (Guidance from a therapist on SelfHealers Soundboard Podcast) Stop Trying to be Perfect and Start Being OK: Why being the OK-est version of you is the antidote to OCD (A Psychology Today article describing the symptoms of moral scrupulosity and its debilitating effects.) Audio Editing: BethAnnie Hartman Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-07-29T00:00:00Z",
      "duration": "00:36:56.0450000",
      "explicit": false,
      "spotifyId": "3FQ3vDfJ1dANuvnuMG0vah",
      "appleId": 1000622713285,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3FQ3vDfJ1dANuvnuMG0vah",
        "apple": "https://podcasts.apple.com/podcast/11-reparenting-for-cycle-breakers/id1685673620?i=1000622713285"
      }
    },
    {
      "id": "6e8d4fbd-7142-4f5f-b399-c4a9cf1c8ac5",
      "title": "10. Breaking the Cycle of Parental Fragility",
      "description": "Send us a Text Message. Breaking away from family\u0027s long-held patterns and expectations can trigger a minefield of difficult emotions and ruptured relationships. In this episode, Naomi and Rebecca remember moments from their own cycle-breaking journeys and reflect on the words that helped bring compassion and nuanced meaning to these challenging experiences. Show Notes What is a Cycle Breaker? (Psychology Today article) Scattered Minds: The Origins and Healing of Attention Deficit Disorder (Gabor Mate\u0027s book where he explains the crucial role of attunement for infants\u0027 brain development.) Audio Editing: BethAnnie Hartman Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-07-20T22:00:00Z",
      "duration": "00:36:07.7970000",
      "explicit": false,
      "spotifyId": "7KYaCVHPFhp2zLEiF5BrXz",
      "appleId": 1000621836045,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KYaCVHPFhp2zLEiF5BrXz",
        "apple": "https://podcasts.apple.com/podcast/10-breaking-the-cycle-of-parental-fragility/id1685673620?i=1000621836045"
      }
    },
    {
      "id": "d8837800-683d-4343-af85-30f29139509e",
      "title": "9. Uncovered: Deconstructing the Dogma of Shiny Happy People",
      "description": "Send us a Text Message. Rebecca and Naomi have more to say about the docuseries, Shiny Happy People. In this episode they analyze some of the central ideology of patriarchal, fundamentalist teachings such as those promoted by IBLP, the Duggars, and others. They share their own stories as well as evidence-based research that illustrates the damaging effects these beliefs and practices have on individuals and communities. Links Recovering Grace 58% of women murdered in 2017 were murdered by an intimate partner or family member ( The Conversation ) WHO fact sheet on violence against women Domestic Violence by State 2023 National Domestic Violence Hotline: 800-799-7233 Historic Anabaptist Teachings (Messiah College) 1984 by George Orwell The Handmaid’s Tale by Margaret Atwood Tia Levings : “Christian Fundamentalists want to run the country the way they run their homes.” Sample IBLP Materials: IBLP Childbirth Guidelines (page 1) and (page 2) Recommended Podcasts Holy Ghosting (\u002219 Cults and Counting\u0022) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-06-27T06:00:00Z",
      "duration": "00:55:54.2530000",
      "explicit": false,
      "spotifyId": "14wKTf2i57Qnm1urFpcx3o",
      "appleId": 1000618451598,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/14wKTf2i57Qnm1urFpcx3o",
        "apple": "https://podcasts.apple.com/podcast/9-uncovered-deconstructing-the-dogma-of-shiny-happy-people/id1685673620?i=1000618451598"
      }
    },
    {
      "id": "b863b27a-fb76-4f0a-bb4d-b7eb5b87da32",
      "title": "8. Uncovered: Valid Reasons to Delay College",
      "description": "Send us a Text Message. To balance out our last episode, in this one we discuss specific situations where it might be better to delay college for a while so that you have a better chance of success when you do get there. We also offer suggestions for alternatives to consider in the meanwhile. Audio editing by BethAnnie Hartman Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-06-20T23:00:00Z",
      "duration": "00:15:38.3440000",
      "explicit": false,
      "spotifyId": "2GSS18IMCBKYUos2RcWTn9",
      "appleId": 1000617781822,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2GSS18IMCBKYUos2RcWTn9",
        "apple": "https://podcasts.apple.com/podcast/8-uncovered-valid-reasons-to-delay-college/id1685673620?i=1000617781822"
      }
    },
    {
      "id": "3777adbe-4396-4db0-adb4-945e2c5dbc00",
      "title": "7. Uncovered: Misguided Reasons to Delay College",
      "description": "Send us a Text Message. If your social environment hasn\u0027t set you up for college, you\u0027ve probably heard a million reasons why it\u0027s not a good idea for you--at least for right now. In this episode we break down these scripts to show how they worked as diversionary tactics and how they contrast with what we have found to be true. Audio editing: BethAnnie Hartman Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-06-12T14:00:00Z",
      "duration": "00:26:56.6130000",
      "explicit": false,
      "spotifyId": "70govnzTg5SB1NCZd0Tua2",
      "appleId": 1000616663134,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/70govnzTg5SB1NCZd0Tua2",
        "apple": "https://podcasts.apple.com/podcast/7-uncovered-misguided-reasons-to-delay-college/id1685673620?i=1000616663134"
      }
    },
    {
      "id": "8757d12f-5657-4231-b5dc-4ae67292eaad",
      "title": "6. Uncovered: Shiny Happy People and their Secrets",
      "description": "Send us a Text Message. Rebecca and Naomi react to the docuseries Shiny Happy People: Duggar Family Secrets that dropped on Amazon Prime this week. They discuss their own past involvement with IBLP and how that informs their interpretation of the docuseries and Duggar family dynamics. Links and resources mentioned in this episode: Shiny Happy People: Duggar Family Secrets - Official Trailer | Prime Video TLC\u0027s Michelle Duggar fights ordinance protecting transgender rights - Los Angeles Times Shiny Happy People: The Unofficial Podcast Leaving Eden Podcast (IG Live) What’s on your mind? Like and comment on our Facebook page at Uncovered: Life Beyond by midnight on Saturday, June 10. One lucky name will be randomly drawn to receive a free copy of Jill Duggar’s book when it comes out next year. For an extra entry, share the page with your FB friends. See you there! Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-06-05T03:00:00Z",
      "duration": "00:31:15.8260000",
      "explicit": false,
      "spotifyId": "4Yc9PbEHjngjPYHVRu7GB3",
      "appleId": 1000615658342,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Yc9PbEHjngjPYHVRu7GB3",
        "apple": "https://podcasts.apple.com/podcast/6-uncovered-shiny-happy-people-and-their-secrets/id1685673620?i=1000615658342"
      }
    },
    {
      "id": "7a92bd6b-275e-498f-9fcb-e779c6d5ace5",
      "title": "5. Uncovered: Dealing with Creepy Dudes",
      "description": "Send us a Text Message. Naomi and Rebecca take a break from regular programming to talk through an incident Naomi witnessed recently and to discuss different options for dealing with a creepy dude who is trying to take advantage of another person\u0027s perceived vulnerability. Mentioned on the show: Bell Bajao\u0027s video, Got Milk? (content warning for disturbing audio) Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-05-10T22:00:00Z",
      "duration": "00:19:23.6240000",
      "explicit": false,
      "spotifyId": "0Hk4FkHhXHTFjnxYh8rteY",
      "appleId": 1000612556249,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Hk4FkHhXHTFjnxYh8rteY",
        "apple": "https://podcasts.apple.com/podcast/5-uncovered-dealing-with-creepy-dudes/id1685673620?i=1000612556249"
      }
    },
    {
      "id": "6b3e5de0-19e2-4643-91b3-95c50c20e4c1",
      "title": "4. Uncovered: How to Get Started",
      "description": "Send us a Text Message. If you weren\u0027t expected to ever go to college, it can be tough to figure out how to begin the process. In this episode, we talk about how to get the qualifications you need (even when you don\u0027t have a high school diploma) and where you can find the help and information to get started. Mentioned in the show: https://studentaid.gov/h/apply-for-aid/fafsa Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-05-01T13:00:00Z",
      "duration": "00:18:14.8440000",
      "explicit": false,
      "spotifyId": "0NS0KuvybqH0Xd1Zog3SYV",
      "appleId": 1000611313573,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NS0KuvybqH0Xd1Zog3SYV",
        "apple": "https://podcasts.apple.com/podcast/4-uncovered-how-to-get-started/id1685673620?i=1000611313573"
      }
    },
    {
      "id": "81bc4515-88b3-4793-8c59-2416429d4b15",
      "title": "3. Uncovered: What to Do When College Feels out of Reach",
      "description": "Send us a Text Message. Do you feel stuck and out of options? Maybe you can imagine a different life but don\u0027t see a path to getting there? Rebecca and Naomi have been there too, and are here to share the insights and practical tips they\u0027ve learned in the process of getting themselves unstuck. Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-05-01T12:00:00Z",
      "duration": "00:16:20.8450000",
      "explicit": false,
      "spotifyId": "19hRAFkmkumrw7NHBGTs6d",
      "appleId": 1000611313370,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/19hRAFkmkumrw7NHBGTs6d",
        "apple": "https://podcasts.apple.com/podcast/3-uncovered-what-to-do-when-college-feels-out-of-reach/id1685673620?i=1000611313370"
      }
    },
    {
      "id": "8928632d-df6f-4eba-86ef-12ba4f95b6e1",
      "title": "2. Uncovered: Naomi\u0027s Story",
      "description": "Send us a Text Message. It\u0027s Naomi\u0027s turn in the hotseat where she shares about her path through church school, home school, college, and graduate school on her way to becoming an English professor. Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-05-01T12:00:00Z",
      "duration": "00:25:31.0620000",
      "explicit": false,
      "spotifyId": "7BUPjvCgzk1TNNI1MHfADb",
      "appleId": 1000611313572,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7BUPjvCgzk1TNNI1MHfADb",
        "apple": "https://podcasts.apple.com/podcast/2-uncovered-naomis-story/id1685673620?i=1000611313572"
      }
    },
    {
      "id": "ac855fba-982c-46c3-98a4-a83c0c39ff07",
      "title": "1. Uncovered: Rebecca\u0027s Story",
      "description": "Send us a Text Message. Meet your hosts and learn about Rebecca\u0027s experiences in school and the barriers she overcame on her path to college in midlife. Thanks for listening! Connect with us via Facebook: Uncovered: Life Beyond Instagram: @uncoveredlifebeyond Email: uncoveredlifebeyond@gmail.com Website: https://www.buzzsprout.com/2171591 Subscribe (for free) to Uncovered: Life Beyond on Apple Podcasts, Spotify, Google Podcasts, Amazon Music, or wherever you get your podcasts so you\u0027ll never miss an episode! What topics at the intersection of education, high-demand religion, career, parenting, and emotional intelligence are of interest to you? Help us plan future episodes by taking this quick listener survey. We appreciate your input very much!",
      "release": "2023-05-01T11:00:00Z",
      "duration": "00:21:11.6400000",
      "explicit": false,
      "spotifyId": "2RJQ7ymOVcxA0SDxYme3xT",
      "appleId": 1000611313697,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2RJQ7ymOVcxA0SDxYme3xT",
        "apple": "https://podcasts.apple.com/podcast/1-uncovered-rebeccas-story/id1685673620?i=1000611313697"
      }
    }
  ]
}