{
  "id": "0f251add-a085-4106-9ae7-0abe5499e3e1",
  "name": "Uncomfortable Conversations on Predators in Business, Community and Culture",
  "spotifyId": "2bmm2GVBr4cLG2ygCwPxpy",
  "appleId": 1667188788,
  "episodes": [
    {
      "id": "03208fa7-2c22-458e-9b03-ae959369e2d1",
      "title": "Predatory Tactics in Business Coaching \u0026 Mentorship - Part 2",
      "description": "Kalika Kanitkar is a small business owner, and cognitive scientist with a passion for mental health education. She was involved in the travel network marketing space for 7 years, and got out about a year ago. Since then she’s begun to share her experience to raise awareness around business opportunity scams, and the predatory tactics used in sales, coaching, and recruitment. You can follow her @kalikakanitkar on all social media channels, although she’s most active on Instagram and YouTube. :) Song credit: Whatever It Takes - Imagine Dragons Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please Contribute to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. To be a guest on the podcast, please send an email to GN@GuruNischan.com. Listen to the Playlist: Uncomfortable Conversations on Predators in Business Community and Culture GuruNischan is a trauma-healing activist, and consultant in personal and professional reinvention. To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com and follow her media platform Conversations You Can Feel - https://gurunischan.substack.com/ Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. Join my Inner Orbit Monthly and stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-09-11T23:37:22Z",
      "duration": "02:39:35.3280000",
      "explicit": false,
      "spotifyId": "5wOM6aAYnM5fiKm4GxdgnD",
      "appleId": 1000627539004,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wOM6aAYnM5fiKm4GxdgnD",
        "apple": "https://podcasts.apple.com/podcast/predatory-tactics-in-business-coaching-mentorship-part-2/id1667188788?i=1000627539004"
      }
    },
    {
      "id": "73005844-430e-467d-b334-6782b853bc10",
      "title": "Predatory Tactics in Business Coaching \u0026 Mentorship - Part 1",
      "description": "Kalika Kanitkar is a small business owner, and cognitive scientist with a passion for mental health education. She was involved in the travel network marketing space for 7 years, and got out about a year ago. Since then she’s begun to share her experience to raise awareness around business opportunity scams, and the predatory tactics used in sales, coaching, and recruitment. You can follow her @kalikakanitkar on all social media channels, although she’s most active on Instagram and YouTube. :) Song credit: Whatever It Takes - Imagine Dragons Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please Contribute to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. To be a guest on the podcast, please send an email to GN@GuruNischan.com. Listen to the Playlist: Uncomfortable Conversations on Predators in Business Community and Culture GuruNischan is a trauma-healing activist, and consultant in personal and professional reinvention. To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com and follow her media platform Conversations You Can Feel - https://gurunischan.substack.com/ Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. Join my Inner Orbit Monthly and stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-09-04T17:01:32Z",
      "duration": "02:06:54.2880000",
      "explicit": false,
      "spotifyId": "5BChPJGFDGAKPTa1GmDWJu",
      "appleId": 1000626726694,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5BChPJGFDGAKPTa1GmDWJu",
        "apple": "https://podcasts.apple.com/podcast/predatory-tactics-in-business-coaching-mentorship-part-1/id1667188788?i=1000626726694"
      }
    },
    {
      "id": "a828cf74-c95d-44bd-8264-302d1c12b616",
      "title": "The Melody of Early Childhood Illuminates the Predatory Patterns Inside of Us",
      "description": "Our conversation today is with Anna Sumara, CPCC, PCC, M.Sc. She’s a leadership and wholeness coach, passionately bringing a holistic, body-oriented approach to support people in their transformative journey, to connect deeper with self and the world and to thrive in any area of their lives. She integrates unique methods--leadership, neuroscience of change, mindfulness, and embodiment--or in short, intelligence of the mind with wisdom of the heart. Her presence encourages safety and openness in individuals to deepen their courageous personal discovery process and actualize their hidden potential. She believes that in order to transform organizations and our world, we need to start from a personal transformation. Anna holds an M.Sc. in Business Management and has more than 15 years of international business experience. She studied human science and cultural diversity and is Certified Professional Co-Active Coach (CPCCTM), accredited by International Coach Federation. Anna works as an individual coach with inspiring and visionary leaders, facilitator, trainer and as well as a faculty member at Co-Active Training Institute where she leads the core curriculum of Co-Active coaching for new coaches and leaders. Prior to that she held various roles in companies from a financial industry, including consulting, asset management, and corporate. Her further qualifications include, among other things, Co-Active Leadership Program, Leadership Circle ProfileTM Certification, Leadership Circle Leadership Embodied Transformation by Strozzi Institute, The Neuroscience of Change and The Power of Embodied Transformation by Coaches Rising, Leading From the Emerging Future by u.Lab and MITx, The Radical Wholeness by Philip Shepherd, Search Inside Yourself, Mindfulness and Emotional Intelligence Leadership Training by Google, Social Presencing Theater by The Presencing Institute, Vinyasa Yoga Teaching Training 250h, Meditation and Ayurveda 100h, Pranayama Intensive. Anna is fluent and works in English, German and Polish. Connect with her at http://www.AniaSumara.com Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCPredators Listen to the Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist : Join my Inner Orbit Monthly and stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-07-09T16:50:03Z",
      "duration": "01:32:57.1680000",
      "explicit": false,
      "spotifyId": "1svj9rzaDpagFMtZDaxZTC",
      "appleId": 1000620389102,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1svj9rzaDpagFMtZDaxZTC",
        "apple": "https://podcasts.apple.com/podcast/the-melody-of-early-childhood-illuminates/id1667188788?i=1000620389102"
      }
    },
    {
      "id": "0474b16a-9d44-450b-a6e7-f66eae19c6bb",
      "title": "How We See Ourselves Currently is Relative to Our Past Experiences - Getting Out of Your Box w/ Dee Phillips",
      "description": "My guest today is Dee Phillips. He’s a philosopher, creator, and deep thinker. I encourage you to listen all the way through this episode to the end. We get to the gems and he brings it all the way home for us. Support the work and share it with a friend. Music credit: Endless, The Hang Drum Project Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. To be a guest on the podcast, please send an email to GN@GuruNischan.com. Uncomfortable Conversations on Predators in Business Community and Culture Music Playlist : Everyday Whiteness Series playlist Join my Inner Orbit Monthly and staying connected at htpp://www.GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-06-19T19:17:16Z",
      "duration": "01:20:53.6880000",
      "explicit": false,
      "spotifyId": "3NB1TWTCidUytPtptbE9Wo",
      "appleId": 1000617611937,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3NB1TWTCidUytPtptbE9Wo",
        "apple": "https://podcasts.apple.com/podcast/how-we-see-ourselves-currently-is-relative-to-our-past/id1667188788?i=1000617611937"
      }
    },
    {
      "id": "bc7d2987-ea12-40dc-ba2c-a02a2bd30bc1",
      "title": "How Do We Resolve and Evolve Ourselves into a Different Way of Being Without Violence?",
      "description": "Yvonne M. Orr has been in the development, communications, and organizational management industry for nearly 30 years, and has an extensive working knowledge of religious, philanthropic, and cultural art communities. Yvonne is also an actor, dancer, choreographer, and spoken word artist who has been in the performing arts for over 25 years. She is the author of “Malaika\u0027s Soul: I Am Light, Vol. I and “Malaika’s Soul: I Am Healing, Vol. II (titles under the five-part poetry books from The Soul-journer Series. She has taught youth classes and set choreography for various theater and professional dance companies. As if there wasn’t enough for Yvonne to do, she serves as the Executive Director of the Indigenous Community Service Center as well; which focuses on social justice reform initiatives, recovery and cancer awareness, youth development programs, and wellness initiatives. You can connect more with her on all social media platforms at @YorrLife100% of proceeds of book sales goes to the non-profit Indigenous Community Service Center http://indigenouscommunityctr.org/ Purchase books at: https://www.amazon.com/Malaikas-Soul-Am-Light-Soul-journer/dp/1688993967 https://www.amazon.com/Malaikas-Soul-Am-Healing-Soul-journer-ebook/dp/B08TVLTCYD Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. To be a guest on the podcast, please send an email to GN@GuruNischan.com. Uncomfortable Conversations on Predators in Business Community and Culture Music Playlist : Everyday Whiteness Series podcast playlist Get exclusive access to my Inner Orbit Monthly by staying connected \u0026 subscribing to GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-06-11T21:00:31Z",
      "duration": "03:21:05.0150000",
      "explicit": false,
      "spotifyId": "1WX2wRS8cb7SRAreEs0M0O",
      "appleId": 1000616553033,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1WX2wRS8cb7SRAreEs0M0O",
        "apple": "https://podcasts.apple.com/podcast/how-do-we-resolve-and-evolve-ourselves-into-a/id1667188788?i=1000616553033"
      }
    },
    {
      "id": "d3b134db-e126-402f-a171-e873c1f1e1c3",
      "title": "Psychological Manipulation of Leaders \u0026 Leadership Training in the Multi-Level Marketing Industry",
      "description": "Jennifer Rajala spent 8 years and recruited hundreds of people into Arbonne, a skin care \u0026 wellness company in the Multi-Level Marketing Industry, eventually morphing into an MLM coach and self-development junkie. Starting with learning to recruit others into MLM, all while having a newborn baby, her part time “success” got her moving up the ranks eventually quitting her job as a social worker, to build “her business” full time. In 2019 she was recruited into Rankmakers, a MLM Coaching Program run by Ray Higdon. She quickly became a top coach and a go-to coach within the Rankmaker System investing 3 years with promises of becoming a Top Speaker and Leadership Coach in the industry. Meanwhile, she was hustling to grow RankMakers system without any hourly wage, no benefits, no personal balance. This continued through the pandemic with sales tactics to target “at-home opportunities”. Disgruntled with the process, she was told it was her mindset, so began taking more personal development courses with Tony Robbins, “to become a better coach”. In 2021, after working on herself for so many years, she was burned out and noticed a friend on TikTok who had left and was speaking out against the MLM industry and Coaching business model. She woke up and in May 2022 she confronted Ray in one of the leadership meetings and then left the meeting. Within 24 hours I was ex-communicated. Today she is a fierce voice speaking out as an anti-MLM advocate. She lives in Michigan with her husband Derek and their 3 daughters for the last 10 years. Song: Make Me a Boat - The Family Crest Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please make a one time or monthly contribution to this publication. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. SUBSCRIBE to Conversations You Can Feel Podcasts \u0026 Publishings below. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCP Podcast Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Join my Inner Orbit Monthly at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-05-28T20:28:14Z",
      "duration": "03:04:21.4550000",
      "explicit": false,
      "spotifyId": "02Vdqm5IdGyD6rtwUEqCaz",
      "appleId": 1000614784524,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/02Vdqm5IdGyD6rtwUEqCaz",
        "apple": "https://podcasts.apple.com/podcast/psychological-manipulation-of-leaders-leadership/id1667188788?i=1000614784524"
      }
    },
    {
      "id": "68a6871e-da28-4b82-9b2d-58216be0b9c5",
      "title": "Child Molesters, Please Stop. Seek Therapy Today.",
      "description": "Aleesha Barlow is a survivor of child sexual abuse, at the hands of her maternal grandfather. The abuse started as early as she can remember, and lasted until her teenage years. At age 6, she told her aunt what her grandfather was doing. Her aunt said that it was wrong, and promised the abuse would stop. Her aunt then told Aleesha\u0027s mother and other sister, and together they confronted their father. He admitted to the abuse, and said the devil made him do it. He told them he could not go to jail, as he knows what they do to child abusers. He threatened to kill himself if they told the police. They then told Aleesha to keep the abuse a secret from her father, as her father would harm her grandfather, but promised the abuse would stop. She was still brought around him and unfortunately the abuse continued. It took her 20 years to tell her father, but the moment she told him she had an immediate weight lifted off her shoulders that she wants all survivors to feel, thus starting #tellsomebody! Facebook: Itstimetotellsomebody Instagram: TellSomebodyMovement Website: www.TellSomebodyToday.com Song: Tupac - Keep ya head up Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please DONATE to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCPBCC Follow my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. Subscribe now Spotify Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Join my Inner Orbit Monthly and stay connected at GuruNischan.com www.gurunischan.substack.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-04-23T22:20:32Z",
      "duration": "01:22:06.5040000",
      "explicit": false,
      "spotifyId": "33iNpV5E6DbAwpMfjCuku7",
      "appleId": 1000610312721,
      "urls": {
        "spotify": "https://open.spotify.com/episode/33iNpV5E6DbAwpMfjCuku7",
        "apple": "https://podcasts.apple.com/podcast/child-molesters-please-stop-seek-therapy-today/id1667188788?i=1000610312721"
      }
    },
    {
      "id": "63640b06-184b-47f0-a0c2-39ce3ad1a9d7",
      "title": "Process Your Own Sh*t - Your Niceness is Harmful to Your Own Humanity",
      "description": "Kathy Garland is a storyteller, memoirist, and essayist, who uses personal essays and memoir to de-marginalize women\u0027s experiences with an intent to highlight and humanize specific issues. Her work can be found in varied anthologies, as well as her personal blog kwoted.wordpress.com. Follow her on Instagram and Twitter @kegarland. kegarland.com kwoted.wordpress.com navigatingthechange.com writingendeavors.org Song Credit: Kanye West: Stronger Please DONATE to this reclamation and recovery work by making a one time or monthly contribution HERE . Be sure to also SUBSCRIBE to my Conversations You Can Feel Publishings and stay tuned for my musings on provocative and taboo topics hiding in plain sight. To be a guest on the podcast, please send an email to GN@GuruNischan.com. Uncomfortable Conversations on Predators in Business Community and Culture Spotify Playlist : Whiteness podcast playlist Get exclusive access to my Inner Orbit and can stay connected by subscribing to GuruNischan.com or follow this publication at http://gurunischan.substack.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-04-17T00:42:49Z",
      "duration": "01:23:24.6960000",
      "explicit": false,
      "spotifyId": "7LYHEcZJo8L3mzl2f4r5oN",
      "appleId": 1000609210242,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7LYHEcZJo8L3mzl2f4r5oN",
        "apple": "https://podcasts.apple.com/podcast/process-your-own-sh-t-your-niceness-is-harmful-to-your/id1667188788?i=1000609210242"
      }
    },
    {
      "id": "46120c7c-7525-4d16-add2-648dacf98516",
      "title": "Breaking the Silence Surrounding Childhood Sexual Abuse",
      "description": "Jeremy Indika speaks out on child sexual abuse by using his own story to break down stigmas and help us understand how such a thing can happen. He wants to change the culture on how we talk about child sexual exploitation and abuse, and what we plan to do to prevent it from happening entirely. www.jeremyindika.com Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please donate to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCP Spotify Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. Join my Inner Orbit Monthly and stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-04-10T00:06:11Z",
      "duration": "01:05:02.8080000",
      "explicit": false,
      "spotifyId": "36tsBkCmVFtwMAtxY2AYrp",
      "appleId": 1000608111273,
      "urls": {
        "spotify": "https://open.spotify.com/episode/36tsBkCmVFtwMAtxY2AYrp",
        "apple": "https://podcasts.apple.com/podcast/breaking-the-silence-surrounding-childhood-sexual-abuse/id1667188788?i=1000608111273"
      }
    },
    {
      "id": "4a6745fa-39a0-448a-9c41-92b01877abc9",
      "title": "The Lasting Impact of Family Abuse - I Didn\u0027t Know It was Trauma. It Just Didn\u0027t Feel Right",
      "description": "Jeff Dase has been committed to the students and communities of Illinois since 1998. Mr. Dase became the Assistant Superintendent of Diversity, Equity, and Inclusion March 6, 2023, after serving as the Assistant Superintendent of Teaching and Learning for Decatur Public Schools since July 2019. Previously serving as a teacher, Assistant Principal, Principal, Chief of Schools and High Schools Network Operations Manager for Chicago Public Schools. Jeff Dase is the author of the recently published book Rise Above. The book reveals the story of how he transcended obstacles in every chapter of his life to become a successful man in the city of Chicago and field of education. His book explains how he kept his integrity while navigating the city of Chicago systems and his professional life to become an award winning contributor to the city of Chicago communities. Offering motivational advice in a spiritual and down-to-earth style, his unique book gives the reader heartfelt insight into the life of survival and success as a black male growing up in the city of Chicago. His book provides wisdom, guidance, and insight to help the reader chart their own path to success; Addressing the challenges men in education face and is intended to provide stories and words of encouragement, guidance and inspiration. You can follow him at @JeffDase (Twitter) Song: I Am Here by Beyonce Please DONATE to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. Subscribe at www.gurunischan.substack.com To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCP Listen to the Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Join my Inner Orbit Monthly to stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-03-26T19:11:43Z",
      "duration": "00:55:19.8480000",
      "explicit": false,
      "spotifyId": "0CTcueR4QvIxjb0MLTDiQm",
      "appleId": 1000605972648,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CTcueR4QvIxjb0MLTDiQm",
        "apple": "https://podcasts.apple.com/podcast/the-lasting-impact-of-family-abuse-i-didnt-know-it/id1667188788?i=1000605972648"
      }
    },
    {
      "id": "d5ffb043-ce1a-4777-8d58-6fe73684d0fb",
      "title": "You\u0027re the Prey - Manipulation and Multi Level Marketing",
      "description": "Roberta Blevins is a former “Hun”, who left the MLM world in 2017 and began publicly educating and speaking out against it. In her time in MLM, she was involved as a consultant for 3; It Works!, LuLaRoe and Modere, and a customer of many. Since leaving MLM, she has educated herself on the systemic structure of the business model, the psychological manipulation, the seedy underbelly and governmental ties, the cult indoctrination, and the history of Multi Level Marketing. She educates daily on TikTok, and podcasts in her \u0022free time\u0022, talking to the survivors and victims of these commercial cults, disguised as the quickest route to the American Dream. www.robertablevins.com IG - @therealrobertablevins TT - @bertalikewhoa Podcast - Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please support this reclamation and recovery work by making a one time or monthly contribution to this publication. Subscription only publications coming soon! To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCP - UncomfortableConversationsOnPredators Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. Spotify Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Join my Inner Orbit Monthly and stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-03-12T20:54:05Z",
      "duration": "02:20:52.4150000",
      "explicit": false,
      "spotifyId": "3P9KyyNE4Wd6IyrU610PcY",
      "appleId": 1000603825506,
      "subjects": [
        "Multi-Level Marketing",
        "LuLaRoe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3P9KyyNE4Wd6IyrU610PcY",
        "apple": "https://podcasts.apple.com/podcast/youre-the-prey-manipulation-and-multi-level-marketing/id1667188788?i=1000603825506"
      }
    },
    {
      "id": "978923f6-e477-4f10-a697-8764378098b2",
      "title": "An Everyday Cult - An Absolute, Upside Down Reversal of What is True",
      "description": "Gerette Buglion is author of An Everyday Cult, a memoir which shows how her innocent quest for meaning left her open to manipulation by a controlling teacher. Gerette’s current work is in Cult Recovery and Education. Her signature writing course called, ‘Writing to Reckon’ offers a safe space for cult survivors to tell their stories. She is co-founder of #iGotOut.org whose mission is to encourage people who have experienced cultic abuse to tell their stories. Gerette Buglion #igotout she, her, hers Author, Cult Recovery Educator and Consultant Writing to Reckon: Experience integration. Write for coherence. Schedule an informational chat with Gerette Co-founder, #igotout.org GeretteBuglion.com Books Referenced: Esther Friedman - Soon to be released book is The Gentle Souls Revolution Daniel Kahneman - Thinking Fast and Slow Song: Starry-Eyed Believer by Esther Friedman - a cult survivor and expressive arts therapist The starry-eyed believers Seek any kind face You, the deceiver, Sensed a trace Delicious longing of those so insecure Makes for perfect fish to lure The starry-eyed believers Seek any kind word You, the deceiver Saw and heard The hollow voice and the pleading look Grabbed your fishing pole and slipped the bait on the hook So the siren song begins Sweet and full of lies Such a seductive melody Such a pretty disguise Lost souls float aimlessly Waiting on you to set them free Mouths agape and biting for the bait Custom-made for you to captivate Let the feeding frenzy begin Don that devout disguise You’re ready for the bait and switch You got a lotta’ fish to fry Bottom Feeders, parasites Sharks on the hunt, vultures in flight Even Bernie Madoff’s got nothing on you Get your cauldron out you’ve got some guppies to (stew) Starry-eyed believers (rpt to end) Please DONATE to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCPBCC Spotify Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Join my Inner Orbit Monthly to stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-02-26T15:37:42Z",
      "duration": "01:39:17.5200000",
      "explicit": false,
      "spotifyId": "1gY6HJSK3nbKqxpKBjt3OI",
      "appleId": 1000601643462,
      "subjects": [
        "Center For Transformational Learning",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gY6HJSK3nbKqxpKBjt3OI",
        "apple": "https://podcasts.apple.com/podcast/an-everyday-cult-an-absolute-upside-down-reversal/id1667188788?i=1000601643462"
      }
    },
    {
      "id": "84a2d2ac-e298-4a2c-8245-e18c55bfb978",
      "title": "I Did Not Consider It Abuse Because She Was An Older Woman",
      "description": "Rafer Weigel is the founder of WMG Communications—a content marketing firm. Weigel is a 3 time Emmy Award Winning journalist whose career began in print journalism at the Chicago Sun-Times, the Los Angeles Times. He then became a sports anchor at CNN Headline News and later ABC 7 Chicago before transitioning to news. Weigel was a news anchor at Fox 32 and was the reporter credited with breaking the story that Chicago police were going to charge Jussie Smollett with staging a fake hate crime. He’s covered Presidential Elections, major sporting events like the Olympics and Super Bowls and everything in between. He’s with us today to share about the confusion of unacknowledged sexual abuse as a teenager, and the impact it has had on his adult life in both intimate relationships and his professional career. Please DONATE to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCPBCC Spotify Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Join my Inner Orbit Monthly at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-02-13T07:49:50Z",
      "duration": "00:48:06.0480000",
      "explicit": false,
      "spotifyId": "6YEDKuArh6qfZKyWupe510",
      "appleId": 1000599289092,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YEDKuArh6qfZKyWupe510",
        "apple": "https://podcasts.apple.com/podcast/i-did-not-consider-it-abuse-because-she-was-an-older-woman/id1667188788?i=1000599289092"
      }
    },
    {
      "id": "71fa7338-073b-4758-96d3-5a6369eb5113",
      "title": "Men Are Sexually Abused Too - When Women Prey on Young Boys (it happens a lot)",
      "description": "Allen Vandever is a contemporary Artist and Activist based out of Chicago. He is a father, husband, and a son. Family and friends are very important to him. He live his life with the goal of making every year worthy of a good movie or a great book. He takes risks, embraces adventure and lives life to the fullest. And as a result, he has many wonderful stories. Founder of Childhood Fractured, a non profit dedicated to supporting adult survivors of sexual abuse with art writing and performance. Follow me on @allenvandeverpnos and @C.F.HQ on instagram. Donate and support to his work at www.childhoodfractured.coom Song Credit: Time (you and I) by Khruangbin Please DONATE to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCPBCC Spotify Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist : Get exclusive access and offerings when you subscribe to my Inner Orbit Monthly at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-02-05T18:27:43Z",
      "duration": "01:30:18.7680000",
      "explicit": false,
      "spotifyId": "1LLDqTT4CIp8m80U2a4vpZ",
      "appleId": 1000598073164,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1LLDqTT4CIp8m80U2a4vpZ",
        "apple": "https://podcasts.apple.com/podcast/men-are-sexually-abused-too-when-women-prey-on-young/id1667188788?i=1000598073164"
      }
    },
    {
      "id": "52e374a8-f4f9-4b0b-9235-7293144573bc",
      "title": "The Predators in My Body - Dismantling the False Identity \u0022running\u0022 Me",
      "description": "As a child survivor of a religious yoga cult, and the current host of the Uncomfortable Conversation Podcast: The Untold Stories of the 3HO/Kundalini Yoga Community, Gurunischan shares why she started this new podcast platform and how LISTENING has helped her discover the predators in her body — the false cultural conditioning that led to a firmly rooted identity in appropriation and “Otherness”. Links mentioned in episode: Uncomfortable Conversation Podcast: The Untold Stories of the 3HO/Kundalini Yoga Community Episode: 39: Episode 40: Our Shared 3HO Identity of “Exceptionalism” and “Otherness” Episode 41: White Silence, Exceptionalism, Superiority and the Spiritual White Woman White Women: Everything You Already Know About Racism and How to Do Better by Regina Jackson and Siara Rao Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-01-23T02:08:05Z",
      "duration": "00:51:27.0950000",
      "explicit": false,
      "spotifyId": "3YmztijU5aWexWM9sornt2",
      "appleId": 1000595987709,
      "subjects": [
        "Yoga Cult",
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3YmztijU5aWexWM9sornt2",
        "apple": "https://podcasts.apple.com/podcast/the-predators-in-my-body-dismantling-the-false/id1667188788?i=1000595987709"
      }
    }
  ]
}