{
  "_ts": 0,
  "id": "bc6833f5-e60c-42dc-ac91-dcf796787448",
  "name": "Uncorked with Funny Wine Girl",
  "spotifyId": "10jTSi5E5HZnQoCUlQjMbj",
  "appleId": 1568230837,
  "episodes": [
    {
      "id": "00373d16-b33a-4475-b7d0-764527d0d963",
      "title": "Lisa Talks About Lisa Joins A Cult",
      "description": "Have you ever felt lost? I think we all have at one point or another and many of us might experience a moment or few each day in which we\u0027re not sure about the direction we\u0027re going in. But I imagine it takes a deep feeling of loss to join a group of people you believe offer you the right answers, perhaps purpose and direction. One might call that group a cult. Or not. This week my guest Lisa VanArsdale shares a bit about how she defines a cult and more importantly, she tells us about her upcoming One-Woman Show and podcast called, \u0022Lisa Joins A Cult.\u0022 This Lehigh Valley woman will introduce her audience to numerous cults she has visited in Pennsylvania, across the country and around the world. And she will share some of her profound moments and visuals that will tug at heartstrings but also provide a great deal of humor. Make plans to see Lisa Joins A Cult or listen to her podcast by clicking ⁠here⁠ . If you enjoyed listening to this week\u0027s podcast or have enjoyed episodes of Uncorked with Funny Wine Girl, won\u0027t you show your support through a monetary contribution? Please visit my Buy Me A Coffee Page or reach out to me at Jeannine.Luby@gmail.com to ask how you can join other generous women who are becoming podcast sponsors. You can also show support by sharing this podcast with a friend, a foe, or anyone you know; post a link in your social media, or send to a friend via text or email; and/or write a review or testimonial on Apple Podcasts or Spotify or your social media. I appreciate you from the bottom of my heart and the bottom of my wine glass.",
      "release": "2024-02-22T10:00:00Z",
      "duration": "00:44:13.8550000",
      "explicit": true,
      "spotifyId": "7B5J8gZK7hjlv59v2jq0bo",
      "appleId": 1000646377323,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7B5J8gZK7hjlv59v2jq0bo",
        "apple": "https://podcasts.apple.com/podcast/lisa-talks-about-lisa-joins-a-cult/id1568230837?i=1000646377323"
      }
    }
  ]
}