{
  "_ts": 0,
  "id": "0f251add-a085-4106-9ae7-0abe5499e3e1",
  "name": "Uncomfortable Conversations on Predators in Business, Community and Culture",
  "spotifyId": "2bmm2GVBr4cLG2ygCwPxpy",
  "appleId": 1667188788,
  "episodes": [
    {
      "id": "03208fa7-2c22-458e-9b03-ae959369e2d1",
      "title": "Predatory Tactics in Business Coaching \u0026 Mentorship - Part 2",
      "description": "Kalika Kanitkar is a small business owner, and cognitive scientist with a passion for mental health education. She was involved in the travel network marketing space for 7 years, and got out about a year ago. Since then she’s begun to share her experience to raise awareness around business opportunity scams, and the predatory tactics used in sales, coaching, and recruitment. You can follow her @kalikakanitkar on all social media channels, although she’s most active on Instagram and YouTube. :) Song credit: Whatever It Takes - Imagine Dragons Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please Contribute to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. To be a guest on the podcast, please send an email to GN@GuruNischan.com. Listen to the Playlist: Uncomfortable Conversations on Predators in Business Community and Culture GuruNischan is a trauma-healing activist, and consultant in personal and professional reinvention. To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com and follow her media platform Conversations You Can Feel - https://gurunischan.substack.com/ Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. Join my Inner Orbit Monthly and stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-09-11T00:00:00",
      "duration": "02:39:35.3280000",
      "explicit": false,
      "spotifyId": "5wOM6aAYnM5fiKm4GxdgnD",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wOM6aAYnM5fiKm4GxdgnD"
      }
    },
    {
      "id": "73005844-430e-467d-b334-6782b853bc10",
      "title": "Predatory Tactics in Business Coaching \u0026 Mentorship - Part 1",
      "description": "Kalika Kanitkar is a small business owner, and cognitive scientist with a passion for mental health education. She was involved in the travel network marketing space for 7 years, and got out about a year ago. Since then she’s begun to share her experience to raise awareness around business opportunity scams, and the predatory tactics used in sales, coaching, and recruitment. You can follow her @kalikakanitkar on all social media channels, although she’s most active on Instagram and YouTube. :) Song credit: Whatever It Takes - Imagine Dragons Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please Contribute to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. To be a guest on the podcast, please send an email to GN@GuruNischan.com. Listen to the Playlist: Uncomfortable Conversations on Predators in Business Community and Culture GuruNischan is a trauma-healing activist, and consultant in personal and professional reinvention. To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com and follow her media platform Conversations You Can Feel - https://gurunischan.substack.com/ Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. Join my Inner Orbit Monthly and stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-09-04T00:00:00",
      "duration": "02:06:54.2880000",
      "explicit": false,
      "spotifyId": "5BChPJGFDGAKPTa1GmDWJu",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5BChPJGFDGAKPTa1GmDWJu"
      }
    },
    {
      "id": "d3b134db-e126-402f-a171-e873c1f1e1c3",
      "title": "Psychological Manipulation of Leaders \u0026 Leadership Training in the Multi-Level Marketing Industry",
      "description": "Jennifer Rajala spent 8 years and recruited hundreds of people into Arbonne, a skin care \u0026 wellness company in the Multi-Level Marketing Industry, eventually morphing into an MLM coach and self-development junkie. Starting with learning to recruit others into MLM, all while having a newborn baby, her part time “success” got her moving up the ranks eventually quitting her job as a social worker, to build “her business” full time. In 2019 she was recruited into Rankmakers, a MLM Coaching Program run by Ray Higdon. She quickly became a top coach and a go-to coach within the Rankmaker System investing 3 years with promises of becoming a Top Speaker and Leadership Coach in the industry. Meanwhile, she was hustling to grow RankMakers system without any hourly wage, no benefits, no personal balance. This continued through the pandemic with sales tactics to target “at-home opportunities”. Disgruntled with the process, she was told it was her mindset, so began taking more personal development courses with Tony Robbins, “to become a better coach”. In 2021, after working on herself for so many years, she was burned out and noticed a friend on TikTok who had left and was speaking out against the MLM industry and Coaching business model. She woke up and in May 2022 she confronted Ray in one of the leadership meetings and then left the meeting. Within 24 hours I was ex-communicated. Today she is a fierce voice speaking out as an anti-MLM advocate. She lives in Michigan with her husband Derek and their 3 daughters for the last 10 years. Song: Make Me a Boat - The Family Crest Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please make a one time or monthly contribution to this publication. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. SUBSCRIBE to Conversations You Can Feel Podcasts \u0026 Publishings below. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCP Podcast Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Join my Inner Orbit Monthly at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-05-28T00:00:00",
      "duration": "03:04:21.4550000",
      "explicit": false,
      "spotifyId": "02Vdqm5IdGyD6rtwUEqCaz",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/02Vdqm5IdGyD6rtwUEqCaz"
      }
    },
    {
      "id": "7639dc30-a5ab-46f3-9ab7-edacb53768cd",
      "title": "When Commitment to \u0022Getting Better Daily\u0022 Becomes Coercion \u0026 Extraction of Yourself and Others",
      "description": "Julie Anderson is a survivor of two commercial cults, which she was part of simultaneously for 5 years, one was a Multi-Level Marketing company called Monat and the other was a Multi-Level Marketing Coaching group known as Rank Makers. She began speaking out about her experiences in December 2021 by creating anti-MLM content, mixing it into her established GenX content on TikTok. She quickly branched out to creating content on Instagram, Facebook and YouTube. She is a fierce educator and advocate speaking out on Rank Makers and coercion in the self-development/coaching industry. You can follow her @_julieanderson426. Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings with GuruNischan. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCPBCC Listen Now: Uncomfortable Conversations on Predators in Business Community and Culture Playlist Make a one time or monthly contribution to this publication. Join my Inner Orbit Monthly and stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-05-07T00:00:00",
      "duration": "02:05:21.8880000",
      "explicit": false,
      "spotifyId": "1Lq7LdaLRrHRgDbbqRpoQ9",
      "subjects": [
        "Multi-Level Marketing",
        "Rank Makers",
        "Monat"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Lq7LdaLRrHRgDbbqRpoQ9"
      }
    },
    {
      "id": "d5ffb043-ce1a-4777-8d58-6fe73684d0fb",
      "title": "You\u0027re the Prey - Manipulation and Multi Level Marketing",
      "description": "Roberta Blevins is a former “Hun”, who left the MLM world in 2017 and began publicly educating and speaking out against it. In her time in MLM, she was involved as a consultant for 3; It Works!, LuLaRoe and Modere, and a customer of many. Since leaving MLM, she has educated herself on the systemic structure of the business model, the psychological manipulation, the seedy underbelly and governmental ties, the cult indoctrination, and the history of Multi Level Marketing. She educates daily on TikTok, and podcasts in her \u0022free time\u0022, talking to the survivors and victims of these commercial cults, disguised as the quickest route to the American Dream. www.robertablevins.com IG - @therealrobertablevins TT - @bertalikewhoa Podcast - Thank you for reading Conversations You Can Feel . This post is public so feel free to share it. Please support this reclamation and recovery work by making a one time or monthly contribution to this publication. Subscription only publications coming soon! To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCP - UncomfortableConversationsOnPredators Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. Spotify Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Join my Inner Orbit Monthly and stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-03-12T00:00:00",
      "duration": "02:20:52.4150000",
      "explicit": false,
      "spotifyId": "3P9KyyNE4Wd6IyrU610PcY",
      "subjects": [
        "Multi-Level Marketing",
        "LuLaRoe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3P9KyyNE4Wd6IyrU610PcY"
      }
    },
    {
      "id": "978923f6-e477-4f10-a697-8764378098b2",
      "title": "An Everyday Cult - An Absolute, Upside Down Reversal of What is True",
      "description": "Gerette Buglion is author of An Everyday Cult, a memoir which shows how her innocent quest for meaning left her open to manipulation by a controlling teacher. Gerette’s current work is in Cult Recovery and Education. Her signature writing course called, ‘Writing to Reckon’ offers a safe space for cult survivors to tell their stories. She is co-founder of #iGotOut.org whose mission is to encourage people who have experienced cultic abuse to tell their stories. Gerette Buglion #igotout she, her, hers Author, Cult Recovery Educator and Consultant Writing to Reckon: Experience integration. Write for coherence. Schedule an informational chat with Gerette Co-founder, #igotout.org GeretteBuglion.com Books Referenced: Esther Friedman - Soon to be released book is The Gentle Souls Revolution Daniel Kahneman - Thinking Fast and Slow Song: Starry-Eyed Believer by Esther Friedman - a cult survivor and expressive arts therapist The starry-eyed believers Seek any kind face You, the deceiver, Sensed a trace Delicious longing of those so insecure Makes for perfect fish to lure The starry-eyed believers Seek any kind word You, the deceiver Saw and heard The hollow voice and the pleading look Grabbed your fishing pole and slipped the bait on the hook So the siren song begins Sweet and full of lies Such a seductive melody Such a pretty disguise Lost souls float aimlessly Waiting on you to set them free Mouths agape and biting for the bait Custom-made for you to captivate Let the feeding frenzy begin Don that devout disguise You’re ready for the bait and switch You got a lotta’ fish to fry Bottom Feeders, parasites Sharks on the hunt, vultures in flight Even Bernie Madoff’s got nothing on you Get your cauldron out you’ve got some guppies to (stew) Starry-eyed believers (rpt to end) Please DONATE to Gurunischan’s reclamation and recovery work by making a one time or monthly contribution to this publication. Don’t miss another episode by SUBSCRIBING to my Conversations You Can Feel Podcasts \u0026 Publishings. Stay tuned for more musings on provocative and taboo topics hiding in plain sight. To be a guest on the podcast, please send an email to GN@GuruNischan.com w/ Subject Line: UCPBCC Spotify Playlist: Uncomfortable Conversations on Predators in Business Community and Culture Playlist: Join my Inner Orbit Monthly to stay connected at GuruNischan.com Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-02-26T00:00:00",
      "duration": "01:39:17.5200000",
      "explicit": false,
      "spotifyId": "1gY6HJSK3nbKqxpKBjt3OI",
      "subjects": [
        "Center For Transformational Learning",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gY6HJSK3nbKqxpKBjt3OI"
      }
    },
    {
      "id": "52e374a8-f4f9-4b0b-9235-7293144573bc",
      "title": "The Predators in My Body - Dismantling the False Identity \u0022running\u0022 Me",
      "description": "As a child survivor of a religious yoga cult, and the current host of the Uncomfortable Conversation Podcast: The Untold Stories of the 3HO/Kundalini Yoga Community, Gurunischan shares why she started this new podcast platform and how LISTENING has helped her discover the predators in her body — the false cultural conditioning that led to a firmly rooted identity in appropriation and “Otherness”. Links mentioned in episode: Uncomfortable Conversation Podcast: The Untold Stories of the 3HO/Kundalini Yoga Community Episode: 39: Episode 40: Our Shared 3HO Identity of “Exceptionalism” and “Otherness” Episode 41: White Silence, Exceptionalism, Superiority and the Spiritual White Woman White Women: Everything You Already Know About Racism and How to Do Better by Regina Jackson and Siara Rao Get full access to Conversations You Can Feel at gurunischan.substack.com/subscribe",
      "release": "2023-01-23T02:08:05Z",
      "duration": "00:51:27.0950000",
      "explicit": false,
      "spotifyId": "3YmztijU5aWexWM9sornt2",
      "appleId": 1000595987709,
      "subjects": [
        "Yoga Cult",
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3YmztijU5aWexWM9sornt2",
        "apple": "https://podcasts.apple.com/podcast/the-predators-in-my-body-dismantling-the-false/id1667188788?i=1000595987709"
      }
    }
  ]
}