{
  "id": "7318f078-3177-4c74-8f03-2e45cdd601e5",
  "name": "understanding the world",
  "youTubeChannelId": "UCvIh05QBUrGnnMBh6F886ow",
  "episodes": [
    {
      "id": "9a25276d-29ba-4ab0-a515-8d65c386a79e",
      "title": "10 Countries That Label Scientology as a Dangerous Cult 🌍⚠️",
      "description": "👉SUBSCRIBE : https://bit.ly/3Z5de2S \nScientology claims to be a religion, but in many countries it is officially regarded as a dangerous cult. From Europe to Latin America, governments have rejected its recognition, prosecuted its leaders, and warned citizens about its practices.\nIn this video, we break down the ten countries that classify Scientology as a dangerous cult and explain the reasons behind their decisions—from fraud convictions in France to surveillance in Germany and outright bans in Russia.\nAll of the information in this video is based on official reports, court rulings, and investigative journalism. You can find the complete list of sources in the description below 👇\n📚 Sources\nWikipedia – Scientology in France: https://en.wikipedia.org/wiki/Scientology_in_France\nWikipedia – Scientology status by country: https://en.wikipedia.org/wiki/Scientology_status_by_country\nMIVILUDES (France) – Official reports on cults: https://www.derives-sectes.gouv.fr\nGerman Office for the Protection of the Constitution – Reports on Scientology (Verfassungsschutz): https://www.verfassungsschutz.de\nBelgian judiciary press releases on Scientology trials: https://www.justitie.belgium.be\nSwiss Federal Court rulings (cases involving Scientology): https://www.bger.ch\nRussian court rulings banning Scientology texts: https://www.sova-center.ru\nIsraeli parliamentary commission on cults (1987): https://www.knesset.gov.il\nReports on Scientology in Norway, Argentina, Poland, and Hungary (news and watchdog coverage): https://www.hrw.org\n🔔 Don’t forget\n✔️ Subscribe for weekly deep dives into religion, law, and society\n✔️ Like this video if you found it informative\n✔️ Share it with someone curious about global religious movements",
      "release": "2025-09-21T14:00:08Z",
      "duration": "00:10:48",
      "explicit": false,
      "youTubeId": "61wCHG_fFNc",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=61wCHG_fFNc"
      }
    },
    {
      "id": "72a2e7a8-dfa4-47ae-bee6-2108a30d3c8c",
      "title": "5 countries that have banned Jehovah’s Witnesses",
      "description": "👉SUBSCRIBE : https://bit.ly/3Z5de2S \nIn this video, we explore five countries that have banned Jehovah’s Witnesses and investigate why governments have taken such drastic measures against this religious group. From Russia’s declaration of “extremism” to Singapore’s strict national service laws, Tajikistan’s legal crackdown, Eritrea’s harsh repression, and Turkmenistan’s refusal to recognize them, we reveal the political, cultural, and legal reasons behind these bans.\nJehovah’s Witnesses are known worldwide for their door-to-door ministry, neutrality in politics, and refusal of military service. But in these countries, those same beliefs have led to imprisonment, loss of rights, and the complete outlawing of their communities.\nThis documentary-style video provides historical background, real cases of persecution, and the broader implications for freedom of religion and human rights. Whether you are studying world religions, human rights, or international politics, this video will give you a clear, factual overview of how and why Jehovah’s Witnesses face bans in certain nations.\nDon’t forget to like, share, and subscribe for more deep dives into global issues, faith, and freedom.\n📖 Sources:\nHuman Rights Watch – https://www.hrw.org\nUSCIRF – United States Commission on International Religious Freedom – https://www.uscirf.gov\nWikipedia – Persecution of Jehovah’s Witnesses – https://en.wikipedia.org/wiki/Persecution_of_Jehovah%27s_Witnesses\nHRWF – Human Rights Without Frontiers – https://hrwf.eu\nUnited Nations Human Rights Committee – https://www.ohchr.org",
      "release": "2025-09-18T12:50:03Z",
      "duration": "00:10:34",
      "explicit": false,
      "youTubeId": "aWjs3fvaX94",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aWjs3fvaX94"
      }
    }
  ]
}