{
  "_ts": 0,
  "id": "88528f30-3d07-481a-be57-597b482e7662",
  "name": "Under the Influence with Jo Piazza",
  "spotifyId": "6k4w68qxiUAC8dbPSwOlzC",
  "appleId": 1544171101,
  "episodes": [
    {
      "id": "3cf197d6-3f99-4c28-9c04-1ca2dc682ae4",
      "title": "Sunday Nice Things: On Drugs, from Other People’s Problems",
      "description": "Sharing something special with you this week, it’s an episode of Other People’s Problems, from CBC. Normally, therapy sessions are totally confidential — but this podcast opens the doors. On this season, the host Dr. Hillary McBride explores the transformative power of psychedelics in a therapeutic setting. With her psychological expertise, Dr. Hillary leads clients through drug-assisted therapy, guiding them to new heights on their healing journeys. You’ll experience these real, unscripted sessions firsthand as they unfold, and get an unprecedented look at therapy using psychedelics and psychoactive drugs, demystifying this often misunderstood practice as a powerful tool in trauma recovery. In this episode, we hear from Brandi, who has social anxiety because she grew up in a cult where members gathered regularly around her family’s dinner table to talk about mortality and sin. To cope, Brandi hid at the top of the stairs in silence, afraid to even go get a snack. In this session using cannabis, she imagines herself and Hillary bulldozing into the room, taking a stand on the kitchen table together, and demanding freedom. You can listen to more Other People’s Problems here Join our newsletter community here . Pre-order EVERYONE IS LYING TO YOU here . Visit our lovely sponsors here . Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2025-05-25T04:00:00Z",
      "duration": "00:42:43.3170000",
      "explicit": false,
      "spotifyId": "6VliGtDu6yZzQKU6TebD94",
      "appleId": 1000709759031,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6VliGtDu6yZzQKU6TebD94",
        "apple": "https://podcasts.apple.com/podcast/sunday-nice-things-on-drugs-from-other-peoples-problems/id1544171101?i=1000709759031"
      }
    }
  ]
}