{
  "id": "b98ea1ac-7353-4d00-97fc-7061c50c926a",
  "name": "Un-holier Than Thou",
  "spotifyId": "6uLidb5G1GpeYuA1p1mIZ1",
  "appleId": 1800066919,
  "youTubeChannelId": "UC4m7hT2md5VSk0jKxo_HuWQ",
  "episodes": [
    {
      "id": "39d3fd67-a2b6-4533-a4ab-ad58a7953271",
      "title": "Exposing the Dark Truth: Drama/Un-Holier-ISH Special Episode",
      "description": "In this deeply personal and uncomfortable episode, hosts David and Jenny address a serious issue affecting the Troubled Teen Industry (TTI) community. They reveal that a former podcast guest has been embellishing their survival story to gain attention and scam community members, particularly vulnerable women, out of money. Despite the sensitive nature of the topic, David and Jenny provide insights and share their mission to bring awareness and change to TTI institutions. They also extend their support to survivors impacted by such deceitful actions. Ending on a positive note, they mention ongoing initiatives like the Survivors Unrestrained organization and an upcoming federal bill aimed at reforming the troubled teen industry. If you\u0027re passionate about making a difference and protecting vulnerable communities, this is an episode you don\u0027t want to miss. #troubledteen #parishilton #dirtyjohn",
      "release": "2025-12-10T05:00:00Z",
      "duration": "00:32:18.4940000",
      "explicit": true,
      "spotifyId": "1mXmN8uwRUf7MzbOqCr4S3",
      "appleId": 1000740542468,
      "youTubeId": "Cl0MCdB4M4Y",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1mXmN8uwRUf7MzbOqCr4S3",
        "apple": "https://podcasts.apple.com/podcast/exposing-the-dark-truth-drama-un-holier-ish-special-episode/id1800066919?i=1000740542468",
        "youtube": "https://www.youtube.com/watch?v=Cl0MCdB4M4Y"
      }
    },
    {
      "id": "8d976625-4deb-41fb-a1da-1a0e1d39249b",
      "title": "Survivor Fights Back: Changing the Troubled Teen Industry - Exclusive Interview",
      "description": "In this episode of the Un Holier Podcast, host Jenny Smith sits down with Tabitha, a survivor of the troubled teen industry who spent time at Tranquility Bay in Jamaica. Tabitha shares her journey of growth and resilience, discussing her mixed emotions about the recent hurricane that hit Jamaica and the lasting impact of her experiences. The episode highlights Tabitha\u0027s impressive efforts in creating a grassroots organization and working towards a federal bill aimed at reforming the troubled teen industry. The conversation delves into the specifics of the proposed legislation, which seeks to provide better protections for teens, ban out-of-country placements, and ensure mental health facilities are properly regulated. Jenny and Tabitha also discuss practical advice for parents dealing with diﬃcult teens, emphasizing the importance of finding the right therapeutic approach. Tune in to learn more about how you can support this impactful cause. #survivors #podcast #tti #parishilton https://www.change.org/p/pass-the-protect-kids-act-protect-children-in-youth-residential-program s?recruiter=1395789295\u0026recruited _ by_ id=a3986430-c44b-11f0-82c5-19d258e4bb7f\u0026utm sour _ ce=share _petition\u0026utm _ campaign=petition dashboard\u0026utm _ _ medium=copylink",
      "release": "2025-12-08T05:00:00Z",
      "duration": "00:56:40.6460000",
      "explicit": true,
      "spotifyId": "3bsClRCmsYKSqquq8Tyy9j",
      "appleId": 1000740162558,
      "youTubeId": "lvB_sY_Lw5w",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3bsClRCmsYKSqquq8Tyy9j",
        "apple": "https://podcasts.apple.com/podcast/survivor-fights-back-changing-the-troubled-teen/id1800066919?i=1000740162558",
        "youtube": "https://www.youtube.com/watch?v=lvB_sY_Lw5w"
      }
    },
    {
      "id": "d650eb33-74a7-4f52-8e12-37c68fff35bd",
      "title": "Marriage \u0026 Religion: Our Different Upbringings \u002B Surviving Religious Trauma",
      "description": "In a special episode of the Un Holier Podcast, host Jenny Smith is joined by her husband, Ryan (aka Smitty), to discuss their vastly different upbringings. Jenny was raised in a religious environment while Ryan wasn\u0027t exposed to church at all. They share personal stories, delve into the challenges and growth in their marriage, and discuss their experiences with various church environments. The couple also touches on the impacts of religious trauma and their journey of finding their own way. Whether you’re familiar with IFB, curious about different religious practices, or just enjoy heartfelt discussions, this episode offers intimate and insightful conversations. #UnHolierPodcast #ReligiousTrauma #MarriageTalk #DifferentUpbringings #PodcastEpisode",
      "release": "2025-12-02T05:00:00Z",
      "duration": "00:41:16.4860000",
      "explicit": true,
      "spotifyId": "3o3hRxHP4YioHteOu6pK7b",
      "appleId": 1000739234182,
      "youTubeId": "phWXH8rxnwA",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3o3hRxHP4YioHteOu6pK7b",
        "apple": "https://podcasts.apple.com/podcast/marriage-religion-our-different-upbringings-surviving/id1800066919?i=1000739234182",
        "youtube": "https://www.youtube.com/watch?v=phWXH8rxnwA"
      }
    },
    {
      "id": "dcb84bdc-7f7b-423f-84ae-f2ac8bc7522c",
      "title": "Sheltered but not Protected: The Justin Woodbury Story",
      "description": "In this emotionally charged episode of The Holier podcast, host Jenny Smith sits down with Justin Woodbury, an old friend from their days in the Christian school. Justin opens up about his harrowing experiences within the Independent Fundamental Baptist (IFB) Church, specifically the Ann Arbor Baptist Church in Michigan. Through a candid conversation, Justin shares the deeply disturbing events of abuse he endured, his journey to healing, and his resolve to help others through his book, \u0027Sheltered But Not Protected.\u0027 Trigger warning: This episode discusses abuse within the church. Viewer discretion is advised. #IFB #AbuseSurvivor #EndHolier #ChristianSchool #cultsurvivor  #survivorstories  #religioustrauma  #churchabuse  #healingjourney \n\n\n\nhttps://www.amazon.com/dp/1662929765?ref=cm_sw_r_ffobk_cso_sms_apin_dp_5XR24WS10N3WTX0A8GJQ\u0026ref_=cm_sw_r_ffobk_cso_sms_apin_dp_5XR24WS10N3WTX0A8GJQ\u0026social_share=cm_sw_r_ffobk_cso_sms_apin_dp_5XR24WS10N3WTX0A8GJQ\u0026bestFormat=true\u0026titleSource=true",
      "release": "2025-11-25T05:00:00Z",
      "duration": "01:40:57.9270000",
      "explicit": true,
      "spotifyId": "0GqtsKloRzVHmxAlofdP29",
      "appleId": 1000738229805,
      "youTubeId": "YL607UoGJEI",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0GqtsKloRzVHmxAlofdP29",
        "apple": "https://podcasts.apple.com/podcast/sheltered-but-not-protected-the-justin-woodbury-story/id1800066919?i=1000738229805",
        "youtube": "https://www.youtube.com/watch?v=YL607UoGJEI"
      }
    },
    {
      "id": "5661c678-7000-47ee-8aa5-e3385116e537",
      "title": "PREACHER BOY EXPOSES IFB\u0027s DARK SECRETS: The Bible College Nightmare That Broke Him! 😱",
      "description": "🚨  A \u0027PREACHER BOY,\u0027 NOW HE\u0027S EXPOSING EVERYTHING! 🚨** In one of our most intense episodes yet, host Jenny Smith sits down with **Daniel** as he takes us deep inside the shadowy world of the **Independent Fundamental Baptist (IFB)** movement. You won\u0027t believe the shocking details he reveals. Daniel was the ideal IFB kid—the classic \u0027preacher boy.\u0027 But behind the façade of suits and perfect attendance was a life buckling under the weight of **rigid structures and controversial teachings**. What finally broke him? A harrowing, must-hear experience at a **Bible college** that forced him to question every single belief he ever held. From strict dating rules and purity culture to the **behind-the-scenes power dynamics** of the IFB, Daniel holds nothing back. Hear his heartbreaking account of the community he lost, and the incredible, unexpected new life and support he found through **martial arts**. This journey is a powerful roadmap for anyone navigating religious trauma and a guide for those considering their own deconstruction. #TrendingViralHashtags** #TalesFromTheIFB #Deconstruction #UnholierPodcast #ExFundie #FundieFriday #ReligiousTrauma #IFBExposed #Cults #Viral #JennySmith #Exvangelical",
      "release": "2025-11-18T05:00:39Z",
      "duration": "01:29:13.6910000",
      "explicit": true,
      "spotifyId": "1Nhy0vZpYMzKhenkBXbHiB",
      "appleId": 1000737221285,
      "youTubeId": "VpF-2yfOaY8",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Nhy0vZpYMzKhenkBXbHiB",
        "apple": "https://podcasts.apple.com/podcast/preacher-boy-exposes-ifbs-dark-secrets-the-bible/id1800066919?i=1000737221285",
        "youtube": "https://www.youtube.com/watch?v=VpF-2yfOaY8"
      }
    },
    {
      "id": "91b55bb1-c215-4bd1-9408-e5c4be36e458",
      "title": "IFB Preachers\u0027 SHOCKING Sermons EXPOSED! (Racial Slurs \u0026 Toxic Teachings Revealed)",
      "description": "🚨 CAN YOU BELIEVE THIS?! 🚨 Join Jenny Smith and David Keck on the Un Holier Podcast as they react in real-time to the most jaw-dropping, controversial sermon clips from Independent Fundamental Baptist (IFB) preachersyou\u0027ve ever heard.\n\nWe\u0027re not holding back. Hear the shocking moments—including documented racial slurs and insane conspiracy theories—that shaped their childhoods. Jenny and David dive into a deep, dynamic conversation, dissecting the toxic rhetoricthat permeates the IFB movement.\n\nIf you or someone you know grew up in the church, this episode is a necessary listen. Find out why thousands are leaving and how these fundamentalist preachers are still getting away with it. This is a rollercoaster of emotion and a powerful act of healing. #ShockingTruth #Exposed #PodcastLife #MustListen #Viral #Controversial #TheySaidWhat",
      "release": "2025-11-11T05:00:00Z",
      "duration": "01:09:11.7190000",
      "explicit": true,
      "spotifyId": "73t60DnqUdMkKnQnEDwNT9",
      "appleId": 1000736213586,
      "youTubeId": "BoC4m1f8SuI",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/73t60DnqUdMkKnQnEDwNT9",
        "apple": "https://podcasts.apple.com/podcast/ifb-preachers-shocking-sermons-exposed-racial-slurs/id1800066919?i=1000736213586",
        "youtube": "https://www.youtube.com/watch?v=BoC4m1f8SuI"
      }
    },
    {
      "id": "5695e737-4dca-445a-9038-97ee77d9ff09",
      "title": "No Longer Invisible: Trauma, Deconstruction, and Escaping the Independent Fundamental Baptist (IFB) Cult",
      "description": "In this gripping podcast episode, we welcome Marbeth Skwarczynski, mother of \u0027Preacher Boys\u0027 host Eric and accomplished author, as she discusses her harrowing experiences growing up in the IFB (Independent Fundamental Baptist) movement. We dive deep into her real-life inspirations for her compelling book \u0027No Longer Invisible\u0027 and explore the emotional challenges and abuses she faced and overcame. This candid conversation sheds light on the stark realities behind seemingly perfect façades in religious communities, highlighting her journey through severe depression, working for years in a Christian school under exploitative conditions, and ultimately deconstructing her faith. Learn about her powerful fiction works that reveal the lives of those impacted by such environments and her latest book \u0027Princess of Moab.\u0027 Don\u0027t miss this emotional and eye-opening episode, especially if you\u0027ve ever questioned how religion can sometimes manipulate and control. Subscribe and hit the bell icon for more inspiring stories and eye-opening discussions!",
      "release": "2025-11-04T05:00:00Z",
      "duration": "01:50:58.2990000",
      "explicit": true,
      "spotifyId": "1IKiyRgJWjhVOl9ljqdwls",
      "appleId": 1000735158614,
      "youTubeId": "fNGWM-_zvCc",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IKiyRgJWjhVOl9ljqdwls",
        "apple": "https://podcasts.apple.com/podcast/no-longer-invisible-trauma-deconstruction-and/id1800066919?i=1000735158614",
        "youtube": "https://www.youtube.com/watch?v=fNGWM-_zvCc"
      }
    },
    {
      "id": "f81f4bfe-97a0-4335-9a49-2f8c67f5635d",
      "title": "The $400 Billion Dollar Question: Why We Leave Strict Religion | Christiana Miller",
      "description": "🔥 The exhaustion of religious legalism is REAL. You don\u0027t want to miss this jaw-dropping, deeply personal conversation!\n\nIn this powerful episode of the UN Holier Podcast, host Jenny Smith sits down with the incredible Christiana Miller, a talented singer, songwriter, and influential social media personality. Christiana grew up completely immersed in the ultra-restrictive Independent Fundamental Baptist (IFB) movement.\n\nChristiana shares her extraordinary life story, revealing what it was truly like to travel with her family to over 500 IFB churches across the country. She opens up about the immense challenges of leaving this restrictive environment, and the emotional journey she took toward questioning and ultimately breaking free from the legalism she was raised in.\n\nHow do you redefine your entire life after leaving the only faith structure you’ve ever known? Christiana discusses her thriving music career, the raw process of faith deconstruction, and offers powerful, practical advice for others contemplating leaving the IFB or any high-control religious system.\n\nThis isn\u0027t just a story about leaving—it\u0027s a story about freedom, personal growth, and finding your own voice.\n\n🔔 Subscribe and hit the bell for more unfiltered conversations!#IFB #IndependentFundamentalBaptist #Deconstruction #FaithDeconstruction #LeavingReligion #Legalism #Podcast #Christianity #ChristianPodcast #ChristianaMiller #JennySmith #FaithCrisis #PersonalGrowth",
      "release": "2025-10-28T04:00:00Z",
      "duration": "01:05:54",
      "explicit": false,
      "spotifyId": "2E0hDvQmKY6LKvCgFy0hmz",
      "appleId": 1000733811937,
      "youTubeId": "f-LJ2sOPPj8",
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2E0hDvQmKY6LKvCgFy0hmz",
        "apple": "https://podcasts.apple.com/podcast/the-%24400-billion-dollar-question-why-we-leave-strict/id1800066919?i=1000733811937",
        "youtube": "https://www.youtube.com/watch?v=f-LJ2sOPPj8"
      }
    },
    {
      "id": "5fa6d426-3f10-4393-9366-27866700477a",
      "title": "They Joined a Church. It Was a Cult. Her Story Will Haunt You.",
      "description": "Join Jenny Smith on the UnHolier Podcast for a raw, unfiltered conversation with Joanna, a survivor who escaped a terrifying ordeal. At a young age, her family was lured into a seemingly innocent church in Washington State, only to discover it was a controlling cult. Joanna bravely shares the shocking details of the severe abuse she endured, the manipulation by trusted leaders, and the heartbreaking betrayal that led to her time in the foster care system.\nThis isn\u0027t just a story of survival—it\u0027s a testament to the devastating power of cults and the incredible strength it takes to break free. Be prepared for a powerful, emotional, and eye-opening episode that will challenge everything you think you know about faith, family, and what it truly means to heal.\nDon\u0027t miss this gripping episode.\n#CultSurvivor #SurvivorStory #EmotionalTrauma #PodcastForSurvivors #CultAwareness #HealingJourney #TrueCrimePodcast #AbuseAwareness #BraveStories #UnHolierPodcast #SexualAssaultAwareness",
      "release": "2025-10-21T04:00:00Z",
      "duration": "00:44:29",
      "explicit": false,
      "spotifyId": "3zhUU1iUQnTsNhBCJ7AnFu",
      "appleId": 1000732754062,
      "youTubeId": "Aj9nCotLoLo",
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zhUU1iUQnTsNhBCJ7AnFu",
        "apple": "https://podcasts.apple.com/podcast/they-joined-a-church-it-was-a-cult-her-story-will-haunt-you/id1800066919?i=1000732754062",
        "youtube": "https://www.youtube.com/watch?v=Aj9nCotLoLo"
      }
    },
    {
      "id": "73aa8a13-ad7b-4fe6-9c79-9e2e3b9b04fc",
      "title": "The \u0027No One and Everyone\u0027 Paradox: Rebuilding Identity After Leaving Religion",
      "description": "We\u0027re switching gears (but keeping it real) with Jonathon Hamilton, a true survivor who embraces the chaotic reality of deconstruction. Jonathan walks us through his journey of shedding the rigid religious labels that once defined him, explaining why he now considers himself \u0027no one and everyone.\u0027 He brings a fascinating and humorous perspective on how losing your faith and identity can be the most authentic thing you ever do.\n\nThis episode dives into the absurdities of high-control systems, the humor in finding your new true self, and the necessary process of grieving the life you thought you had. If you\u0027ve ever felt like you had to be the person everyone else wanted you to be, join us for a conversation packed with unexpected laughter and genuine insights on what it takes to stop performing and finally be everyone to a select few. #Unholier #Deconstruction #Exvangelical #ExReligious #ReligiousTrauma #CultSurvival #FindingAuthenticity #HighControl #PostFaith",
      "release": "2025-10-14T04:00:00Z",
      "duration": "01:25:12",
      "explicit": false,
      "spotifyId": "3a6nJHUx7izLDFqKJ1AfRl",
      "appleId": 1000731741073,
      "youTubeId": "RJg0gr2x8aw",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3a6nJHUx7izLDFqKJ1AfRl",
        "apple": "https://podcasts.apple.com/podcast/the-no-one-and-everyone-paradox-rebuilding-identity/id1800066919?i=1000731741073",
        "youtube": "https://www.youtube.com/watch?v=RJg0gr2x8aw"
      }
    },
    {
      "id": "ce36e1ce-d66d-4110-877e-efbda681b4f8",
      "title": "From Faith to Fear: How a Teen Survivor Uncovered a Hidden System of Control",
      "description": "In this gripping episode of the UnHolier Podcast, we welcome Jessica, a brave survivor of the troubled teen industry, who shares her powerful story of resilience. Jessica recounts her harrowing experiences in the Happiness Hill and Shenandoah Haven homes, exposing the extreme and abusive practices rooted within these institutions. From manipulative religious control to physical and emotional abuse, Jessica details the struggles she faced as a naïve teen cast into this unforgiving environment. We also delve into the broader implications of how cult-like mentalities and unregulated \u0027therapeutic\u0027 programs continue to harm vulnerable youths. Despite the trauma, Jessica\u0027s journey is one of survival and awareness-raising, providing invaluable insights for parents and teen survivors alike. #Survivors #TroubledTeenIndustry #CultAwareness #JessicaStory #UnHolierPodcast",
      "release": "2025-10-07T04:00:00Z",
      "duration": "01:14:54",
      "explicit": false,
      "spotifyId": "7KTTY8LJOAnbXSoQ7Sz57U",
      "appleId": 1000730520459,
      "youTubeId": "LQv-lqBEyxc",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KTTY8LJOAnbXSoQ7Sz57U",
        "apple": "https://podcasts.apple.com/podcast/from-faith-to-fear-how-a-teen-survivor-uncovered/id1800066919?i=1000730520459",
        "youtube": "https://www.youtube.com/watch?v=LQv-lqBEyxc"
      }
    },
    {
      "id": "13532700-9b6d-4ce5-a5b5-6acb43363179",
      "title": "Exposing the Dark Truth Behind Troubled Teen Homes: Survivor\u0027s Shocking Stories",
      "description": "Welcome back to the UnHolier Podcast! In today\u0027s episode, host Jenny Smith interviews a returning guest, \u0027A\u0027, a survivor of the troubled teen home, Shenandoah Haven, in Cleveland, Tennessee. They dive deep into what \u0027A\u0027 has been up to since her first appearance, including connecting with other survivors and gathering eye-opening information about the abuse and corruption at Shenandoah Haven and its associated church. From revelations of misuse of power, sexual abuse, starvation as punishment, and bizarre contractual obligations, this episode uncovers the harrowing realities faced by the teens. They also discuss legal actions, the rebranding tactics of these institutions, and offer advice to both potential parents considering these homes and current/former staff. This episode is a call to action for legal reforms, support for survivors, and holding abusers accountable. #TroubledTeens #SurvivorStories #HumanRights #ChurchAbuse #LegalReforms",
      "release": "2025-09-30T04:00:00Z",
      "duration": "01:01:40",
      "explicit": false,
      "spotifyId": "0CnwuhiEXLox4DVmKfsedF",
      "appleId": 1000729215699,
      "youTubeId": "67fntztnW0o",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CnwuhiEXLox4DVmKfsedF",
        "apple": "https://podcasts.apple.com/podcast/exposing-the-dark-truth-behind-troubled-teen-homes/id1800066919?i=1000729215699",
        "youtube": "https://www.youtube.com/watch?v=67fntztnW0o"
      }
    },
    {
      "id": "98e55276-6bc9-4642-adc6-287de504881a",
      "title": "Beyond the Doctrine: Unmasking Religious Trauma with Expert Anne Russo!",
      "description": "Are you questioning your faith, or struggling with past wounds from a high-control religious environment?\nIn this eye-opening episode, we sit down with Anne Russo, a groundbreaking therapist specializing in religious trauma. With her forthcoming book on the topic, Anne shares her personal experiences and her expert insight into the silent epidemic of religious trauma.\nYou\u0027ll discover:\n • What religious trauma truly is and how it manifests.\n • Practical, actionable advice for navigating your healing journey.\n • The difference between healthy faith and harmful, oppressive doctrines.\n • The path to finding community, support, and freedom beyond the confines of your past.\nWhether you\u0027re struggling with a faith transition or simply want to understand this critical topic, Anne\u0027s compassionate guidance offers a powerful roadmap to reclaiming your life\u0027s joy.\n#ReligiousTrauma #MentalHealth #Deconstruction #FaithTransition #HealingJourney #HighControlGroups #CultSurvivor #Exvangelical #Therapy #AnneRusso #TraumaRecovery #PodcastInterview #FindingFreedom #SpiritualAbuse #TheHealingProcess",
      "release": "2025-09-23T13:52:23Z",
      "duration": "00:48:11",
      "explicit": false,
      "spotifyId": "2rFNv0nfyTfBzvmGMeHlLw",
      "appleId": 1000728057013,
      "youTubeId": "rpATGIIJdbg",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rFNv0nfyTfBzvmGMeHlLw",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-doctrine-unmasking-religious-trauma-with/id1800066919?i=1000728057013",
        "youtube": "https://www.youtube.com/watch?v=rpATGIIJdbg"
      }
    },
    {
      "id": "a29916e2-89d9-438f-91e8-4b133a8cd0b8",
      "title": "I Escaped a Cult, and This is What Happened Next",
      "description": "⚠️ Trigger Warning: This episode contains discussions of physical, emotional, and sexual trauma. Viewer discretion is advised.\n\n\nIn this explosive episode of Un Holier Than Thou, Jenny sits down with special co-host David Keck to a hear a story of survival that will leave you speechless. We are honored to welcome Martha, a brave author, trauma coach, and speaker, who shares her harrowing journey of escaping a restrictive and abusive religious cult.\n\n\nMartha\u0027s story is a testament to human resilience. From a young age, she was subjected to extreme control, psychological manipulation, and shocking physical punishment within the cult compound. She details the chilling tactics used to isolate members, the strict punishments for disobedience, and the impossible choices she faced.\n\n\nThis isn\u0027t just Martha\u0027s story; it\u0027s a deep dive into the hidden world of cults, a discussion on how they operate, and what happens to survivors when they finally break free. Martha pulls back the curtain on the incredible challenges of re-entering the \u0022real world,\u0022 the struggle to rebuild her identity, and the long, painful road to healing from deep-seated trauma.\n\n\nYou\u0027ll hear Martha describe:\n\n\n• The terrifying reality of life inside the cult compound.\n\n\n• The intense psychological control and brutal punishment tactics.\n\n\n• The secret escape plan that changed her life forever.\n\n\n• Her ongoing struggle with faith and healing after leaving.\n\n\n• How she transformed her trauma into a powerful mission to help others.\n\n\nDon\u0027t miss this powerful, emotional, and ultimately inspiring episode that proves no one has to feel alone in their healing journey.\n\n\nhttps://trauma-x.org/\n\n\nhttps://youtu.be/k_fOjKdtnlc?si=lKWG7ieFm51Nf0_P\n\n\n#UnHolierThanThou #CultSurvivor #ReligiousTrauma #Cults #ExposingCults #HealingJourney #TraumaRecovery #OvercomingAdversity #SurvivorStory #AbuseAwareness #DavidKeck #Jenny #Podcast #Interview #RealLifeStory",
      "release": "2025-09-09T04:00:00Z",
      "duration": "01:05:03",
      "explicit": false,
      "spotifyId": "2ytrFuY3Bo6yUxeRCqABIK",
      "appleId": 1000725644957,
      "youTubeId": "8y0hninPSzg",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ytrFuY3Bo6yUxeRCqABIK",
        "apple": "https://podcasts.apple.com/podcast/i-escaped-a-cult-and-this-is-what-happened-next/id1800066919?i=1000725644957",
        "youtube": "https://www.youtube.com/watch?v=8y0hninPSzg"
      }
    },
    {
      "id": "a06e1762-7ef3-40ab-af30-afc48b98d73b",
      "title": "From Indoctrination to Freedom: One Pastor\u0027s Journey Out of the IFB",
      "description": "Have you ever felt trapped by religion? In this raw and unfiltered interview, we sit down with JC Groves, a brave pastor who escaped the clutches of the Independent Fundamental Baptist (IFB) movement. From a life of strict religious indoctrination to a powerful spiritual awakening, JC’s story will challenge everything you think you know about faith. We\u0027ll uncover the secrets of the IFB\u0027s legalistic practices, hear breathtaking stories of personal transformation, and reveal the man-made rules often disguised as biblical truth. If you\u0027ve been hurt by religious control or are questioning your own faith journey, this video is a beacon of hope. Join us as JC shares his new mission with the \u0027Following the Way Podcast,\u0027 dedicated to helping you build an authentic relationship with Jesus, free from the burdens of religious tradition. Don\u0027t just listen—be transformed. Like, share, and subscribe to get your spiritual freedom back! #ReligiousTrauma #SpiritualAwakening #IFB #IndependentFundamentalBaptist #Exvangelical #Christianity #Christian #Podcast #FaithJourney #ReligiousFreedom #Jesus #Legalism",
      "release": "2025-09-02T04:00:00Z",
      "duration": "00:56:57.3120000",
      "explicit": true,
      "spotifyId": "0iFiSrHvZgD85L9EW2Snw7",
      "appleId": 1000724490291,
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0iFiSrHvZgD85L9EW2Snw7",
        "apple": "https://podcasts.apple.com/podcast/from-indoctrination-to-freedom-one-pastors-journey/id1800066919?i=1000724490291"
      }
    },
    {
      "id": "8604593d-3373-4530-8fd5-7978f64361e7",
      "title": "Season Finale! From Hymns to Headbanging: Breaking Free from Strict Church Rules",
      "description": "Ready for a trip down memory lane that\u0027s anything but holy? Join Jenny and her special guest Johnna as they spill all the tea on their crazy journey growing up in the Independent Fundamental Baptist (IFB) church. It\u0027s a hilarious look at everything you weren\u0027t allowed to do, especially when it came to music. Imagine a world with only hymns, strict dress codes, and zero rock and roll. Now picture what happens when two kids break free and discover a whole new universe of sound. From surviving awkward moments at tent revivals (yes, grasshoppers are involved!) to sneaking out for their first rock concert, this episode is a laugh-out-loud tale of rebellion and discovery. But it\u0027s not all fun and games. Jenny and her guest Johnna get real about navigating the lasting effects of religious trauma and how music became their ultimate escape. If you\u0027ve ever felt trapped by strict church rules, this is the story you need to hear. It\u0027s relatable, liberating, and proves you can find your own rhythm, even after a lifetime of strict rules. #ChurchMusic #ReligiousTrauma #IFB #Exvangelical #Exchristian #RockMusic #MusicJourney #ReligiousFreedom #FaithDeconstruction #Storytime Don\u0027t miss out on this incredible story of music, freedom, and finding your own way! https://www.tiktok.com/@lukesevereid/video/7337046668073782570?is_from_webapp=1\u0026sender_device=pc\u0026web_id=7541462327490381367",
      "release": "2025-08-26T16:00:00Z",
      "duration": "00:54:08.4310000",
      "explicit": true,
      "spotifyId": "38W11ijH4WEot4E9MjRADX",
      "appleId": 1000723537995,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Evangelicalism",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38W11ijH4WEot4E9MjRADX",
        "apple": "https://podcasts.apple.com/podcast/season-finale-from-hymns-to-headbanging-breaking-free/id1800066919?i=1000723537995"
      }
    },
    {
      "id": "094820d2-724d-4393-ab55-0eded890e8ed",
      "title": "They Called It ‘Healing’ — She Calls It Hell: A Survivor’s Shocking Story",
      "description": "In this powerful and emotional episode of Unholier Than Thou, hosts Susie and Jenny welcome a courageous survivor—A—who is breaking her silence on the horrifying abuse she endured at Shenandoah Haven, one of many institutions in the troubled teen industry.\nA shares her story of being sent away without consent, subjected to emotional, physical, and religious abuse, and ultimately surviving a system that protects predators and punishes the vulnerable. From the \u0022Porn Pastor\u0022 to the church\u0027s twisted justice system, this episode pulls back the curtain on an industry cloaked in secrecy.\n🛑 This is a must-hear episode for anyone who wants to understand the hidden horrors behind “rehabilitation” programs and why survivors like A are demanding real change.\n👉 Subscribe for more survivor stories\n⚠️ Trigger Warning: This episode contains accounts of abuse, exploitation, and trauma. Please listen with care.\n🔗 #TroubledTeenIndustry #SurvivorStory #AbuseAwareness #LegislativeChange #CommunitySupport #ExposeTheTruth #ReligiousTrauma #ShenandoahHaven",
      "release": "2025-08-19T04:00:00Z",
      "duration": "01:22:29",
      "explicit": false,
      "spotifyId": "23owNDEV9fWBaKHUz3ejdd",
      "appleId": 1000722600808,
      "youTubeId": "LtiKhDSTaX4",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23owNDEV9fWBaKHUz3ejdd",
        "apple": "https://podcasts.apple.com/podcast/they-called-it-healing-she-calls-it-hell-a/id1800066919?i=1000722600808",
        "youtube": "https://www.youtube.com/watch?v=LtiKhDSTaX4"
      }
    },
    {
      "id": "df3fb569-a074-48f5-a867-6bcce8212bda",
      "title": "Church Control \u0026 Secrets: Barb\u0027s SHOCKING Escape to Freedom!",
      "description": "⚠️ TRIGGER WARNING: This episode contains sensitive discussions of religious trauma, sexual abuse, and miscarriage. Listener discretion is advised.\nImagine a life defined by unyielding control and harsh judgment. This week on \u0022The Process of Healing,\u0022 hosts Susie and Jenny sit down with the incredibly brave Barb, who shares her harrowing, unfiltered story of being raised within a rigid, cult-like religious environment.\nBarb pulls back the curtain on her tumultuous past, from the intense dynamics of her upbringing in Temple Baptist to the seismic church split that plunged her family into Prayer Baptist. She bravely recounts:\n • Her early life under manipulative church leaders.\n • The profound struggles of questioning authority as a teenager.\n • The devastating impact of an early pregnancy and traumatic miscarriage.\n • Her courageous journey of escaping familial sexual abuse.\n • And the relentless judgment and unrealistic expectations she faced.\nThis isn\u0027t just a story of survival; it\u0027s a testament to unbreakable resilience. Barb reveals her path from deep trauma to profound healing, highlighting the transformative relationships and the crucial role of finding the right kind of support and counsel outside the church\u0027s shadow.\nJoin us for a powerful, eye-opening conversation about self-discovery, personal light, and the enduring quest for true freedom.\nDon\u0027t miss this inspiring episode. Share it to help others find their light!\n#ReligiousTrauma #CultSurvivor #ChurchAbuse #SexualAbuseSurvivor #HealingJourney #Escape #Freedom #Judgment #Miscarriage #Resilience #SelfDiscovery #Podcast #TraumaRecovery #FindingLight #SupportSystem #MentalHealth #UnfilteredStory #Inspiring #SurvivorStories #TheProcessOfHealing",
      "release": "2025-08-12T04:00:00Z",
      "duration": "00:50:26",
      "explicit": false,
      "spotifyId": "3mmvHG7ETqKsVPUqMzrcxv",
      "appleId": 1000721598704,
      "youTubeId": "5ue4U_yXnv8",
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mmvHG7ETqKsVPUqMzrcxv",
        "apple": "https://podcasts.apple.com/podcast/church-control-secrets-barbs-shocking-escape-to-freedom/id1800066919?i=1000721598704",
        "youtube": "https://www.youtube.com/watch?v=5ue4U_yXnv8"
      }
    },
    {
      "id": "25c87d72-0c23-416b-8a0f-ed3b05795cc5",
      "title": "Survivors Unrestrained: Sent Away at 12! Tabitha\u0027s SHOCKING Tranquility Bay Nightmare!",
      "description": "WARNING: This episode contains graphic descriptions of child abuse, neglect, and institutional trauma. Listener discretion is advised.\nImagine being 12 years old, sent away by your own parents, and trapped for years in a place that promised help but delivered a nightmare. This week on \u0022Un-holier Than Thou\u0022 we sit down with the incredibly brave Tabitha, a survivor of the notorious Tranquility Bay facility in Jamaica – a dark chapter of the Troubled Teen Industry (TTI).\nTabitha pulls back the curtain on the appalling conditions, severe punishments, and shocking neglect she endured for four and a half years. She reveals the physical and emotional toll this \u0022program\u0022 took on her, and the resilience it took to survive.\nBut Tabitha\u0027s story doesn\u0027t end there. She has transformed her pain into powerful purpose, founding \u0027Survivors Unrestrained\u0027 – a non-profit dedicated to supporting others affected by these programs.\nTune in to hear her harrowing journey from control to freedom, the vital importance of community in healing, and the ongoing battle to bring justice and support to countless survivors. This is more than a story; it\u0027s a call to action.\nDon\u0027t miss this essential conversation. Share it to shine a light on the hidden realities of the TTI.\n#TranquilityBay #TroubledTeenIndustry #TTI #SurvivorsUnrestrained #SurvivorStory #ChildAbuse #InstitutionalAbuse #Neglect #TraumaHealing #Advocacy #Justice #Podcast #TrueCrime #Resilience #HealingJourney #Jamaica #BreakTheSilence #Unbelievable #Shocking #SupportSurvivors",
      "release": "2025-08-05T04:00:00Z",
      "duration": "00:54:24",
      "explicit": false,
      "spotifyId": "6WyG30BT5owGthXej5SXnr",
      "appleId": 1000720674956,
      "youTubeId": "G2kMMCVFMwo",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6WyG30BT5owGthXej5SXnr",
        "apple": "https://podcasts.apple.com/podcast/survivors-unrestrained-sent-away-at-12-tabithas-shocking/id1800066919?i=1000720674956",
        "youtube": "https://www.youtube.com/watch?v=G2kMMCVFMwo"
      }
    },
    {
      "id": "a843beea-60fb-4e9e-acfb-a62989d81ee1",
      "title": "Spilling the Kool-Aid: Alisha\u0027s SHOCKING Cult Escape \u0026 Journey to Freedom!",
      "description": "WARNING: This episode discusses sensitive topics including cult dynamics, manipulation, and emotional abuse. Listener discretion is advised.\nYou won\u0027t believe what she survived. 🚨 This week, get ready for a raw, eye-opening conversation as we welcome special guest Alisha, a brave survivor who was born and raised in a cult-like religious environment!\nYou might know Alisha from TikTok, where she fearlessly shares her story. Now, she\u0027s \u0022Spilling the Kool-Aid\u0022 with us, detailing the chilling manipulative practices of the cult leader and the emotional and mental struggles she endured for years.\nHear her gripping account of:\nHer initiation into the controlled world of the cult.The pivotal moments that sparked her awakening.The incredible, harrowing journey to her eventual escape and reclaiming her freedom.Alisha\u0027s mission today? To bring urgent awareness to those still trapped in similar communities and to help countless others heal from their experiences. This isn\u0027t just a story; it\u0027s a powerful look into the dark realities of cult dynamics and the inspiring path toward recovery and self-discovery.\nDon\u0027t miss this essential episode! Share it to help others break free.\n#CultSurvivor #CultAwareness #ReligiousCult #MindControl #Escape #Freedom #TraumaHealing #SelfDiscovery #Podcast #TrueCrime #Manipulation #SpillingTheKoolAid #TikTokSurvivor #HealingJourney #BreakFree #UnbelievableStory #MustWatch #SEO",
      "release": "2025-07-29T04:00:00Z",
      "duration": "01:45:08",
      "explicit": false,
      "spotifyId": "0fL4OkL5v45fGu2knB7Fgr",
      "appleId": 1000719588995,
      "youTubeId": "32YHqDoXLdU",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0fL4OkL5v45fGu2knB7Fgr",
        "apple": "https://podcasts.apple.com/podcast/spilling-the-kool-aid-alishas-shocking-cult-escape/id1800066919?i=1000719588995",
        "youtube": "https://www.youtube.com/watch?v=32YHqDoXLdU"
      }
    },
    {
      "id": "7f7bfe0e-5000-4aab-b27e-56845136c0a0",
      "title": "BORN INTO A CULT: Kim Kelley\u0027s SHOCKING Escape \u0026 Fight Against Child Trafficking!",
      "description": "You won\u0027t believe this story. 🚨 This week on Unholier Than Thou, we\u0027re honored to welcome special guest Kim Kelley, a courageous survivor who was born and raised inside an international religious cult notorious for severe child abuse and trafficking.\nKim pulls back the curtain on the chilling reality of growing up in a highly controlled environment, the shocking abuse she and her siblings endured, and the incredible true story of how she ultimately escaped.\nToday, Kim dedicates her life to combating child exploitation and trafficking, working directly with law enforcement and implementing vital training programs. In this powerful conversation, Kim provides:\nUnflinching insight into the prevalence of child abuse within religious organizations.The immense challenges of addressing these hidden issues.Practical steps communities and individuals can take to protect children, especially in the vulnerable digital realm.This episode is a raw, eye-opening look into the ongoing fight against child exploitation in the United States. Prepare to be informed, inspired, and moved to action by Kim\u0027s unwavering resilience and hope.\n#CultSurvivor #ChildAbuseAwareness #ChildTrafficking #ReligiousCults #KimKelly #UnholierThanThou #Podcast #TrueCrime #Advocacy #ChildProtection #SurvivorStory #MentalHealth #JusticeForChildren #EndChildExploitation #SafeChurch #DigitalSafety #MustListen #Clickbait #SEO #HumanRights",
      "release": "2025-07-22T04:00:00Z",
      "duration": "01:31:34",
      "explicit": false,
      "spotifyId": "6J6gxKHgXS1K5BHZkfEXiv",
      "appleId": 1000718405050,
      "youTubeId": "9URYaqkgr0c",
      "subjects": [
        "Children Of God",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6J6gxKHgXS1K5BHZkfEXiv",
        "apple": "https://podcasts.apple.com/podcast/born-into-a-cult-kim-kelleys-shocking-escape-fight/id1800066919?i=1000718405050",
        "youtube": "https://www.youtube.com/watch?v=9URYaqkgr0c"
      }
    },
    {
      "id": "6ba5d50e-b059-4860-bf64-a8bf470b9caf",
      "title": "LOST Family, GAINED Freedom: The Unbelievable Price of Escaping a Patriarchal Cult",
      "description": "In this captivating episode, we welcome Tamara Buchanan, known as Jezebel on social media, sharing her extraordinary journey from life in a strict Apostolic Pentecostal cult to becoming an advocate and speaker. Tamara recounts her upbringing, the moment she decided to reclaim the name Jezebel to empower herself, and the harrowing experiences of sexual and domestic abuse she endured. She discusses the control mechanisms within the religious cult, the manipulation of biblical scriptures, and the absence of support from her family and church community. Tamara’s resilience shines as she describes her fight for freedom, the traumatic impact on her mental health, and her relentless quest for personal healing and empowerment. Despite losing contact with her family, Tamara found liberation and now uses her platform to shed light on the issues of trauma, patriarchy, and misogyny. She also shares her journey of weight loss and self-discovery, showing that survival can lead to thriving. Her powerful poems and reflections underscore her unwavering spirit and commitment to helping others find their voice and freedom from abusive environments. #jezebel #unholier #healing #religion #religioustrauma #trauma #church",
      "release": "2025-07-15T04:00:00Z",
      "duration": "01:05:15",
      "explicit": false,
      "spotifyId": "4mhqE7mf7heEns0VG5Efg4",
      "appleId": 1000717277176,
      "youTubeId": "a4KAjNt4v8c",
      "subjects": [
        "Evangelicalism",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mhqE7mf7heEns0VG5Efg4",
        "apple": "https://podcasts.apple.com/podcast/lost-family-gained-freedom-the-unbelievable-price/id1800066919?i=1000717277176",
        "youtube": "https://www.youtube.com/watch?v=a4KAjNt4v8c"
      }
    },
    {
      "id": "0028b9e2-5874-4727-9f7d-dd2c37dcd775",
      "title": "Escaping the Shadows: Brad\u0027s Journey of Healing from IFB Trauma",
      "description": "In this deeply moving and powerful episode, hosts Susie and Jenny sit down with Brad, a former IFB member and pastor\u0027s kid, to delve into his harrowing experiences of abuse and his long journey towards healing. Brad shares his story of being molested by a church deacon\u0027s son, the denial of justice by his own father, and the subsequent challenges he faced growing up in such a troubling environment. He opens up about the trauma, the impact on his relationships, and how he found his path towards recovery with the support of compassionate figures in his life, including an understanding pastor and a dedicated therapist. Brad also discusses his eventual departure from the IFB and how he rebuilds his faith and finds peace. His story is not just about enduring great pain but also about finding resilience and hope. This episode is a beacon of support for survivors and a call to action for those entangled in abusive environments. Tune in to hear Brad\u0027s courageous journey and his message of healing and strength.\n\n\n\n#ReligiousTrauma #Exvangelical #Deconstruction #ChurchToo #IFB #PastorKids #SurvivorStory #ChildAbuse #HealingJourney #MentalHealthMatters #SpiritualAbuse #BetrayalTrauma #BreakingTheSilence #TraumaRecovery #UnholyTruths #FaithAfterTrauma #Advocacy",
      "release": "2025-07-08T04:00:00Z",
      "duration": "00:58:29",
      "explicit": false,
      "spotifyId": "2pIpUrANr7Dmuh4TmoCHDg",
      "appleId": 1000716270458,
      "youTubeId": "PKm0UTo90EM",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2pIpUrANr7Dmuh4TmoCHDg",
        "apple": "https://podcasts.apple.com/podcast/escaping-the-shadows-brads-journey-of-healing-from/id1800066919?i=1000716270458",
        "youtube": "https://www.youtube.com/watch?v=PKm0UTo90EM"
      }
    },
    {
      "id": "22750276-4179-413a-8c37-9cf7514b61c9",
      "title": "The SHOCKING Reality of New Beginnings Girls Academy: A Survivor Speaks Out!",
      "description": "In this episode, we delve into Samantha\u0027s powerful and heart-wrenching story at New Beginnings Girls Academy. Samantha recounts her journey from a troubled childhood, marked by familial conflicts and self-harm, through her traumatic experiences at the academy. She speaks candidly about the abuse and mistreatment she endured, the flawed educational system, her multiple attempts to escape, and the unrelenting emotional struggles she faced. Despite her suffering, Samantha\u0027s resilience shines through as she now dedicates her time to researching and raising awareness about the abusive practices in similar institutions. Join us as we hear Samantha\u0027s story of survival and her ongoing fight to shut down these harmful establishments.\n\n#NewBeginningsGirlsAcademy #TroubledTeenIndustry #SurvivorStory #InstitutionalAbuse #ChildAbuse #TeenAcademy #BoardingSchoolSurvivors #TraumaHealing #BreakingTheSilence #AbuseAwareness #MentalHealth #Resilience #Podcast #UnholierThanThou #HelpSurvivors #ShutThemDown #EscapeStory #SelfHarmAwareness",
      "release": "2025-07-01T17:00:00Z",
      "duration": "00:47:20.8940000",
      "explicit": true,
      "spotifyId": "4pLWJcnfrsX1bwkMO8plQb",
      "appleId": 1000715321589,
      "youTubeId": "6DASYndiW-o",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4pLWJcnfrsX1bwkMO8plQb",
        "apple": "https://podcasts.apple.com/podcast/the-shocking-reality-of-new-beginnings-girls/id1800066919?i=1000715321589",
        "youtube": "https://www.youtube.com/watch?v=6DASYndiW-o"
      }
    },
    {
      "id": "e2d3a474-b416-45f8-8085-30ada0085550",
      "title": "Inside the Troubled Teen Industry: Dan Engleman\u0027s Harrowing Bethel Academy Nightmare!",
      "description": "In this episode of our podcast, we are joined by Dan Engleman, a former cadet of Bethel Boys Academy. Dan shares his deeply personal and harrowing experiences from his time at the academy between 1995 and 1997. Adopted at a young age due to his biological parents\u0027 struggles with addiction, Dan details the challenges he faced in his early years, leading to his placement in Bethel Boys Academy. He recounts the severe mistreatment and violence he endured and the impact it had on his adolescent and adult life. Dan also discusses the importance of parental support and the lasting trauma from feeling abandoned. Tune in to hear Dan\u0027s story of resilience and how he and fellow survivors support each other through a dedicated Facebook group. This eye-opening conversation sheds light on the shocking realities of the troubled teen industry and the need for better alternatives and thorough research for any parents considering such programs. #BethelBoysAcademy #TroubledTeenIndustry #SurvivorStory #ChildAbuse #InstitutionalAbuse #BoardingSchoolSurvivors #TraumaHealing #Podcast #TrueCrime #YouthPrograms #ParentalWarning #Resilience #BreakingTheSilence #AbuseAwareness #TeenAcademy",
      "release": "2025-06-24T04:00:00Z",
      "duration": "01:05:30",
      "explicit": false,
      "spotifyId": "2jnYnsJ2WKOmqz91wBE4tu",
      "appleId": 1000714296637,
      "youTubeId": "N4Xqe-8kIas",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2jnYnsJ2WKOmqz91wBE4tu",
        "apple": "https://podcasts.apple.com/podcast/inside-the-troubled-teen-industry-dan-englemans/id1800066919?i=1000714296637",
        "youtube": "https://www.youtube.com/watch?v=N4Xqe-8kIas"
      }
    },
    {
      "id": "cf5974e1-bd57-460b-b5cb-efa0c71c13b1",
      "title": "Blue: Deconstructing Religion, Gender Identity, and Mental Health",
      "description": "In this powerful episode, we welcome special guest Blue to share their deeply personal and transformative story. Blue delves into their upbringing in a strict evangelical household and discusses how growing up in a religious cult setting shaped their early life experiences. This conversation explores Blue\u0027s journey through deconstructing deeply ingrained beliefs, coming to terms with their non-binary identity, and #managing dissociative identity disorder (DID). Highlights include discussions on overcoming a fear-based religious upbringing, the importance of open and accepting dialogue about gender and sexuality, and learning to love oneself amid #trauma and societal pressure. Blue\u0027s insights offer a beacon of hope and understanding for those navigating similar paths. Tune in for an enlightening and heartfelt discussion on embracing one\u0027s true self.\n\n#powerful #religion",
      "release": "2025-06-17T04:00:00Z",
      "duration": "01:17:39",
      "explicit": false,
      "spotifyId": "1dDlBsVOSmDwiZLfNTuW2w",
      "appleId": 1000713192909,
      "youTubeId": "D39dMSjifG8",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dDlBsVOSmDwiZLfNTuW2w",
        "apple": "https://podcasts.apple.com/podcast/blue-deconstructing-religion-gender-identity-and/id1800066919?i=1000713192909",
        "youtube": "https://www.youtube.com/watch?v=D39dMSjifG8"
      }
    },
    {
      "id": "f9c0918d-75af-4936-b14e-c2c28ed3d278",
      "title": "The Sobering Truth: Happiness Hill\u0027s Brainwashing \u0026 Johnna\u0027s Unbelievable Story (TTI)",
      "description": "In this emotional yet sometimes funny and light-hearted episode, we sit down with Johnna, a survivor from Happiness Hill, a troubled teen home. Johnna shares her harrowing experience of growing up in an abusive household, dealing with undiagnosed ADHD, and the challenges she faced at Happiness Hill. From being misdiagnosed and unjustly labeled as a drug addict to enduring horrific abuse and strict religious oppression, Johnna’s story is a powerful testament to resilience. She discusses the psychological trauma, the rigid rules, and the forced labor that the girls at Happiness Hill endured. Now pursuing a career in psychiatric nursing, Johnna is dedicated to helping others by conducting an in-depth survey on the impacts of institutionalization on mental health. This episode is a deeply moving exploration of survival, accountability, and the journey toward healing. #trauma #sobriety #religion #tti #religioustrauma",
      "release": "2025-06-10T04:00:00Z",
      "duration": "01:03:15",
      "explicit": false,
      "spotifyId": "1aBSPLjGafs5PX6mlRCOIy",
      "appleId": 1000712194219,
      "youTubeId": "hoeIP-xQw7w",
      "subjects": [
        "Cult Psychology",
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1aBSPLjGafs5PX6mlRCOIy",
        "apple": "https://podcasts.apple.com/podcast/the-sobering-truth-happiness-hills-brainwashing/id1800066919?i=1000712194219",
        "youtube": "https://www.youtube.com/watch?v=hoeIP-xQw7w"
      }
    },
    {
      "id": "d0a0e3af-656b-4d42-a3cf-4c08568e1f0e",
      "title": "Church Life: How the Sausage is REALLY Made (Pastor\u0027s Kids Spill ALL!)",
      "description": "You think you know church life? THINK AGAIN!🤫 Ever wonder \u0022how the sausage is REALLY made\u0022 behind the scenes? This week on Unholier Than Thou, Jenny and Susie — both pastor\u0027s kids themselves — are spilling ALL the tea on the unspoken, unfiltered realities of growing up in ministry! 🤯\n \nGet ready for eye-opening stories of chaos, drama, and shocking hypocrisy that regular churchgoers never see. From unpaid ministry roles to cutthroat church politics, secret scandals, and the exhausting pressure of always putting on a \u0022perfect face,\u0022 we\u0027re pulling back the curtain on the darker side of church life.\n\nJoin us for raw personal traumas, unexpected hilarious anecdotes, and a completely fresh perspective on what truly happens when the cameras are off and the sermon is over. This isn\u0027t your grandma\u0027s Sunday school!\n\nPrepare to have your perception of the pulpit forever changed!\n\n#ChurchExposed #PastorKids #PKLife #UnholyTruths #ChurchScandals #ReligiousTrauma #BehindTheScenes #Hypocrisy #MinistryLife #Christianity #Deconstruction",
      "release": "2025-06-03T04:00:00Z",
      "duration": "01:01:40",
      "explicit": false,
      "spotifyId": "6oSaJi2P1ZPhLqlxQ95Oi3",
      "appleId": 1000710962908,
      "youTubeId": "sC0RskeTrcU",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6oSaJi2P1ZPhLqlxQ95Oi3",
        "apple": "https://podcasts.apple.com/podcast/church-life-how-the-sausage-is-really-made-pastors/id1800066919?i=1000710962908",
        "youtube": "https://www.youtube.com/watch?v=sC0RskeTrcU"
      }
    },
    {
      "id": "559d6430-ef6b-4a33-85cb-b696fa5a3d1f",
      "title": "From Darkness to Light: Dan Edwards\u0027 Inspirational Journey of Survival \u0026 Redemption",
      "description": "In this emotionally riveting episode of our podcast, we sit down with Dan Edwards, a survivor of the Bethal Boys Academy under Lester Roll Off Enterprises. Dan sheds light on his harrowing experiences, including the trauma he faced at a young age and the extreme environment of the academy. He details how severe punishments, psychological suffering, and forced labor shaped his early life, leading him down a dark path filled with anger, hate, and crime. However, Dan\u0027s journey didn\u0027t end there. After hitting rock bottom, he found the strength to turn his life around, becoming a pastor and establishing HFS Ministry, a nonprofit organization dedicated to helping veterans, addicts, and the homeless. Join us as we uncover Dan\u0027s remarkable transformation from a life of despair to one of hope and service. #Survival #Redemption #Inspiration #Podcast #IBLP #BethalBoysAcademy #ChildAbuse #healingjourney  #nonprofit  #Support #faith",
      "release": "2025-05-27T04:00:00Z",
      "duration": "00:56:09",
      "explicit": false,
      "spotifyId": "25K2QakQFRzQWOFSVTs6KQ",
      "appleId": 1000710036988,
      "youTubeId": "w9knShIAEAc",
      "subjects": [
        "Troubled Teen Industry",
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/25K2QakQFRzQWOFSVTs6KQ",
        "apple": "https://podcasts.apple.com/podcast/from-darkness-to-light-dan-edwards-inspirational-journey/id1800066919?i=1000710036988",
        "youtube": "https://www.youtube.com/watch?v=w9knShIAEAc"
      }
    },
    {
      "id": "bf4379cd-9634-487d-a70c-108dea169653",
      "title": "Sacred Scars: When the Hand That Feeds Also Hurts",
      "description": "In this powerful and emotional episode, we welcome Dave, a popular TikTok content creator, as he shares his raw and inspirational life story. Raised Baptist by a preacher father, Dave recounts his childhood filled with religious zeal, parental neglect, and severe abuse, including molestation by a man living in his home. Despite these hardships, Dave\u0027s resilience shines through as he navigates his complex relationship with faith, which ultimately led him from Christianity to becoming an outspoken atheist. He also discusses his ongoing work in the religious trauma community online, particularly through TikTok, where he helps others who have suffered similar fates. This episode is a deep dive into how one man\u0027s traumatic past has fueled his mission to advocate for others and shed light on the darker side of religious institutions. Join us for this heartfelt conversation, and don\u0027t forget to like, comment, and subscribe. #preacher #abuser #religion #taylorswift #Trauma #sacred #sacredscars #tiktok #FPY\n\nhttps://theprocessofhealing.com/",
      "release": "2025-05-20T04:00:00Z",
      "duration": "00:53:02",
      "explicit": false,
      "spotifyId": "0P4V1DCQXa2LBOs514hMGa",
      "appleId": 1000709087424,
      "youTubeId": "tdjDFaJlQPs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0P4V1DCQXa2LBOs514hMGa",
        "apple": "https://podcasts.apple.com/podcast/sacred-scars-when-the-hand-that-feeds-also-hurts/id1800066919?i=1000709087424",
        "youtube": "https://www.youtube.com/watch?v=tdjDFaJlQPs"
      }
    },
    {
      "id": "16a9e7a2-05bd-4dd6-a79e-a08d9bd45ad2",
      "title": "TikTok Live: Empowering Survivors: Trey\u0027s Law and the Journey to Justice",
      "description": "Join us for a powerful and heartfelt discussion that David \u0026 Susie had on a TikTok LIVE where we delve into the significance of Trey\u0027s Law and the personal story of a survivor named Suzanne. Recently featured in a video testimony for the Texas Senate, Suzanne shares the emotional and challenging journey of advocating for legal reform to support survivors of sexual assault. The conversation covers the impact of statute limitations, the role of NDAs in sexual assault cases, and the importance of using one\u0027s voice to create change. Suzanne\u0027s deeply personal recount of her childhood trauma and her pursuit of justice serves as a beacon of hope and empowerment for fellow survivors. Tune in to learn more about Trey\u0027s Law and the ongoing fight for the rights of survivors.\n#survivors #tiktok #youtube #live\nTiktok: theprocess_podcast\nhttps://treyslaw.org/",
      "release": "2025-05-14T18:00:00Z",
      "duration": "01:21:26",
      "explicit": false,
      "spotifyId": "2WtEQcgERXb6CfDeVhChuo",
      "appleId": 1000708492545,
      "youTubeId": "PjvFc2N7HoI",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2WtEQcgERXb6CfDeVhChuo",
        "apple": "https://podcasts.apple.com/podcast/tiktok-live-empowering-survivors-treys-law-and/id1800066919?i=1000708492545",
        "youtube": "https://www.youtube.com/watch?v=PjvFc2N7HoI"
      }
    },
    {
      "id": "c745f15b-a3a0-411f-8857-1fd527031f69",
      "title": "Under The Umbrella Rebellion: Dee\u0027s Harrowing Journey Through Cult \u0026 Control",
      "description": "In this week\u0027s episode, we are joined by the incredible Dee from The Umbrella Rebellion Podcast. Dee shares her personal journey from being involved in the Institute in Basic Life Principles (IBLP) under Bill Gothard\u0027s cult, through her struggle with an abusive marriage, to ultimately finding her path to freedom and healing. Dee\u0027s story covers her upbringing in a Catholic family, the transition to a Baptist church, and her involvement with both the Independent Fundamental Baptist (IFB) church and the military. She also speaks extensively on the dangers of extreme fundamentalist teachings, her experiences within these groups, and the challenges she faced along the way. Join us as Dee reflects on her empowering journey, offering resources and hope to those in similar situations. Don\u0027t miss her insights on breaking free from oppressive systems, building a supportive community, and finding your own path to healing. #CultSurvivor #ReligiousTrauma #HealingJourney #UmbrellaRebellion #DeeStory #PodcastGuest #FreedomFromOppression",
      "release": "2025-05-13T15:00:00Z",
      "duration": "01:33:57.7730000",
      "explicit": true,
      "spotifyId": "5kUkkk3vWDEoB37e7Sxece",
      "appleId": 1000708335888,
      "youTubeId": "tI6Zsm6KcAE",
      "subjects": [
        "Institute In Basic Life Principles",
        "Independent Fundamentalist Baptist",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5kUkkk3vWDEoB37e7Sxece",
        "apple": "https://podcasts.apple.com/podcast/under-the-umbrella-rebellion-dees-harrowing-journey/id1800066919?i=1000708335888",
        "youtube": "https://www.youtube.com/watch?v=tI6Zsm6KcAE"
      }
    },
    {
      "id": "f5ea8ca8-46cc-4562-9c38-f7e240f63715",
      "title": "Unpacking Cult Dynamics: The ABCs of Manipulative Groups",
      "description": "In this episode of the \u0027Unholier Than Thou\u0027 podcast, Susie and Jenny dive into the intricacies of cult dynamics and their shared experiences growing up in a manipulative religious environment. They discuss terminology like \u0027love bombing,\u0027 the inconsistencies they witnessed within their communities, the tactics used to control members, and the personal impacts of these environments. The conversation also extends to the broader implications for people questioning their involvement in potentially cult-like groups. Tune in for a candid discussion revealing the often hidden aspects of cult practices and their ripple effects on individuals.\n#cult #religion #exposing",
      "release": "2025-05-06T04:00:00Z",
      "duration": "00:36:21",
      "explicit": false,
      "spotifyId": "7BREHwoGEZVzIPG0OVguBB",
      "appleId": 1000706471456,
      "youTubeId": "7pUD3c1xHnU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7BREHwoGEZVzIPG0OVguBB",
        "apple": "https://podcasts.apple.com/podcast/unpacking-cult-dynamics-the-abcs-of-manipulative-groups/id1800066919?i=1000706471456",
        "youtube": "https://www.youtube.com/watch?v=7pUD3c1xHnU"
      }
    },
    {
      "id": "d2214a8f-9d03-4c61-8dd3-db8f4da10f24",
      "title": "Escaping the Mormon Church: Becky\u0027s Journey of Overcoming Religious Trauma",
      "description": "In this powerful and emotional episode, we welcome Becky, a former member of the Mormon Church, to share her deeply personal experiences and the lasting impact of religious trauma. Becky dives into her upbringing within the church, her struggles with purity culture, and the emotional toll of sexual abuse. She candidly discusses the secrets and controversial practices of the church, the challenges she faced, and her journey towards healing and self-acceptance. Join us as Becky offers insights into her deconstruction process and the path to finding her true self beyond the confines of organized religion. This conversation is both eye-opening and inspirational for anyone grappling with similar experiences or seeking understanding and support.",
      "release": "2025-04-29T04:00:00Z",
      "duration": "01:16:25",
      "explicit": false,
      "spotifyId": "7chKnCfeCs9LMlq3w82R8K",
      "appleId": 1000705357921,
      "youTubeId": "X4hIuX_ruus",
      "subjects": [
        "Cult Recovery",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7chKnCfeCs9LMlq3w82R8K",
        "apple": "https://podcasts.apple.com/podcast/escaping-the-mormon-church-beckys-journey-of/id1800066919?i=1000705357921",
        "youtube": "https://www.youtube.com/watch?v=X4hIuX_ruus"
      }
    },
    {
      "id": "e20fff7f-c170-4c20-87e0-bdd1db1ceb0b",
      "title": "Eric Skwarczynski from Preacher Boys: From Fundamentalism to AdvocacyEpisode",
      "description": "In this episode, we sit down with Eric Skwarczynski, the creator of the Preacher Boys podcast. Eric shares his journey growing up in the Independent Fundamental Baptist (IFB) movement, his experiences of finding faith and disillusionment, and the pivotal moments that led him to start his podcast focused on #exposing abuses within the IFB community. We discuss the complex and emotional aspects of deconstructing fundamentalist beliefs, the impact of the \u0027Let Us Pray\u0027 documentary, and the broader cultural implications of these stories. Join us for this in-depth conversation filled with emotional insights, personal anecdotes, and a look into the power of survivor-focused storytelling. #storyteller #podcast  #preacherboyspodcast\n\nhttps://www.youtube.com/@PreacherBoys",
      "release": "2025-04-22T04:00:00Z",
      "duration": "00:57:08",
      "explicit": false,
      "spotifyId": "4H1nzrby2QiueZ2fBxg3zi",
      "appleId": 1000704403627,
      "youTubeId": "xXPOiFzozYU",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4H1nzrby2QiueZ2fBxg3zi",
        "apple": "https://podcasts.apple.com/podcast/eric-skwarczynski-from-preacher-boys-from-fundamentalism/id1800066919?i=1000704403627",
        "youtube": "https://www.youtube.com/watch?v=xXPOiFzozYU"
      }
    },
    {
      "id": "ecdd2f45-ed14-4da2-97bc-dfcd0ee78a7b",
      "title": "Purity Culture\u0027s Dirty Secrets: Hypocrisy in the Church Exposed",
      "description": "Welcome to \u0027Unholier,\u0027 our podcast on the pervasive influence of religious indoctrination and cult-like judgments. In this episode, it\u0027s just us delving deep into the concept of Purity Culture. We discuss how it impacts not just church visits or Bible reading but seeps into every facet of life, especially for women raised in specific religious environments like the Independent Fundamental Baptist (IFB) church. We recount personal stories and examine the oppressive nature of Purity Culture, its expectations, and its long-lasting effects on relationships and self-worth. Join us for an eye-opening discussion filled with humor, candid experiences, and even some surprising revelations about noted figures like Joshua Harris. Perfect for anyone looking to understand the genuine implications of growing up in such restrictive environments and seeking a more balanced perspective. Subscribe for more conversations about religious indoctrination and its impact on our lives. #UncoverTheTruth #PurityCulture",
      "release": "2025-04-15T04:00:00Z",
      "duration": "01:02:36",
      "explicit": false,
      "spotifyId": "7qq79aEmwzKgM4KbMlIw7a",
      "appleId": 1000703549217,
      "youTubeId": "F_9ApSftV2Y",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qq79aEmwzKgM4KbMlIw7a",
        "apple": "https://podcasts.apple.com/podcast/purity-cultures-dirty-secrets-hypocrisy-in-the-church/id1800066919?i=1000703549217",
        "youtube": "https://www.youtube.com/watch?v=F_9ApSftV2Y"
      }
    },
    {
      "id": "4b4166cc-f88f-45ff-99bf-958b83ca8152",
      "title": "Rescued from Isolation: John Moody\u0027s Fight for Justice After Bethel Boys Academy Horrors",
      "description": "In this episode, hosts Susie and Jenny sit down with John Moody, who recounts his traumatic experiences at the Bethel Boys Academy. John shares his backstory of being sent to the academy at the age of 12 due to behavioral issues and outlines the severe abuse and neglect he faced there, including physical violence, forced labor, and emotional manipulation. He details his resilience, the impact of these experiences on his later life, and the eventual reunion with other survivors of Bethel. The conversation also touches on broader issues within the troubled teen industry and the lack of oversight for such facilities.",
      "release": "2025-04-08T04:00:00Z",
      "duration": "00:58:09",
      "explicit": false,
      "spotifyId": "6X9DqxOE1EqFUN0jRu3EBB",
      "appleId": 1000702639043,
      "youTubeId": "iumLd6sCXWI",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6X9DqxOE1EqFUN0jRu3EBB",
        "apple": "https://podcasts.apple.com/podcast/rescued-from-isolation-john-moodys-fight-for-justice/id1800066919?i=1000702639043",
        "youtube": "https://www.youtube.com/watch?v=iumLd6sCXWI"
      }
    },
    {
      "id": "0cd6ac30-96c6-44f6-9d42-93123d05b9d0",
      "title": "They Tried to Silence Her: Sabrina\u0027s Harrowing TTI \u0026 Adoption Story",
      "description": "In this episode, hosts Susie and Jenny welcome Sabrina, a survivor of the troubled teen industry and abusive adoption practices. Sabrina shares her harrowing experiences in multiple troubled teen facilities and the abuse she faced. She also delves into her advocacy work, including speaking before the Senate Finance Committee and collaborating with Paris Hilton\u0027s 1111 Media, aiming to reform the way vulnerable children are treated. Sabrina recounts her personal journey of reconnecting with her siblings, finding her biological family, and her efforts to break the cycle of abuse by being a positive and engaged parent. Her story highlights resilience, courage, and the importance of ongoing advocacy.\n#TroubledTeenIndustry #TTISurvivors #AdoptionAbuse #ReformTTI #BreakingCodeSilence #ChildAdvocacy #SurvivorStories #MentalHealthAwareness #ParisHilton1111Media #UnholierThanThou",
      "release": "2025-04-01T04:00:00Z",
      "duration": "01:03:46",
      "explicit": false,
      "spotifyId": "54O6eATDkUZwPqG0EirSeZ",
      "appleId": 1000701679312,
      "youTubeId": "-9wXk4hpI2g",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/54O6eATDkUZwPqG0EirSeZ",
        "apple": "https://podcasts.apple.com/podcast/they-tried-to-silence-her-sabrinas-harrowing-tti-adoption/id1800066919?i=1000701679312",
        "youtube": "https://www.youtube.com/watch?v=-9wXk4hpI2g"
      }
    },
    {
      "id": "3db2befe-4374-480e-8f97-be8227f4f281",
      "title": "Kidnapped, Abused, Escaped. Nate Dunn Breaks his Silence on Troubled Teen Industry",
      "description": "In this powerful episode, hosts Susie and Jenny sit down with Nate Dunn, who shares his harrowing experiences within the troubled teen industry. Nate delves into his early life trauma, including an abduction at seven years old, and his time at abusive facilities like Victory Ranch and Bethel Boys Academy. Despite years of suffering and subsequent struggles with addiction and incarceration, Nate reveals his turning point towards recovery and the importance of support networks. This emotional and inspiring conversation highlights the resilience of the human spirit and the critical need for awareness and reform in the treatment of troubled youth. #Podcast #TrueStory #troubledteenindustry #tti #survivor",
      "release": "2025-03-25T04:00:00Z",
      "duration": "01:22:20",
      "explicit": false,
      "spotifyId": "06tt1Ko7a0i9ldzoJvUkil",
      "appleId": 1000700697895,
      "youTubeId": "pIbV9c3GdQc",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/06tt1Ko7a0i9ldzoJvUkil",
        "apple": "https://podcasts.apple.com/podcast/kidnapped-abused-escaped-nate-dunn-breaks-his-silence/id1800066919?i=1000700697895",
        "youtube": "https://www.youtube.com/watch?v=pIbV9c3GdQc"
      }
    },
    {
      "id": "d165118f-b894-4afb-9b65-51bc711ef568",
      "title": "From Public Shaming to Freedom: Jenny\u0027s Journey Out of the IFB\u0027s Grip",
      "description": "In this episode, the host welcomes Jenny as she shares her harrowing journey growing up in the Independent Fundamental Baptist (IFB) movement. Jenny\u0027s story details her family\u0027s deep roots in IFB, the strict and oppressive rules she faced, and the challenges of living under a legalistic and controlling environment. She recounts traumatic experiences, including a public shaming at youth camp, and a disastrous, abusive marriage arranged within the IFB framework. Despite the adversity, Jenny discusses how she sought therapy, found her confidence and sexuality, and eventually escaped the confines of abuse, rebuilding her life. The conversation also touches upon her current views on religion, her relationship with God outside of organized religion, and her path to greater self-awareness and healing. Finally, the episode ends on a lighter note with rapid-fire questions about her newfound discoveries and experiences after leaving the IFB.",
      "release": "2025-03-18T04:00:00Z",
      "duration": "01:11:36",
      "explicit": false,
      "spotifyId": "2UZollA5rkK3k7ckpY12pU",
      "appleId": 1000699591580,
      "youTubeId": "fAjVE9V2AvM",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2UZollA5rkK3k7ckpY12pU",
        "apple": "https://podcasts.apple.com/podcast/from-public-shaming-to-freedom-jennys-journey-out-of/id1800066919?i=1000699591580",
        "youtube": "https://www.youtube.com/watch?v=fAjVE9V2AvM"
      }
    },
    {
      "id": "424f0a7b-29b8-4c18-9004-eaf0f333f07c",
      "title": "They Tried to Break Her: Susie Spencer\u0027s Harrowing TTI Story \u0026 the Fight for Justice",
      "description": "In this episode, we delve deep into the complex relationship between justice and forgiveness, focusing on how these concepts are often manipulated within the legal and religious systems. We explore the pressures victims face to forgive their perpetrators and the consequences of such pressures. Cases within the Southern Baptist Convention highlight the misuse of forgiveness to silence victims and protect offenders. The episode also touches on personal experiences, societal implications, and the true, freeing essence of forgiveness.",
      "release": "2025-03-11T04:00:00Z",
      "duration": "00:37:28",
      "explicit": false,
      "spotifyId": "3oArsn1ur026CEGCsGDAMy",
      "appleId": 1000698684477,
      "youTubeId": "9xE4gMg05n4",
      "subjects": [
        "Troubled Teen Industry",
        "Southern Baptist Convention"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3oArsn1ur026CEGCsGDAMy",
        "apple": "https://podcasts.apple.com/podcast/they-tried-to-break-her-susie-spencers-harrowing-tti/id1800066919?i=1000698684477",
        "youtube": "https://www.youtube.com/watch?v=9xE4gMg05n4"
      }
    },
    {
      "id": "a9c94b5a-f209-477b-8e6c-c5783d7c1dc6",
      "title": "Unholier Than Thou: The Secrets They Tried to Bury (And Why We\u0027re Exposing Them)",
      "description": "Welcome to the explosive debut of Unholier Than Thou, a new podcast from the Surviving Network! In this premiere episode, host David Keck from The Process of Healing introduces you to Jenny Smith and Susie Spencer, the fearless voices behind this groundbreaking series. We\u0027re pulling back the curtain on the hidden horrors of the IFB, the Troubled Teen Industry (TTI), and other religious cults, revealing the secrets they desperately tried to bury. Hear firsthand accounts of survival, resilience, and the unwavering pursuit of truth. Get ready to challenge everything you thought you knew. This is more than a podcast; it\u0027s a revolution. #UnholierThanThou #ReligiousTrauma #TTI #Exvangelical #CultRecovery #SurvivorStories",
      "release": "2025-03-04T05:00:00Z",
      "duration": "00:51:38",
      "explicit": false,
      "spotifyId": "5XyzPJQpB6sORwPF6sDZjI",
      "appleId": 1000697733500,
      "youTubeId": "JLIQcH_zIbc",
      "subjects": [
        "Troubled Teen Industry",
        "Evangelicalism",
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5XyzPJQpB6sORwPF6sDZjI",
        "apple": "https://podcasts.apple.com/podcast/unholier-than-thou-the-secrets-they-tried-to-bury-and/id1800066919?i=1000697733500",
        "youtube": "https://www.youtube.com/watch?v=JLIQcH_zIbc"
      }
    }
  ]
}