{
  "id": "bbe988a7-f737-4f72-a204-127eddf63563",
  "name": "Uniquely Female Troubles Leslie Wells",
  "youTubeChannelId": "UCm4bbxhu2etWRr4q80iQcdg",
  "episodes": [
    {
      "id": "f889fb9c-55ae-4a40-93bf-1b1b2865fdbd",
      "title": "Cognitive Dissonance in the Context of Cults",
      "description": "In my previous video, outlining the terrible things cult leader, William Branham, said about women, I wanted to tell you how it felt to sit in church and hear those things said, as a woman.  But I couldn\u0027t.  I realized I couldn\u0027t  remember having any feelings at all--not anger, not shame, not rage, not hurt, not sadness.  And I didn\u0027t have to wonder why.  It is because of cognitive dissonance, a process our minds go through when we are confronted with information that contradicts what we already believe.  This video explains what cognitive dissonance is, how it works, and how it operates in the context of religious cults.\n\nhttps://youtu.be/jk1NnnNHz-4?si=6osoiNvtQ1GMygI-   Here is a link to a video that explains what this channel is about\n\nhttps://youtu.be/jIXJKecXwRA?si=fRmysV_Gqhn2tuSL   Here is a link to the video I am referring to in this video, the one that talks about William Branham having to struggle against the desire to kill women\n\nhttps://youtube.com/@LeavingtheMessage?si=Uzuibc4S0ijPX-nZ   Here is a link to the Youtube channel, Leaving the Message, the best place on the internet to find information about the cult following of William Branham, The End Time Message, the cult I was in from age 16 to 44.\n\nHere are some Amazon Links to the books I mentioned in the video.  If you buy a book through one of these links, I will receive a small commision but it will not affect the price you pay.\n\nhttps://amzn.to/3RD9sJQ  This is to the book, Combatting Cult Mind Control: The Guide to Protection, Rescue, and Recovery From Destructive Cults by Dr. Steven Hassan\n\nhttps://amzn.to/4ldzAbP  This link to the book by Robert Jay Lifton called Thought Reform and the Psychology of Totalism: A Study of Brainwashing in China\n\nhttps://amzn.to/44cnb1K  This link is to the book, When Prophecy Fails: A Social and Psychological Study of a Modern Group That Predicted the Destruction of the World by Leon Festinger and others.\n\nhttps://amzn.to/3XOn1K6  This link to another book by Leon Festinger, called A Theory of Cognitive Dissonance",
      "release": "2025-04-07T00:00:07Z",
      "duration": "00:41:29",
      "explicit": false,
      "youTubeId": "8F9XBzSu5Hk",
      "subjects": [
        "Cult Psychology",
        "William M. Branham"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8F9XBzSu5Hk"
      }
    },
    {
      "id": "6d726406-ec9a-4a1e-8c8b-1b6fd1c65cde",
      "title": "William Branham--MY former cult leader wanted to kill women.  Part 1",
      "description": "William Branham, who died in 1965, is still the central figure of a cult called The End Time Message.  He had a lot to say about women--expressing his hostility and disdain for us.  He talked about struggling with the urge to kill us, among many other things.  I\u0027ve included some links to a Youtube channel exposing the cult, as well as books on Amazon exposing this false prophet.\n\nhttps://youtube.com/@leavingthemessage?si=G5_gUczZmzMpJ4R2  Here is a link to the Youtube channel, Leaving the Message, which exposes this cult and William Branham.  \n\nhttps://amzn.to/4hB1RWT  This is a link to a book on Amazon called Preacher Behind the White Hoods by John Collins that exposes William Branham.\n\nhttps://amzn.to/4kPsNFd  This is a link to a book on Amazon called Come Out of Her My People by Charles Paisley, a former message minister.\n\nhttps://amzn.to/4kXdrP5   This is a link to a book on Amazon called Under the Halo by Rod Bergen, another book that exposes William Branham\n\nhttps://amzn.to/4kXdOcr   This is a link to a book on Amazon called Investigating William Branham: The Unfolding of Plagiarisms and Errors by Bryan Smalls\n\nIf you buy any of these books through these links, I will receive a small commission, but it will not increase the price you pay for the book.",
      "release": "2025-03-23T10:46:11Z",
      "duration": "00:25:01",
      "explicit": false,
      "youTubeId": "jIXJKecXwRA",
      "subjects": [
        "William M. Branham"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jIXJKecXwRA"
      }
    }
  ]
}