{
  "id": "6cc53c2a-7214-4486-9cbc-1d76a9512c8c",
  "name": "Unleash Your Inner Creative with Lauren LoGrasso (A Creativity Podcast)",
  "spotifyId": "7aHGGn6Jvfd3p1oYS2dESh",
  "appleId": 1451719426,
  "episodes": [
    {
      "id": "2bd30b76-7f1f-4610-98d3-501607effeaa",
      "title": "🙏🧎‍♀️Leaving Mormonism: Finding Yourself, Community \u0026 Faith After High-Control Groups w/ Coach, Sadie Blasucci",
      "description": "This week we continue to take a tour down memory lane with one of the best and most-listened to Unleash episodes of all time! It is with Sadie Blasucci--she shares her journey of making an extremely creative decision: leaving the religion that your parents and community have told you is the \u0022right\u0022 one. For her, that was Mormonism. We need to use our creativity in ALL aspects of life, not just work. Questioning the script that has been given to you about life, God, love--that\u0027s part of it. Tune in for a fascinating conversation and for tips on finding yourself and spirituality when you leave the religious and/or cultural framework you were raised in. Original Description: On The Guest: Sadie Blasucci is a former Mormon and Faith Transition Coach that helps people acclimate after leaving the church. She’s also the co-host of Missionary Podcast and co-author of a Faith Crisis Guided Journal titled My Authentic Faith. Her focus is to teach people to find faith, trust, and happiness within themselves. From this conversation you’ll learn: The origin of Mormonism \u0026 other interesting Mormon facts The process of unlearning childhood traumas How to find happiness outside of your spiritual community and take responsibility for it How habit swapping can help in transitional phases The purpose of secrecy in Mormonism The difference between organized religion and finding your own spirituality How to process Spiritual grieving The idea of worthiness in Mormonism Tools for faith transitioning And so much more! Faith Transition Coaching Services https://sadielane.podia.com/ Faith Crisis Guided Journal My Authentic Faith \u0026#x1f399;️ Connect \u0026 Work with Me: If you love this episode and want personalized support to break through creative blocks, build confidence, and finally share your work with the world, I’d love to help. As a creative coach, I work with artists, entrepreneurs, and multi-passionate creatives to unleash their inner voice and build a thriving creative life from a place of self-love. ✨ Want to work together? Email me at Lauren.LoGrasso@gmail.com or visit https://www.laurenlograsso.com/contact/ to book a free 15-minute discovery call. Remember to subscribe/follow the show on Apple Podcasts, Spotify or wherever you get your pods. Please leave us a rating and review- it helps SO much in getting the show out there. And tell a friend about the show- podcasts are very personal and tend to be spread person to person. If this show helped you or made you smile, share the love :) Follow the show: @unleashyourinnercreative Follow me: @LaurenLoGrasso Hosted by Ausha. See ausha.co/privacy-policy for more information.",
      "release": "2025-05-14T08:11:00Z",
      "duration": "01:07:40.2170000",
      "explicit": false,
      "spotifyId": "4BGWESER8dUutKdrjHgM3B",
      "appleId": 1000708427725,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BGWESER8dUutKdrjHgM3B",
        "apple": "https://podcasts.apple.com/podcast/leaving-mormonism-finding-yourself-community-faith/id1451719426?i=1000708427725"
      }
    }
  ]
}