{
  "id": "ef2dddb4-ef92-4474-a7fc-6c5da2758714",
  "name": "Unlettered And Ordinary",
  "youTubeChannelId": "UCm4fh6PgzPT-CZp7cWmGViQ",
  "episodes": [
    {
      "id": "3cf8de65-c53b-41ec-908a-e61e204a1861",
      "title": "Disfellowshipped From Jehovah\u0027s Witnesses. I guess they didn\u0027t like my letter.",
      "description": "I wrote a letter to my congregation asking to be removed as one of Jehovah\u0027s Witnesses. I gave them the scriptural grounds on why I was making my decision. This is a link to the letter I wrote.     https://youtu.be/YWqNBZaKN2A  \nThey did in fact disfellowship me but they never contacted me to discuss anything or to at least rebuke my scriptural claims of Christ.",
      "release": "2018-09-14T00:22:38Z",
      "duration": "00:14:52",
      "explicit": false,
      "youTubeId": "PgsJKULd2zg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PgsJKULd2zg"
      }
    },
    {
      "id": "4ca75519-d3c1-4c8c-aa4b-343daabe133e",
      "title": "My Letter To Jehovah\u0027s Witness Congregation",
      "description": "3 years ago God saved me from a lifetime of sin and unbelief. As my faith and knowledge of God grew I no longer could continue in this man made organization that denies the basic fundamentals of Christ. I know that when I am disfellowshipped no one will hear the truth as to why. For this reason I have created this short vid to send to my friends so that they will know why. I love my JW friends and it is my prayer that they would just take the time to read scripture with their eyes open. And think about what the organization is trying to sell them as salvation. \nGalatians 1:8 But even if we or an angel from heaven should preach to you a gospel contrary to the one we preached to you, let him be accursed.\nHere is a copy of the letter that I mailed them.\n\nDear friends. I was writing you to let you know I was wanting to be taken off of the rolls of being a Jehovah\u0027s Witness. I want to explain my decision to you in detail though. Most of it has to do with the person and work of Jesus Christ that I have found in scripture that does not agree with most of Jehovah\u0027s Witness theology. For this reason I can no longer in any way honestly identify myself with Jehovah\u0027s Witnesses. Let me say first off that I do not consider you my enemy, our enemy is not flesh and blood, but powers of evil in high places. Ephesians 6:12 My hope is that you would read this and take the time to see this for yourself. \nJesus said in John 8:24 \u0022Unless you believe that I AM He, you will die in your sins.\u0022 Believing in everything that Jesus is, His completed work and His preeminence is absolutely necessary for eternal life. Jesus is the way, the truth and the life. John 14:6. Jesus is the Alpha and Omega, the beginning and the end the first and the last. Revelation 22:13. Jesus is the only way to the Father. John 14:6. Jesus is equal to the Father John 5:18. Jesus is creator, sustainer and the preeminent over all things. Colossians 1:16-20 Jesus is God. John 1:1 He is the author and finisher of our faith Hebrews 12:2 Whoever confesses the Son has the Father also 1 John 2:23 Salvation is found in no one else Acts 4:12 \nJesus also claimed to have the omni attributes of God in John 14:12-14. He said \u0022ask anything in my name and I will do it.\u0022 He is saying that He will be able to hear and answer all prayer from believers, He was presupposing that He would know who is praying, where, and what they are asking in His name. He would have to be omniscient, omnipresent, and omnipotent. He goes on in verse 23 \u0022Anyone who loves me will obey my teaching. My father will love them, and WE will come to them and make OUR home with them.\u0022 Here he is claiming to be omnipresent because he will dwell with the believer just as the Father dwells with the believer. Also by saying this He believed that He was coequal with the Father in essence and nature. No created being can utter these words. \nThe organization has spent so much time and energy disqualifying who Christ is. Not that they do disqualify Him, but their efforts have brought them to the point of changing verses specifically to support their theology. I won\u0027t go into details but John 1:1 has been changed. The word \u0022other\u0022 was added at least 4 times in Colossians 1 that does not appear in the original text. I could go on but I will just stop there. \nJesus is in every way equal , eternal, and to be honored just as the Father is honored. Whoever has the Son has life 1 John 5:12  and whoever believes in the Son has eternal life. John 3:36 In Him was life John 1:4 and He gives eternal life to whoever He pleases John 5:21\nThere is so much more that I would like to share with you but the only other thing that comes to mind right now is what is echoed by the Apostle Paul. \u0022I consider everything a loss because of the surpassing worth of knowing Christ Jesus my Lord, for whose sake I have lost all things. I consider them garbage, that I may gain Christ\u0022 Philippians 3:8\nAt first I wasn\u0027t going to include this, but I have included some research that I did comparing the bible with JW publications. The results speak for themselves. \nIn closing I just want to say Jesus is Lord! And as the hymn says \u0022On Christ the solid rock I stand all other ground is sinking sand!\u0022\nI beg you friends. Repent. Please. See Christ for who He really is. Eternal Father, Mighty God, Wonderful Counselor, Prince of peace. Creator, sustainer, author and finisher, and the only way of salvation. \nI John 2:22-25 \u0022Who is the liar but he who denies that Jesus is the Christ? This is the antichrist, he who denies the father and the Son. No one who denies the Son has the Father. Whoever confesses the Son has the Father also. Let what you heard from the beginning abide in you. If what you heard from the beginning abides in you, then you too will abide in the Son and in the Father. And this is the promise that He made to us- eternal life.\u0022",
      "release": "2018-08-26T21:58:33Z",
      "duration": "00:12:50",
      "explicit": false,
      "youTubeId": "YWqNBZaKN2A",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YWqNBZaKN2A"
      }
    }
  ]
}