{
  "_ts": 0,
  "id": "440c4fe5-eb01-4203-a86e-f9bec7ab8b07",
  "name": "Unpack Cultage",
  "youTubeChannelId": "UCT3d2lyeHDWMXUMiDMHH_gA",
  "episodes": [
    {
      "id": "2b672aed-7096-4070-8979-d668f8550514",
      "title": "Superstition \u0026 Spiritual Abuse - #3 of Logical Fallacies Series",
      "description": "Have you ever considered if your thinking is influenced by plain old superstition? Claiming to know \u0022why\u0022 good or bad things happen, is often weaponized by spiritually dangerous people. Come and unpack this cultage with me!",
      "release": "2025-01-20T19:13:57Z",
      "duration": "00:17:21",
      "explicit": false,
      "youTubeId": "XzQFhym9naY",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XzQFhym9naY"
      }
    },
    {
      "id": "22f9c940-beee-40c3-a856-ada04f0daf2d",
      "title": "The Straw Man \u0026amp; Spiritual Abuse- #2 of Logical Fallacies Series",
      "description": "Let\u0027s unpack how using the Straw Man maneuver entraps vulnerable people and keeps them from making free choices.",
      "release": "2025-01-11T23:50:58Z",
      "duration": "00:17:08",
      "explicit": false,
      "youTubeId": "HYsjT3Q4h2k",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HYsjT3Q4h2k"
      }
    },
    {
      "id": "b3ff7f34-8c34-4335-8226-bde9c281c861",
      "title": "Ad Hominem \u0026 Spiritual Abuse - #1 of Logical Fallacies Series",
      "description": "In this vlog, I describe what the common logical fallacy called \u0022ad hominem\u0022 is and how it shows up in our lives. Spiritual abusers thrive on people not seeing through this dynamic, so I hope to empower you to recognize it and walk away. \nNote: I accidentally call King Saul from the OT Paul, apologies!\nAt another point I am referring to my cult leader as \u0022vulnerable\u0022, fragile would have been the better word choice.",
      "release": "2025-01-05T03:58:27Z",
      "duration": "00:18:44",
      "explicit": false,
      "youTubeId": "EUDQ3KxVVk8",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EUDQ3KxVVk8"
      }
    },
    {
      "id": "85de56c5-7f4e-47c6-9b55-e024d4ca4ac3",
      "title": "Unpacking: Whistle Blower Trauma",
      "description": "Many people in toxic or spiritually abusive systems have been shunned/demonized by leaders after speaking out against perceived problems. In this new Vlog I address what I call \u0022whistle blower-trauma\u0022; the season that can occur after being left with wondering what the heck happened and if they should have better not said anything at all. Let\u0027s delve deeper into what made you speak up and consider how growth can come from a traumatic experience. The book I mention is Janyne Mcconnaughey\u0027s \u0022Trauma in the Pews\u0022.",
      "release": "2024-06-24T16:49:47Z",
      "duration": "00:39:26",
      "explicit": false,
      "youTubeId": "R5eXBFssy90",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R5eXBFssy90"
      }
    },
    {
      "id": "28ef093b-5dd1-4970-9a7e-63ed066454d4",
      "title": "Conversation With \u0022Cult Trip\u0022 Author Anke Richter- The Journalist Who Got Too Close",
      "description": "Christina and cult journalist and \u0022Cult Trip\u0022 author Anke Richter have a personal conversation about their shared passion of bringing awareness to cults that come in all shapes and sizes. After both of them had their own experiences with cultic groups, they cover a lot of ground. How do we recognize if we are in a cult? What are some common red flags? Does everyone have the same experience within a group? Anke\u0027s new book \u0022Cult Trip\u0022 will be published in the US in later May, it can already be bought on Amazon. \nFollow Anke and her important work at AnkeRichter.net and DeCult.net!",
      "release": "2024-03-31T18:09:28Z",
      "duration": "01:12:24",
      "explicit": false,
      "youTubeId": "LDz4IlUpuNE",
      "subjects": [
        "Cult-Expert",
        "Bhagwan Shree Rajneesh",
        "Centrepoint",
        "Agama Yoga"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LDz4IlUpuNE"
      }
    },
    {
      "id": "e17626e0-118b-4e81-9c74-a74996eb19b6",
      "title": "Emily Garcés on Spiritual Abuse",
      "description": "\u0022It\u0027s like time travel, isn\u0027t it?\u0022 Join me in meeting Welsh artist Emily John Garcés and be inspired by how she turned hurt into various forms of art and essentially greater maturity, embracing her humanity. She shares what led to her book, \u0022Hitchhiking with Drunken Nuns\u0022 as well as powerful, beautiful poetry. We discuss how her time in YWAM didn\u0027t lead to the life she expected, how spiral dynamics helped her understand herself and others more, and judge less.",
      "release": "2021-11-07T00:15:49Z",
      "duration": "00:59:52",
      "explicit": false,
      "youTubeId": "AY5RvC7SK6o",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AY5RvC7SK6o"
      }
    },
    {
      "id": "c621a49a-b061-4a2b-85c6-c200ab1fc951",
      "title": "J.S. Park on Healing from Spiritual Abuse",
      "description": "Chaplain and author J.S. Park meets me to share how his work as a chaplain has shaped his own life. In his beautiful book \u0022The Voices We Carry\u0022 he grants an intimate look into his own life and how he discovered a path of healing for himself from various trauma. We also talk about spiritual abuse and racism within Christianity.",
      "release": "2021-04-13T20:35:46Z",
      "duration": "01:04:07",
      "explicit": false,
      "youTubeId": "jsZpPYnuCmE",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jsZpPYnuCmE"
      }
    },
    {
      "id": "b16b50f2-5011-4bad-8a19-8a744d3dc26d",
      "title": "Jared Byas on Spiritual Abuse",
      "description": "Feel free to subscribe to my channel YouTube.com/TruthInMotionStudios to help me reach more people! \nMeet author, (in)famous podcaster, and former pastor Jared Byas. He shares from the plethora of his life\u0027s reflective experiences and brings a beautifully healing perspective of reading the Bible and relating to other people to our conversation. \nwww. JaredByas.com\nwww.TheBibleForNormalPeople.com",
      "release": "2021-03-27T21:01:25Z",
      "duration": "00:56:24",
      "explicit": false,
      "youTubeId": "-y9Vzqkc-XE",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-y9Vzqkc-XE"
      }
    },
    {
      "id": "bc43009a-1c05-4e54-81ae-c572cc8f124c",
      "title": "Felicia Murrell on Spiritual Abuse",
      "description": "*Feel free to subscribe to my channel TruthInMotionStudios to let me know that you would like to help me reach more people.* Felicia Murrell, copy editor and beautiful free thinker, and I spent precious time together and I am very glad to get to share it with you. She shares of her personal life, spiritual abuse she and her husband experienced, and of her spiritual journey. She lives in Albuquerque, NM and her husband works for Richard Rohr. Her business website as copy editor: yzcounsel.com and her Instagram: hellofelicia_murrell",
      "release": "2021-03-15T20:17:14Z",
      "duration": "00:55:55",
      "explicit": false,
      "youTubeId": "o2KrG-gx_Qs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=o2KrG-gx_Qs"
      }
    },
    {
      "id": "40ad8019-6987-40e4-abd3-2b2587bb20d7",
      "title": "David Tensen on Spiritual Abuse",
      "description": "*Feel free to subscribe to my channel TruthInMotionStudios to let me know that you would like to help me reach more people.* Have the extraordinary pleasure to meet Australian poet, author of \u0022The Wrestle\u0022 and \u0022So I wrote you a Poem\u0022, chaplain, and consultant David Tensen and hear what he has to say about spiritual abuse and reclaiming your voice! www.DavidTensen.com Check out his teaching on \u0022Out of the tombs\u0022 on his website.\nFeel free to subscribe to my channel to let me know that you would like to see more free resources on spiritual abuse recovery!",
      "release": "2021-02-20T03:27:23Z",
      "duration": "01:15:37",
      "explicit": false,
      "youTubeId": "ZPQWOcBrd78",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZPQWOcBrd78"
      }
    },
    {
      "id": "aed24bf5-097c-4d83-baec-ba8906d74b39",
      "title": "What you need to know before joining YWAM",
      "description": "*Feel free to subscribe to my channel TruthInMotionStudios to let me know that you would like to help me reach more people.* Pastor Ryan Braley shares of his experiences at one YWAM base. We discuss the good, the bad, and the ugly. We look at practical ways to prepare to face and heal from encountering spiritual abuse.",
      "release": "2021-02-05T23:03:54Z",
      "duration": "01:07:32",
      "explicit": false,
      "youTubeId": "kWXAdEW4_U8",
      "subjects": [
        "Youth with a Mission"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kWXAdEW4_U8"
      }
    },
    {
      "id": "1227177a-1d9c-48af-998e-0cd3ec4d9d61",
      "title": "Spiritual Abuse in Evangelicalism -Professor Kristin Kobes Du Mez (author of \u0022Jesus and John Wayne\u0022)",
      "description": "*Feel free to subscribe to my channel TruthInMotionStudios to let me know that you would like to help me reach more people.* Meet Michigan Professor Kristin Kobes Du Mez who has a lot of light to shed on the history of evangelical beliefs that are inherently abusive. Feel free to sign up to my channel to help me reach more people!",
      "release": "2020-09-27T19:03:05Z",
      "duration": "01:11:35",
      "explicit": false,
      "youTubeId": "zshPSjXIvnI",
      "subjects": [
        "Evangelicalism",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zshPSjXIvnI"
      }
    },
    {
      "id": "22b3a651-a45b-4194-83a8-416b908cf930",
      "title": "Facing Spiritual Abuse in YWAM",
      "description": "*Feel free to subscribe to my channel TruthInMotionStudios to let me know that you would like to help me reach more people.* Meet Peter Helms, a native Dutch who currently lives in Germany. He has had a long career within YWAM and shares how he views his experiences, especially in light of his trinitarian faith. We talk about missionary work in general, theology and its potentially abusive implications, YWAMs dangerous view on \u0022authority\u0022, how we would advise parents whose kids want to participate with YWAM or any other missionary school. Peter is more than willing to get in touch with anyone who has questions for him: peterhelms@me.com",
      "release": "2020-08-22T21:40:55Z",
      "duration": "01:03:26",
      "explicit": false,
      "youTubeId": "g7L3Hufu2Hg",
      "subjects": [
        "Cult Recovery",
        "Youth with a Mission"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g7L3Hufu2Hg"
      }
    },
    {
      "id": "11ff776f-c815-483c-866a-96986c658d92",
      "title": "Wm Paul Young on Spiritual Abuse",
      "description": "*Please subscribe to my channel TruthInMotionStudios to help me reach more people.*\nJoin me as I get to witness author (The Shack) Wm Paul Young do what he does (tell stories and share his thoughts and heart) on everything spiritual abuse related and then some! It\u0027d be easier to say what we didn\u0027t cover during our time together! Sensitive content.",
      "release": "2020-05-29T03:02:56Z",
      "duration": "01:11:31",
      "explicit": false,
      "youTubeId": "4VkGgzhW0NA",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4VkGgzhW0NA"
      }
    },
    {
      "id": "e6827de7-ccd8-4ed7-b6c3-e9821581ff29",
      "title": "David Hayward, aka nakedpastor, on Spiritual Abuse",
      "description": "This casual conversation is for you if you\u0027re interested in hearing thoughts about how one can develop a healthy, personal spirituality after experiencing spiritual abuse within a church or unhealthy group and yet thrive in community. We also discuss the role David\u0027s cartoons play in expressing his thoughts about Christian culture. Please note that David says his home is in Christianity but he has cottages everywhere. Feel free to subscribe to my channel if you want to let me know you\u0027re interested in seeing more resources for people recovering from spiritual abuse. All respectful comments are welcome but please, just like we said in the video, grant everyone the freedom to have their own thoughts.",
      "release": "2020-05-11T23:17:09Z",
      "duration": "00:54:45",
      "explicit": false,
      "youTubeId": "SYLJ-nOOGII",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SYLJ-nOOGII"
      }
    },
    {
      "id": "dd35045a-a5ec-4572-87d4-813edf8e09c5",
      "title": "Dr. Brad Jersak on Spiritual Abuse",
      "description": "*Please subscribe to my channel TruthInMotionStudios to help me reach more people.* \nMeet Canadian theologian, professor, and author Brad Jersak and hear what he has to say about toxic faith, spiritual abuse, traumatizing children with evangelicalism (and how not to do that), what Jesus said about authority and leadership, and what the Good News are.",
      "release": "2020-04-19T01:11:33Z",
      "duration": "01:05:46",
      "explicit": false,
      "youTubeId": "viDide8Jbro",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=viDide8Jbro"
      }
    },
    {
      "id": "b8c18c05-e5bf-4485-92d1-287010f5a1af",
      "title": "Why I was Vulnerable to Spiritual Abuse",
      "description": "***Correction: I’m accidentally conglomerating the two Simons, Simon the Zealot and Simon Peter, “the rock”. The point I’m making still stands though as the expectation of a violent messiah was common for the time and Jesus addresses the readiness amongst the disciples to use force frequently.*** Greetings from the Panhandle of Florida! We’ll discuss in a bit rougher weather (sorry for sound issues)  Mark 8 and the self \u002B the ego as defined by Psychologist Jung. I’ll share what I think made me vulnerable to becoming a victim of spiritual abuse.",
      "release": "2020-02-21T18:46:09Z",
      "duration": "00:21:31",
      "explicit": false,
      "youTubeId": "cSqsMtIQFiY",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cSqsMtIQFiY"
      }
    },
    {
      "id": "f36a683f-a46d-4421-903a-f1dcf915ab0a",
      "title": "CPR For Life After Cult",
      "description": "In this again very personal vlog I share how leaving a cult is comparable to choking. Using this analogy, I describe how we survived our first few days and weeks after getting kicked out of our cult.",
      "release": "2019-12-17T18:27:24Z",
      "duration": "00:19:56",
      "explicit": false,
      "youTubeId": "CVoEoCDq7tM",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CVoEoCDq7tM"
      }
    },
    {
      "id": "07f2d9b6-6867-4812-9ece-d62b26e0d93c",
      "title": "Video Blog - Why talk about spiritual abuse? (Mit deutschen Untertiteln)",
      "description": "I share some thoughts on why I am passionate to talk about spiritual abuse.",
      "release": "2018-12-15T23:41:43Z",
      "duration": "00:09:21",
      "explicit": false,
      "youTubeId": "_U-F12tfm0c",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_U-F12tfm0c"
      }
    },
    {
      "id": "2db5a6e4-06ae-49bc-bc53-4f53a95060db",
      "title": "Identifying \u0026 Overcoming Spiritual Abuse -Interview with Christina Zaczkowski",
      "description": "Feel free to share this video if it was helpful to you!  My dear friend Ashley Darkenwald interviews me about my experiences with spiritual abuse. Learn how I became able to leave and what helped me get well. Part 1 of the TIM Studios video series on spiritual abuse.",
      "release": "2018-08-17T17:31:20Z",
      "duration": "00:44:33",
      "explicit": false,
      "youTubeId": "oSoHDUSavi0",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oSoHDUSavi0"
      }
    }
  ]
}