{
  "_ts": 0,
  "id": "0ddc9979-e277-47b8-9b8e-f87279624557",
  "name": "Unpleasant Dark Truths",
  "spotifyId": "5LCpYz1VAnT5CIiANCZMCs",
  "appleId": 1779138329,
  "youTubeChannelId": "UCtSlDfUQ_7wteG1JjXGL4tw",
  "episodes": [
    {
      "id": "98e0dd5e-6a83-4109-8230-86679fb786fc",
      "title": "Raelian Movement - With a special guest - Cults Episode 12",
      "description": "In this episode of Unpleasant Dark Truths, we delve into the intriguing world of the Raelian Movement, a cult founded by Claude Vorilhon, also known as Rael. The movement claims that extraterrestrial beings, known as the Elohim, created humanity, intertwining futuristic science fiction with spiritual teachings. We\u0027ll unpack the group\u0027s fascination with cloning, their controversial views on sexuality, and their use of provocative UFO imagery to attract attention.\n\nWe’ll also explore how Rael recruited members by blending radical scientific ideas with promises of enlightenment, while addressing the scandals and controversies that have followed the group. From allegations of exploitation to their global expansion efforts, this episode examines how the Raelian Movement operates in modern society and what life is like for its members.\n\nFinally, we’ll hear stories from a former member, and analyze the lasting impact of the movement’s teachings. Tune in for a journey into one of the most unconventional and debated cults of the modern era.\n\n\n\n  •  Origins of the Raelian Movement and Claude Vorilhon (Rael)\n  •  Core beliefs, including extraterrestrial creators\n  •  The group’s focus on cloning and genetic engineering\n  •  Recruitment strategies and member demographics\n  •  The role of sexuality and nudity in their practices\n  •  Controversies, including media backlash and scandals\n  •  Symbolism and use of UFO imagery\n  •  Financial structures and funding\n  •  The movement’s global reach and expansion\n  •  Perspectives from former member\n\n**Today\u0027s guest prefers to remain anonymous, and her real name is not Jenny and we have chosen to do a voiceover during the editing work to hide her real voice. But everything she says is said in her own words.\n\n\n\n\nSupport the show (https://www.buzzsprout.com/2422365/support) \n\n\nThank you for listening in on our Pod.\n\nWe delve into the darkest truths lurking in the shadows. Each episode uncovers these secrets, bringing them into the spotlight to challenge what you thought you knew.\n\nEvery Monday we release a comparison episode where we explore two similar cults, crimes, or other topics to highlight their eerie connections.\nEvery Wednesday \u0026 Friday we take a Deep Dive into each part of the Monday comparison, providing an in-depth analysis of each case.\nBrace yourself for revelations that might change the way you see the world!\n\nWelcome back!",
      "release": "2024-11-30T09:50:12Z",
      "duration": "00:32:05",
      "explicit": false,
      "spotifyId": "77QtDe2M2koCTUNEX2M8UH",
      "appleId": 1000678706829,
      "youTubeId": "WaxJNE6ndY4",
      "subjects": [
        "Raëlism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/77QtDe2M2koCTUNEX2M8UH",
        "apple": "https://podcasts.apple.com/podcast/raelian-movement-with-a-special-guest-cults-episode-12/id1779138329?i=1000678706829",
        "youtube": "https://www.youtube.com/watch?v=WaxJNE6ndY4"
      }
    }
  ]
}