{
  "id": "bbc1fe2f-e75c-4cde-a48c-ce4d81f04715",
  "name": "Unposted",
  "spotifyId": "49HB8nSu6Rw4CXx5BipoLq",
  "appleId": 1747556969,
  "episodes": [
    {
      "id": "037db245-39bf-4019-908a-f53f40f0a523",
      "title": "Exposing the harsh realities of the dance industry, audition life, and dreams being ripped apart | Unposted Episode 4",
      "description": "SIGN THE PETITION TO INVESTIGATE ROBERT SHINN’S CRIMES AND 7M DANCE CULT HERE: https://www.change.org/p/investigate-robert-shinn-for-his-crimes Make sure to watch the documentary on Netflix, Dancing For The Devil. Educate yourself and spread the word. Thank you. On today\u0027s episode our host Liz Bezler takes time to talk about the harsh realities of becoming a professional dancer and how her once glamorized dream is not anything like she thought it would be. Liz will talk about what it takes to become a professional dancer, her experience getting an agent and auditioning for big name brands and artists, not feeling valued on gigs, and how life is not linear. She reminds us that it is okay for our dreams to change and for doors to close that we once thought were what we wanted. Life is a roller coaster… and it’s all a part of the journey. Make sure to subscribe to \u0022Unposted Podcast\u0027\u0027 so you don\u0027t miss an episode dropping every Tuesday at 11am EST on YouTube as well as all podcast streaming platforms Tuesday’s at 5am EST. Also streaming on all platforms: Apple Podcast: https://podcasts.apple.com/us/podcast/unposted/id1747556969 Spotify: https://open.spotify.com/show/49HB8nSu6Rw4CXx5BipoLq?si=1c425fccffe747cf Instagram: https://www.instagram.com/unpostedpodcast/ Host: https://www.instagram.com/lizbezler/ Tiktok: https://www.tiktok.com/@unpostedpodcast Thank you for all of the continued love and support. I hope this helps just one person. Xoxo - Liz Bezler",
      "release": "2024-06-11T06:00:00Z",
      "duration": "00:59:53.3250000",
      "explicit": false,
      "spotifyId": "7iHqEWHraK7ymu2RGmjL2v",
      "appleId": 1000658572390,
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7iHqEWHraK7ymu2RGmjL2v",
        "apple": "https://podcasts.apple.com/podcast/exposing-the-harsh-realities-of-the-dance/id1747556969?i=1000658572390"
      }
    }
  ]
}