{
  "_ts": 0,
  "id": "bf9bd42b-75fa-4694-82b7-44d3ef36d6a3",
  "name": "Unreal Medieval",
  "youTubeChannelId": "UC3Sf10g9lumzXVeGvGH7xiA",
  "episodes": [
    {
      "id": "6d124a1e-dc4a-4da3-a337-3a634b8da6f6",
      "title": "History\u0027s 5 Medieval Cults with Female Leaders",
      "description": "Thiota, a 9th-century German prophetess, claimed to know the exact date of the world\u0027s end, sparking widespread panic and a massive following. She was summoned by local church authorities, who questioned her about the source of her prophecies. Thiota confessed that a priest had revealed the information to her, but the bishops were unimpressed and declared her teachings false. She was publicly flogged as punishment for causing widespread panic and leading people astray. Thiota\u0027s fate remains unknown after her public shaming, but her story serves as a testament to the power of charismatic women in medieval Europe.",
      "release": "2025-06-19T10:01:18Z",
      "duration": "00:37:54",
      "explicit": false,
      "youTubeId": "hetPDFNOW7Q",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hetPDFNOW7Q"
      }
    },
    {
      "id": "74bb517a-1b35-4848-8208-e26cfd2498bb",
      "title": "History\u0027s 5 Medieval Cult Leaders Who Claimed Divinity",
      "description": "Aldebert, a 8th-century Frankish preacher, claimed to be an angel-channelling saint with a direct line to heaven. He produced fake relics, including a letter supposedly written by Jesus, and performed miraculous feats to convince his followers. His followers abandoned the established church, and he set up his own crosses and oratories. However, church authorities, including Saint Boniface, condemned him as a charlatan and heretic, and he was eventually stripped of his priestly authority and sentenced to penance. Aldebert\u0027s fate remains unclear, but his public ministry was ultimately shut down by the official church.",
      "release": "2025-06-17T22:00:33Z",
      "duration": "00:37:44",
      "explicit": false,
      "youTubeId": "QPiCWHQrJms",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QPiCWHQrJms"
      }
    },
    {
      "id": "7cfdfce2-9a89-4bd4-8189-b057fa3de473",
      "title": "History\u0027s 7 Most Bizarre Medieval Religious Cults",
      "description": "In medieval Europe, people believed in various extreme spiritual movements, including those who thought they could sin without consequence because they were too holy, and others who believed in a female pope and a demonic black cat. These groups were accused of heresy, including worshiping Lucifer and engaging in orgies and human sacrifice. However, historians are skeptical about the existence of these groups, and many think the accusations were exaggerated or fabricated by the church to justify persecution. The fear of Luciferians was very real, leading to real investigations and punishments, but the stories of these groups are likely based on folklore and propaganda. The medieval worldview was filled with a powerful fear of evil, which was exploited by the church to justify its authority.",
      "release": "2025-05-29T22:00:17Z",
      "duration": "00:41:36",
      "explicit": false,
      "youTubeId": "JJMj3RgXIRs",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JJMj3RgXIRs"
      }
    },
    {
      "id": "5455dce7-30d4-4e8a-8029-34b72f60b652",
      "title": "6 Medieval Cults Focused on Extreme Asceticism",
      "description": "In medieval times, some people took asceticism to extreme lengths, including whipping themselves in public to appease God and stop the Black Death. The Flagellants, a group of self-flagellants, would whip themselves with leather scourges for 33.5 days, chanting prayers and hymns. Their actions were meant to mimic Christ\u0027s suffering and lift the plague. However, the movement was criticized by the Church and secular authorities, leading to its suppression. The Flagellants\u0027 extreme devotion was a stark example of how fear and religious fervor can combine to produce intense public displays of pain and penance.",
      "release": "2025-05-11T22:00:29Z",
      "duration": "00:33:30",
      "explicit": false,
      "youTubeId": "KFDLIr8jLhA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KFDLIr8jLhA"
      }
    }
  ]
}