{
  "_ts": 0,
  "id": "2223b0d2-4241-4f04-b954-cb9d47fa97f8",
  "name": "Unreal Archives",
  "youTubeChannelId": "UCnO05D-2Et2jDhdMQF2QyRw",
  "episodes": [
    {
      "id": "38afe50a-5635-4dce-af5e-02b0d122db80",
      "title": "Inside the Raelian Movement: Secrets of the World’s Creepiest Active Cult",
      "description": "What if I told you there\u0027s a modern-day cult that believes its leader is an alien prophet… and they’re still operating around the world? In this jaw-dropping exposé, we uncover the terrifying truth behind the Raelian Movement, one of the creepiest cults still active today. Led by a man who claims to speak with aliens, this cult mixes UFO beliefs, cloning, AI-controlled governments, and hyper-sexualized rituals into a disturbing sci-fi religion.\n\nWatch as we reveal the dark origins of the Raelian cult, their disturbing alien worship, the infamous Clonaid cloning controversy, their obsession with human engineering, and their radical vision for humanity’s future. From mind control to ritualistic initiation rites, this cult may not be violent—but it’s far more disturbing than you think.\n\nWe’ll dive deep into cult psychology, modern cults 2024, alien religions, extreme belief systems, and bizarre spiritual doctrines. If you’re into disturbing cult documentaries, secret societies, religious cult breakdowns, and weird beliefs that people actually follow, this is the video you can’t miss.\n\n🔔 Subscribe now for more deep dives into modern-day cults, conspiracy religions, mind control movements, and creepy real-life subcultures.\n\n#Cults #RaelianMovement #AlienCult #ModernDayCults #CloningCults #MindControl #SecretSocieties #TrueCrime #CreepyCults #DisturbingBeliefs #Rael #Clonaid #CultDocumentary #AlienWorship #UFOReligion #CultsExplained #SubcultureDeepDive #TrueCrimeCult #CreepiestCults #SciFiCult #NewAgeCults",
      "release": "2025-05-09T15:01:31Z",
      "duration": "00:08:47",
      "explicit": false,
      "youTubeId": "n9rc3ndPMN0",
      "subjects": [
        "Raëlism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n9rc3ndPMN0"
      }
    }
  ]
}