{
  "_ts": 0,
  "id": "6fb54a93-4672-4f3a-ac36-33d979c9927c",
  "name": "Un•Religiously",
  "youTubeChannelId": "UCvf0hBh_YvSIYXigAA64a_w",
  "episodes": [
    {
      "id": "406ecc9f-a2e4-4407-ac6b-bf08e79c9ead",
      "title": "Inside Chi Alpha: The Cult Tactics Hiding Behind Campus Ministry",
      "description": "Chi Alpha Christian Fellowship claims to be a student ministry, but behind the worship nights and Bible studies lies a culture of manipulation, control, and cult-like behavior.\n\nIn this in-depth exposé, I break down how Chi Alpha operates like a multi-level marketing scheme, pressures students into performative healing, and aggressively targets international students as part of a broader mission strategy.\n\nWhether you’ve been involved in Chi Alpha or are just curious about what really goes on, this video pulls back the curtain on the inner workings of one of America’s most powerful campus ministries.\n\n\n#ChiAlpha #ReligiousTrauma #ChristianCult #CampusMinistryExposed #SpiritualManipulation",
      "release": "2025-05-17T00:00:21Z",
      "duration": "00:40:25",
      "explicit": false,
      "youTubeId": "r-7-RDlgo4A",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=r-7-RDlgo4A"
      }
    },
    {
      "id": "c0d3e5ff-b01f-410d-aac9-72054da2fede",
      "title": "Inside ECKANKAR: Sleep, Soul Travel, and the Planes of Existence",
      "description": "In this video, we explore the lesser-known beliefs of the new religious movement ECKANKAR — specifically their teachings around sleep, Soul Travel, and the spiritual planes of existence.\n\nWhile these beliefs may seem mystical or harmless on the surface, we examine the psychological effects, including how dream interpretation, spiritual surveillance, and karmic framing can shape followers’ mental and emotional health.\n\nAs a former believer (or curious outsider), you’ll get an in-depth look at what it means to sleep in ECKANKAR — and why it might be more controlling than you think.\n\n👁️ Topics covered:\n– The Astral, Causal, Mental \u0026 Soul Planes\n– The Mahanta’s role in dreams\n– Soul Travel during sleep\n– Potential mental health consequences\n– How spiritual dreams can override real-life agency\n\n🔔 Subscribe for more exvangelical commentary, cult breakdowns, and psychological deep dives into fringe spiritual movements.\n\n#Eckankar #SpiritualSleep #SoulTravel #Exvangelical #NewReligiousMovements #DreamInterpretation #CultsExplained #MentalHealthInReligion\n\n🎯 SEO-Rich, Ad-Friendly Title Options:\nWhat ECKANKAR Believes Happens When You Sleep (And Why It Matters)\n\nInside ECKANKAR: Sleep, Soul Travel, and the Planes of Existence\n\nThe Hidden Cost of “Spiritual Sleep” in ECKANKAR | Cult Psychology Explained\n\nECKANKAR’s Beliefs About Dreams and Soul Travel — A Critical Look\n\nWhy Sleep Isn’t Just Sleep in ECKANKAR | Mental Health, Control \u0026 Belief\n\nWould you like a pinned comment or video chapters to go with this as well?",
      "release": "2025-05-13T02:19:56Z",
      "duration": "00:40:04",
      "explicit": false,
      "youTubeId": "VprFu2C-HMk",
      "subjects": [
        "Eckankar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VprFu2C-HMk"
      }
    },
    {
      "id": "0a5c091e-3f5d-41ef-81b7-0f03f0bc3ba1",
      "title": "Exposing The Twelve Tribes: The Cult Behind The Yellow Deli and Mate Factor",
      "description": "The Yellow Deli may look like a cozy, hippie-style café — but behind the herbal tea and hand-carved booths lies a controversial religious movement with a dark history. In this deep dive, we uncover the hidden world of the Twelve Tribes, the group behind The Yellow Deli and Mate Factor.\n\nFrom alleged child labor and cult-like control to apocalyptic beliefs and communal living, this video explores the origins, beliefs, daily life, and controversies surrounding the Twelve Tribes movement.\n\n🔍 Topics Covered:\n\nThe history and founding of the Twelve Tribes\n\nHow The Yellow Deli and Mate Factor operate\n\nDaily life inside the community\n\nAccusations of abuse, racism, and labor violations\n\nWhy they continue to operate in plain sight\n\n⚠️ Viewer discretion advised: This video discusses sensitive topics including abuse and religious manipulation.\n\n👇 Share your thoughts in the comments. Have you ever visited a Yellow Deli or Mate Factor location?\n\n#TwelveTribes #TheYellowDeli #MateFactor #Cults #CultDeepDive #ExposingCults #ReligiousCults #InvestigativeDocumentary",
      "release": "2025-05-09T17:38:06Z",
      "duration": "00:39:04",
      "explicit": false,
      "youTubeId": "9Rp-5-k4dSA",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9Rp-5-k4dSA"
      }
    }
  ]
}