{
  "id": "0decc706-15e9-443b-aa03-df1604a2637f",
  "name": "Unseen",
  "youTubeChannelId": "UCVtHlqfvXn-6m6A2IWUB8MQ",
  "episodes": [
    {
      "id": "d0bbbd00-18c4-4887-bdd1-489d7567490c",
      "title": "Cult Leader Thinks He Got Away Until 11YO Exposes His Dark Secret | Niki Lopez \u0026 The Nuwubian Nation",
      "description": "“There’s a pyramid in the cow pasture”\n\nIn 1986, Niki Lopez lives with her family at 717 Bushwick Avenue, home to a secretive group called the Nuwaubian Nation in the heart of Brooklyn–alarmingly, in 1993, the whole community vanishes without a trace. Nearly ten years later, on May 8th, 2002, over 200 federal agents prepare to storm a seemingly “ancient Egyptian” compound in rural Putnam County, Georgia. Inside, nearly 200 families live under the control of Nuwaubian Nation leader, Dwight “Malachi” York. In order to get justice for all the victims before it’s too late, it’s up to Niki to escape, confront her past, and expose the truth behind one of the darkest cases in American history.\n\nNiki founded her organization “What’s Your Elephant”, which aims to empower individuals from all walks of life to use the arts to tell their stories: https://whatsyourelephant.org/\n-\n-\n-\nWritten, directed \u0026 edited by Matthew Rice\nResearched by Bianca Tan\nVoiceover by William Akana\nProduced by Alexandra Salois \u0026 Salim Sader\n-\n-\n-\nSources\nThe Nuwaubian Nation, How I Escaped My Cult: Freeform, 2025\n\nUnited Nuwaubian Nation of Moors, People Magazine Investigates: Cults: MMXVIII Discovery Communications LLC, 2018\n\nNuwaubian Nation, FOX5 Eyewitness News, 1998\n\nWaco: The Inside Story, Frontline PBS, 2018\n\nMysteries Behind Closed Doors: The Dr. Malachi Z. York Case (The Untold Story), ImperialSevens, 2012\n\nOpen House visits to the Nuwaubian compound Tama-Re, Jay Humphrey, 2024\n-\n-\n-\nGo to https://unseen.plus/ for more!\nListen to our videos on Spotify: 🎧 https://podcasters.spotify.com/pod/show/unseentruecrime\nFollow us on social media:\nFacebook - https://www.facebook.com/watch.unseen\nYouTube Shorts - @unseenagain \n-\nUncover what true crime documentaries don’t show you: real cases and real people, but with a new twist. This is Unseen.\n-\n-\n-\n********************\nMusic Bed ID: MB01UGF5ODZ6PTY",
      "release": "2025-10-25T16:00:44Z",
      "duration": "00:25:13",
      "explicit": false,
      "youTubeId": "P8wj3fI37AY",
      "subjects": [
        "Nuwaubian Nation",
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P8wj3fI37AY"
      }
    }
  ]
}