{
  "id": "67fb0547-5d2c-4ea4-960b-e0446498808c",
  "name": "Unseen",
  "spotifyId": "6C6Gj58po61vFDmz8lK5Gr",
  "appleId": 1656315508,
  "episodes": [
    {
      "id": "9aaf1c27-fdd8-4f62-83a1-bdee4f7201bf",
      "title": "The Disturbing Alien Pyramid Cult of Georgia | The Case of Niki Lopez \u0026 The Nuwaubian Nation | UNSEEN ",
      "description": "“There’s a pyramid in the cow pasture” - In 1986, Niki Lopez lives with her family at 717 Bushwick Avenue, home to a secretive group called the Nuwaubian Nation in the heart of Brooklyn–alarmingly, in 1993, the whole community vanishes without a trace. Nearly ten years later, on May 8th, 2002, over 200 federal agents prepare to storm a seemingly “ancient Egyptian” compound in rural Putnam County, Georgia. Inside, nearly 200 families live under the control of Nuwaubian Nation leader, Dwight “Malachi” York. In order to get justice for all the victims before it’s too late, it’s up to Niki to escape, confront her past, and expose the truth behind one of the darkest cases in American history. Niki founded her organization “What’s Your Elephant”, which aims to empower individuals from all walks of life to use the arts to tell their stories: https://whatsyourelephant.org/ - Written, directed \u0026 edited by Matthew Rice Researched by Bianca Yzabelle Tan Voiceover by William Akana Produced by Alexandra Salois \u0026 Salim Sader - Sources The Nuwaubian Nation, How I Escaped My Cult: Freeform, 2025 United Nuwaubian Nation of Moors, People Magazine Investigates: Cults: MMXVIII Discovery Communications LLC, 2018 Nuwaubian Nation, FOX5 Eyewitness News, 1998 Waco: The Inside Story, Frontline PBS, 2018 Mysteries Behind Closed Doors: The Dr. Malachi Z. York Case (The Untold Story), ImperialSevens, 2012 Open House visits to the Nuwaubian compound Tama-Re, Jay Humphrey, 2024 Getty Images Instagram, Niki Lopez The Waco Massacre: 30 Years On | DARK SIDE OF THE 90\u0027S, VICE TV, 2023 Local Artist Shares Her “Elephant” to Help Empower Women, NBC 6 South Florida, 2019",
      "release": "2025-10-27T19:45:13Z",
      "duration": "00:25:11.7220000",
      "explicit": false,
      "spotifyId": "6IXcHDGwbHfjW8TUCXJZa5",
      "appleId": 1000733750969,
      "subjects": [
        "Nuwaubian Nation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6IXcHDGwbHfjW8TUCXJZa5",
        "apple": "https://podcasts.apple.com/podcast/the-disturbing-alien-pyramid-cult-of-georgia-the/id1656315508?i=1000733750969"
      }
    }
  ]
}