{
  "_ts": 0,
  "id": "4e58b043-273e-4302-83c7-47d18484a214",
  "name": "Untethering Shame",
  "spotifyId": "2AouludJr7EweOkMIN9s42",
  "appleId": 1691795543,
  "youTubeChannelId": "UCdqCNF8lI6hq8U2GNQsAJkQ",
  "episodes": [
    {
      "id": "36278e57-f1ff-4f46-9f37-ed436647cab9",
      "title": "Shame \u0026 Healing from a Cult",
      "description": "In this conversation, Kyira Wackett interviews Sandra Huitt, who grew up in a cult. They discuss the challenges of leaving a cult and the process of healing and finding oneself after leaving. Sandra shares her experience of feeling othered and struggling to fit in after leaving the cult. She also talks about the difficulties of opening up to her parents about her struggles and the anger she developed towards them later on. Sandra found solace and a sense of belonging in underground raves and electronic music events. Sandra Huitt shares her experience growing up in a cult and her challenges when leaving. She discusses the struggle of finding her identity and belonging outside of the cult, as well as the difficulty of trusting herself and others. Sandra reflects on the journey of self-love and healing, and the importance of honoring her past while embracing her growth. She expresses her desire to demystify the cult experience and help others recognize the signs to avoid getting involved. The conversation highlights the complexities of navigating personal relationships and finding self-worth after leaving a cult. Takeaways Leaving a cult can be a complex and challenging process, and the healing journey is ongoing. Feeling othered and struggling to fit in is a common experience for individuals who have left cults. Opening up to parents about struggles after leaving a cult can be difficult, especially if they had a different experience or are still involved. Anger towards parents for their involvement in a cult may develop over time. Finding solace and a sense of belonging in alternative communities or events can be helpful in the healing process. Leaving a cult can be a challenging process of finding one\u0027s identity and sense of belonging outside of the cult community. Trusting oneself and others can be difficult after growing up in an environment where external validation was the norm. The journey of self-love and healing involves learning to honor one\u0027s past while embracing personal growth. Sharing personal experiences can help demystify the cult experience and raise awareness of the signs to avoid getting involved. Navigating personal relationships and finding self-worth after leaving a cult can be complex and require ongoing self-reflection and growth. More about Sandra: My name is Sandra Huitt and I\u0027m a cult survivor, cycle breaker, and activist. I studied World Religion and History to check the accuracy of what I was taught as a child and I remain a passionate student in those fields as there\u0027s always more to learn. A decade of social work and pediatric counseling aligns with my belief that a rising tide lifts all boats. Vulnerability is one of my superpowers and I use it often to discuss my journey through healing to encourage others to find their path. Traveling the world to absorb the beauty of other cultures lights me on fire and singing my heart out makes my soul happy. Ready to take the next step? Download the FREE handout, \u0022 5 Things Shame Resilient People do Every Day \u0022 and start making those daily shifts to break that shame cycle that\u0027s keeping you stuck in that negative headspace. Book a free 25-minute discovery call to discuss different program options and find the support best fits your needs. Stay Connected: Subscribe to the podcast on Spotify or Apple Podcasts and be sure to leave a review to let us know your thoughts on this episode. YouTube Website Keywords cult, leaving, healing, othering, fitting in, struggle, parents, anger, belonging, identity, trust, self-love, healing, demystify, self-worth --- Support this podcast: https://podcasters.spotify.com/pod/show/kyira-wackett/support",
      "release": "2024-09-01T07:00:00Z",
      "duration": "00:47:54.4440000",
      "explicit": true,
      "spotifyId": "2E9tVZqkyY3tzKaTcpR2l4",
      "appleId": 1000667946341,
      "youTubeId": "8l6myUehqt8",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2E9tVZqkyY3tzKaTcpR2l4",
        "apple": "https://podcasts.apple.com/podcast/shame-healing-from-a-cult/id1691795543?i=1000667946341",
        "youtube": "https://www.youtube.com/watch?v=8l6myUehqt8"
      }
    }
  ]
}