{
  "id": "95dc0872-2ea8-4454-9ecd-e1b073268817",
  "name": "Untidy",
  "spotifyId": "6FKRdV8xqVU3vP5jfJ3TKi",
  "appleId": 1670524338,
  "episodes": [
    {
      "id": "e46301f0-1a9b-466a-aa6f-4cabebbdac3d",
      "title": "Gloriavale Unveiled with Theophila Pratt",
      "description": "In this episode of Untidy, Matilda and Hannah speak with Theophila Pratt, a Gloriavale cult survivor, qualified paediatric occupational therapist, author, and fierce advocate for freedom and healing. Theo, formerly known as Honey Faithful, grew up in Gloriavale, an isolated and highly controlled Christian community on the West Coast. At 18, she was cast out after challenging the regime, with nothing but a suitcase, a ticket to Auckland, and little understanding of how the outside world worked. TRIGGER WARNING: This episode includes discussion of religious trauma, psychological abuse, coercive control, childhood neglect, and sexual abuse. While we approach these topics with care and sensitivity, some content may be distressing for listeners. Please take care while listening and prioritise your wellbeing. Theo shares what life inside Gloriavale was really like — from the oppressive rules that haunted every moment, to the calculated psychological control that deprived people of their individual identities, especially for girls and women. Theo talks about the subtle acts of rebellion that sparked her path to freedom, what it took to start again from scratch, and how she’s now helping others do the same. Theo reflects on trauma, therapy, rage, spirituality, and walking a determined road to self-trust and reclaiming her voice and identity. Her memoir, ‘Unveiled: A Story of Surviving Gloriavale’ exposes the realities of life inside the cult and offers hope to those seeking freedom from high-control environments. Links as mentioned in the show: Buy Unveiled by Theophila Pratt from https://www.theopratt.com/ Gloriavale Leavers’ Trust: https://gloriavaleleavers.org.nz/ Follow Theo on Instagram @lifeischoicenz Watch TVNZ documentary, Escaping Utopia If you’re enjoying Untidy, the best way to show your support is by tapping the ‘\u0026#43; follow’ button in your podcast app and subscribing on YouTube ! That way, fresh episodes will always be ready and waiting for you. Help us to keep building this supportive community — share an episode with a mate, and chuck us a 5-star review — it helps more people find our Untidy, unfiltered, and relatable chats. Thank you for listening, contributing and supporting this independent production! We’re grateful to have you here! — Hannah \u0026 Matty xx Don’t forget! Untidy is made for YOU — the people right at the heart of this steaming hot mess! Follow the show and DM us on Instagram @untidypodcast or email hello@untidypodcast.com . Your stories and ideas to help shape the show! Find us online at Untidy podcast . Find Matilda at @matootles and get your copy of The Feel Good Guide . Find Hannah at @hannahedavison and her My Big Moments children’s books at @mybigmoments . Enter code UNTIDY at checkout for 10% off your order. See omnystudio.com/listener for privacy information.",
      "release": "2025-05-16T17:00:00Z",
      "duration": "01:04:29.6480000",
      "explicit": false,
      "spotifyId": "2g23zwzzgq4waoBaJdOvjH",
      "appleId": 1000708755629,
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2g23zwzzgq4waoBaJdOvjH",
        "apple": "https://podcasts.apple.com/podcast/gloriavale-unveiled-with-theophila-pratt/id1670524338?i=1000708755629"
      }
    }
  ]
}