{
  "id": "9164edc3-3806-4946-9f5c-a0691b3237b8",
  "name": "Untold Evidence",
  "youTubeChannelId": "UCD8-JMI9BUu8m6vuZnkQJ5Q",
  "episodes": [
    {
      "id": "b617de65-3755-4104-8123-d0d4de63222e",
      "title": "The World\u0027s Most Terrifying Cults: Poison, Sacrifice, and Mass Death",
      "description": "Three cult leaders. Thousands dead.\nFrom Jonestown to Tokyo to Matamoros — this is how faith turned into mass murder.\nWatch the terrifying true story of Jim Jones, Shoko Asahara, and Adolfo Constanzo — the cult masterminds Too Brutal for Netflix. #TrueCrimeDocumentary #truecrimecommunity #crime #horror #Cults #CultLeader \nDive into this disturbing true crime documentary analyzing the 3 deadliest cult leaders of the modern era. We examine the horrifying final acts of Jim Jones (The Jonestown massacre), Shoko Asahara (The Tokyo subway sarin attack by Aum Shinrikyo), and Adolfo Constanzo (The Narcosatanic cult murders and human sacrifices in Matamoros). This video breaks down the cult leader psychology and the dark tactics of brainwashing that led to these mass deaths.\n\n#JimJones #AumShinrikyo #TrueCrimeDocumentary #Cults #Jonestown #ShokoAsahara #CultLeader\n\n\n🔥 If you love deep-dive true crime documentaries, hit Subscribe for more stories that are Too Brutal for Netflix.\n\n\n🔥 SUBSCRIBE for more cases too brutal for Netflix: https://www.youtube.com/@UntoldEvidence\n📌 Follow our series playlist: https://youtu.be/x23YRj8JjDM?si=L7T51-Yy0ZylDIH6\n\n#TrueCrime #Horror #TrueCrimeDocumentary #UnsolvedMysteries #CrimeStories #TrueCrimeCommunity #Netflix #TooBrutalForNetflix #UntoldEvidence #UrbanHorror  #ColdCases #MurderMystery #Documentary #CrimeNews #ChillingStories #RealCrime #ForgottenCrimes #TrueCrimeCases #DarkHistory #Crimedocumentary\n#TooBrutalForNetflix #TrueCrime #UrbanSerialKillers #serialkillerfacts  #UnsolvedHorror #Fastfood #murdermystery  #Dahmer\n #CreepyDocumentary #shorts #crimenews #crime #crimestory #crimedocumentary #documentary #unsolvedmysteries #unsolvedcrime #crime #Truecrime #truecrimecommunity #truecrimestories #truecrimepodcast #truecrimedocumentary #truecrimestory #truecrimes #SerialKillers #Netflix #netflixmovie #Fyp #COP #sleep #sleepmusic #sleepsounds \n\n👉 This Channel Cover all these True Crime Documentaries ⬇️\n\nJim Jones, Jonestown Massacre, Shoko Asahara, Aum Shinrikyo, Tokyo Subway Sarin Attack, Adolfo Constanzo, Narcosatanicos, Matamoros Cult Murders, Cult Leaders Documentary, Cult Psychology, True Crime Documentary, Too Brutal for Netflix, Untold Evidence, True Crime Stories, Cult Documentary 2025, Dark History, Crime Documentary, Mass Murder Documentary, Real Crime Stories, True Crime Analysis, Killer Psychology, Brainwashing Explained\n#TrueCrime #TrueCrimeDocumentary #TrueCrimeCases #CrimeStories #UnsolvedMysteries #CrimeAnalysis\n\ntrue crime\ntrue crime stories\nuntold evidence style\ncult documentary Jim Jones\ntrue crime Jonestown massacre\ncult leader Shoko Asahara\nscary cults Aum Shinrikyo\ndocumentary Tokyo sarin gas attack\ntrue crime stories Adolfo Constanzo\nreal crime Narcosatanic cult\neerie crime storytellingCults and Crimes, Manipulative Leaders, Religious Cults Gone Wrong, Serial Killers and Cults, True Crime Cults, Psychological Manipulation, Horror Documentaries, Real Cult Footage, True Crime Deep Dive, Disturbing True Crime, Evil Leaders Documentary, Historical Cults, True Crime Narration, Real Life Horror Stories, Chilling Crime Cases, Crime History Explained, Mind Control Cults, Mass Suicide Cases, Criminal Psychology , Untold Evidence, Too Brutal for Netflix, True Crime YouTube Channel, Creepy True Crime Stories, True Crime Community, Unsolved Mysteries, Murder Mystery, Real Crime Documentary, Forgotten Crimes, True Crime Addict, Netflix True Crime, Most Disturbing Cults, Creepy Documentary, Urban Horror, Cold Case Files, True Crime Full Documentary , #jimjones  #AumShinrikyo #AdolfoConstanzo #truecrimedocumentary  #Cults #Jonestown #ShokoAsahara #cultleader  #TooBrutalForNetflix #UntoldEvidence #TrueCrime #darkhistory  #crimestories  #realcrime  #murdermystery  #truecrimecommunity  #unsolvedmysteries Cult Psychology, Brainwashing, Real Crime Stories, Dark History, Killer Psychology, True Crime Cases, Real Cult Footage, Disturbing True Crime #Cults #CultLeader",
      "release": "2025-11-10T02:00:01Z",
      "duration": "00:21:11",
      "explicit": true,
      "youTubeId": "0qqjHubkhNE",
      "subjects": [
        "Aum Shinrikyo",
        "Peoples Temple",
        "Adolfo Constanzo"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0qqjHubkhNE"
      }
    }
  ]
}