{
  "id": "7226423f-e864-428e-a166-0239399dc637",
  "name": "Unveiled Crimes",
  "youTubeChannelId": "UCH_0aH3fKkDfaQ0qSUQmR8A",
  "episodes": [
    {
      "id": "23034698-ec67-4d41-a8b9-6937677556b6",
      "title": "The Cult Father Who Murdered His Entire Bloodline",
      "description": "🔴 The Twisted Reign of Marcus Wesson | Cult Leader Who Orchestrated the Murder of 9 Children\n\nIn 2004, what began as a routine child custody dispute in Fresno, California, spiraled into one of the most horrifying revelations in true crime history.\n\nPolice walked into a nightmare—nine children executed, all connected to one man: Marcus Wesson. He wasn’t just a father. He was a self-proclaimed prophet who ruled over his family with an iron grip, manipulating them into a cult of control, incest, and fear. What officers uncovered inside that home would haunt them forever.\n\nIn this chilling true crime documentary, we uncover:\n\nWho Marcus Wesson really was—and how he became a monster.\n\nHow he used religion to enslave his own family.\n\nThe horrifying events of March 12, 2004.\n\nThe psychological and physical torment endured by his victims.\n\nWhat happened during the explosive trial that led to his death sentence.\n\n💀 This isn\u0027t just a story of murder—it\u0027s a story of cult mentality, brainwashing, and generational trauma hidden in plain sight.\n\n🎵 Track details:\nHorror Mystery\nGenre: Horror Music\nDark, ambient and spooky horror track. Suitable for those moments when you are wounded lying on the 20th floor of the ruined building and waiting for zombies to get you.\n\n\n🔔 Subscribe to Unveiled Crimes for more real-life horror stories, mysterious disappearances, and criminal minds exposed. Don’t forget to like, share, and leave a comment. What part of this case disturbed you the most?\n\n#TrueCrime #MarcusWesson #CultCrime #UnveiledCrimes #FamilyMassacre #CriminalPsychology #DarkHistory #TrueCrimeDocumentary #CrimeStory",
      "release": "2025-04-19T20:26:34Z",
      "duration": "00:15:30",
      "explicit": false,
      "youTubeId": "U9mhv4QysUY",
      "subjects": [
        "Marcus Wesson"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=U9mhv4QysUY"
      }
    }
  ]
}