{
  "id": "e3574887-a4e8-4cb6-b10c-5a859e4e7e53",
  "name": "USC Department of Gender \u0026 Sexuality Studies",
  "youTubeChannelId": "UCvJlb6_SKAZK1DVs_unwsxw",
  "episodes": [
    {
      "id": "aa3a710b-e9d7-4e32-aced-5f0ba19d3e7e",
      "title": "Critical Conversations: On Cults",
      "description": "Critical Conversations: On Cults is a conversation between Dr. Poulomi Saha, an Associate Professor of English and co-Director of the Program in Critical Theory at UC Berkeley, and Guinevere Turner, a writer, director and actor who has first hand experience of growing up in Cults. They have an encompassing conversation about our fascination with cults, the dynamics of cults from the inside, and the presence of cults  that permeate today.\n\nPoulomi Saha is a scholar of Asian American literature, postcolonial studies, \u0026 queer and feminist theory, they are currently at work on a book about America’s long obsession with Indian spirituality and why so often those groups come to be called cults. Our current cultural investments in yoga and mindfulness actually have a history going all the way back to the early republic. A history limned by scandal, anxiety, and deep longing. Their first book, An Empire of Touch: Women’s Political Labor \u0026 The Fabrication of East Bengal (Columbia University Press, 2019) was awarded the Harry Levin Prize for outstanding first book by the American Comparative Literature Association in 2020 and the Helen Tartar First Book Award in 2017.\n\nGuinevere Turner  has been working in film and TV since her 1994 debut film Go Fish, which she wrote, produced and starred in. She teamed up with director Mary Harron to write the films American Psycho, The Notorious Bettie Page and the 2019 film Charlie Says. She was a writer and story editor on Showtime’s The L Word, and she played the recurring character Gabby Deveaux on that show. She has written and directed seven short films, two of which premiered at the Sundance Film Festival.\n\nShe can be seen in acting roles that include The Watermelon Woman, Chasing Amy, American Psycho and The L Word. Guinevere taught screenwriting at Sarah Lawrence College, Columbia University, University of Georgia, UCLA and NYU. She published an essay in The New Yorker in April of 2019, and expanded on that essay in her 2023 memoir When the World Didn’t End from Penguin Random House.",
      "release": "2024-04-04T22:14:23Z",
      "duration": "01:01:24",
      "explicit": false,
      "youTubeId": "STOrh8GEnwE",
      "subjects": [
        "The Lyman Family",
        "Larry Ray",
        "Self-Help"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=STOrh8GEnwE"
      }
    }
  ]
}