{
  "id": "4954f0ad-cf49-431b-b63b-bcd8c2822916",
  "name": "Vennie Kocsis",
  "youTubeChannelId": "UCrgeb_nUp62Q90SWd-b-Qxw",
  "episodes": [
    {
      "id": "57de8b01-2de8-414e-9d77-4d1084279658",
      "title": "Echo Chamber of the Mind: Understanding Shared Psychsia",
      "description": "Echo Chamber of the Mind: Understanding Shared Psychosis\n\nExploring shared psychosis, a phenomenon where delusional beliefs spread within close relationships, often leading to horrific outcomes. Using historical and contemporary examples, it illustrates how emotional vulnerability and isolation can amplify irrational beliefs. The post advocates for critical thinking, diverse relationships, and professional support to combat such shared delusions.\n\nhttps://venniekocsis.com/2025/05/22/understanding-shared-psychosis/",
      "release": "2025-07-16T11:44:06Z",
      "duration": "00:16:17",
      "explicit": false,
      "youTubeId": "SY04mn-8cm4",
      "subjects": [
        "The Move Of God",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SY04mn-8cm4"
      }
    },
    {
      "id": "60e7a1a6-3aca-4deb-b859-e019926c199d",
      "title": "The Jane Tapes",
      "description": "**ALL IMAGES AND FOOTAGE ARE THE SOLE INTELLECTUAL PROPERTY OF SURVIVOR VOICES SHOW CREATOR VENNIE KOCSIS.**\n\nSam Fife was a Baptist minister who used his sinister beliefs to build one of the largest and least talked about cults in the United States, with some compounds globally. \n\nIn the late 70\u0027s, Sam enlisted the services of a young pastoral intern at Tulane Hospital\u0027s psychiatric division. The young pastor wrote a thesis in which he described taking the job in order to see if Tulane would eventually accept exorcism as a form of treatment for individuals with mental impairments.  It was this young doctor who sent Jane to Sam for this exorcism. \n\nSam Fife led his followers to believe that Tulane itself had called on him, thereby solidifying the belief that he was indeed, a prophet of God.  Jane Miller went on to be one of the few female ministry in Sam Fife\u0027s cults, lived comfortably and seemingly benefited what a critically thinking individual might call a carefully crafted hoax.",
      "release": "2018-08-30T11:27:55Z",
      "duration": "01:25:46",
      "explicit": false,
      "youTubeId": "sl2dmeLTt_A",
      "subjects": [
        "The Move Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sl2dmeLTt_A"
      }
    }
  ]
}