{
  "id": "76fe11fd-597d-4a9e-bffb-8928dd4008fa",
  "name": "Veterans For Child Rescue",
  "youTubeChannelId": "UC54OaaiGb3Ba3-r7AGJfxJg",
  "episodes": [
    {
      "id": "b7109987-2be3-4b89-98d8-dad795254534",
      "title": "Unveiling the Truth About Epstein, Gov. Corruption, \u0026 the Fight for Justice | Live with Nick Bryant",
      "description": "Dive deep into the dark corners of power and privilege with investigative journalist Nick Bryant in this exclusive interview, as he sheds light on the intricate web surrounding Jeffrey Epstein. Bryant, renowned for his tenacity and commitment to uncovering uncomfortable truths, discusses his journey through the labyrinth of Epstein\u0027s world, revealing insights and challenges faced in his quest for justice.\r\n\r\n📌 What to Expect:\r\n- Insider Insights: Discover the untold stories and obstacles Nick encountered during his investigation.\r\n- The Black Book: A closer look into Epstein\u0027s infamous contacts and what it reveals about global elites.\r\n- The Path to Justice: How Bryant\u0027s work has contributed to the ongoing fight against child trafficking and abuse.\r\n\r\nThis interview is more than just a conversation; it\u0027s a deep dive into the systemic failures that allowed Epstein\u0027s crimes to go unchecked and what we can do to prevent such injustices in the future. Whether you\u0027re a longtime follower of the case or new to the details, Bryant\u0027s perspective offers valuable insights into the complexities of seeking truth and justice in a world that often prefers silence.\r\n\r\n👉 Subscribe and Set a Reminder: Don\u0027t miss out on this compelling interview. Subscribe to our channel, set a reminder for the live event, and join us in uncovering the truth behind one of the most notorious cases of our time.\r\n\r\n#NickBryant #JeffreyEpstein #InvestigativeJournalism #JusticeSeekers #TrueCrimeCommunity #LiveInterview #EpsteinCase #ChildProtection #ExposeTheTruth #SeekingJustice",
      "release": "2024-02-14T14:31:40Z",
      "duration": "01:04:51",
      "explicit": false,
      "youTubeId": "xe-RcFKDauI",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xe-RcFKDauI"
      }
    }
  ]
}