{
  "id": "2ce50ed1-cc7d-4460-9856-997ccb0932f4",
  "name": "Veteran Made with Carey Kight",
  "spotifyId": "4iGIEaayykKkcamOtrhouu",
  "appleId": 1554899908,
  "youTubeChannelId": "UCTjs4gM8nElF0NYL3wdEWHw",
  "episodes": [
    {
      "id": "285342b9-fe5a-4657-b260-cf2d1c8d4815",
      "title": "From a Cult to the Army to Hollywood: How an Army Veteran Landed a Netflix Show in Film School",
      "description": "In episode 157, I sit down with Daril Fannin — Army veteran, award-winning screenwriter, producer, and the founder of KINO — for a raw, energetic conversation about his path from military life to Hollywood and the power of authentic human interaction.\n\nWe dive deep into Daril’s upbringing in a fundamentalist Pentecostal cult, his eye-opening introduction to the world of movies, and how storytelling literally changed the course of his life. Daril’s journey from combat medic to making deals with A-list celebrities in the entertainment industry demonstrates exactly what’s possible when we choose to connect with others on a human level to build genuine relationships.\n\nWe don’t sugarcoat the grind or the realities of transitioning from the military to an industry as ruthless as entertainment. Authenticity isn’t just a buzzword, it’s a real way of being and a real strategy for building a fulfilling, sustainable career. Cinema is more than escape; it’s communal, foundational, and instructive. It shapes the very way we see the world. Through Daril’s story, we break down the myth that success in Hollywood is about who you know or luck — it’s about being deliberate with your relationships, relentless in your pursuit, and refusing to settle for transactional exchanges when you can build meaningful human connection instead.\n\nEpisode Sponsors:\nhttps://store.veteranmadeproductions.com/\nhttps://www.gopills.com/ -- use \u0022VM15\u0022 at checkout for 15% off your order.\nhttps://www.bubsnaturals.com/ -- use \u0022veteranmade\u0022 at checkout for 20% off your order.\nhttps://www.truemadefoods.com/ -- use \u0022VET\u0022 at checkout for 15% off your order.\nhttps://www.rucksox.com/ -- use \u0022VETERANMADE15\u0022 at checkout for 15% off your order.\nhttps://bravoactual.com/ -- use \u0022Veteran Made\u0022 at checkout for 15% off your order.\n\nIntro Song composed and produced by @cleod9music489 \n\nSOCIALS:\nhttps://www.instagram.com/veteranmade.ck/\nhttps://www.instagram.com/darilfannin/\nhttps://www.instagram.com/kinomakesmovies/\nhttp://x.com/veteranmade.ck\nhttps://x.com/kinomakesmovies",
      "release": "2025-08-04T21:29:36Z",
      "duration": "01:03:04",
      "explicit": false,
      "spotifyId": "4vg5n6degJNt7lm2ga0V7d",
      "appleId": 1000720646260,
      "youTubeId": "VM37o6ojDeI",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vg5n6degJNt7lm2ga0V7d",
        "apple": "https://podcasts.apple.com/podcast/from-a-cult-to-the-army-to-hollywood-how-an/id1554899908?i=1000720646260",
        "youtube": "https://www.youtube.com/watch?v=VM37o6ojDeI"
      }
    }
  ]
}