{
  "id": "a125cd61-7fb6-429e-a484-dc8711ffed4e",
  "name": "voidzilla",
  "youTubeChannelId": "UC28n0tlcNSa1iPe5mettocg",
  "episodes": [
    {
      "id": "6f64c744-dfb4-4b9b-bbc4-95b8764f3650",
      "title": "they\u0027re literally covering up the epstein files",
      "description": "support: https://www.patreon.com/coffeezilla\n\ndisclaimer (updated May 2025): voidzilla is an opinion‑driven channel that comments on the news of the day under the satirical and rhetorically hyperbolic banner “CRIME IS LEGAL.” the phrase critiques what we see as a lax or uneven regulatory enforcement environment for fraud. unlike our affiliated channel Coffeezilla, which conducts detailed investigations and source‑document deep dives, and draws opinions from that, voidzilla offers rapid‑fire commentary and criticism on information already in the public domain. statements here reflect the host’s views at the moment of recording and may become outdated as facts evolve. references to “crime,” “fraud,” “scam,” or similar terms appear in a rhetorical hyperbolic context similar to “CRIME IS LEGAL.” unless we expressly state that a court has entered a final judgment, no segment should be read as a definitive finding of legal liability. viewers are urged to consult primary sources and form independent conclusions. production of this program is public‑interest commentary protected by the First Amendment and the Texas Citizens Participation Act (TCPA). \n\nanyone featured in this program who believes a material error has occured may contact our business email with supporting documentation under the SUBJECT: \u0022CORRECTION REQUEST\u0022. we will promptly review substantiated notices and, where appropriate, issue corrections or updates.",
      "release": "2026-01-18T07:06:18Z",
      "duration": "00:10:33",
      "explicit": false,
      "youTubeId": "wxszxvwOhtY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wxszxvwOhtY"
      }
    }
  ]
}