{
  "id": "880f6032-2ca1-4537-9235-2a7443ae41aa",
  "name": "Vox",
  "youTubeChannelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "episodes": [
    {
      "id": "3302a538-d528-4584-9675-02db414a99c8",
      "title": "How Jeffrey Epstein fooled America | Today, Explained",
      "description": "Jeffrey Epstein remained a thriving member of the elite for decades, even when everyone seemed to know what he was doing. His sphere of influence included top political officials, CEOs, corporate executives, finance managers, and even a member of the British royal family. How did he manage it? It turns out it was by establishing an elaborate network of influence and access that went well beyond the norms and expectations of the rich and famous.\n\nWhat were the tipping points that nearly brought Epstein to justice in the 14 years before his first conviction and his final 2019 arrest? What were the structures and systems that failed to stop him from abusing and exploiting young women and girls in those 14 years? In this episode, we tick through the guest lists and institutions that continued to profit from relationships with Jeffrey Epstein — and which helped him remain free, in turn.\n\nWe will also talk about many of the conspiracy theories that have popped up since the latest tranche of Epstein documents came out. Was Epstein a national security asset? Did he actually kill himself?\n\nIndependent journalist Tara Palmeri, author of the Red Letter Substack and host of The Tara Palmeri Show, argues that conspiracies are important to help the public understand the extent and scope of the Epstein scandal — since for so long, so much about the story was covered up. We’ll make sense of which conspiracies have validity and which are tinfoil hat material, in this interview with a journalist who has long advocated for and written about the Epstein survivors.\n\n00:00 Intro: What we do and do not know about Epstein\n03:31 The stories of the Epstein survivors\n07:56 The conspiracy theories around Epstein\n11:21 The elite enablers around Epstein\n17:08 The political cover-up over Epstein\n19:13 The conspiracy theorizing around Epstein\n22:13 The elite lies around Epstein\n\nToday, Explained publishes compelling interviews with key figures in politics and culture every Saturday. Subscribe to Vox’s YouTube channel to get them or listen wherever you get your podcasts. And new episodes of Today, Explained drop every weekday on Apple Podcasts, Spotify, or your favorite listening app.\n\nIf you enjoy our reporting and want to hear more from Vox journalists, sign up for our Patreon at patreon.com/vox. Each month, our members get access to exclusive videos, livestreams, and chats with our newsroom.\n\nSubscribe to our channel! http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what\u0027s really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on Facebook: http://goo.gl/U2g06o\nOr Twitter: http://goo.gl/XFrZ5H",
      "release": "2026-02-21T13:01:02Z",
      "duration": "00:24:20",
      "explicit": false,
      "youTubeId": "WCQMgDd3dec",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WCQMgDd3dec"
      }
    }
  ]
}