{
  "_ts": 0,
  "id": "03575db8-d951-4377-928d-08fb4161a32d",
  "name": "Waller Adventures",
  "youTubeChannelId": "UCR23TDsC9mi1TkTk9rn5Rxg",
  "episodes": [
    {
      "id": "20066b4b-d414-4fdb-af1d-d567cb217d91",
      "title": "A Religious Cult in Florida? | Koreshan Unity Historic Settlement | Estero, Florida",
      "description": "A Religious Cult in Florida? | Koreshan Unity Historic Settlement | Estero, Florida\n\nWelcome to a journey through time and ideology as we delve into the captivating story of the Koreshan Unity Historic Settlement. Join us as we unravel the mysteries of this once-thriving communal utopia nestled in the heart of Estero, Florida.\n\nIn this immersive exploration, we\u0027ll traverse the picturesque landscapes and historic buildings that bear witness to the dreams and aspirations of Cyrus Teed and his followers. Learn about their visionary philosophy, which blended science, spirituality, and social equality in pursuit of a harmonious society.\n\nDiscover the fascinating architecture of the settlement, including the iconic Koreshan Unity Planetary Court, where members envisioned a celestial city governed by their unique principles. Wander through the meticulously preserved homes, gardens, and community spaces that offer a glimpse into daily life within this utopian enclave.\n\n#koreshanstatepark #esterofl #hollowearth #floridahistory #cult #cults\n#koreshanunitycult #koreshan #cyrusteed #weirdplacestovisitinflorida\n#interestingplacestovisitinflorida #leecountyflorida #thingstodoinleecountyflorida #koreshanstateparkhistory\n#untoldstoriesflorida #cultsinflorida #cultsintheusa #oldestcults\n#religiouscults\n#AReligiousCultinFloridaKoreshanUnityHistoricSettlementEsteroFlorida\n\n▶️Did you enjoy this video? Then check out our other videos.  Waller Adventures is your gateway to learning, creating new experiences, and savoring the joy of adventure.  Subscribe now and let\u0027s embark on a multi-faceted journey together!  Also, follow us on Instagram, FaceBook and Tik Tok at Waller Adventures. We upload videos every Sunday at 3pm.\n\nhttps://www.youtube.com/@WallerAdventures\n  \n▶️FaceBook: facebook.com/walleradventures\n▶️Instagram: instagram.com/waller_adventures\n▶️Merch: https://waller-adventures.myspreadshop.com/\n\n🎆Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCR23TDsC9mi1TkTk9rn5Rxg/join\n\n⚠️About: Join me on a thrilling journey through the great outdoors and beyond as I explore hidden gems and share the wonders of adventure.  Immerse yourself in the heart of history, discover off-the-beaten-path treasures, and embark on a weekly adventure that blends informative storytelling with the joy of learning.  But that\u0027s not all- our adventure extends into the heart of home with delightful cooking and gardening videos.\n\n[koreshan state park, estero fl, hollow earth, florida history, cult, cults, koreshan unity cult, koreshan, cyrus teed, weird places to visit in florida, interesting places to visit in florida, lee county florida, things to do in lee county florida, koreshan state park history, untold stories florida, cults in florida, cults in the usa, oldest cults, religious cults and A Religious Cult in Florida? | Koreshan Unity Historic Settlement | Estero, Florida]",
      "release": "2024-06-09T19:00:20Z",
      "duration": "00:57:26",
      "explicit": false,
      "youTubeId": "mp8sBTga6z8",
      "subjects": [
        "Koreshanity"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mp8sBTga6z8"
      }
    }
  ]
}