{
  "id": "a3faa059-28d5-42f9-b77e-af5866750a56",
  "name": "Was jetzt? – Die Woche",
  "spotifyId": "701JLOKWtR8u4qyblKCqRD",
  "appleId": 1698721280,
  "youTubeChannelId": "UC_YnP7DDnKzkkVl3BaHiZoQ",
  "youTubePlaylistId": "PLWK1Hx_NM2f48XRH3Eb7hHtZaLQc2NaTY",
  "episodes": [
    {
      "id": "71a0ecfb-985e-4ce3-9dcf-c9ec841b8c6e",
      "title": "Epstein-Files – Wer schützt hier wen?",
      "description": "Korrektur: In einer früheren Version dieses Videos wurde fälschlicherweise angegeben, Ghislaine Maxwell stamme aus bescheidenen Verhältnissen. Die Epstein-Akten sind eine massive Datenflut: über drei Millionen Seiten mit Dokumenten, Videos und Fotos. In Europa haben die Veröffentlichungen bereits konkrete Folgen. Ex-Botschafter treten zurück, Minister geraten unter Verdacht, Königshäuser stehen unter öffentlichem Druck. Auch in Deutschland wächst der politische Druck , mögliche Verbindungen systematisch auszuwerten; Abgeordnete fordern eine Prüfung durch die Nachrichtendienste und eine transparente Aufarbeitung möglicher Kontakte. In den USA hingegen verlagert sich die Debatte bislang vor allem auf formale Fragen der Veröffentlichung : Schwärzungen, Fristen, Zuständigkeiten – und auf parteipolitische Schuldzuweisungen. Politische oder juristische Konsequenzen für schwer belastete Spitzenfiguren bleiben weitgehend aus. Kritiker werfen dem Justizministerium vor, mit fehlerhaften Schwärzungen den Opferschutz zu unterlaufen und zugleich den Eindruck selektiver Geheimhaltung zu erwecken. So droht die Aufarbeitung in prozeduralen Debatten steckenzubleiben, während die Aussagen der Überlebenden erneut an den Rand gedrängt werden. Eine der wichtigsten Fragen bleibt: Wann, wenn überhaupt, wird endlich aus der Perspektive der Opfer verstanden und debattiert? Wie kann es sein, dass die Aufklärung bis heute blockiert wird? Und für wen könnten die Files doch noch gefährlich werden? Darüber spricht Dilan Gropengiesser in der 127. Folge von Was jetzt? – Die Woche mit Rieke Havertz , internationale ZEIT-Korrespondentin und Co-Gastgeberin des Podcasts OK, America? . Unsere Sendung sehen Sie immer donnerstags auf zeit.de und auf YouTube .",
      "release": "2026-02-12T15:52:18Z",
      "duration": "00:24:37.9730000",
      "explicit": false,
      "spotifyId": "7tbrjlqJpXd2qbNzMFDzIR",
      "appleId": 1000749450091,
      "youTubeId": "0goFgs9PYXg",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7tbrjlqJpXd2qbNzMFDzIR",
        "apple": "https://podcasts.apple.com/podcast/epstein-files-wer-sch%C3%BCtzt-hier-wen/id1698721280?i=1000749450091",
        "youtube": "https://www.youtube.com/watch?v=0goFgs9PYXg"
      }
    }
  ]
}