{
  "_ts": 0,
  "id": "6cd6deb2-a733-4b06-af61-0234a54344e9",
  "name": "Was I In A Cult?",
  "spotifyId": "43lKIk7Tt69S4tdCpHWCnH",
  "appleId": 1582863762,
  "episodes": [
    {
      "id": "a347f69b-ee7d-4fb3-8538-5f9bbd2327d4",
      "title": "Solid Rock Church: “My Dad, the Cult Leader”",
      "description": "What happens when your father becomes your pastor and eventually your cult leader? In this episode, Emily Maldonado shares the raw truth about growing up in a cult led by her own dad. From staged exorcisms to discovering that love and freedom could only come by breaking every rule, Emily’s story is heartbreaking and inspiring. With gripping honesty, she unpacks the jaw-dropping moment she knew she had no choice but to leave… and for Emily, leaving meant losing her entire family. With humor and profound resilience, Emily shares how she escaped a life dictated by manipulation—and found the strength to rebuild a life of joy and authenticity.  \n___\nControl Body Odor ANYWHERE with @lumedeodorant and get 15% off with promo code “inacult” LumeDeodorant.com! #lumepod\n__\nFollow Emily on Insta/Tiktok: @styledmicasa\n__\nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult  \nMerch is here! www.wasiinacult.com",
      "release": "2024-10-28T04:10:50Z",
      "duration": "01:13:41",
      "explicit": false,
      "spotifyId": "5rHVdAnH3Jlb9V90KzN8ke",
      "appleId": 1000674695035,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rHVdAnH3Jlb9V90KzN8ke",
        "apple": "https://podcasts.apple.com/podcast/solid-rock-church-my-dad-the-cult-leader/id1582863762?i=1000674695035"
      }
    },
    {
      "id": "df673f02-f088-4017-a94f-645b7968fad3",
      "title": "QAnon: “Control \u002B Alt \u002B Delulu”",
      "description": "Ashley takes us inside the twisted world of QAnon—an online cult that spread like wildfire during the pandemic, offering false hope through dangerous conspiracies to those seeking community, connection and autonomy in an unraveling world. Ashley reveals how fear tactics and manipulation lured her into a space where JFK Jr. was alive, Tom Hanks was an international trafficker, and every catastrophe was proof of an elite plot.\n\nFrom Instagram rabbit holes to FOIA requests about hot dogs at the White House, Ashley unpacks the absurdity and real danger behind QAnon’s grip. This is not just a story of strange beliefs—it’s a story of control, trauma, and ultimately, resilience. Join us as Ashley explains how she reclaimed her mind, her sanity, and her life—one hard truth at a time.\n____\n\nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult  \nMerch is here! www.wasiinacult.com",
      "release": "2024-10-21T01:59:21Z",
      "duration": "01:04:33",
      "explicit": false,
      "spotifyId": "6cyPTupUQN4KpzDtxOtK1P",
      "appleId": 1000673814087,
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cyPTupUQN4KpzDtxOtK1P",
        "apple": "https://podcasts.apple.com/podcast/qanon-control-alt-delulu/id1582863762?i=1000673814087"
      }
    },
    {
      "id": "6b0d1beb-8dce-4007-998e-63677148679a",
      "title": "Falun Gong P2: “Falun Gone… For Good”",
      "description": "In Part 2 of Angela\u0027s story, the realities of Falun Gong’s grip on her family deepen. Angela reflects on the emotional toll of a cult that prioritized spiritual salvation over physical health—even as her mother’s condition worsens. But escaping isn’t easy when your family remains deep in the cult’s ideologies… Angela’s journey out of this cult is filled with heartbreaking revelations and the resilience that defines a true “surthirver.” ____ Donate to CUDDLY today! Head to cuddly.com/CULT and help make a difference! Angela on TikTok/Instagram: @workplace_doodles Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys) Merch is here! www.wasiinacult.com",
      "release": "2024-10-14T05:19:26Z",
      "duration": "00:52:57.1160000",
      "explicit": false,
      "spotifyId": "5KGYXaDe7AYHxnapxUMi3T",
      "appleId": 1000673017153,
      "subjects": [
        "Falun Gong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KGYXaDe7AYHxnapxUMi3T",
        "apple": "https://podcasts.apple.com/podcast/falun-gong-p2-falun-gone-for-good/id1582863762?i=1000673017153"
      }
    },
    {
      "id": "549cf62a-7e44-434f-884d-422fab99db03",
      "title": "Falun Gong P1: “Karma Claus... He’s Always Watching\u0022",
      "description": "When her mother fell sick, young Angela had no idea that she would spend her childhood growing up in a dangerous cult. Falun Gong, a Chinese spiritual movement-slash-religion-slash-cult, known for its Shen Yun dancers and its ties to \u0027The Epoch Times’ entangled her family in its facade of meditation and enlightenment. In this two-part episode, Angela recounts her experience in a world where karma is not just a bitch, but a force that can dictate life and death… with suffering seen as path to salvation and modern medicine demonized as an obstacle to spiritual purity. And just when you think it can’t get any wilder, the Capitol Insurrection storms into the story… Stay tuned next week for Part Two. ____ Angela on TikTok: @workplace_doodles Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com Tyler’s Boring Book Club addition: \u0022How We Got to Now: Six Innovations That Made the Modern World\u0022",
      "release": "2024-10-07T05:22:44Z",
      "duration": "00:47:04.2020000",
      "explicit": false,
      "spotifyId": "3QlN2mKh2iMks0RhF8jEjR",
      "appleId": 1000672046482,
      "subjects": [
        "Falun Gong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QlN2mKh2iMks0RhF8jEjR",
        "apple": "https://podcasts.apple.com/podcast/falun-gong-p1-karma-claus-hes-always-watching/id1582863762?i=1000672046482"
      }
    },
    {
      "id": "738c118c-843f-4c2f-aa24-3091e3d179d6",
      "title": "Women Only Secret Society (NXIVM) PT1: “The Magic Sauce” (UPDATE)",
      "description": "**NOTE: This episode originally aired in 2021** When the LA party scene didn\u0027t fit Jessica\u0027s lifestyle anymore, she replaced martinis and after-hour clubs with green juices and tonic bars. But the reemergence of a childhood trauma forced her to examine her inner self. One day, a friend told her about a class that could improve her life even more. That class turned out to be part of a larger entity. A self-empowerment company that purported to help you become the master of your own life. A little group called... NXIVM. Find Jessica\u0027s book here Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com",
      "release": "2024-09-30T05:06:44Z",
      "duration": "01:03:15.6170000",
      "explicit": false,
      "spotifyId": "1aJZ9Zs1H6FbVAtlPO7r4x",
      "appleId": 1000671282811,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1aJZ9Zs1H6FbVAtlPO7r4x",
        "apple": "https://podcasts.apple.com/podcast/women-only-secret-society-nxivm-pt1-the-magic-sauce-update/id1582863762?i=1000671282811"
      }
    },
    {
      "id": "eecd846e-607b-4679-9d7f-ed269f82d4e0",
      "title": "Australian Vegan Cult: “Lambs on the Lam”",
      "description": "In this week’s episode, Hannah takes us from her Jehovah’s Witness upbringing to a wild journey through the world of an extreme vegan cult. What started as a passion for animal welfare escalated into living on a full fledged animal sanctuary, becoming the hub for Vegan’s of Geelong, and spiraling into breaking and entering in the name of “liberation.” Fueled by conspiracies and paranoia, Hannah’s new “family” pushed the boundaries of activism. With candor and lightheartedness, Hannah shares how she escaped one cult, only to fall into another, and what it took to break free for good. ____ Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com",
      "release": "2024-09-23T05:15:39Z",
      "duration": "00:58:54.6280000",
      "explicit": false,
      "spotifyId": "5CCtofL8lX3Z0NmUPFL0AX",
      "appleId": 1000670397767,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5CCtofL8lX3Z0NmUPFL0AX",
        "apple": "https://podcasts.apple.com/podcast/australian-vegan-cult-lambs-on-the-lam/id1582863762?i=1000670397767"
      }
    },
    {
      "id": "007a56bd-ab62-4e23-815c-760707ae132c",
      "title": "The Two-by-Twos: “Be sad and die.”",
      "description": "Today’s guest, Meagan, host of the \u0022Trust Me\u0022 podcast, shares her journey growing up in the secretive Christian cult known as the Two-by-Twos. From a childhood dictated by oppressive rules that governed her every move, she reveals how this “hidden” religion shaped her life. With wit and raw honesty, Meagan recounts the manipulation and isolation she endured, and how she finally found the strength to break free. \nAnd shortly after, when the cult’s darkest truths finally surfaced for all the world to see, her entire idea of her childhood came crashing down. This wasn’t just a tightly controlled Christian sect, but something far more sinister… \n_____\n\nListen to Meagan’s podcast, “Trust Me: Cults, Extreme Beliefs, \u0026 Manipulation” wherever you get your podcasts.  \nFollow Trust Me: @trustmepodcast\nFollow Meagan: @meaganelizabethgrainger\nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys) \nMerch is here! www.wasiinacult.com",
      "release": "2024-09-16T05:53:31Z",
      "duration": "01:01:06",
      "explicit": false,
      "spotifyId": "7vtLKRx3e2BCEA8HOAEhDp",
      "appleId": 1000669693709,
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vtLKRx3e2BCEA8HOAEhDp",
        "apple": "https://podcasts.apple.com/us/podcast/the-two-by-twos-be-sad-and-die/id1582863762?i=1000669693709"
      }
    },
    {
      "id": "200555a7-6f5b-40f6-829d-912e0bc9fe9c",
      "title": "A Theater Group: “Lights… Camera… Cult!”",
      "description": "They say when you dream, dream big. And teenage Alex did just that. With an accent to die fahhh, this East Bostonian shares his story of joining an acting class with the promise of stardom, only to eventually realize, he was in a manipulative cult. Under the influence of a charismatic coach, Alex and his fellow students were pushed to the brink—endless rehearsals, emotional abuse, and mind games that blurred the line between ambition and exploitation. Alex exposes the dangerous allure of fame when you place the success of your future in the wrong hands... What happens when your dream become a nightmare? _____ Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys) Merch is here! www.wasiinacult.com ______ Control Body Odor ANYWHERE with @lumedeodorant and get 15% off with promo code Inacult at LumeDeodorant.com! #lumepod ______ Try CBD at cbdistillery.com and use code CU LT for 20% off.",
      "release": "2024-09-09T05:14:55Z",
      "duration": "00:48:30.2750000",
      "explicit": false,
      "spotifyId": "2zdwEdyIZqc614w5hon4Y2",
      "appleId": 1000668869841,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zdwEdyIZqc614w5hon4Y2",
        "apple": "https://podcasts.apple.com/podcast/a-theater-group-lights-camera-cult/id1582863762?i=1000668869841"
      }
    },
    {
      "id": "c4871b48-b324-42a1-aa72-bb9a50532a9a",
      "title": "The Wolf of Wall Street: “A Cult of One”",
      "description": "Dr. Nadine Macaluso joins us today to discuss our first of its kind on this show… a cult of one. Who exactly was her cult leader? None other than “The Wolf of Wall Street,” her ex-husband, Jordan Belfort.  In the movie adaptation of Jordan’s book, “The Wolf of Wall Street,” Dr. Nadine was portrayed by Margot Robbie and had no say in how her life was portrayed. Well, today Dr. Nadine is here to share the truth behind her picture perfect life. On the outside she had beauty, wealth, the doting husband, and two wonderful kids. But today she shares the truth about what was going on behind closed doors: the isolation, the loss of self, the abuse, the control, the manipulation and the gaslighting that kept her in a haze of confusion and pain. But, like every guest on this show, she shares the moment she finally found the strength and courage to walk away for good. \n\nNow a respected therapist, Dr. Nae emphasizes the importance of therapy in her healing process and destigmatizing the experiences of victims of cult leaders or pathological lovers. A Brooklyn gal at heart, Dr. Nae is as real as they get and was an absolute joy to have on the show. \n_____\n\nFollow Dr. Nae: Instagram: @therealdrnadine / TikTok: @drnaelmft\nBuy Dr. Nae\u0027s book HERE \nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys) \nMerch is here! www.wasiinacult.com",
      "release": "2024-09-02T06:41:47Z",
      "duration": "01:04:29",
      "explicit": false,
      "spotifyId": "1KdAjsQhkqhx2JqIGVgw3g",
      "appleId": 1000668051997,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1KdAjsQhkqhx2JqIGVgw3g",
        "apple": "https://podcasts.apple.com/us/podcast/the-wolf-of-wall-street-a-cult-of-one/id1582863762?i=1000668051997"
      }
    },
    {
      "id": "c5cf43e5-e2dd-4c35-a445-722aaf061e40",
      "title": "TITLE: The Mel Lyman Family PT1: “People Get Ready” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2021**\nAs an actor and writer, Guinevere Turner understands more than most, that some stories just can\u0027t be contrived. Because sometimes life is far stranger than fiction. As is the case with Guinevere\u0027s upbringing. Not your typical getting out story, it would take years for Guinevere to understand that, no, she didn\u0027t grow up on a hippie commune in the 1970s and 80s... she grew up in a cult. \n______ \nFollow Guinevere: @guinevereturner \nBuy Guinevere’s book HERE \nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon \nMerch is here! www.wasiinacult.com \nLink to Spotify playlist for this episode",
      "release": "2024-08-26T00:04:58Z",
      "duration": "00:56:42",
      "explicit": false,
      "spotifyId": "4ra6RJ59Z00AhGdPyFrRdU",
      "appleId": 1000666646490,
      "subjects": [
        "The Lyman Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ra6RJ59Z00AhGdPyFrRdU",
        "apple": "https://podcasts.apple.com/us/podcast/title-the-mel-lyman-family-pt1-people-get-ready-update/id1582863762?i=1000666646490"
      }
    },
    {
      "id": "ba7984b2-a492-4d68-b3be-3389932f186f",
      "title": "LISTEN NOW: “Nobody Should Believe Me”",
      "description": "Today, we\u0027re excited to bring you a special episode from our friend Andrea Dunlop of the “Nobody Should Believe Me” podcast.Last week, Andrea joined us to share her personal story about how Munchausen by Proxy tore her family apart, and the response was overwhelming. We know many of you were left with questions and a desire to dive deeper into this rare and troubling condition. That’s why we wanted to share Andrea’s own podcast, where she explores these themes in greater depth and answers the questions that our conversation only began to uncover. We hope you find this episode as compelling as we do. We’ll be back in two weeks with an all-new episode. Thank you, as always, for your continued support! —— We meet accomplished novelist and loving mother Andrea Dunlop as she embarks on a journey to understand the series of events that tore her family apart. We learn that her older sister has been investigated twice for Munchausen by Proxy abuse, which inspired Andrea to learn everything she could about this complex and misunderstood issue. We see Andrea become captivated by the story of Hope Ybarra and go along with her to meet Hope’s father, sister, and brother: the first people Andrea has ever spoken to who’ve actually lived through a case. But can anything prepare Andrea for the truth? __ LISTEN TO “Nobody Should Believe Me” here: https://www.nobodyshouldbelieveme.com/ ___ Merch is here! www.wasiinacult.com Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon",
      "release": "2024-08-19T05:02:29Z",
      "duration": "00:35:17.7990000",
      "explicit": false,
      "spotifyId": "590GGerMEEHdsLBQYCl8c8",
      "appleId": 1000665877885,
      "urls": {
        "spotify": "https://open.spotify.com/episode/590GGerMEEHdsLBQYCl8c8",
        "apple": "https://podcasts.apple.com/podcast/listen-now-nobody-should-believe-me/id1582863762?i=1000665877885"
      }
    },
    {
      "id": "cf5af743-d922-4a13-b092-90be48835ca0",
      "title": "Munchausen by Proxy: “My Sister the Perpetrator”",
      "description": "When your sister, whom you love, fabricates a pregnancy with twins, it’s alarming. But when you eventually come to discover that your sister is the culprit of Munchausen by Proxy, life as you know it will never be the same.\n\nToday, Andrea Dunlop, a novelist and podcaster of the successful podcast, “Nobody Should Believe Me” joins us to share her personal experience with her sister’s Munchausen by Proxy abuse and delves into her family background and where it all began. Fabricated illnesses and surgeries escalate to abuse of her own children. And the question we are all wondering: Are instigators of this disorder aware of what they are doing?? Listen now to find out… \n\nFollow Andrea: @andreadunlop \nListen to “Nobody Should Believe Me” wherever you get your podcasts.\nFollow the show: @nobodyshouldbelievemepod\nResources for those dealing Munchausen by Proxy, visit: munchausensupport.com \nAndrea’s Books:\nWe Came Here to Forget \nLosing the Light\nShe Regrets Nothing\nWomen are the Fiercest Creatures \n\nFollow us on Instagram/TikTok/F B:  @wasiinacult\n\nHave your own story? Email us: info@wasiinacult.com \n\nPlease support Was I In A Cult? Through Patreon\n\nWe have MERCH! Head to our website for the link: www.wasiinacult.com",
      "release": "2024-08-12T04:16:31Z",
      "duration": "01:05:19",
      "explicit": false,
      "spotifyId": "65xjRaCkgPUVCNM2W74qRv",
      "appleId": 1000665023054,
      "urls": {
        "spotify": "https://open.spotify.com/episode/65xjRaCkgPUVCNM2W74qRv",
        "apple": "https://podcasts.apple.com/us/podcast/munchausen-by-proxy-my-sister-the-perpetrator/id1582863762?i=1000665023054"
      }
    },
    {
      "id": "47122fb3-5f82-488e-b7e4-49e969a897b3",
      "title": "Maum Meditation “Cleanse Mind (aka) Brain Wash”",
      "description": "Today, Diamond King shares her poignant journey of being ensnared by a meditation cult known as MAUM Meditation. Promising enlightenment, the group diverted her from personal goals and desires, ultimately causing her to completely disassociate from reality. Through the unwavering support of a loved one and diligent personal research, Diamond uncovered the cult\u0027s financial and spiritual abuse and manipulation, empowering her to break free. Now a thriving teacher, she travels the world, spreading her wisdom and embracing her authentic self. Diamond shares her cautionary tale with humor and compassion, and it was truly a delight to have her on the show. ___ Find Diamond: @therealdiamondking Follow us on Instagram / TikTok / F B : @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon We have MERCH! Head to our website for the link: www.wasiinacult.com",
      "release": "2024-08-05T05:36:17Z",
      "duration": "00:46:16.0320000",
      "explicit": false,
      "spotifyId": "1frMvRZfaHtcfW2Fk25GkI",
      "appleId": 1000664363264,
      "subjects": [
        "Maum Meditation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1frMvRZfaHtcfW2Fk25GkI",
        "apple": "https://podcasts.apple.com/podcast/maum-meditation-cleanse-mind-aka-brain-wash/id1582863762?i=1000664363264"
      }
    },
    {
      "id": "63eeb8e8-fe75-47e4-82cf-2b97ea2d8cc2",
      "title": "Millionaire’s Club: “The World Was Gonna Open Up” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2022**\nCONTENT WARNING: This episode discusses sexual assault. \n\nArianna was a recent college graduate with dreams of one day opening her own marketing company. So when a LinkedIn opportunity for a social media marketing assistant fell into her lap, it felt too good to be true. Soon, she would be brushing shoulders with millionaires, in hopes that some of their mojo would rub off. After all, she had big plans for her future and a self-made father to prove herself to. But, you know what they say about things being too good to be true... They usually are. This brave, inspiring woman is here to share her very important story of what exactly happened when she got involved with this Nashville \u0022Millionaire\u0027s Club.” \n___\n\nArianna on Instagram: @ariannasprabary  \nArianna on TikTok: Aristrawberry0  \nFollow us on Instagram/TikTok/F B:  @wasiinacult\nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon  \nWe have MERCH! Head to our website for the link: www.wasiinacult.com",
      "release": "2024-07-29T06:30:07Z",
      "duration": "01:06:39",
      "explicit": false,
      "spotifyId": "5FZa3rigKpeO539M6O2eiz",
      "appleId": 1000663679239,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5FZa3rigKpeO539M6O2eiz",
        "apple": "https://podcasts.apple.com/us/podcast/millionaires-club-the-world-was-gonna-open-up-update/id1582863762?i=1000663679239"
      }
    },
    {
      "id": "9fd91578-2239-4c09-8264-4693f61c0d8a",
      "title": "Bikram Yoga: “Smells Like Wet Carpet”",
      "description": "After finding her passion in Bikram Yoga while in her 20s, Jennifer Boeder aspires to become a Bikram teacher and plops down $5000 to sign up for the two-month teacher training. But after only a few days of being trapped in a smelly, windowless warehouse and getting yelled at by sycophantic trainers, she starts to see the truth. Turns out the \u0022great and powerful guru,\u0022 Bikram Choudhury, is less great and powerful, and more toxic and tyrannical. From the degrading remarks to the unbearable conditions, Jennifer’s story highlights the dark side of a supposed path to enlightenment. —— Merch is arriving! Click here to check it out. —— Thanks to everyone who supports our show. It really helps us. Can’t afford to contribute monetarily? Reviews and ratings help a bunch. Thank you. If you would like to support us, head to our Patreon Follow us: instagram / TikTok @ wasiinacult Find Jennifer: @jenniferruth Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-07-22T05:23:25Z",
      "duration": "00:59:15.9700000",
      "explicit": false,
      "spotifyId": "4cwwrH03ekmLTdstY7h1rN",
      "appleId": 1000662973602,
      "subjects": [
        "Bikram Yoga"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cwwrH03ekmLTdstY7h1rN",
        "apple": "https://podcasts.apple.com/podcast/bikram-yoga-smells-like-wet-carpet/id1582863762?i=1000662973602"
      }
    },
    {
      "id": "d81f5b08-50c4-49fb-a925-6204dd1ba9ac",
      "title": "My Dad’s A Cult Leader: “The Failed Love Movement\u0022",
      "description": "A couple weeks ago we published an episode featuring Ashleigh Teeter, who was ostracized from her family because of her cult leader father. Today we feature her youngest brother\u0027s story of growing up in that house long after Ashleigh was gone. 14 years her junior, Mattie was just a young boy when her sister was deemed demonic by his father. And for almost 25 years the siblings never spoke to each other. Today we welcome Mattie to share his heartbreaking story… a boy who was never allowed to talk to a girl without brutal consequences. —— Today, Mattie and Ashleigh are not only reunited but they host a podcast about their upbringing together. It’s called “The Cult Next Door” and is available wherever you get your podcasts. —— Thanks to everyone who supports our show. It really helps us. Can’t afford to contribute monetarily? Reviews and ratings help a bunch. Thank you! If you would like to support us, head to our Patreon Follow us: instagram/TikTok @wasiinacult Listen to Mattie \u0026 Ashleigh\u0027s podcast: The Cult Next Door @cultnextdoorpodcast (insta/tiktok) Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-07-15T00:00:00",
      "duration": "01:02:11.6700000",
      "explicit": false,
      "spotifyId": "7sKNLiRX85odAr1VEkzKGZ",
      "appleId": 1000662277507,
      "subjects": [
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7sKNLiRX85odAr1VEkzKGZ",
        "apple": "https://podcasts.apple.com/us/podcast/my-dads-a-cult-leader-the-failed-love-movement/id1582863762?i=1000662277507"
      }
    },
    {
      "id": "670c1f9e-83e4-4157-b392-6392f99b11c0",
      "title": "MLM LuLaRoe: “What’s Your Why?” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2022** She\u0027s a hustler, baby. And she just wants you to know. Roberta Blevins was taught to be a self-starter. Inspired by her self-made father, she knew that if you put your mind to it, anything can happen. And it\u0027s true. Anything can happen. But that\u0027s the problem with anything. Anything sometimes includes MLM\u0027s. Multi-level marketing (schemes). This is a story of a dynamite go-getter and how she crawled her way into a box of fart leggings and eventually... crawled her way out. — Roberta hosts her own podcast: Life After MLM. Check it out! @lifeaftermlmpodcast — Find us on Instagram/Tiktok: @wasiinacult (Instagram for the legging pic!) Help keep this show going by supporting us on Patreon Have your own story and want to be on our show? Email us: info@wasiinacult.com Follow Roberta: @therealrobertablevins",
      "release": "2024-07-08T08:00:00Z",
      "duration": "01:07:58.1840000",
      "explicit": false,
      "spotifyId": "3XNP5btzknv5MWtQxVjsom",
      "appleId": 1000661521348,
      "subjects": [
        "Multi-Level Marketing",
        "LuLaRoe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XNP5btzknv5MWtQxVjsom",
        "apple": "https://podcasts.apple.com/podcast/mlm-lularoe-whats-your-why-update/id1582863762?i=1000661521348"
      }
    },
    {
      "id": "c837cf1a-2104-434c-ba01-8dc2a92a684c",
      "title": "A Cult Divided: “Running to Freedom\u0022",
      "description": "Today\u0027s episode dives into the extraordinary story of Ashleigh Teeter, who grew up in the World Wide Church of God... a cult in its own right. But when the church splits due to a new leader’s ideas, Ashleigh’s world gets turned upside down. She witnesses her own father become a cult leader, and then get ostracized from her nuclear family for almost 25 years. Why? Listen to find out.\n—— \nAshleigh hosts her own podcast about her upbringing. It’s called “The Cult Next Door” and is available wherever you get your podcasts.\n—— \nThanks to everyone who supports our show. It really helps! \nIf you don’t yet, but would like to, head to our Patreon \nFollow us: instagram/TikTok @wasiinacult\nListen to Ashleigh’s podcast: The Cult Next Door @cultnextdoorpodcast (insta/tiktok)\nFollow Ashleigh: @ashleighrb5\nHave your own story and want to be on our show? \nEmail us: info@wasiinacult.com\n—— \nTry VIIA Hemp! https://bit.ly/viiainacult and use code INACULT! (15% off)",
      "release": "2024-07-01T04:24:54Z",
      "duration": "01:03:50",
      "explicit": false,
      "spotifyId": "6scGzkBDQnsfGZd5FjGQHp",
      "appleId": 1000660749075,
      "subjects": [
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6scGzkBDQnsfGZd5FjGQHp",
        "apple": "https://podcasts.apple.com/us/podcast/a-cult-divided-running-to-freedom/id1582863762?i=1000660749075"
      }
    },
    {
      "id": "ad51df13-a8de-4f51-b00c-de07b68345d5",
      "title": "US Air Force: “Not Just a Pretty Face, Sir.”",
      "description": "WARNING: This episode discuss sexual assault. A girl with a dream, Amanda was recruited from high school into what she thought would be the path to fulfilling that dream. But a superior\u0027s abuse of power forced her life in a different direction. This is a powerful and important story shared from an often underrepresented perspective: a woman in the US military. Told with grace, strength, humility, and humor, it is an absolute pleasure providing Amanda with a platform to let her story be known. ___ Thanks to everyone who supports our show. It really helps! If you don’t yet, but would like to, head to our Patreon (thank you and thank you) Follow us: instagram/TikTok @wasiinacult Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-06-24T05:37:14Z",
      "duration": "01:02:16.3200000",
      "explicit": false,
      "spotifyId": "6BNYzpiwpIaDcFqnR1RGfu",
      "appleId": 1000660047310,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6BNYzpiwpIaDcFqnR1RGfu",
        "apple": "https://podcasts.apple.com/podcast/us-air-force-not-just-a-pretty-face-sir/id1582863762?i=1000660047310"
      }
    },
    {
      "id": "eff99f72-62e4-43f3-8ee3-a327c33915a2",
      "title": "S-Factor Pole Dancing - PT2: “Emotional Roadkill”",
      "description": "Welcome to PART 2 of Jessica Hopper’s journey into and out of a pole dancing cult. This episode takes us to the peak of the cult, including protégés, unpaid labor, surreal bookclubs, emotional breakdowns, and coercion retreats. The leader, Sheila, is quite “pole\u0022-arizing, to say the least. Jessica’s breaking point, comes at an unexpected but important time in history, and leads to her eventually breaking free. A wonderfully articulate soul who shares her story with a no-holds-bar type of attitude, Jessica’s wit and vulnerability shine through in her retelling. Thank you again for showing us, Jessica, that cults can live literally anywhere. Support us and our show on Patreon Follow us: instagram/TikTok @wasiinacult Follow Jessica: instagram: @jesshopperpole Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-06-17T04:22:24Z",
      "duration": "00:55:15.3560000",
      "explicit": false,
      "spotifyId": "2eoPIixJqBwMXhZvJqHUnR",
      "appleId": 1000659255117,
      "subjects": [
        "S Factor Studio"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2eoPIixJqBwMXhZvJqHUnR",
        "apple": "https://podcasts.apple.com/podcast/s-factor-pole-dancing-pt2-emotional-roadkill/id1582863762?i=1000659255117"
      }
    },
    {
      "id": "027f37a1-3a38-4b68-a71f-55077375af23",
      "title": "S-Factor - PT1: “Pole Dancing to Solve the Patriarchy”",
      "description": "Meet the very funny and very bold Jessica Hopper, as she dives into her bizarre and unexpected journey into a pole dancing cult. Yes, a pole dancing cult at a studio called S-Factor in Los Angeles, CA. What began as a fun pole dancing class turned into an intense, all-consuming experience. Jessica shares her story of quitting her job, enduring rigorous and costly training, and grappling with the beginnings of the cult-like culture within S-Factor. With humor and honesty, Jessica reveals the highs and lows, the camaraderie and the disillusionment. This is just PART 1 of her illuminating experience. Thank you, Jessica. You are an absolute hoot, and it was so fun to have you on the show. Support us and our show on Patreon Follow us: instagram/TikTok @wasiinacult Follow Jessica: instagram: @jesshopperpole Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-06-10T05:13:48Z",
      "duration": "01:09:36.8210000",
      "explicit": false,
      "spotifyId": "09lBNkoGLFeX2c6IXTc0qD",
      "appleId": 1000658446597,
      "subjects": [
        "S Factor Studio"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09lBNkoGLFeX2c6IXTc0qD",
        "apple": "https://podcasts.apple.com/podcast/s-factor-pt1-pole-dancing-to-solve-the-patriarchy/id1582863762?i=1000658446597"
      }
    },
    {
      "id": "a31a1ead-17bd-4482-a46b-6f09a8d0d043",
      "title": "An Islamic Sect: “Stolen Innocence”",
      "description": "WARNING: This episode contains graphic discussions of abuse and self-harm. Raised by a single mother in the Muslim community, Samir Ahmed was sent to a Tablighi Jamaat-focused madrasa at age 11, a religious boarding school for boys under 15. With good intentions and pressure from the community, his mother hoped this would keep her son away from drugs and knocking up girls. What transpires is one of the most harrowing stories we have ever featured on this show. But as Samir recounts his traumatic experiences with remarkable vulnerably and poise, listeners will hear the resilience and strength that define him. With his huge heart, Samir proves that your voice is one of the most powerful tools you own. Thank you again, Samir. It was an honor to share your story. Support us and our show on Patreon Follow us on Instagram/TikTok: @wasiinacult Have your own story and want to be on our show? Email us: info@wasiinacult.com Try VIIA Hemp! and use code INACULT! (15% off)",
      "release": "2024-06-03T03:45:35Z",
      "duration": "00:59:54.1350000",
      "explicit": false,
      "spotifyId": "4BK6bvOEaSCM8yPZohAIdJ",
      "appleId": 1000657652348,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BK6bvOEaSCM8yPZohAIdJ",
        "apple": "https://podcasts.apple.com/podcast/an-islamic-sect-stolen-innocence/id1582863762?i=1000657652348"
      }
    },
    {
      "id": "403cc029-bbb1-4556-969b-8a94cb4d4778",
      "title": "John Frum Movement: “GI Joe, The American… God?”",
      "description": "On a “Very Special Episode” of \u0022Was I In A Cult?\u0022 … Today, we take a detour from our usual format to pay homage to Memorial Day by uncovering the bizarre and captivating tale of the John Frum Movement. Yes, that’s ‘from’ with a ‘u’, homies. Today, we’re diving into the South Pacific’s volcanic island of Tanna, where WWII soldiers inspired a cult devoted to a mystical American GI promising endless cargo. Yup, infinite Spam. Think of it as Amazon Prime meets religious zeal. So join Tyler \u0026 Liz as they explore this fascinating slice of history, filled with bamboo runways, makeshift military drills, and a whole lot of hope. So, if you’re ready for a wild ride through the enchanting and eccentric world of cargo cults, buckle up. We’re sorry—and you’re welcome. Don’t forget to join “Tyler’s Boring Book Club” by supporting his book recommendations here: \u0022Guns, Germs, and Steel” by Jared Diamond: https://www.amazon.com/dp/0393354326/ref=cm_sw_r_as_gl_api_gl_i_4VQFG86WC22Z6WV3780Q?linkCode=ml1\u0026tag=wasiinacult-20 \u0022Prisioners of the Castle\u0022 by Ben Macintyre: https://www.amazon.com/dp/0593136357/ref=cm_sw_r_as_gl_api_gl_i_2FQQA5EN2YVAGPA9YV9F?linkCode=ml1\u0026tag=wasiinacult-20 And support us on Patreon to keep the weirdness coming: https://www.patreon.com/wasiinacult Follow us: @wasiinacult Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-05-27T06:44:42Z",
      "duration": "00:37:24.8060000",
      "explicit": false,
      "spotifyId": "5jllUbWyKGj62LNXcFsAkL",
      "appleId": 1000656901905,
      "subjects": [
        "John Frum"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jllUbWyKGj62LNXcFsAkL",
        "apple": "https://podcasts.apple.com/podcast/john-frum-movement-gi-joe-the-american-god/id1582863762?i=1000656901905"
      }
    },
    {
      "id": "641c82fe-522c-49a6-a782-cd64371d4e8e",
      "title": "Ballet 58: “Pray, then plié!”",
      "description": "SHOWNOTES: \u0022A ballet cult?” We asked the same thing. But today’s brave guest, Summer Smith, shares what happens when the world of pliés and pirouettes meets dogmatic devotion. Raised in a strict religious family and molded by the intense world of competitive ballet, Summer\u0027s journey takes a surprising twist when she joins Ballet 58, a seemingly innocuous Christian ballet company in Chicago. Soon devotions blend with dance routines, and artistic discipline intertwines with cult-like control. As Summer navigates the thin line between dedication and manipulation, you\u0027ll be left questioning just how far the influence of a charismatic leader can reach. LINKS: Follow Us: Instagram/Tik Tok: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email Us: info@wasiinacult.com Find Summer and all the ex Ballet 58’ers sub Reddit: https://www.reddit.com/r/ex58/ Watch In The Balance: https://vimeo.com/535912792/7551d1ed90",
      "release": "2024-05-20T04:33:55Z",
      "duration": "00:58:23.8040000",
      "explicit": false,
      "spotifyId": "2NuqeSwgWi24Atv0ZkFxHo",
      "appleId": 1000656130800,
      "subjects": [
        "Ballet 5:8"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NuqeSwgWi24Atv0ZkFxHo",
        "apple": "https://podcasts.apple.com/podcast/ballet-58-pray-then-pli%C3%A9/id1582863762?i=1000656130800"
      }
    },
    {
      "id": "ba66e574-5948-4dc6-ad1b-a40f228ceca3",
      "title": "UCKG: “Taking down a Billionaire Megachurch Cult”",
      "description": "Meet Rachael Reign, a tenacious activist battling to dismantle a billionaire megachurch cult. The cult that once owned her life. From her innocent introduction to the Universal Church of the Kingdom of God (UCKG) in South London as a 13-year-old girl, to devastating financial coercion and insidious practices, including exorcisms and grooming to become a pastor’s wife, Rachael\u0027s journey is one of transformation from victim to advocate. Through her story, she exposes the cult’s billionaire leader, Edir Macedo, and the exploitation under the guise of religion. With unwavering determination, Rachael empowers survivors and fights for justice, symbolizing the triumph of the human spirit over oppression. She\u0027s an inspiration for reclaiming freedom and standing against abuse. And she was a delight to have on the show. LINKS: Follow Us: Instagram/Tik Tok: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email Us: info@wasiinacult.com Follow Rachael: Instagram : @msrachaelreign Follow her movement: Instagram/Tik Tok: @survivinguniversaluk",
      "release": "2024-05-13T03:40:48Z",
      "duration": "00:58:58.4940000",
      "explicit": false,
      "spotifyId": "4icwIpKCm57HkI2OOzhjSL",
      "appleId": 1000655396883,
      "subjects": [
        "Universal Church Of The Kingdom Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4icwIpKCm57HkI2OOzhjSL",
        "apple": "https://podcasts.apple.com/podcast/uckg-taking-down-a-billionaire-megachurch-cult/id1582863762?i=1000655396883"
      }
    },
    {
      "id": "58c98357-c16a-4a6f-a7ea-3fa3690266bf",
      "title": "Teen Challenge: “444 Days Without Love”",
      "description": "SHOWNOTES: Our youngest guest to-date, Aliya Kasabian recounts her chilling involuntary initiation into the Boise Girls Academy, an institution that masquerades as a haven for troubled teens. From controlling communication with families to enforced silence and the denial of basic necessities like tampons, Aliya’s story exposes the depths of manipulation and coercion wielded by the program’s directors. But resistance only extends your time at this prison-like “healing facility.” So, eventually, Aliya discovers that if she is ever to be free, the only way out is to become… a true believer. LINKS: Follow Us: Instagram/Tik Tok: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email Us: info@wasiinacult.com Follow Aliya: Instagram/Tik Tok : @sandb0xb0y Try VIIA Hemp! https://bit.ly/viiainacult and use code INACULT! (15% off)",
      "release": "2024-05-06T07:37:36Z",
      "duration": "01:01:40.9760000",
      "explicit": false,
      "spotifyId": "62xP4ehqiVA8NWqhEV4jj8",
      "appleId": 1000654681140,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/62xP4ehqiVA8NWqhEV4jj8",
        "apple": "https://podcasts.apple.com/podcast/teen-challenge-444-days-without-love/id1582863762?i=1000654681140"
      }
    },
    {
      "id": "95c9c252-4488-47a0-98e2-cc8b4ecca039",
      "title": "Zendik Farm: “Mating in Captivity” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2023** **NEW EP DROP NEXT WEEK MONDAY MAY 6TH** Imagine having to ask a group of eco-farmers for permission to have sex. And when granted permission, your options of consummation include… the back of a van or the loft of a goat barn. Well that\u0027s what happened when Helen Zuman, a spelling bee whiz looking to explore her interest in eco-farming, visited Zendik Farm in North Carolina shortly after graduating from Harvard. A two-week experience turned into years of her life. And that, ladies and gentlemen, is how you spell C-U-L-T. Support Was I In A Cult? on Patreon for goodies \u0026 extra content: https://www.patreon.com/wasiinacult (https://www.patreon.com/wasiinacult) Follow us on Instagram: @wasiinacult Contact us: Have a cult story of your own and want to share it on our show? Send us an email: info@wasiinacult.com. MORE ABOUT HELEN: https://helenzuman.com/",
      "release": "2024-04-29T02:27:00Z",
      "duration": "01:13:20.3260000",
      "explicit": false,
      "spotifyId": "4c83YQoKLummEVb4z4prGp",
      "appleId": 1000653889824,
      "subjects": [
        "Zendik Farm"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4c83YQoKLummEVb4z4prGp",
        "apple": "https://podcasts.apple.com/podcast/zendik-farm-mating-in-captivity-update/id1582863762?i=1000653889824"
      }
    },
    {
      "id": "c4e1c86e-d1b6-4404-bd7b-57a82eb25d78",
      "title": "Psychic Scientology: “Clearing the BS”",
      "description": "Ever heard of a Scientology-laced organization for spiritual growth? Neither had we, until we sat down with Kim Periano. Today, Kim recounts her bizarre experience with the Foundation for Spiritual Development (FSD). From hypnotic meditations to chilling encounters with supposed extraterrestrial beings, Kim\u0027s account unveils the disturbing truth behind the FSD\u0027s facade of spiritual growth. And as she progresses through the levels, Kim finds herself trapped in a web of manipulation, fear and coercion, questioning her own sanity and the true intentions of those she once trusted. LINKS: Find Kim: Acupuncture: https://www.lionsheartwellness.com/ \u0026 Coaching: https://couragetotransform.com/ Follow Kim: @couragetotransform Follow Us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email Us: info@wasiinacult.com Try VIIA Hemp! https://bit.ly/viiainacult and use code INACULT! (15% off)",
      "release": "2024-04-22T04:54:38Z",
      "duration": "01:01:48.8910000",
      "explicit": false,
      "spotifyId": "2NSL3MHBRRdfccAIAd2bNx",
      "appleId": 1000653194405,
      "subjects": [
        "Foundation for Spiritual Development",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NSL3MHBRRdfccAIAd2bNx",
        "apple": "https://podcasts.apple.com/podcast/psychic-scientology-clearing-the-bs/id1582863762?i=1000653194405"
      }
    },
    {
      "id": "df1f6125-c8d1-4d32-a5fb-283471d684ab",
      "title": "Tyler’s Story Part 2: “Man On a Mission”",
      "description": "Today is the final part of your fearless co-host, Tyler Measom\u0027s, story of being raised a Mormon, and finding the strength to finally say goodbye to the underwear. Now an acclaimed filmmaker and podcaster, much of Tyler’s work is inspired by the shadows of his past. He would go on and on, but Liz is telling him to wrap it up. So, enjoy the episode. And if you haven’t listened to PART 1 yet, do so first. Thanks again, Tyler, for your candor and insight. LINKS Follow Tyler: @tylermeasom Follow us: Instagram @wasiinacult Want Tyler’s Magic Underwear? Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-04-15T05:29:01Z",
      "duration": "00:57:13.6650000",
      "explicit": false,
      "spotifyId": "7lmbu7GpkeYiu5mX5w67We",
      "appleId": 1000652485922,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7lmbu7GpkeYiu5mX5w67We",
        "apple": "https://podcasts.apple.com/podcast/tylers-story-part-2-man-on-a-mission/id1582863762?i=1000652485922"
      }
    },
    {
      "id": "939a2bb5-c356-44c2-929b-bde46f6f3300",
      "title": "Tyler’s Story  - Part 1: “Mormon Mission to… Not France”",
      "description": "Tyler Measom, your fearless co-host, stopped by the studio in his magic underwear to chat with Liz about his cultic upbringing as a good (clean) Mormon Boy in Pleasant Grove, Utah. It’s everything you could hope for and less… or more… more or less. LINKS Follow Tyler: @tylermeasom Follow us: Instagram @wasiinacult Want Tyler’s Magic Underwear? Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-04-08T05:30:29Z",
      "duration": "00:46:09.0050000",
      "explicit": false,
      "spotifyId": "5lWk6S6SSSdxe1Pnr8LwO7",
      "appleId": 1000651769612,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5lWk6S6SSSdxe1Pnr8LwO7",
        "apple": "https://podcasts.apple.com/podcast/tylers-story-part-1-mormon-mission-to-not-france/id1582863762?i=1000651769612"
      }
    },
    {
      "id": "08810968-dacd-418f-b172-8dfc4aa7984c",
      "title": "The Cult Guru: “How to Save The World w/ Dr. Steven Hassan”",
      "description": "WE NEED YOUR INPUT!! We’re launching a new membership on Patreon and want to know… If you were to support this membership, what content do YOU crave more of? Please head to THIS LINK and GIVE US YOUR THOUGHTS!: https://forms.gle/9M8TSjfBvpNHKbxD6 TODAY’S EPISODE: A former Moonie, Dr. Hassan has spent the last 45 years helping thousands break free from cults and cult-like environments. He is is America\u0027s leading cult expert and the author of several groundbreaking books that have become invaluable resources for those seeking to understand and recover from the trauma of cult involvement. These critically acclaimed books, including “Combating Cult Mind Control,” “Freedom of Mind,” and “The Cult of Trump,” have shed light on the psychological, social, and emotional aspects of undue influence, while providing practical tools for healing and recovery. Visit freedomofmind.com (http://freedomofmind.com/) for more information about Dr. Hassan\u0027s recovery and intervention services, and his offering of both general and professional Continuing Education courses on cults and mind control. LINKS: FIND DR. Steven Hassan: freedomofmind.com Follow us: Instagram @wasiinacult Give us your thoughts! https://forms.gle/9M8TSjfBvpNHKbxD6 Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-04-01T05:01:49Z",
      "duration": "00:55:51.1180000",
      "explicit": false,
      "spotifyId": "5oNAkHzMffUI2h4wO9ch31",
      "appleId": 1000651059394,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5oNAkHzMffUI2h4wO9ch31",
        "apple": "https://podcasts.apple.com/podcast/the-cult-guru-how-to-save-the-world-w-dr-steven-hassan/id1582863762?i=1000651059394"
      }
    },
    {
      "id": "829367ff-1259-475d-9909-6b471c6f4f76",
      "title": "Married to the Cult Leader: “Symbol of The Whore\u0022",
      "description": "Christina takes us on a harrowing journey trapped in a cult led by (none other than) her husband, who claimed to be the reincarnation of Christ. Of course when they first met, he was a rebel who stole cars and did drugs, but we digress. From manipulation to isolation and justified adultery through \u0027God’s will,\u0027 Christina\u0027s story is a rollercoaster of control and resilience. As she faces threats to her family and identity, Christina bravely shares her experiences with humor and hope, showing us that even in the darkest of times, there is always a glimmer of light. LINKS Follow us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com — “This episode is sponsored by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.”",
      "release": "2024-03-25T02:02:39Z",
      "duration": "01:01:43.0660000",
      "explicit": false,
      "spotifyId": "2yq9a3NZfZ3rO0mrEHnfc0",
      "appleId": 1000650351750,
      "subjects": [
        "Equipping Christian Center"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2yq9a3NZfZ3rO0mrEHnfc0",
        "apple": "https://podcasts.apple.com/podcast/married-to-the-cult-leader-symbol-of-the-whore/id1582863762?i=1000650351750"
      }
    },
    {
      "id": "2ef60e7e-0ddd-404b-9b8c-f24e90b1eef2",
      "title": "Mormonism w/ Tal Bachman: “He’s So Hiiiiigh… On Doctrine\u0022",
      "description": "In the electrifying world of rock ’n roll, Canadian Tal Bachman, son of legendary Randy Bachman from Bachman Turner Overdrive, seemed destined for stardom. Yet, his path was anything but straightforward. For Tal, it was a constant dance between the chords of fame and the doctrines of his devout Mormon upbringing. And as the spotlight beckoned, Tal found himself at a crossroads, as the requirements for stardom clashed with rules of his religion. What led him to step away from the stage? And once he finally breaks free from the cult, does he find his way back? LINKS: Jingle writer: @angelasoffemusic Tal Bachman: @talbachman Follow us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com — Head to Viiahemp.com and use the code: ‘inacult\u0027 to receive 15% off \u0026#43; one free sample of their sleepy Dreams gummies. (21\u0026#43;).",
      "release": "2024-03-17T07:00:00Z",
      "duration": "01:20:05.2240000",
      "explicit": false,
      "spotifyId": "1j5FdJQrLSREq8pegNBqbn",
      "appleId": 1000649569717,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1j5FdJQrLSREq8pegNBqbn",
        "apple": "https://podcasts.apple.com/podcast/mormonism-w-tal-bachman-hes-so-hiiiiigh-on-doctrine/id1582863762?i=1000649569717"
      }
    },
    {
      "id": "9adc5b29-3a05-4e06-a34f-da3ee9d6a1e2",
      "title": "Gloriavale: “Gloria Fail\u0022",
      "description": "Jason Christian was born into Gloriavale — a self-proclaimed utopic Christian community of more than 500 people on the West Coast of New Zealand’s South Island. His grandfather, Hopeful Christian, was the leader. Shut out from the outside world and forced to work on the farm at the age of six, Jason was primed to live a life without actual freedom, as this group of true believers was all he knew. But when it was time for him to marry a woman in the community that was chosen for him, Jason made a different choice. LINKS Gloriavale documentary: https://www.gloriavale.com/ Follow us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com — “This episode is sponsored by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.”",
      "release": "2024-03-11T05:40:50Z",
      "duration": "01:04:22.4130000",
      "explicit": false,
      "spotifyId": "6Ie5SMEG9oOZr65AUK1GXZ",
      "appleId": 1000648761374,
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Ie5SMEG9oOZr65AUK1GXZ",
        "apple": "https://podcasts.apple.com/podcast/gloriavale-gloria-fail/id1582863762?i=1000648761374"
      }
    },
    {
      "id": "597a03a5-4b8a-4cae-9501-8587033b0924",
      "title": "Sufism - Part 2: “Freedom at 23”",
      "description": "This is Part 2 of Sara Tasneem’s heroic story. If you haven’t listened to Part 1, please start there. This episode reveals Sara’s immense strength, her re-brith, her new found freedom. But after years of imprisionment, the real world isn’t always an easy road… especially when you have mouths to feed. Thank you Sara. You’re an inspiration. Want to help end child marriage? You can! Get involved. It will take us all to finally end child marriages for good. Here are some helpful links to get you started: — Zonta USA: https://zontausa.org/end-child-marriage-in-the-usa/end-child-marriage-action/ — Unchained At Last: https://www.unchainedatlast.org/ — The AHA Foundation: https://www.theahafoundation.org/get-involved/ — United Nations Sustainable Development Goal 5.3 to end child marriage worldwide by 2030: https://sdgs.un.org/goals/goal5#targets_and_indicators — Tahirih Justice Center Forced Marriage Initiative: https://www.tahirih.org/who-we-serve/forms-of-violence/forced-marriage/ — Link to HB2924 in California (call your legislator and support this bill!!): https://legiscan.com/CA/text/AB2924/2023 — Sara’s activism: https://www.facebook.com/thrivingaftersurviving \u0026 https://tasneemsfadvocacy.home.blog/ — Follow us: Instagram: @wasiinacult — Support Us: https://www.patreon.com/wasiinacult — Have a story to share on our show? Email us: info@wasiinacult.com — “This episode is sponsored by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.”",
      "release": "2024-03-04T06:19:21Z",
      "duration": "00:50:54.4190000",
      "explicit": false,
      "spotifyId": "01IbuKaMxFkF46W0eLMhoW",
      "appleId": 1000647932119,
      "subjects": [
        "Sufi"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/01IbuKaMxFkF46W0eLMhoW",
        "apple": "https://podcasts.apple.com/podcast/sufism-part-2-freedom-at-23/id1582863762?i=1000647932119"
      }
    },
    {
      "id": "ee1fb426-8502-436b-aa0b-e160613f5ccd",
      "title": "Sufism - Part 1: “Forced at 15”",
      "description": "Sara Tasneem\u0027s journey began in Boulder, Colorado, where she was born into the Islamic faith. However, at the age of five, her parents divorced, causing her faith to split as well. Her mother distanced herself from the religion, while her father delved deeper, immersing himself in a Sufi group that would soon dominate Sara\u0027s existence. Then, at the age of 15, Sara\u0027s life took an unexpected turn when her father brought her to a conference led by the group\u0027s sheikh in Los Angeles, California. Little did she anticipate that this seemingly ordinary weekend would change the trajectory of her life in ways beyond imagination. Find Sara: https://tasneemsfadvocacy.home.blog/ Follow us: Instagram: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com This episode is brought to you by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.",
      "release": "2024-02-26T07:05:59Z",
      "duration": "00:49:01.3870000",
      "explicit": false,
      "spotifyId": "4s4eP6rBC7i7HXWyXWdKot",
      "appleId": 1000646879604,
      "subjects": [
        "Sufi"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4s4eP6rBC7i7HXWyXWdKot",
        "apple": "https://podcasts.apple.com/podcast/sufism-part-1-forced-at-15/id1582863762?i=1000646879604"
      }
    },
    {
      "id": "d43cf93a-06b6-4afb-aee8-7faccda05476",
      "title": "Multi-Level Manipulator (MLM): “Hey, Hun! Hey, Girl! Hey, sis!”",
      "description": "Emily Lynn Paulson was a busy, ass-kicking mom to five children when she realized something was missing. Wanting to find a way to enter the workforce again, she met up with an old friend one night who introduced her to some products. Products her friend was selling. Products that Emily could sell too. She could work her own hours, be her own boss, and still spend all the time with her kids. It sounded perfect. And it was. Until… well, it wasn’t. -- Emily’s book, “Hey, Hun: Sales, Sisterhood, Supremacy, and the Other Lies Behind Multilevel Marketing” was a book of the year pick by NPR for 2023. — LINKS Find Emily: Instagram @emilylynnpaulson Founder of @sobermomsquad Follow us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-02-19T04:09:51Z",
      "duration": "00:49:01.4130000",
      "explicit": false,
      "spotifyId": "355a2lsCxeGIYVX4UyVppH",
      "appleId": 1000645858639,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/355a2lsCxeGIYVX4UyVppH",
        "apple": "https://podcasts.apple.com/podcast/multi-level-manipulator-mlm-hey-hun-hey-girl-hey-sis/id1582863762?i=1000645858639"
      }
    },
    {
      "id": "4a7cf7b9-2e19-49b7-8bce-5911d711c0ed",
      "title": "Deer Tribe — PART 2: “This is Not Sexual Healing.\u0022",
      "description": "Now fully committed, Kit works her way through the Deer Tribe Medicine Society and Quodoushka programs, each level more intense than the last. After moving to Phoenix due to pressure from the group, she begins to really question whether or not this is providing the healing she set out to recieve. And then, when quarantine strikes, a woman joins the group that may just save her life. LINKS Deer Tribe: dtmms.org/ Amara Charles: www.amaracharles.com/ Quodoushka: www.quodoushka.org/ Ruda Center (aka the Ashram): rudracenter.org Follow us: Instagram: \u0026#64;wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info\u0026#64;wasiinacult.com Theme Song: www.maurastreppa.com Instagram/TikTok: \u0026#64;maurastreppamusic Spotify/Apple/Amazon Music/wherever you get your music: Maura Streppa This episode is brought to you by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.",
      "release": "2024-02-12T05:06:55Z",
      "duration": "00:50:01.5730000",
      "explicit": false,
      "spotifyId": "27Sz6pWNRXT3dkwCS8kA8e",
      "appleId": 1000645024744,
      "subjects": [
        "Deer Tribe Metis Medicine Society"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/27Sz6pWNRXT3dkwCS8kA8e",
        "apple": "https://podcasts.apple.com/podcast/deer-tribe-part-2-this-is-not-sexual-healing/id1582863762?i=1000645024744"
      }
    },
    {
      "id": "fbb6b815-967c-40ed-9cbe-b5a00e3e8c4d",
      "title": "Deer Tribe — PART 1: “This Is Sexual Healing?\u0022",
      "description": "While attending college in Texas, a friend suggested that Kit attend a sweat lodge. Innocently, she did. Little did she know this sweat lodge was part of a bigger community known as ‘The Ashram\u0027. Soon she was recruited into more than just the sweat and before she knew it, she was in the inner circle.   Eventually, she would discover that this ashram was part of an even larger organization: The Deer Tribe Medicine Society. And one day she was recruited into a program that promised to heal her sexual trauma.  We’ll let you be the judge of how well that promise was fulfilled…    LINKS Deer Tribe: dtmms.org/  Amara Charles: www.amaracharles.com/  Quodoushka: www.quodoushka.org/  Ruda Center (aka the Ashram): rudracenter.org   Follow us: Instagram: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-02-05T07:21:15Z",
      "duration": "00:56:33.9060000",
      "explicit": false,
      "spotifyId": "2nkWp5F3yn1oOTdgv6RLER",
      "appleId": 1000644218793,
      "subjects": [
        "Deer Tribe Metis Medicine Society"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2nkWp5F3yn1oOTdgv6RLER",
        "apple": "https://podcasts.apple.com/podcast/deer-tribe-part-1-this-is-sexual-healing/id1582863762?i=1000644218793"
      }
    },
    {
      "id": "d8ff2137-a233-4830-be1b-10f4898d9dd1",
      "title": "Children of God: “You’re Enough As You Are” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2021**  **NEW EPS DROP NEXT WEEK MONDAY FEB 5th**  Welcome to the worst cult ever (in our humble opinions). This is a story of incredible resilience, bravery, and inspiration. Being born into a cult always comes with its challenges, but learning how to have an original thought in your mid-20s is a rare struggle that most people are fortunate enough to never have to face. This is just one of many obstacles Angel had to overcome as she ventured out of the cult and into the world. But when you\u0027ve spent over 20 years of your life in a cult and it\u0027s all you know, the real world isn\u0027t always as sparkly as you hoped. Find Angel: www.theprocessbyangel.com  Insta: @whatisangeldoing Youtube Channel: https://www.youtube.com/user/MrAngeladesantis Follow us: Insta @wasiinacult Email us with your story: info@wasiinacult.com Support us on Patreon: patreon.com/wasiinacult",
      "release": "2024-01-29T08:00:00Z",
      "duration": "00:41:56.7410000",
      "explicit": false,
      "spotifyId": "6faLrLC7xcF5Wvw1QSmrlg",
      "appleId": 1000643349602,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6faLrLC7xcF5Wvw1QSmrlg",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-youre-enough-as-you-are-update/id1582863762?i=1000643349602"
      }
    },
    {
      "id": "81e369ec-adb8-4cf7-8401-2ea5f48505e1",
      "title": "Thou Shan’t Be Named: “Non-Church Church” (UPDATE)",
      "description": "*NOTE: This episode originally ran in 2022*  TITLE: Thou Shan\u0027t Be Named: \u0022Non-Church Church\u0022 Non-Denominational Christianity. Sounds innocent enough, and for many non-denominational churches, it is. But for others, the non-affiliation creates a dangerous pathway to a choose your own adventure \u0022religion.\u0022 For Shannon Payton, it was an adventure all right, but not one she necessarily would\u0027ve chosen...if, of course, given the choice. Shannon has lived more of her life inside the cult than out, but this social media comedian is just starting to scratch the surface of having her voice heard. A voice, of course, that wasn\u0027t allowed to be heard for most of her life. And trust us, it\u0027s a voice worth hearing. Shannon now has her own podcast called: The Shanny Pants Show podcast. Check it out!  Find Shannon: www.shannypantsshow.com Follow Shannon: Insta/ TikTok @therealshannypants Follow us: Insta @wasiinacult  Email us: info@wasiinacult.com  Support us on Patreon: patreon.com/wasiinacult",
      "release": "2024-01-22T18:02:49Z",
      "duration": "00:53:47.5330000",
      "explicit": false,
      "spotifyId": "4LrqZTTkZWTOJdA0CZnPZW",
      "appleId": 1000642528579,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LrqZTTkZWTOJdA0CZnPZW",
        "apple": "https://podcasts.apple.com/podcast/thou-shant-be-named-non-church-church-update/id1582863762?i=1000642528579"
      }
    },
    {
      "id": "4e36ff9c-9a49-416a-a12e-bec563982696",
      "title": "WISE(aka Scientology) — “Stop interbulating me!”",
      "description": "Fresh to the workforce, Amber answered a job posting for a dental assitant: “No experience needed!” Looking for something reliable to support her new life as a single mother, she was thrilled when she got hired. Little did she know, her new job would be more than just dental work… —— We’ll be back in a few weeks with SEASON 3. Thank you for all your love and support! We appreciate you more than you know. To help us continue to create this show, please consider supporting us on Patreon. https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com",
      "release": "2023-05-15T01:29:53Z",
      "duration": "01:11:38.1610000",
      "explicit": true,
      "spotifyId": "6JIHTXHVjE84muuAQvNEFP",
      "appleId": 1000613040986,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6JIHTXHVjE84muuAQvNEFP",
        "apple": "https://podcasts.apple.com/podcast/wise-aka-scientology-stop-interbulating-me/id1582863762?i=1000613040986"
      }
    },
    {
      "id": "f4e34987-6b7e-461e-8426-0d98d2a2a804",
      "title": "Divine Madness: “Ultra Mara-con”",
      "description": "Colorado is known to draw the hippies, the free-thinkers, the adventurous… so when a group of alternative medicine devotees convinces our guest that they can cure her severe back pain, she’s open to suggestion. But soon, she finds herself sleeping in a van and questioning everything that got her to this point. —— Support us on Patreon!  https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com This episode is brought to you by BetterHelp. Give online therapy a try at www.betterhelp.com/INACULT and get on your way to being your best self.",
      "release": "2023-05-08T01:16:56Z",
      "duration": "00:52:37.2110000",
      "explicit": true,
      "spotifyId": "71YIeKak0qUQjWvMx3P6Sb",
      "appleId": 1000612132491,
      "subjects": [
        "Divine Madness Running Club"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/71YIeKak0qUQjWvMx3P6Sb",
        "apple": "https://podcasts.apple.com/podcast/divine-madness-ultra-mara-con/id1582863762?i=1000612132491"
      }
    },
    {
      "id": "347933c7-57a9-4a11-a420-ddbecd524682",
      "title": "Chung Moo Quan — Part 2: “Be Alright to Leave?”",
      "description": "Russell D. Johnson’s story continues. A journey into and out of a martial arts cult. …PART TWO… So Russell survives his emergency, life-threatening arm surgery, but shockingly, that won’t be the hardest thing. So the next question becomes… Can he survive the stalking and death threats that occur after he speaks up and out against the cult? Well, if anyone can, it’s our unassuming Bruce Banner… \u0027Cause watch out ya’ll… he’s about to “HULK SMASH!” —— Support us on Patreon!  https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com More Russell: Russell’s podcast: https://www.deceivedpodcast.com Gruesome arm pics (not for faint of heart): https://www.deceivedpodcast.com/gallery",
      "release": "2023-05-01T01:28:29Z",
      "duration": "00:40:04.8580000",
      "explicit": true,
      "spotifyId": "737R7eEDiU6gtPxuSSZsao",
      "appleId": 1000611267464,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/737R7eEDiU6gtPxuSSZsao",
        "apple": "https://podcasts.apple.com/podcast/chung-moo-quan-part-2-be-alright-to-leave/id1582863762?i=1000611267464"
      }
    },
    {
      "id": "037ffe5e-9ad5-4b22-8ccf-07e55476128c",
      "title": "Chung Moo Quan — Part 1: “Kult Fu Fighting”",
      "description": "It’s the 1970s and Kung Fu is all the rage. So when 16-year-old Russell Johnson looks to channel his (inner) rage, he signs up for a local class to learn how to become a peaceful warrior. Only what he doesn’t know is that what he signed up for would one day almost cost him his life… —— Support us on Patreon! Your donation is our salvation (we made that up but it sounded nice ‘n culty…) Truly, your contributions really do help. https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com Find Russell: https://www.deceivedpodcast.com And as promised, gruesome arm pics (not for the faint of heart): https://www.deceivedpodcast.com/gallery __ This episode is sponsored by Mindbloom. Take the first step and break free from your anxiety and depression with Mindbloom. Right now, Mindbloom is offering our listeners $100 off your first six session program when you sign up at Mindbloom.com/cult and use promo code CULT.  __ This episode is also sponsored by ZocDoc. Finding a trusted doctor has never been easier than with Zocdoc. Go to Zocdoc.com/INACULT and download the Zocdoc app for FREE. Then find a book a top-rated doctor today. ",
      "release": "2023-04-24T02:00:39Z",
      "duration": "00:54:14.4960000",
      "explicit": true,
      "spotifyId": "3sJRTnxfwVtcvemPuXaxXU",
      "appleId": 1000610336688,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sJRTnxfwVtcvemPuXaxXU",
        "apple": "https://podcasts.apple.com/podcast/chung-moo-quan-part-1-kult-fu-fighting/id1582863762?i=1000610336688"
      }
    },
    {
      "id": "357a5e09-2859-4441-b9f3-fc3f0410b323",
      "title": "Carol the Cult Assassin: \u0022Out of Fear Into Power\u0022",
      "description": "So you’ve survived an abusive cult.  Now what?  What exactly are the legal options available to you? An investigative litigator who represents victims of cultic and religious abuse, Carol Merchasin, sat down with us to discuss just that.  She is our hero.  - Find Carol at Mcolaw.com.  Support us on Patreon! : https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com - This episode is sponsored by EveryPlate. Get started with EveryPlate for just $1.49 per meal by going to EveryPlate.com/podcast and entering code cult149.",
      "release": "2023-04-17T05:00:00Z",
      "duration": "00:44:52.5830000",
      "explicit": true,
      "spotifyId": "4t1KmyxTNUtRnrg5KFY9lk",
      "appleId": 1000609235427,
      "subjects": [
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4t1KmyxTNUtRnrg5KFY9lk",
        "apple": "https://podcasts.apple.com/podcast/carol-the-cult-assassin-out-of-fear-into-power/id1582863762?i=1000609235427"
      }
    },
    {
      "id": "d4857fe6-4450-4082-a512-33a6cece5cbc",
      "title": "Religious Texas Commune — Part 2: “The Least Beloved\u0022",
      "description": "Tamara, the beloved, has just been upgraded from the commune to the big house on the hill with the leader and his multiple wives. But it isn’t long before she realizes that the reason she thought she was brought to live with them is not the reason she is there at all… __ Support us on Patreon! : https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com Follow Tamara: https://tamaramc.com Twitter: @TamaraMCPhD Instagram: @tamaramcphd __ Today\u0027s episode is sponsored by BetterHelp. Visit Betterhelp.com/INACULT for 10% off your first month. This episode is also sponsored by Babbel. Purchase a Babbel subscription and get six months for the price of three. Go to Babbel.com and use code INACULT for three free months.",
      "release": "2023-04-10T16:46:43Z",
      "duration": "00:42:53.5430000",
      "explicit": true,
      "spotifyId": "0uxcv3mty4GWDVJOKB8gPh",
      "appleId": 1000608228008,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0uxcv3mty4GWDVJOKB8gPh",
        "apple": "https://podcasts.apple.com/podcast/religious-texas-commune-part-2-the-least-beloved/id1582863762?i=1000608228008"
      }
    },
    {
      "id": "a15e4487-f96e-413c-8605-4232b84b7e9d",
      "title": "Religious Texas Commune — Part 1: “The Most Beloved”",
      "description": "Raised by two Jewish parents, Tamara and her family are splintered when her father finds a new religion. Five-year-old Tamara is now forced to live two separate worlds. One with mom, going to public school… and one with Dad on a strict religious commune. When gifted the name “Beloved” by the leader, it’s not exactly the honor she was expecting.  Support us on Patreon!: https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com Follow Tamara:  https://tamaramc.com Twitter: @TamaraMCPhD Instagram: @tamaramcphd - This episode is sponsored by Babbel. Purchase a Babbel subscription and get 6 months for the price of 3! Go to Babbel.com and use code INACULT for three free months.",
      "release": "2023-04-03T05:00:00Z",
      "duration": "00:39:27.9360000",
      "explicit": true,
      "spotifyId": "29b1aFGVxZdwa8Vv7d3eMQ",
      "appleId": 1000607056071,
      "urls": {
        "spotify": "https://open.spotify.com/episode/29b1aFGVxZdwa8Vv7d3eMQ",
        "apple": "https://podcasts.apple.com/podcast/religious-texas-commune-part-1-the-most-beloved/id1582863762?i=1000607056071"
      }
    },
    {
      "id": "51f5ab7c-f659-49c0-ba27-c01695a28862",
      "title": "Zendik Farm: \u0022Mating in Captivity\u0022",
      "description": "Imagine having to ask a group of eco-farmers for permission to have sex. And when granted permission, your options of consummation include… the back of a van or the loft of a goat barn.  Well that’s what happened when Helen Zuman, a spelling bee whiz looking to explore her interest in eco-farming, visited Zendik Farm in North Carolina shortly after graduating from Harvard.  A two-week experience turned into years of her life. And that, ladies and gentlemen, is how you spell… C-U-L-T.  - Support Was I In A Cult? on Patreon for goodies, extra content, and a chance to win a signed copy of Helen’s book: Mating in Captivity! Follow us on Instagram: @wasiinacult Contact us: Have a cult story of your own and want to share it on our show? Send us an email at info@wasiinacult.com. MORE ABOUT HELEN: https://helenzuman.com/ Find her book, Mating In Captivity, HERE.Follow Helen: Twitter - @HelenZuman // Instagram - @helenzuman - This episode is sponsored by the Wondery podcast This Is Actually Happening. Follow wherever you listen to podcasts. You can listen ad-free on the Amazon Music or Wondery App. This episode is also sponsored by ZocDoc. Go to Zocdoc.com/INACULT and download the Zocdoc app for FREE. Then find and book a top-rated doctor today.   ",
      "release": "2023-03-27T05:00:00Z",
      "duration": "01:08:52.1280000",
      "explicit": true,
      "spotifyId": "29En6TJx10PhBMQiklAmO4",
      "appleId": 1000606019670,
      "subjects": [
        "Zendik Farm"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/29En6TJx10PhBMQiklAmO4",
        "apple": "https://podcasts.apple.com/podcast/zendik-farm-mating-in-captivity/id1582863762?i=1000606019670"
      }
    },
    {
      "id": "10551979-15fb-4bfe-945c-41fff2491911",
      "title": "The Body of Christ Church: “When God is a House I Can’t Leave.”",
      "description": "Cults can be well-known, they can be obscure, and sometimes they can be hiding in plain sight. So when poet laureate Diannely’s family joins a seemingly “typical” church in Haverhill, Massachusetts… how does it become a cult? Let’s let her tell you.  - This episode is sponsored by BetterHelp. Give online therapy a try with 10% off your first month at betterhelp.com/INACULT. This episode is also brought to you by This Is Actually Happening. Follow wherever you get your podcasts, or listen ad-free on the Amazon Music or Wondery apps.  Find Diannely and her Whiting Award-winning book of poetry, Ugly Music, at DiannelyAntigua.com. Support Was I In A Cult? on Patreon! Visit patreon.com/wasiinacult.  Follow us on Instagram @wasiinacult. Have a story to share? Email us at info@wasiinacult.com or contact us at wasiinacult.com. ",
      "release": "2023-03-20T05:00:00Z",
      "duration": "00:55:27.0710000",
      "explicit": true,
      "spotifyId": "6ab5kboHJV3GOq9QzULpdK",
      "appleId": 1000604912082,
      "subjects": [
        "Body Of Christ Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ab5kboHJV3GOq9QzULpdK",
        "apple": "https://podcasts.apple.com/podcast/the-body-of-christ-church-when-god-is-a-house-i-cant-leave/id1582863762?i=1000604912082"
      }
    },
    {
      "id": "f7b410f9-5734-41a6-85c8-560c7a06a5e8",
      "title": "Eternal Values - Part 3: “To Thine Own Self”",
      "description": "The final part of Hoyt Richards’ incredible journey into and out of a UFO doomsday cult.    The damning Vanity Fair article throws Hoyt’s family into chaos as they attempt to intervene. And right when you think he might finally be getting out, his fellow “spiritual brothers” go to extreme lengths to keep their financial backer from leaving. And it works…   Until it finally doesn’t.   Thank you again, Hoyt. He is a brave and inspirational human, and we loved having him on the show.    —   This episode is sponsored by BetterHelp. Give online therapy a try with 10% off your first month at Betterhelp.com/INACULT. This episode is also sponsored by Babbel. Get six months for the price of three at Babbel.com with promo code INACULT.   Support us on Patreon (every little bit helps!):  patreon.com/wasiinacult   Follow us: instagram.com/wasiinacult    Contact us: info@wasiinacult.com — Have your own cult story and want to be on the show? Reach out with a synopsis of your story.    Listen to Hoyt\u0027s cult survival podcast, \u0022WhatheFlok?!\u0022 and follow him on Instagram @hoytrich.  ",
      "release": "2023-03-13T19:20:00Z",
      "duration": "00:55:43.3430000",
      "explicit": true,
      "spotifyId": "2ziPtGWKn6E91B21xjnBPx",
      "appleId": 1000604018257,
      "subjects": [
        "Eternal Values"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ziPtGWKn6E91B21xjnBPx",
        "apple": "https://podcasts.apple.com/podcast/eternal-values-part-3-to-thine-own-self/id1582863762?i=1000604018257"
      }
    },
    {
      "id": "33f972d7-087b-42a4-b680-64dec6637242",
      "title": "Eternal Values - Part 2: \u0022Vanity Un-Fair\u0022",
      "description": "The now quasi-famous group takes it to the next level. They get a name, a book, a show, a hit song, and a distant star doomsday getaway. Hoyt, meanwhile, becomes his own star, modeling for millions but returning home to sleep on the floor. All is going well (or so they think) until the group puts a well-known phrase to the test. Is there really no such thing as bad press?  —  This episode is sponsored by ZocDoc. Find and book a top-rated doctor today at Zocdoc.com/INACULT. Support us:  Patreon.com/wasiinacult  Follow Hoyt: Instagram.com/hoytrich  Follow us: Instagram.com/wasiinacult  Have your own cult story and want to be on the show? Reach out at info@wasiinacult.com.",
      "release": "2023-03-06T05:00:00Z",
      "duration": "00:51:11.6160000",
      "explicit": true,
      "spotifyId": "5SaMtEvnbvjeXeYHJJET7H",
      "appleId": 1000602939117,
      "subjects": [
        "Eternal Values"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5SaMtEvnbvjeXeYHJJET7H",
        "apple": "https://podcasts.apple.com/podcast/eternal-values-part-2-vanity-un-fair/id1582863762?i=1000602939117"
      }
    },
    {
      "id": "4140e824-c47e-48ce-8055-ce84338547c1",
      "title": "Eternal Values - Part 1: \u0022The Man From Nantucket\u0022",
      "description": "It was 1978, and the effortlessly handsome Hoyt Richards was a 16-year-old football talent summering in Nantucket. Chasing girls and free beer was about all on this young boy’s mind. So when he meets a man on the beach who was rumored to throw great parties, Hoyt thinks nothing of it.  Little did Hoyt know…he had just come face-to-face with a budding cult leader that would take his life in a direction he never could’ve dreamed.   — This episode is sponsored by ZocDoc. Find and book a top-rated doctor today at Zocdoc.com/INACULT. Support us:  Patreon.com/wasiinacult  Follow Hoyt: Instagram.com/hoytrich  Follow us: Instagram.com/wasiinacult  Have your own cult story and want to be on the show? Reach out at info@wasiinacult.com.",
      "release": "2023-03-06T05:00:00Z",
      "duration": "00:50:41.4960000",
      "explicit": true,
      "spotifyId": "6YxyVTlbTyZosq6OYElXSx",
      "appleId": 1000602939034,
      "subjects": [
        "Eternal Values"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YxyVTlbTyZosq6OYElXSx",
        "apple": "https://podcasts.apple.com/podcast/eternal-values-part-1-the-man-from-nantucket/id1582863762?i=1000602939034"
      }
    },
    {
      "id": "bbaa6e6a-0608-4587-80a7-afcf5038545c",
      "title": "SEASON 2 - COMING MARCH 6TH",
      "description": "More crazy cults, more wild stories, and more of us. Hosted by Tyler Measom and Liz Iacuzzi, Was I In A Cult? is a documentary-style podcast featuring far-out, first-hand stories of survivors who unwittingly joined, lived in, and escaped cults. Using levity and infotainment, the show humanizes the cultic experience and may leave some of our listeners asking themselves, \u0022Wait...was I in a cult?\u0022 You can support Was I In A Cult? through Patreon at patreon.com/wasiinacult and follow along with us on Instagram @wasiinacult.",
      "release": "2023-02-27T05:22:51Z",
      "duration": "00:01:00.0480000",
      "explicit": true,
      "spotifyId": "6RuPDQyvkdTmsTHdA2urlP",
      "appleId": 1000601809023,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RuPDQyvkdTmsTHdA2urlP",
        "apple": "https://podcasts.apple.com/podcast/season-2-coming-march-6th/id1582863762?i=1000601809023"
      }
    },
    {
      "id": "7d2f1060-44f2-4f39-a708-a1f9d97f5ec2",
      "title": "STATUS UPDATE: \u0022New Email Who Dis?\u0022",
      "description": "Liz and Tyler pop by to update you on their lives, and to reassure you that they will be back! Please support Was I In A Cult? Through Patreon  See omnystudio.com/listener for privacy information.",
      "release": "2022-08-23T09:00:00Z",
      "duration": "00:06:02.2660000",
      "explicit": false,
      "spotifyId": "3RzMlgybwW2HX00pK3dhIm",
      "appleId": 1000577074136,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3RzMlgybwW2HX00pK3dhIm",
        "apple": "https://podcasts.apple.com/podcast/status-update-new-email-who-dis/id1582863762?i=1000577074136"
      }
    },
    {
      "id": "e48d7be6-4dd8-403a-82da-37b8631d53f6",
      "title": "Millionaire’s Club: “The World Was Gonna Open Up”",
      "description": "Arianna was a recent college graduate with dreams of one day opening her own marketing company. So when a LinkedIn opportunity for a social media marketing assistant fell into her lap, it felt too good to be true.    Soon, she would be brushing shoulders with millionaires, in hopes that some of their mojo would rub off. After all, she had big plans for her future and a self-made father to prove herself to.    But, you know what they say about things being too good to be true…   They usually are.    This brave, inspiring woman is here to share her very important story of what exactly happened when she got involved with this Nashville “Millionaire’s Club.”   ____   Arianna on Instagram: @ariannasprabary   Arianna on TikTok: Aristrawberry0   Follow us on Instagram @wasiinacult   Have your own story? Email us: info@wasiinacult.com   Please support Was I In A Cult? Through Patreon  See omnystudio.com/listener for privacy information.",
      "release": "2022-02-10T11:45:00Z",
      "duration": "00:58:55.9600000",
      "explicit": false,
      "spotifyId": "5ercVEFHfPLQxrOv9JpmAV",
      "appleId": 1000550670436,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ercVEFHfPLQxrOv9JpmAV",
        "apple": "https://podcasts.apple.com/podcast/millionaires-club-the-world-was-gonna-open-up/id1582863762?i=1000550670436"
      }
    },
    {
      "id": "e219bb34-5247-4a7e-a2c2-417a6ec310ba",
      "title": "Armstrongism: “Saving For the Feast”",
      "description": "A humble upbringing is an understatement for Dan McIntrye. Canada born and bred, Dan’s cult journey took him from guitar god, to free desserts to cult escape, only to land him right in the arms of… another one?     A double survivor. A triple thriver. And one extremely nice guy. Damn, Canadians, you really are as kind as they say.   --------   Link to Dan\u0027s song \u0022Any Given Sunday\u0022   Listen to Tyler guest on the \u0022Latter-Day Lesbian\u0022 podcast!   Think you were in a cult? Contact us to be on the show: info@wasiinacult.com   Follow us: Instagram @wasiinacult Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2022-02-03T11:50:00Z",
      "duration": "00:59:32.5580000",
      "explicit": false,
      "spotifyId": "11EFmypt296f3OO1LO4HeB",
      "appleId": 1000549888936,
      "urls": {
        "spotify": "https://open.spotify.com/episode/11EFmypt296f3OO1LO4HeB",
        "apple": "https://podcasts.apple.com/podcast/armstrongism-saving-for-the-feast/id1582863762?i=1000549888936"
      }
    },
    {
      "id": "0ea673f1-7dd3-4b88-bf6c-7a70d3da8bbf",
      "title": "MLM LuLaRoe: “What’s your why?”",
      "description": "She’s a hustler, baby. And she just wants you to know.  Roberta Blevins was taught to be a self-starter. Inspired by her self-made father, she knew that if you put your mind to it, anything can happen. And it’s true. Anything can happen. But that’s the problem with anything. Anything sometimes includes MLM’s. Multi-level marketing (schemes).  This is a story of a dynamite go-getter and how she crawled her way into a box of fart leggings and eventually… crawled her way out.    ——   Follow Roberta’s Anti-MLM Movement:    Instagram - @therealrobertablevins @lifeaftermlmpodcast   Listen to her podcast “Life After MLM”: Spotify Apple   ——   Contact us with your stories to be featured on the show: info@wasiinacult.com   Follow us: Instagram  Please support Was I In A Cult? Through Patreon ——   Michael Scott tried his hand at a “new company idea”  See omnystudio.com/listener for privacy information.",
      "release": "2022-01-27T04:52:00Z",
      "duration": "00:57:57.4720000",
      "explicit": false,
      "spotifyId": "3xNFdvbY3jq6IsTy6epuwu",
      "appleId": 1000549128882,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3xNFdvbY3jq6IsTy6epuwu",
        "apple": "https://podcasts.apple.com/podcast/mlm-lularoe-whats-your-why/id1582863762?i=1000549128882"
      }
    },
    {
      "id": "1077ef0b-792b-4d3d-8b3b-486c939e3e61",
      "title": "Black Hebrew Israelites: “Cursed and Chosen”",
      "description": "Lauren’s initial years of her life, for lack of a better word, were quite normal. Along with her five siblings, she lived a very comfortable life in Corona, CA. Then one day, her once atheist father found religion.   And that discovery took him on a journey to finding “the truth”. A truth that would one day take the family all the way to Egypt.   —   Follow us: @wasiinacult instagram Contact us: info@wasiinacult.com Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2022-01-20T10:10:00Z",
      "duration": "00:49:41.1460000",
      "explicit": false,
      "spotifyId": "51xgL3kGhG40NRF5qV9WW5",
      "appleId": 1000548460887,
      "subjects": [
        "Black Hebrew Israelites"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/51xgL3kGhG40NRF5qV9WW5",
        "apple": "https://podcasts.apple.com/podcast/black-hebrew-israelites-cursed-and-chosen/id1582863762?i=1000548460887"
      }
    },
    {
      "id": "0052211e-ca9b-4601-8216-989637c58da8",
      "title": "Thou Shan’t Be Named: “Non-Church Church”",
      "description": "TITLE: Thou Shan’t Be Named: “Non-Church Church”  Non-Denominational Christianity. Sounds innocent enough, and for many non-denominational churches, it is. But for others, the non-affiliation creates a dangerous pathway to a choose your own adventure “religion.” For Shannon Payton, it was an adventure all right, but not one she necessarily would’ve chosen…if, of course, given the choice.    Shannon has lived more of her life inside the cult than out, but this social media comedian is just starting to scratch the surface of having her voice heard. A voice, of course, that wasn’t allowed to be heard for most of her life.    And trust us, it’s a voice worth hearing.   —   Follow Shannon: Insta/ TikTok @officialshannypants   Listen to our interview on The Daily Zeitgeist   Follow us: insta @wasiinacult Email us: info@wasiinacult.com   Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2022-01-12T22:29:00Z",
      "duration": "00:43:35.0920000",
      "explicit": false,
      "spotifyId": "0KX3fKRKZWTRujMuh6BExO",
      "appleId": 1000547723527,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0KX3fKRKZWTRujMuh6BExO",
        "apple": "https://podcasts.apple.com/podcast/thou-shant-be-named-non-church-church/id1582863762?i=1000547723527"
      }
    },
    {
      "id": "5b1e5962-b599-436f-a356-1ab56a823bdf",
      "title": "CHRISTMAS BONUS!: “Here Comes Santa Cult”",
      "description": "There are many a Christmas tale that we all know and love, but this one, dear listener, we can (almost) guarantee… that you have never ever heard this one.   ’Twas the night before Christmas and through the town’s center, not a creature was stirring, not even a cult member…   Merry Christmas \u0026 Happy Holidays! From our family, to yours.   ----   \u0022Was I In A Cult\u0022 Instagram   ----   Research NY TIMES ARTICLE FROM 1899: Mnason got arrested  GUILTY! After Mnason got out of prison, 1903 Thomas Nast Changed Santa  Mnason T Hunstman Obituary   Please support Was I In A Cult? Through Patreon  See omnystudio.com/listener for privacy information.",
      "release": "2021-12-22T17:11:00Z",
      "duration": "00:20:52.0750000",
      "explicit": false,
      "spotifyId": "0Sv3yw5rgwxpryBVjLTCfK",
      "appleId": 1000545834689,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Sv3yw5rgwxpryBVjLTCfK",
        "apple": "https://podcasts.apple.com/podcast/christmas-bonus-here-comes-santa-cult/id1582863762?i=1000545834689"
      }
    },
    {
      "id": "bf8ab496-4963-4dff-82af-07b6d447d23e",
      "title": "Hollyweirder: “Nothing is Free”",
      "description": "Hollywood is filled with the rich, the famous, and the people looking to take advantage of both. Because everyone in Hollywood is either someone, knows someone, or claims to be able to help you become someone. So when actress Lindsey McKeon, and singer/performer Jessica Sutta, stumble into an impressive acting class led by a teacher claiming to take their work to the next level, they don’t bat an eye. But it would be years of financial and emotional abuse disguised as self-growth before the two of them would realize… holy sh*t — their teacher turned “guru” is in fact… a cult leader.  Learn more about your ad-choices at https://www.iheartpodcastnetwork.comSee omnystudio.com/listener for privacy information.See omnystudio.com/listener for privacy information.",
      "release": "2021-12-16T13:05:00Z",
      "duration": "00:44:05.6030000",
      "explicit": false,
      "spotifyId": "31t8OGJjSI1uNFrt7FhJDs",
      "appleId": 1000545170307,
      "urls": {
        "spotify": "https://open.spotify.com/episode/31t8OGJjSI1uNFrt7FhJDs",
        "apple": "https://podcasts.apple.com/podcast/hollyweirder-nothing-is-free/id1582863762?i=1000545170307"
      }
    },
    {
      "id": "8c034a8b-c3f0-43ae-a92d-87cf29d1ef9b",
      "title": "Children of God: “You’re Enough As You Are\u0022",
      "description": "Welcome to the worst cult ever (in our humble opinions). This is a story of incredible resilience, bravery, and inspiration. Being born into a cult always comes with its challenges, but learning how to have an original thought in your mid-20s is a rare struggle that most people are fortunate enough to never have to face. This is just one of many obstacles Angel had to overcome as she ventured out of the cult and into the world.But when you’ve spent over 20 years of your life in a cult and it’s all you know, the real world isn’t always as sparkly as you hoped.____Insta: @whatisangeldoingYoutube Channel: https://www.youtube.com/user/MrAngeladesantishttps://www.theprocessbyangel.com  Learn more about your ad-choices at https://www.iheartpodcastnetwork.comSee omnystudio.com/listener for privacy information.See omnystudio.com/listener for privacy information.",
      "release": "2021-12-09T04:56:00Z",
      "duration": "00:40:03.1080000",
      "explicit": false,
      "spotifyId": "1HM6RmPbKl3ybf3N83dA9T",
      "appleId": 1000544388440,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1HM6RmPbKl3ybf3N83dA9T",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-youre-enough-as-you-are/id1582863762?i=1000544388440"
      }
    },
    {
      "id": "d7ec0431-32e6-4c85-8518-ea9ecd1b9c4f",
      "title": "Hollyweird: “Thief of Dreams\u0022",
      "description": "Los Angeles, CA is full of dreamers. After all, dreams are what people move to the City of Lost Angels to chase. But did anyone know that an acting teacher can turn into a cult leader? Is that even possible? Apparently stranger things have happened, because the answer is… Oh hell yes she can. Two former students studying under an acting coach turned self-help cult leader are here to share their harrowing stories of showing up with their dreams in their hands… but unfortunately, giving them over to the wrong “guide”. _ Podsauce ft. Liz Iacuzzi \u0026 Tyler Measom If you would like to be considered as a guest on the show, please contact us at info@wasiinacult.com Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-12-02T03:17:00Z",
      "duration": "00:56:25.1030000",
      "explicit": false,
      "spotifyId": "4JjT8T1Rb61Tg1mptvmEZT",
      "appleId": 1000543689523,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4JjT8T1Rb61Tg1mptvmEZT",
        "apple": "https://podcasts.apple.com/podcast/hollyweird-thief-of-dreams/id1582863762?i=1000543689523"
      }
    },
    {
      "id": "f424d518-2c21-4d47-9520-a6ead4594ea0",
      "title": "Democratic Workers: “The Revolution Isn’t A Tea Party\u0022",
      "description": "Some experts come by their expertise by way of education. Some by experience. Others, by both. As is the case with today’s guest. Dr. Janja Lalich joins us to share her experience in a 1970s Marxist Cult, as well as enlighten us with her expertise on the subject.    She’s been there, done that, and has more than lived to talk about it.   ______   Janja\u0027s Twitter: @Janja_Lalich   Her books: “Stuff They Don’t Want You To Know” episode:  Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-11-24T20:55:00Z",
      "duration": "00:51:19.6530000",
      "explicit": false,
      "spotifyId": "6fia0IoQqghc2xuZ00TkR9",
      "appleId": 1000542990854,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6fia0IoQqghc2xuZ00TkR9",
        "apple": "https://podcasts.apple.com/podcast/democratic-workers-the-revolution-isnt-a-tea-party/id1582863762?i=1000542990854"
      }
    },
    {
      "id": "f3cc97ea-2515-4028-8e41-ebadc859cb4d",
      "title": "The Order: “Feel Like a Number”",
      "description": "When you\u0027re numbered among the Lord\u0027s anointed, you\u0027re supposed to feel special, but for Jeremy Tucker, he was just another mindless cog in the machine of the Kingdom of God. It didn\u0027t matter though, he would work hard to do his part, until that hard work nearly cost him his life…   From guest producer Lindsay Hansen Park.    https://www.yearofpolygamy.com/   https://sunstone.org/sunstone-history-podcast/   https://www.tiktok.com/@lindsayhansenpark?lang=en   Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-11-04T21:12:00Z",
      "duration": "00:51:17.7200000",
      "explicit": false,
      "spotifyId": "0HrTHz2rgOPXU4il726wrM",
      "appleId": 1000540812128,
      "subjects": [
        "Latter Day Church of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0HrTHz2rgOPXU4il726wrM",
        "apple": "https://podcasts.apple.com/podcast/the-order-feel-like-a-number/id1582863762?i=1000540812128"
      }
    },
    {
      "id": "a548e012-55d6-4b78-935b-7decc2387bb3",
      "title": "The Mel Lyman Family PT 2: “Wanted at the Big House\u0022",
      "description": "When you grow up in a cult, life on the outside can be rough. So rough, that one might actually prefer to stay inside the cult. When Guinevere finally experiences life on the outside, she witnesses firsthand that one can physically leave a cult, but mentally, still be in it.    And the moment of true clarity for Guinevere comes at a moment no one sees coming. Especially not herself.    ______   Guinevere’s Instagram: @guinevereturner   Twitter: @turnerguinevere   Link to Charlie Says: https ://www.netflix.com/title/81023720 Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-10-27T22:30:00Z",
      "duration": "00:37:43.4050000",
      "explicit": false,
      "spotifyId": "0H8EVzRmgQT2vnuSziQ9wC",
      "appleId": 1000539939048,
      "subjects": [
        "The Lyman Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0H8EVzRmgQT2vnuSziQ9wC",
        "apple": "https://podcasts.apple.com/podcast/the-mel-lyman-family-pt-2-wanted-at-the-big-house/id1582863762?i=1000539939048"
      }
    },
    {
      "id": "1c32f897-1800-45fb-87ea-70e781382e00",
      "title": "The Mel Lyman Family PT1: “People Get Ready“",
      "description": "As an actor and writer, Guinevere Turner understands more than most, that some stories just can’t be contrived. Because sometimes life is far stranger than fiction.    As is the case with Guinevere’s upbringing.    Not your typical getting out story, it would take years for Guinevere to understand that, no, she didn’t grow up on a hippie commune in the 1970s and 80s… she grew up in a cult.    ______   Guinevere’s Instagram: @guinevereturner / Twitter: @turnerguinevere   Link to Spotify playlist for this episode:  https://open.spotify.com/playlist/4OqNnobOP5tj3rB1tBytpC?si=dc2760b11c6f4e57 Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-10-20T19:15:00Z",
      "duration": "00:43:14.1680000",
      "explicit": false,
      "spotifyId": "5hvi6ErsTZgn7Zj65ML2z4",
      "appleId": 1000539210693,
      "subjects": [
        "The Lyman Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5hvi6ErsTZgn7Zj65ML2z4",
        "apple": "https://podcasts.apple.com/podcast/the-mel-lyman-family-pt1-people-get-ready/id1582863762?i=1000539210693"
      }
    },
    {
      "id": "7df0018b-0d2f-435a-a99c-34f457fc3c0c",
      "title": "Atypicult: “Mental Parental”",
      "description": "This is not your typical cult. But for comedian, Ariel, it was all she knew. Filled with isolation and abuse, it would take her years to break free.    Ariel’s Insta: @Arielsnotamermaid Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-10-13T10:00:00Z",
      "duration": "00:40:05.2760000",
      "explicit": false,
      "spotifyId": "7BfNfbKmvbKjm4L96ZRWuu",
      "appleId": 1000538440607,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7BfNfbKmvbKjm4L96ZRWuu",
        "apple": "https://podcasts.apple.com/podcast/atypicult-mental-parental/id1582863762?i=1000538440607"
      }
    },
    {
      "id": "b4675c8c-e918-44e2-b76d-35e545608c65",
      "title": "Children of God: “Pray for Death”",
      "description": "When you’re born into a cult, it’s difficult enough. But when you’re born into a cult with a raging alcoholic pedophile as the leader, it’s a nightmare.   Author, Flor Edwards was raised in the Children of God. And praise the lord she got out.    But getting out didn’t come without its own challenges…   ____   Link to Flor\u0027s autobiography:  https://www.amazon.com/Apocalypse-Child-Flor-Edwards/dp/1683367685   Follow Flor on social media: @floredwardsauthor Please support Was I In A Cult? Through Patreon  See omnystudio.com/listener for privacy information.",
      "release": "2021-10-06T11:00:00Z",
      "duration": "00:43:06.3830000",
      "explicit": false,
      "spotifyId": "3edBMXbPukHLn41AurQqTN",
      "appleId": 1000537721637,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3edBMXbPukHLn41AurQqTN",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-pray-for-death/id1582863762?i=1000537721637"
      }
    },
    {
      "id": "d0c821ef-102c-4705-8a96-4513615fcb83",
      "title": "Jehovah’s Witnesses: “Shut Up and Be Blessed“",
      "description": "With rockstar aspirations, Daniel O’Brien wasn’t looking for anything but a good time. But when heartbreak rocked his world, he tripped into something that lifted his spirits and rallied his hopes - the Jehovah’s Witnesses.    Before he knew it, Daniel had traded his guitar for a green Bible and found himself rapidly rising through the ranks of the religion. A wife, and two kids later, he was a fully indoctrinated, high ranking Elder in the church.   But when Daniel realizes that he’s part of a life much different than the one he originally signed up for, he knows that he must leave.    The only problem is… he can’t.   ___   If you, or anyone you know has ever been in a cult, please email us at info@wasiinacult.com, we’d love to hear from you. Your story could be featured in a future episode… Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-29T12:30:00Z",
      "duration": "00:47:40.7210000",
      "explicit": false,
      "spotifyId": "21IvhtxZQO9cJQ4cMJJ1WI",
      "appleId": 1000536988521,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21IvhtxZQO9cJQ4cMJJ1WI",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-shut-up-and-be-blessed/id1582863762?i=1000536988521"
      }
    },
    {
      "id": "a993dd66-d87d-41b5-802f-87268e6f21eb",
      "title": "Women Only Secret Society (NXIVM) PT 2: \u0022Collateral Damaged\u0022",
      "description": "“It’s exclusive,” she was told. A women only secret society.  She was a chosen one, after all.  A badass ninja warrior woman, she was ready to set the world on fire.  Finally surrounded by people that shared her same vision, she would do whatever it takes.  Jessica Joan was ready for anything. Well... almost anything.    __   If you, or anyone you know, has successfully escaped a cult, please reach out to us. We\u0027d love to hear from you and have your story and voice be heard on a future episode: info@wasiinacult.com Please support Was I In A Cult? Through Patreon     __   Jessica Joan\u0027s Instagram: https://www.instagram.com/lovejessjoan/?hl=en   You can purchase Jessica\u0027s book here: http://theuntouchablejessicajoan.comSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-22T12:30:00Z",
      "duration": "00:56:52.7930000",
      "explicit": false,
      "spotifyId": "0E0CDjoOQBkJaXyHZkCtTd",
      "appleId": 1000536272691,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0E0CDjoOQBkJaXyHZkCtTd",
        "apple": "https://podcasts.apple.com/podcast/women-only-secret-society-nxivm-pt-2-collateral-damaged/id1582863762?i=1000536272691"
      }
    },
    {
      "id": "b9efb4b4-e94b-4681-9e8d-056272ecdd17",
      "title": "Women Only Secret Society (NXIVM) PT 1: \u0022The Magic Sauce\u0022",
      "description": "When the LA party scene didn’t fit Jessica’s lifestyle anymore, she replaced martinis and after-hour clubs with green juices and tonic bars. But the reemergence of a childhood trauma forced her to examine her inner self.  One day, a friend told her about a class that could improve her life even more. That class turned out to be part of a larger entity. A self-empowerment company that purported to help you become the master of your own life.  A little group called… NXIVM. Jessica Joan\u0027s Instagram: https://www.instagram.com/lovejessjoan/?hl=en You can purchase Jessica\u0027s book here: http://theuntouchablejessicajoan.com Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-15T11:30:00Z",
      "duration": "00:49:05.5930000",
      "explicit": false,
      "spotifyId": "22tAbDchVWthXnDRVYhr2D",
      "appleId": 1000535408698,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22tAbDchVWthXnDRVYhr2D",
        "apple": "https://podcasts.apple.com/podcast/women-only-secret-society-nxivm-pt-1-the-magic-sauce/id1582863762?i=1000535408698"
      }
    },
    {
      "id": "02a01b65-d6aa-49d1-b964-9e43fb8e05e1",
      "title": "Mormon…More Women PT 2: \u0022I do… I do… I don’t.\u0022",
      "description": "Faced with the fear of an impending apocalypse, Joanne and her husband move to a small Utah town to live “Mormonism on steroids”, which means wearing long underwear, communicating with the dead, prophetic visions, odd temple rituals, cookies with Jesus, and the law of celestial marriage (i.e. polygamy). If you or someone you know has been in a cult and want to share your story, contact us at info@wasiinacult.com. We\u0027d love to hear from you. Link to Joanne\u0027s Book, \u0022It\u0027s Not About Sex My Ass: Confessions of an Ex-Mormon Ex-Polygamist Ex-Wife\u0022: https://www.amazon.com/Its-Not-About-Sex-Ex-Polygamist-ebook/dp/B008Q4D6E4 Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-08T10:15:00Z",
      "duration": "00:37:52.7570000",
      "explicit": false,
      "spotifyId": "3BFbp4kgfDoMn5tG0bHV0s",
      "appleId": 1000534681663,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BFbp4kgfDoMn5tG0bHV0s",
        "apple": "https://podcasts.apple.com/podcast/mormon-more-women-pt-2-i-do-i-do-i-dont/id1582863762?i=1000534681663"
      }
    },
    {
      "id": "e7707c44-d3f4-45bb-95b2-28c53d005bb8",
      "title": "Mormon…More Women PT 1: \u0022My Husband’s Wife\u0022",
      "description": "Faced with the fear of an impending apocalypse, Joanne and her husband move to a small Utah town to live “Mormonism on steroids”, which means wearing long underwear, communicating with the dead, prophetic visions, odd temple rituals, cookies with Jesus, and the law of celestial marriage (i.e. polygamy). If you or someone you know has been in a cult and want to share your story, contact us at info@wasiinacult.com We\u0027d love to hear from you. Link to Joanne\u0027s Book, \u0022It\u0027s Not About Sex My Ass: Confessions of an Ex-Mormon Ex-Polygamist Ex-Wife\u0022: https://www.amazon.com/Its-Not-About-Sex-Ex-Polygamist-ebook/dp/B008Q4D6E4 Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-08T10:00:00Z",
      "duration": "00:35:59.3860000",
      "explicit": false,
      "spotifyId": "3P3AmH2jeTVricdgRkWg7w",
      "appleId": 1000534679142,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3P3AmH2jeTVricdgRkWg7w",
        "apple": "https://podcasts.apple.com/podcast/mormon-more-women-pt-1-my-husbands-wife/id1582863762?i=1000534679142"
      }
    },
    {
      "id": "36fdc76d-0788-4466-a880-6cdfe6384777",
      "title": "Trailer: Was I In A Cult?",
      "description": "Hosted by Tyler Measom and Liz Iacuzzi, Was I In A Cult? is a documentary-style podcast  featuring far-out, first-hand stories of survivors who unwittingly joined, lived in, and escaped, cults. Using levity and info-tainment, the show humanizes the cultic experience and may leave some of our listeners asking themselves…“Wait…was I in a cult?”   Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-08-26T12:39:00Z",
      "duration": "00:03:31.8260000",
      "explicit": false,
      "spotifyId": "7DgUvE3dwfzsvRf4ZNjbPk",
      "appleId": 1000533122429,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7DgUvE3dwfzsvRf4ZNjbPk",
        "apple": "https://podcasts.apple.com/podcast/trailer-was-i-in-a-cult/id1582863762?i=1000533122429"
      }
    }
  ]
}