{
  "id": "6cd6deb2-a733-4b06-af61-0234a54344e9",
  "name": "Was I In A Cult?",
  "spotifyId": "43lKIk7Tt69S4tdCpHWCnH",
  "appleId": 1582863762,
  "episodes": [
    {
      "id": "f8e970b2-9a7c-4376-8378-0f90b9144622",
      "title": "Liz’s Story—Pt2: “Kick \u0027Em in the Cooch”",
      "description": "So… remember that acting class? Well, turns out this “human behavior expert” has her eyes on a much larger prize. I mean, you can’t be the next Tony Robbins while just teaching scene analysis. In Part 2 of Liz’s story, Sandy’s world shifts into trying to become what it’s been after all along: a spiritual self-help empire. Except this one is built on word salad, public humiliation, and the slow, steady squeeze of control. (Spoiler: Her goal never \u0022manifested\u0022) In this shift, the class expands beyond Los Angeles… all the way across the world to India. Because when you’re in a class to learn scene analysis, the obvious next step is a spiritual retreat. The language changes. The pressure shifts. And suddenly, “transformation” comes with a hefty price tag. A world where boundary crossing is reframed as growth and the cost of admission is total and complete loyalty. And if you can’t afford it? No worries. Just sell your car. One student did. And if you learn nothing else - as Liz would tell you, when someone slaps you in India, kick ’em in the cooch. _______ FOLLOW US For more culty content - follow us on Instagram \u0026 TikTok → @wasiinacult SUPPORT THE SHOW If you believe in what we’re doing - shining a light on manipulation, coercive control, and cultic abuse - please rate, review, and share the podcast. Want even more? Join us on Patreon for ad-free episodes, bonus content, and behind-the-scenes conversations. HAVE A CULTY STORY TO SHARE? If you’ve been part of a cult - we want to hear from you. Email us → info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2026-01-19T08:00:00Z",
      "duration": "00:59:58.0270000",
      "explicit": false,
      "spotifyId": "161flbL0a1qtO1JpwEkZrL",
      "appleId": 1000745760669,
      "subjects": [
        "Cult Psychology",
        "Self-Help",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/161flbL0a1qtO1JpwEkZrL",
        "apple": "https://podcasts.apple.com/podcast/lizs-story-pt2-kick-em-in-the-cooch/id1582863762?i=1000745760669"
      }
    },
    {
      "id": "2d906e72-4781-430c-9214-a6513c2cbead",
      "title": "Liz’s Story - Pt1: “Hollyweirdest”",
      "description": "Either Liz finally stepped up to the mic to tell her own story… or Tyler finally cornered her and hit record. Either way — it’s happening. After moving to Los Angeles with a toxic boyfriend, Liz leaves behind the Chicago comedy scene and finds herself nudged into a Hollywood acting class — one he introduces her to via a “free” class that’s anything but. What starts as a supposedly legit acting class quickly earns a reputation as “the place where comedy goes to die.” And yet… it’s somehow worse than that. Because this “class” slowly morphs into a spiritual self-help cult. Yes. An acting class cult. No, she did not see it coming. And neither will you. In Part 1 of Liz’s story, we dive into how this Chicagoan accidentally wandered into the hollyweirdest chapter of her life. _______ FOLLOW US For more culty content — follow us on Instagram \u0026 TikTok → @wasiinacult SUPPORT THE SHOW If you believe in what we’re doing — shining a light on manipulation, coercive control, and cultic abuse — please rate, review, and share the podcast. Want even more? Join us on Patreon for ad-free episodes, bonus content, and behind-the-scenes conversations. HAVE A CULTY STORY TO SHARE? If you’ve been part of a cult — we want to hear from you. Email us → info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2026-01-12T08:00:00Z",
      "duration": "01:03:45.9200000",
      "explicit": false,
      "spotifyId": "0VMT6xj7jvuqErtoXdYEWg",
      "appleId": 1000744835226,
      "subjects": [
        "_America",
        "Cult Psychology",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0VMT6xj7jvuqErtoXdYEWg",
        "apple": "https://podcasts.apple.com/podcast/lizs-story-pt1-hollyweirdest/id1582863762?i=1000744835226"
      }
    },
    {
      "id": "350c37db-ce88-460c-ba79-e543e5d84924",
      "title": "NXIVM Aftermath - Jessica Joan Returns: “Not My Monkey, Not My Circus”",
      "description": "Four years after we first met her in our studio - just days after her victim impact statement in Alison Mack’s NXIVM trial - Jessica Joan is back.\n\nSince we last spoke, Jessica shared her story on the Hulu docuseries “How I Escaped My Cult”, and a lot has shifted: in her healing, in what “justice” means, and in what accountability actually looks like over time.\n\nThis follow-up conversation was prompted by our recent interview with journalist Natalie Robehmed, host of the podcast “Alison After NXIVM”, where listeners hear Alison speak publicly about NXIVM and her life post-prison. After that episode, it felt important to come back to Jessica - to hear directly from someone harmed by Alison, and to explore the messy questions of empathy, forgiveness, and what we’re really asking for when we say we want “accountability.”\n\nFOLLOW US\nFor more culty content - follow us on Instagram \u0026 TikTok → @wasiinacult\n\nFIND JESSICA\nGet your copy of The Untouchable: Jessica Joan \u0026 the Downfall of NXIVM\nCheck out her new website: www.thisisjessicajoan.com\nInstagram/TikTok: @thesirenandthesunflower\n\nSUPPORT THE SHOW\nIf you believe in what we’re doing - shining a light on manipulation, coercive control, and cultic abuse - please rate, review, and share the podcast.\nWant even more?\nJoin us on Patreon for ad-free episodes, bonus content, and behind-the-scenes conversations.\n\nHAVE A CULTY STORY TO SHARE?\nIf you’ve been part of a cult - we want to hear from you.\nEmail us → info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2026-01-05T08:00:00Z",
      "duration": "00:41:45",
      "explicit": false,
      "spotifyId": "0XsKyKKsp6CiIPBxzX8Zxs",
      "appleId": 1000743785820,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0XsKyKKsp6CiIPBxzX8Zxs",
        "apple": "https://podcasts.apple.com/podcast/nxivm-aftermath-jessica-joan-returns-not-my-monkey/id1582863762?i=1000743785820"
      }
    },
    {
      "id": "8d2a44a7-5744-4f75-ac9c-3c093f3c2fd7",
      "title": "Children of God: \u0022You\u0027re Enough as You Are\u0022 [RE-RELEASE]",
      "description": "**NOTE: This episode originally aired in 2021**\n\nWelcome to the worst cult ever (in our humble opinions). This is a story of incredible resilience, bravery, and inspiration. Being born into a cult always comes with its challenges, but learning how to have an original thought in your mid-20s is a rare struggle that most people are fortunate enough to never have to face. This is just one of many obstacles Angel had to overcome as she ventured out of the cult and into the world.But when you\u0027ve spent over 20 years of your life in a cult and it\u0027s all you know, the real world isn\u0027t always as sparkly as you hoped.\n\nFOLLOW US\nFor more culty content — follow us on Instagram \u0026 TikTok → @wasiinacult\n\nFIND ANGEL\nInstagram: @whatisangeldoing\nYoutube: @AngelDeSantis\n\nSUPPORT THE SHOW\nIf you believe in what we’re doing — shining a light on manipulation, coercive control, and cultic abuse — please rate, review, and share the podcast.\nWant even more?\nJoin us on Patreon for ad-free episodes, bonus content, and behind-the-scenes conversations.\n\nHAVE A CULTY STORY TO SHARE?\nIf you’ve been part of a cult — we want to hear from you.\nEmail us → info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-12-29T08:00:00Z",
      "duration": "00:43:45",
      "explicit": false,
      "spotifyId": "0ZZIUdy0I65CKaWTwl8miv",
      "appleId": 1000743076803,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ZZIUdy0I65CKaWTwl8miv",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-youre-enough-as-you-are-re-release/id1582863762?i=1000743076803"
      }
    },
    {
      "id": "ff38433b-b455-4048-8c40-82d0b9ca5ef7",
      "title": "Children of God: “The Christmas Monster”",
      "description": "A comet. A cultural fever. And a cult’s failed prophecy. \n\nIn 1973, as the holidays approached and the world felt increasingly unstable, a comet named Kohoutek was predicted to light up the sky in way never seen before… right at Christmas. The media obsessed. The artists sang. And David Berg, an apocalyptic sex cult leader, saw confirmation that judgment was imminent. Christmas would be the end.\n\nIn this episode, we trace how the Children of God turned a celestial event into The Christmas Monster, sending families fleeing the United States, scattering members across the globe, and quietly erasing the idea of home altogether.\n\nWe speak with Perry Bulwar, who was recruited into the cult as a teenager and lived inside it for over twenty years. He takes us through belief, fear, failed prophecy, and the moment a pop song cracked the spell.\n\nIt’s a holiday story - just maybe not the kind you’re used to.\n\n___________\n\nFOLLOW US\nFor more culty content - follow us on Instagram \u0026 TikTok → @wasiinacult\n\nPERRY’S BOOK\nGet your copy of “Misguided: My Jesus Freak Life In a Doomsday Cult”\n\nSUPPORT THE SHOW\nIf you believe in what we’re doing - shining a light on manipulation, coercive control, and cultic abuse - please rate, review, and share the podcast.\nWant even more?\nJoin us on Patreon for ad-free episodes, bonus content, and behind-the-scenes conversations.\n\nHAVE A CULTY STORY TO SHARE?\nIf you’ve been part of a cult - we want to hear from you.\nEmail us → info@wasiinacult.com\n\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-12-23T08:00:00Z",
      "duration": "00:45:31",
      "explicit": false,
      "spotifyId": "4Tt8VMuHgH3gbSy9tFr9c5",
      "appleId": 1000742561828,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Tt8VMuHgH3gbSy9tFr9c5",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-the-christmas-monster/id1582863762?i=1000742561828"
      }
    },
    {
      "id": "523fde5f-dec3-4a9b-92d4-da677353f50b",
      "title": "Cosmetology School: “It’s Giving Cult”",
      "description": "This week we head to Nashville, Tennessee — where a cosmetology school promising structure, opportunity, and “professionalism” turned out to be something else entirely.\nOur guest, Sophia, thought she was paying over $20,000 to learn how to do hair. Instead, she walked into a system obsessed with obedience, image, and silence — where being late cost money, smiling was mandatory, and your body, time, and labor were constantly monitored. Add in “motivational” rituals, public humiliation, and unpaid work dressed up as “education,” and suddenly this isn’t just cosmetology school… it’s giving cult.\nFOLLOW US\nFor more culty content — follow us on Instagram \u0026 TikTok → @wasiinacult\nFOLLOW SOPHIA\nFind Sophia on Instagram \u0026 TikTok → @styledby.sophiaelise\nIf you’re in Nashville, go get your hair done and TIP WELL! \nSUPPORT THE SHOW\nIf you believe in what we’re doing — shining a light on manipulation, coercive control, and cultic abuse — please rate, review, and share the podcast.\nWant even more?\nJoin us on Patreon for ad-free episodes, bonus content, and behind-the-scenes conversations.\nHAVE A CULTY STORY TO SHARE?\nIf you’ve been part of a cult, high-control group, or something that didn’t look like a cult until way later — we want to hear from you.\nEmail us → info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-12-19T08:00:00Z",
      "duration": "00:55:36",
      "explicit": false,
      "spotifyId": "49dTXXLffw2BZx9bkEFtZC",
      "appleId": 1000741963771,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/49dTXXLffw2BZx9bkEFtZC",
        "apple": "https://podcasts.apple.com/podcast/cosmetology-school-its-giving-cult/id1582863762?i=1000741963771"
      }
    },
    {
      "id": "e8eca1f3-f2f0-4827-9638-5dc4eadc9d2d",
      "title": "The Cult of Ashtanga Yoga: \u0022No Touching, Guruji!\u0022",
      "description": "This week, Liz and Tyler head straight into the sweaty “this-is-definitely-not-a-cult-except-maybe-it-definitely-is” world of Ashtanga yoga. \nOur guest, Magnolia Zuniga, was one of only 20 women in the world to become a Certified Ashtanga teacher. She spent 22 years inside the system — traveling to India, waking up before the crack of dawn, giving up apartments, and building her entire life around the practice and the man who created it. \nThen, on her very first day studying with master Pattabhi Jois — the “grandfather” of modern yoga — she witnessed something that shattered everything she thought she knew. \nWhat followed was years of confusion, devotion, cognitive dissonance, community pressure, and the slow unraveling of everything she believed Ashtanga Yoga to be.\n\nFOLLOW US\nFor more culty content, nuanced conversations, and uncomfortable truths told with care — follow us on Instagram \u0026 TikTok →\n@wasiinacult\n\nFOLLOW MAGNOLIA\nYouTube: @MagnoliaSezSo\nInstagram: @magnoliasezso\nMagnolia\u0027s Newsletter\n\nSUPPORT THE SHOW\nIf you believe in what we’re doing — shining a light on manipulation, coercion, and the messy psychology behind it — please rate, review, and share the podcast.\nWant to support our work even more so we can keep bringing you more cult-busting content?\nJoin our Patreon for ad-free episodes, bonus content, and our eternal gratitude.\n\nHAVE A CULTY STORY TO SHARE?\nWe’d love to hear from you.\nEmail us → info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-12-10T08:00:00Z",
      "duration": "01:09:35",
      "explicit": false,
      "spotifyId": "1vfbdkdxN6CmdQi1xSe6B2",
      "appleId": 1000740712510,
      "subjects": [
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1vfbdkdxN6CmdQi1xSe6B2",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-ashtanga-yoga-no-touching-guruji/id1582863762?i=1000740712510"
      }
    },
    {
      "id": "d4a4e0b0-8148-4b26-80af-667c8db798f5",
      "title": "Allison After NXIVM: “The Monster She Met. The Monster She Became.”",
      "description": "When we got the email inviting us to interview journalist Natalie Robehmed about her new CBC \u0026#43; Campsite Media podcast, Allison After NXIVM, we weren’t sure what to do. Talking about Allison Mack — someone who caused very real harm, including to people we’ve had on this show - is complicated. And honestly? We didn’t want to accidentally platform or sanitize that harm. But then we listened. And what we found wasn’t a redemption story. It was complexity. It was discomfort. It was a journalist tracing how someone can be both a victim and a perpetrator. In this conversation, Natalie takes us behind her interviews with Allison: childhood exploitation, Hollywood pressures, the hunger to be “the best,” and the dynamics of NXIVM’s inner circle that turned all of that into something horrifying. We’re not here to tell you how to feel about Allison Mack. But we are here to sit in the space where victimhood and violence blur - the space where a person realizes the monster they were running from is the one they learned to be. FOLLOW US For more culty content - follow us on Instagram \u0026 TikTok → @wasiinacult LISTEN TO \u0022ALLISON AFTER NXIVM\u0022 Hear Natalie\u0027s full 7-part investigation into Allison Mack (or search Allison After NXIVM wherever you get your podcasts. SUPPORT THE SHOW If you believe in what we’re doing - shining a light on manipulation, coercion, and the messy psychology behind it - please rate, review, and share the podcast. Want to be part of our inner circle? Join us on Patreon for ad-free episodes, bonus content, and our eternal gratitude for helping us keep these stories alive. HAVE A CULTY STORY? We’d love to hear from you - drop us a line at info@wasiinacult.com . See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-12-01T08:00:00Z",
      "duration": "01:13:16.4600000",
      "explicit": false,
      "spotifyId": "6FsHmBzC8DJ3MzNlk6OGAA",
      "appleId": 1000739140912,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6FsHmBzC8DJ3MzNlk6OGAA",
        "apple": "https://podcasts.apple.com/podcast/allison-after-nxivm-the-monster-she-met-the-monster/id1582863762?i=1000739140912"
      }
    },
    {
      "id": "6ed460ae-59fd-4e6e-8c87-1f6116759344",
      "title": "The LeBaron Polygamy Cult—Pt3: “And It Was Revealed, the Power Had Always Been Hers.”",
      "description": "She survived a violent polygamist cult. She survived a husband who collected wives like property. She survived the blood atonement doctrine that stalked her childhood like a shadow. But this is the part of Pamela Jones’s story where she does the impossible: she runs. In this final chapter of our three-part series, Pamela plans an escape nearly as dangerous as the life she’s leaving behind—nine children in tow, no legal paperwork for half of them, almost no money, and the very real fear that leaving could mean death. This episode isn’t just about leaving a cult. It’s about rebuilding an identity from scratch. It’s about motherhood as revolution. It’s about reclaiming a life she was told she never owned. And it’s the story of what Pamela built on the other side—freedom, love, a business, and a legacy that’s inspiring other women to walk out of the same darkness she escaped. Her transformation is staggering. Her resilience is unforgettable. Her ending is exactly what she deserved. Pamela’s memoir, The Dirt Beneath Our Door, is linked in the show notes. _____________ FOLLOW US For more culty content — follow us on Instagram \u0026 TikTok → @wasiinacult SUPPORT THE SHOW If you believe in what we’re doing (and want to help us keep shining light on the dark corners of control and charisma), please rate, review, and share the podcast. It helps more than you know. Want to go deeper down the rabbit hole? Join us on Patreon for ad-free episodes, bonus content, and our eternal gratitude for helping us keep these stories alive. HAVE A CULTY STORY? We’d love to hear from you — drop us a line at info@wasiinacult.com . CONNECT WITH PAMELA JONES You can follow Pamela Jones — speaker, author, survivor, and all-around badass — here: Her Book: The Dirt Beneath Our Door Website LinkedIn Instagram Facebook See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-11-24T08:00:00Z",
      "duration": "00:56:30.2760000",
      "explicit": false,
      "spotifyId": "7mHVWpPNvqFZR38p2Ig1Qe",
      "appleId": 1000738165976,
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7mHVWpPNvqFZR38p2Ig1Qe",
        "apple": "https://podcasts.apple.com/podcast/the-lebaron-polygamy-cult-pt3-and-it-was-revealed/id1582863762?i=1000738165976"
      }
    },
    {
      "id": "311a9723-6ba8-4c65-ab35-cb6024f99e17",
      "title": "The LeBaron Polygamy Cult—Pt2: \u0022Wives in Bulk\u0022",
      "description": "In Part Two of Pamela Jones’ extraordinary story, the so-called “escape” she dreamed of at fifteen turns into a new kind of prison.\nAfter growing up under the violent rule of the LeBaron brothers — a murderous offshoot of Mormon fundamentalism — Pamela marries young, believing it will be her salvation. Her husband David doesn’t just take her innocence — he takes her freedom, her home, and her dignity. She raises babies on rationed potatoes, lives under the threat of blood atonement, and tries to stay safe inside a community run by fear, hierarchy, and men who call their control “God’s will.”\nBut years later, and many sister wives later, something in Pamela begins to shift. A spark. A voice. A quiet rebellion forged from decades of silence.\nThis is the part of her journey where the cracks in the doctrine begin to show… and where Pamela realizes the only person coming to save her is herself.\nNext week: the escape — across a border, across a belief system, and into a life she was never meant to reach.\n____________\nFOLLOW US\nFor more culty content —\nfollow us on Instagram \u0026 TikTok → @wasiinacult\n\nSUPPORT THE SHOW\nIf you believe in what we’re doing (and want to help us keep shining light on the dark corners of control and charisma), please rate, review, and share the podcast. It helps more than you know.\n\nWant to go deeper down the rabbit hole?\nJoin us on Patreon for ad-free episodes, bonus content, and our eternal gratitude for helping us keep these stories alive.\n\nHAVE A CULTY STORY?\nWe’d love to hear from you — drop us a line at info@wasiinacult.com.\n\nCONNECT WITH PAMELA JONES\nYou can follow Pamela Jones — speaker, author, survivor, and all-around badass — here:\nHer Book: The Dirt Beneath Our DoorWebsiteLinkedInInstagramFacebook\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-11-17T08:00:00Z",
      "duration": "00:55:10",
      "explicit": false,
      "spotifyId": "27yQc3B6TJxL75f9Ciy1iZ",
      "appleId": 1000737158827,
      "subjects": [
        "Church of the Firstborn (LeBaron family)",
        "Apostolic United Brethren",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/27yQc3B6TJxL75f9Ciy1iZ",
        "apple": "https://podcasts.apple.com/podcast/the-lebaron-polygamy-cult-pt2-wives-in-bulk/id1582863762?i=1000737158827"
      }
    },
    {
      "id": "abbabcd0-3c35-4c0a-a9ab-7f966f35faa4",
      "title": "The LeBaron Polygamy Cult—P1: “Murder in the Name of God”",
      "description": "FOLLOW US\nFor more culty content —\nfollow us on Instagram \u0026 TikTok → @wasiinacult\n\nSUPPORT THE SHOW\nIf you believe in what we’re doing (and want to help us keep shining light on the dark corners of control and charisma), please rate, review, and share the podcast. It helps more than you know.\n\nWant to go deeper down the rabbit hole?\nJoin us on Patreon for ad-free episodes, bonus content, and our eternal gratitude for helping us keep these stories alive.\n\nHAVE A CULTY STORY?\nWe’d love to hear from you — drop us a line at info@wasiinacult.com.\n\nCONNECT WITH PAMELA JONES\nYou can follow Pamela Jones — speaker, author, survivor, and all-around badass — here:\nHer Book: The Dirt Beneath Our DoorWebsiteLinkedInInstagramFacebook\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-11-11T08:00:00Z",
      "duration": "01:00:54",
      "explicit": false,
      "spotifyId": "40MxumPsb7iP7AHhJkXGjf",
      "appleId": 1000736316443,
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/40MxumPsb7iP7AHhJkXGjf",
        "apple": "https://podcasts.apple.com/podcast/the-lebaron-polygamy-cult-p1-murder-in-the-name-of-god/id1582863762?i=1000736316443"
      }
    },
    {
      "id": "abd77bc1-95db-41ea-a91e-6baf247c8af0",
      "title": "[UPDATE] Jehovah’s Witnesses: “Shut Up and Be Blessed”",
      "description": "**Note: This episode originally aired in September 2021. Stick around til the end for a catch up interview with Daniel 4 years later.**\n\nWith rockstar aspirations, Daniel O\u0027Brien wasn\u0027t looking for anything but a good time. But when heartbreak rocked his world, he tripped into something that lifted his spirits and rallied his hopes - the Jehovah\u0027s Witnesses. Before he knew it, Daniel had traded his guitar for a green Bible and found himself rapidly rising through the ranks of the religion. A wife, and two kids later, he was a fully indoctrinated, high ranking Elder in the church. But when Daniel realizes that he\u0027s part of a life much different than the one he originally signed up for, he knows that he must leave. The only problem is... he can\u0027t.\n_____\n\nFOLLOW US\nFor more culty content, follow us on Instagram \u0026 TikTok:\n→ @wasiinacult\n\nSUPPORT THE SHOW\n\nIf you believe in what we’re doing — please rate, review, and share the podcast. It helps more than you know.\n\nAnd if you’d like to go a step further, join us on Patreon. You’ll get ad-free episodes, bonus content, and our eternal gratitude for helping us keep these conversations going.\n→ Join us on Patreon.\n\nHAVE A CULTY STORY?\nWe’d love to hear from you.\n→ info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-11-03T08:00:00Z",
      "duration": "01:06:10",
      "explicit": false,
      "spotifyId": "0a6w293QT3iv3gDTSNUGHM",
      "appleId": 1000735004261,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0a6w293QT3iv3gDTSNUGHM",
        "apple": "https://podcasts.apple.com/podcast/update-jehovahs-witnesses-shut-up-and-be-blessed/id1582863762?i=1000735004261"
      }
    },
    {
      "id": "35fd7fdd-3ba6-425f-8dfa-7ebc20305082",
      "title": "The Jordanian Sufi Cult: “Trapped Between Worlds”",
      "description": "When Raidah left medical school in Sydney to spend the summer at what was promise to be an Islamic utopia in Jordan, she thought she was taking a break to heal. Instead, she found herself inside a high-control religious community led by Nuh Ha Mim Keller — an American-born Catholic convert who reinvented himself as a Sufi sheikh and built a devoted following of Muslims living in Western countries. Through his English-language books, lectures, and retreats, Keller promised these diaspora Muslims a spiritual home — a refuge from Western chaos and Islamophobia. But what Raidah found instead… was a cult. _____ FOLLOW US For more culty content, follow us on Instagram \u0026 TikTok: → @wasiinacult FOLLOW RAIDAH SHAH IDIL Follow Raidah on Instagram → @raidahwrites Check out her debut novel How to Free a Jinn — available now from Penguin Random House SEA and in the U.S. READ Storm Without a Port (PDF) — the 77-page survivor testimony compiled by former members of the Jordanian Sufi cult. Visit In Shaykh’s Clothing — a resource for Muslim survivors of spiritual abuse. SUPPORT THE SHOW If you believe in what we’re doing — please rate, review, and share the podcast. It helps more than you know. And if you’d like to go a step further, join us on Patreon . You’ll get ad-free episodes, bonus content, and our eternal gratitude for helping us keep these conversations going. → Join us on Patreon . HAVE A CULTY STORY? We’d love to hear from you. → info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-10-27T07:00:00Z",
      "duration": "01:02:33.9260000",
      "explicit": false,
      "spotifyId": "0rkqsR4DjuexbBkhgvkZ3d",
      "appleId": 1000733656720,
      "subjects": [
        "Sufi"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0rkqsR4DjuexbBkhgvkZ3d",
        "apple": "https://podcasts.apple.com/podcast/the-jordanian-sufi-cult-trapped-between-worlds/id1582863762?i=1000733656720"
      }
    },
    {
      "id": "fdca7f19-f798-426c-9cf1-e84ad1b9fcd4",
      "title": "[BONUS] Amy Duggar King: “Holy Disruptor”",
      "description": "Today’s story isn’t about a reality TV show—though a lot of people think it starts there. In truth, it began long before the cameras, before the matching outfits and the too-perfect smiles. You know the TLC series 19 Kids \u0026 Counting—the Duggars and their seemingly perfect world built within the IBLP. But there was another Duggar—of sorts. Not a sibling. The cousin. Amy. Or as America came to know her, “Crazy Cousin Amy.” Except she wasn’t crazy. Isn’t crazy. Not even close. She just wasn’t in their cult—the IBLP. What no one saw, though, was that Amy—an only child—was surviving her own hell at home. Her new memoir, Holy Disruptor, is a story of breaking cycles, setting boundaries, and finding herself in the aftermath. Today, she joins us to talk about her journey—from the quiet terror of her childhood to life in the public eye, through the scandals that shattered her trust, and toward a life built on truth, healing, and peace… even when it means disrupting “family.” And no, she wasn’t in the IBLP, but by the end, she may just find herself wondering… “Wait—was I in a cult?” ______________ FOLLOW US For more culty content, follow us on Instagram \u0026 TikTok: → @wasiinacult FOLLOW AMY DUGGAR KING Folly Amy @amyrachelleking Get her new memoir: Holy Disruptor — available wherever books are sold. SUPPORT THE SHOW If you believe in what we’re doing — please rate, review, and share the podcast. It helps more than you know. And if you’d like to go a step further, join us on Patreon . You’ll get ad-free episodes, bonus content, and our gratitude for helping us keep these conversations going. → Join us on Patreon . HAVE A CULTY STORY? We’d love to hear from you. → info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-10-20T07:00:00Z",
      "duration": "01:00:57.5600000",
      "explicit": false,
      "spotifyId": "04oOqNeYiuUIOE4KJdRFZE",
      "appleId": 1000732613827,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/04oOqNeYiuUIOE4KJdRFZE",
        "apple": "https://podcasts.apple.com/podcast/bonus-amy-duggar-king-holy-disruptor/id1582863762?i=1000732613827"
      }
    },
    {
      "id": "2fa4f2ed-283d-4bdb-9003-bb5f7003bfad",
      "title": "Church of the Harvest: “WWJD? Probably Pay His Employees.”",
      "description": "Nine years. One strip-mall church. A duffel bag full of cash, a freezing pool full of goldfish, and a pastor who convinced everyone he had a direct line to God.\n\nThis week, Alisha takes us inside Church of the Harvest — a charismatic California congregation that promised purpose, purity, and a path to the pulpit… but delivered something far darker.\n\nHazing disguised as holiness, unpaid labor disguised as “discipleship,” and extreme control disguised as dating.  \n\nBecause when your pastor asks you to “volunteer” full-time, pay tuition to do it, and maybe jump into a swamp at 3 a.m. to save metaphorical fish — you might just be in a cult.\n\n______________________\n\nFOLLOW US\nFor more cult content, behind-the-scenes chaos, and occasional sermons from our strip-mall pulpit:\n→ @wasiinacult on Instagram \u0026 TikTok\n\nSUPPORT THE SHOW\nThe best way to support our ministry of exposing culty bullshit?\nRate, review, and share the pod — it’s free, legal, and no one will ask for your debit card “in faith.”\n\nIf you do want to tithe a little, join us on Patreon — we promise not to call it “tuition”. You’ll get ad-free episodes, bonus content, and our undying gratitude (no altar required).\n\n→ Become a member on Patreon.\n\nHAVE A CULTY STORY?\nWe want to hear it.\n→ info@wasiinacult.com\n\nFollow Alisha:  \nTikTok/IG @Spillingthekoolaid \u0026 \nIG: @Ezbakealisha\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-10-13T07:00:00Z",
      "duration": "01:02:05",
      "explicit": false,
      "spotifyId": "2jQ3elKJ7IljgFo5YRcSHt",
      "appleId": 1000731709976,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2jQ3elKJ7IljgFo5YRcSHt",
        "apple": "https://podcasts.apple.com/podcast/church-of-the-harvest-wwjd-probably-pay-his-employees/id1582863762?i=1000731709976"
      }
    },
    {
      "id": "c5daba1b-04d4-4640-885d-4175ffc0d495",
      "title": "SpaceX — PT2: “Mission Aborted”",
      "description": "Last week, we met Paige: a bright-eyed engineer who joined SpaceX believing she was helping to save humanity. In Part 1, we followed her through the seduction — the mission, the 80-hour weeks, the Elon slogans on the walls, the slow loss of self until the job became the identity.\n\nThis week, the mission meets the myth. Paige helps organize an open letter — a polite but radical act of collective dissent in a cult-like workplace. And almost everyone is too scared to sign it.\n\nWhat begins as a measured plea for change becomes a window into just how deep the fear-mongering and punitive control at SpaceX really run.\n\nAnd soon, Paige learns what every defector from a high-demand system eventually does: that questioning the leader isn’t seen as courage — it’s seen as betrayal.\n____\n\nFOLLOW US\nFor more cult content, behind-the-scenes chaos:\n→ @wasiinacult on Instagram \u0026 TikTok\n\nSUPPORT THE SHOW\nThe best way to fuel our mission? Rate, review, and share the pod with your people — word of mouth is rocket fuel.\nAnd if you want to help keep the mics on (without betting on stock options that never vest)? Join us on Patreon. We don’t drain bank accounts — we just give you ad-free episodes, bonus content, and our undying gratitude.\n→ Become a member on Patreon.\n\nHAVE A CULTY STORY?\nWe want to hear it. \n→ info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-10-06T07:00:00Z",
      "duration": "00:57:08",
      "explicit": false,
      "spotifyId": "6sH5Trf3usMZTENSeLdP84",
      "appleId": 1000730427881,
      "subjects": [
        "Corporate Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6sH5Trf3usMZTENSeLdP84",
        "apple": "https://podcasts.apple.com/podcast/spacex-pt2-mission-aborted/id1582863762?i=1000730427881"
      }
    },
    {
      "id": "6a213456-f88d-4a70-a319-45d84341d2ce",
      "title": "SpaceX—PT1: “It’s About to Get Musky in Here”",
      "description": "An ex–SpaceX engineer asks our favorite question: when does mission become mindset—and then eventually something more? Paige was convinced she was helping save humanity by working at SpaceX.\n\nIn Part 1, she traces the seduction: the purpose, the perks, the “Elon Algorithms” plastered on the wall, the complete devotion, the loss of individuality into one group identity, the isolation, the uncompensated labor, the belief that you are better than the rest… it all started to feel less like a workplace and more like… something else.\n\nToday, we follow Paige’s journey into the belly of the rocket factory. And next week? The fallout. When speaking up against the culture didn’t just cost her a job… it made her a target.\n\n———\n\nFOLLOW US\nFor more cult content, behind-the-scenes chaos:\n→ → @wasiinacult on Instagram \u0026 TikTok\n\nSUPPORT THE SHOW\nThe best way to fuel our mission? Rate, review, and share the pod with your people — word of mouth is rocket fuel.\nAnd if you want to help keep the mics on (without betting on stock options that never vest)? Join us on Patreon. We don’t drain bank accounts — we just give you ad-free episodes, bonus content, and our undying gratitude.\n→ Become a member Patreon.\n\nHAVE A CULTY STORY?\nWhether it’s a startup, a church, or just your weird improv troupe — we want to hear it.\n→ info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-09-29T07:00:00Z",
      "duration": "00:55:53",
      "explicit": false,
      "spotifyId": "33Zvf8SrEwtt6WuQ8bov45",
      "appleId": 1000729121837,
      "subjects": [
        "Corporate Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33Zvf8SrEwtt6WuQ8bov45",
        "apple": "https://podcasts.apple.com/podcast/spacex-pt1-its-about-to-get-musky-in-here/id1582863762?i=1000729121837"
      }
    },
    {
      "id": "9eadc88d-01c5-44ce-9568-036fceb946b3",
      "title": "Body \u0026 Brain Yoga Tai Chi: “The Cult FKA Dahn Yoga”",
      "description": "What if the yoga class you signed up for wasn’t yoga at all, but the doorway to something much darker?\n\nIn this episode, Angel takes us inside Body \u0026 Brain Yoga and Tai Chi — a strip-mall wellness studio that seemed harmless enough. Until it wasn’t. Instead of stretching, you’re told to march in circles, punch your stomach, chant about your mother’s failings, and spill your deepest traumas to a room full of strangers.\n\nWhat Angel didn’t know was that Body \u0026 Brain isn’t just a quirky yoga chain. It’s a nationwide empire with 70\u002B locations, millions in revenue, luxury retreats in Sedona — and a founder who flew private while his followers drowned in debt.\n\nAnd that’s just the beginning. Dig deeper and you’ll find that Body \u0026 Brain is nothing new at all… it’s the rebranded face of Dahn Yoga — one of the most notorious modern cults.\n________\n\nFOLLOW US\nFor more cult content, behind-the-scenes chaos:\n→ @wasiinacult on Instagram \u0026 TikTok\n\nFOLLOW ANGEL\nInsta: @mtan_gel\n\nSUPPORT THE SHOW\nYou can support this show by rating, reviewing, and sharing it with your people — word of mouth keeps us growing.\n\nAnd if you really want to help keep the mics on? Become a Patreon member. Unlike Body \u0026 Brain, we don’t drain bank accounts — we just give you ad-free episodes, bonus content, and our undying gratitude.\n→ Join us on Patreon.\n\nHAVE A CULTY STORY?\nWant to share it? We wanna hear it.\n→ info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-09-22T07:00:00Z",
      "duration": "01:07:11",
      "explicit": false,
      "spotifyId": "1JNhxIoB9og79M3y6KWFYs",
      "appleId": 1000727888900,
      "subjects": [
        "Body \u0026 Brain"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1JNhxIoB9og79M3y6KWFYs",
        "apple": "https://podcasts.apple.com/podcast/body-brain-yoga-tai-chi-the-cult-fka-dahn-yoga/id1582863762?i=1000727888900"
      }
    },
    {
      "id": "a2f1b744-c25a-4421-b0be-3f08bbb71496",
      "title": "The Cult of Rodney Howard-Browne: “Holy Ghosted”",
      "description": "She thought she was enrolling in a Bible college. Instead, she was signing up to give her identity, her labor, her choice—and her fire—to a man who called himself the Holy Ghost Bartender. At “River University,” worship looked like laughing fits and collapsing bodies. Romance was arranged. Submission wasn’t suggested—it was glorified. And your soul? That was just a tally mark on a clipboard. For Sarah, what started as a mission from God turned into a 12-year descent through emotional control, spiritual abuse, and religious labor trafficking. ___ FOLLOW US for more culty content, behind-the-scenes chaos, and updates from our unholy quest to expose charismatic conmen: → @wasiinacult on Instagram \u0026 TikTok SUPPORT THE SHOW: Rodney’s followers emptied their bank accounts at the altar. We just ask you to visit Patreon . If this episode hit you—or made you question the price of obedience—share it, and leave a review. To our Patreon members: You\u0027re the real holy fire. Thank you for keeping the mic on and the bullshit detectors charged. Want ad-free episodes and exclusive extras? → Join us on Patreon . HAVE A CULTY STORY? We wanna hear it. → Email us: info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-09-15T07:00:00Z",
      "duration": "00:57:31.8460000",
      "explicit": false,
      "spotifyId": "1u82l5AEN7hoNEJbRTS7fU",
      "appleId": 1000726863566,
      "subjects": [
        "Rodney Howard-Browne"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1u82l5AEN7hoNEJbRTS7fU",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-rodney-howard-browne-holy-ghosted/id1582863762?i=1000726863566"
      }
    },
    {
      "id": "81d00cd4-166c-4b5f-98a5-b1c00c3be885",
      "title": "The Cult of My Mafia Dad: “An Offer He Couldn’t Refuse”",
      "description": "A limo to Atlantic City. Pizzerias with back rooms. Garbage bags vanishing across boroughs. Comedian Barry Rothbart grew up believing his dad didn’t just live large—he made life larger. Then the tapes surfaced. This isn’t a mob story. It’s what happens when your identity is forged from someone else’s legend—only to discover the legend was a lie. As Barry unravels the mythology, his father’s world curdles into something darker… and uncomfortably familiar to our show. For the full, uncut conversation, hop over to our Patreon . ____ FOLLOW US for more culty content and behind-the-scenes chaos: Instagram \u0026 TikTok → @wasiinacult SUPPORT THE SHOW: Barry’s dad kept his money in stacks above the bed. We prefer Patreon. If this episode hit you—or made you think twice about charisma, cons, or cult leaders—share it and then leave a review (but take the cannoli). A huge thank you to our Patreon members—your support keeps us making episodes like this one. Want ad-free shows \u0026 exclusive extras? → Join our Patreon . CHECK OUT BARRY: Barry Rothbart’s investigative series Searching for Allan Rothbart is exclusively on Audible. It’s equal parts mob tale, family reckoning, and cult-like indoctrination story. Don’t miss it. You can also follow Barry on social media → @barryrothbart HAVE A CULTY STORY? We wanna hear it. Email us: info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-09-08T07:00:00Z",
      "duration": "01:08:51.3960000",
      "explicit": false,
      "spotifyId": "3dZGcepeMHtKwgSUK46pqX",
      "appleId": 1000725481280,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3dZGcepeMHtKwgSUK46pqX",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-my-mafia-dad-an-offer-he-couldnt-refuse/id1582863762?i=1000725481280"
      }
    },
    {
      "id": "fab82551-3fde-43ee-a384-5c841fb3731a",
      "title": "The Cult of Influencing: “The Algorithm Giveth, The Algorithm Taketh Away”",
      "description": "What happens when your entire life revolves around likes, follows, and perfectly staged smoothie bowls? For Lee Tilghman — better known as @leefromamerica — it meant rising to the top of Instagram’s wellness world… and losing herself in the process. This week, we explore what it means to devote yourself to the cult of social media: when every thought and action becomes about what to post, when friends are replaced by followers, and when your online identity becomes the only one you know. From the outside, the influencer life looks aspirational. But Lee asks: at what cost? ____________ COME SEE US LIVE!! Los Angeles • September 9, 2025 With special guest: comedian Moses Storm @ Dynasty Typewriter VIP “Meet \u0026 Greet” tickets available! Not in LA? No prob — livestream available too! FOLLOW US for more culty content and behind-the-scenes chaos: Instagram \u0026 TikTok → @wasiinacult SUPPORT THE SHOW: The average person spends over 2 hours a day on social media. If this episode resonated—or even made you rethink your daily doomscroll—share it, leave a review. Hug a friend IRL. Huge thank you to our Patreon members—you keep this thing going. Want ad-free episodes \u0026 exclusive content? → Join our Patreon . Have a culty story? We wanna hear it. Email us: info@wasiinacult.com And if you want more from today’s guest, Lee from America: Her brand-new book “If you Don’t Like This, I Will Die” is out now Find Lee → @leefromamerica See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-09-01T07:00:00Z",
      "duration": "00:53:56.5190000",
      "explicit": false,
      "spotifyId": "2u1swYdcZtxjYBqpSeoB96",
      "appleId": 1000724430486,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2u1swYdcZtxjYBqpSeoB96",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-influencing-the-algorithm/id1582863762?i=1000724430486"
      }
    },
    {
      "id": "8cf0f2e9-4e68-4fce-a240-da5d6aa5be64",
      "title": "The Town In The Shape of a Cross: “Thoughts Are Free”",
      "description": "Michael grew up believing his hometown in Germany was just that — a quiet, picturesque community with cobblestone streets, tidy homes, a school, and a grocery store. At its heart stood the church, looming over daily life. But what looked like small-town order was really something far darker. Built in the aftermath of World War II, by leaders with lingering Nazi ties, the town was engineered for control: walls without walls, designed to keep its people in and the rest of the world out. Years later, in a casual conversation with a sibling, the truth unraveled: This wasn’t just a devout community. It was a cult. COME SEE US LIVE!!! Los Angeles • September 9, 2025 With special guest: comedian Moses Storm @ Dynasty Typewriter VIP “Meet \u0026 Greet” tickets available! Not in LA? No prob — livestream available too! Special Thanks: Big thanks to Maura Streppa for her gorgeous rendition of “Die Gedanken sind frei” → Follow Maura on Instagram @maurastreppamusic Follow Us for More Culty Content: Instagram \u0026 TikTok → @wasiinacult Support the Show: If this episode moved you — share it. Leave a review. Scream-sing Die Gedanken sind frei in your kitchen. Thank you to our Patreon members — we appreciate the hell out of you. Want ad-free episodes \u0026 exclusive content? → Join our Patreon . Share Your Story: Had a culty experience of your own? We want to hear it. Email us: info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-08-25T07:00:00Z",
      "duration": "01:02:53.6490000",
      "explicit": false,
      "spotifyId": "7JG1zRwDthucf1IfEKntvC",
      "appleId": 1000723514397,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7JG1zRwDthucf1IfEKntvC",
        "apple": "https://podcasts.apple.com/podcast/the-town-in-the-shape-of-a-cross-thoughts-are-free/id1582863762?i=1000723514397"
      }
    },
    {
      "id": "93bc4ef2-1a93-4dfc-84c3-99e48210407c",
      "title": "The Cult of American Apparel: “Sweatshop or Sex Shop?”",
      "description": "It was one of the coolest jobs you could get in the 2000s. The swoopy bangs. The gold lamé leggings. The sexually charged ads. American Apparel wasn’t just a brand — it was a vibe. And today’s guest, Zsuzsi was on the front lines of it all. From art school to assistant manager to overseeing a hot New York City store, she was living the dream… until it started to feel more like a fever dream — and eventually, a cult. Today’s story is about what happens when the \u0022American dream\u0022 disguises exploitation in trendy cotton basics — and how one man\u0027s charisma fueled a culture of unchecked abuse, manipulation, humiliation, and grooming… all hidden behind the label “Made in the USA.” And the worst part? He’s still at it. ___ COME SEE US LIVE!!! Los Angeles • September 9, 2025 With special guest: comedian Moses Storm @ Dynasty Typewriter VIP “Meet \u0026 Greet” tickets available! Not in LA? No prob — livestream available too! Follow Us for More Culty Content: Instagram \u0026 TikTok → @wasiinacult Find Zsuzsi: @hdbyz \u0026 @hellozhia / https://www.hdbyz.com \u0026 https://www.hellozhia.com Support the Show: If you learned something, felt something, or are angry too and want to make a little noise — share this episode. Leave a review. Send it to a friend. And maybe… make a call to: (213) 275-3120 Just for some light, constructive feedback. Thank you to our Patreon members — we appreciate the hell out of you. Want ad-free episodes \u0026 exclusive content? → Join our Patreon . Share Your Story: Had a culty experience of your own? We want to hear it. Email us: info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-08-18T07:00:00Z",
      "duration": "01:12:07.2100000",
      "explicit": false,
      "spotifyId": "0HkrgRzVYOGQDQ2JQyTQ5U",
      "appleId": 1000722413376,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0HkrgRzVYOGQDQ2JQyTQ5U",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-american-apparel-sweatshop-or-sex-shop/id1582863762?i=1000722413376"
      }
    },
    {
      "id": "6a6b1b50-47f5-402b-87b9-5eb5a5daf25c",
      "title": "Armstrongism: “Saving For the Feast” [UPDATE]",
      "description": "**Note: This episode originally aired in February 2022** COME SEE US LIVE!!! In LA on Sept 9, 2025 with special guest, comedian Moses Storm @ Dynasty Typewriter. LINK TO TICKETS!! A humble upbringing is an understatement for Dan McIntrye. Canada born and bred, Dan\u0027s cult journey took him from guitar god, to free desserts to cult escape, only to land him right in the arms of... another one? A double survivor. A triple thriver. And one extremely nice guy. Damn, Canadians, you really are as kind as they say. —— COME SEE US LIVE!! In LA on Sept 9, 2025 with special guest, comedian Moses Storm @ Dynasty Typewriter. LINK TO TICKETS! VIP meet n greet available… see you then! Follow Us for More Culty Content: Instagram \u0026 TikTok: @wasiinacult Support the Show: This show is listener-powered. If Dan’s story got you thinking—rate, review, and share. Thank you to our Patreon members!! We appreciate you. And if you would like ad-free episodes and exclusive content, consider joining our Patreon . Share Your Story: Have a cultic experience of your own? We want to hear it. Email us: info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-08-11T07:00:00Z",
      "duration": "01:08:59.8070000",
      "explicit": false,
      "spotifyId": "38DeOvuWQH1F85wtYiMpeH",
      "appleId": 1000721471674,
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38DeOvuWQH1F85wtYiMpeH",
        "apple": "https://podcasts.apple.com/podcast/armstrongism-saving-for-the-feast-update/id1582863762?i=1000721471674"
      }
    },
    {
      "id": "83296158-727e-42e9-b1d6-8d0072503658",
      "title": "Zen Master Rama’s Meditation/Computer Programming Cult: “Going For the Gold!”",
      "description": "This week, meet Jim Picariello, who, in the early ’90s as a hopeful college kid hyped up on way too much coffee, thought he was signing up for a meditation class… and ended up in a tech-driven, enlightenment-seeking, quasi-Buddhist spiritual cult. Yeah… this one was a new one for us too. Led by Frederick Lenz - aka Rama - aka Zen Master Rama - aka the most spiritually enlightened dude who could glow gold - shapeshift into Egyptian gods, and… also totally needed your entire paycheck in order to - oh wait, hmm, we forgot… but we’re sure it was very spiritually necessary. ___ Follow Us for More Culty Content: Instagram \u0026 TikTok: @wasiinacult Connect w/ Jim: Instagram: @jimpicariello Bluesky: @jimpicariello.bsky.social LinkedIn: Jim Picariello Support the Show: This show runs on listener energy (and we promise we don’t drain it like a cult leader). If Jim’s story got you thinking - rate, review, and share. Big love to our Patreon members… you’re the real gold. And if you want ad-free episodes and exclusive content, come join us on Patreon . Enlightenment not included. Share Your Story: Have a cultic experience of your own? We want to hear it. Email us: info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-08-04T07:00:00Z",
      "duration": "01:10:18.0700000",
      "explicit": false,
      "spotifyId": "2jmMIKqUF6onhsHmPoZCT9",
      "appleId": 1000720631300,
      "subjects": [
        "Zen Master Rama"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2jmMIKqUF6onhsHmPoZCT9",
        "apple": "https://podcasts.apple.com/podcast/zen-master-ramas-meditation-computer-programming-cult/id1582863762?i=1000720631300"
      }
    },
    {
      "id": "fd47bd55-a137-431f-aaf9-7935f4a0c9a5",
      "title": "The Cult of Warren Jeffs’ FLDS PT2: “The Great Escape”",
      "description": "Last week, we met Jorjina Broadbent — mother of twelve, former sister-wife, and low-key badass hiding in plain sight.\n\nThis week? She stops hiding.\n\nWe pick up where we left off: deep inside the world of Warren Jeffs’ FLDS cult — a place where girls are married off as teens, obedience is salvation, and hairstyles left something to be desired… like choice. But for Jorjina, something inside her starts to shift. As the leash tightens and the rules get crueler, the exit comes into view.\n\nWhat follows is a breathless series of near-escapes, terrifying threats, and secret plans that might as well have been scribbled on fast food napkins. Also, Tyler’s gorilla-style documentary filmmaking at its most high-stakes gets to be part of it all. \n\nHow will she make it out? And all her children?\n\nGet the popcorn ready… \n\nThis is Part Two of Jorjina’s extraordinary story.\n\n___\n\nFollow Us for More Culty Content:\nInstagram \u0026 TikTok: @wasiinacult\n\nWATCH THE FILM:\nSons of Perdition (Tyler’s baby)\nStream on Amazon, Tubi, Apple TV, YouTube TV, Sling, Plex\n\nFREE for Patreon members!\n\nHelp Jorjina get some Abba shoes! (Venmo @Jorjina-Broadbent)\n\nSupport the Show:\nThis show is listener-powered. If Jorjina’s story moved you—please rate, review, and share. Thank you to our Patreon members!! We appreciate you. And if you would like ad-free episodes and exclusive content, consider joining our Patreon.\n\nShare Your Story:\nHave a cultic experience of your own? We want to hear it.\nEmail us at info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-07-28T07:00:00Z",
      "duration": "01:02:39",
      "explicit": false,
      "spotifyId": "3ncjrD84ledFxeprscuj5y",
      "appleId": 1000719547634,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ncjrD84ledFxeprscuj5y",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-warren-jeffs-flds-pt2-the-great-escape/id1582863762?i=1000719547634"
      }
    },
    {
      "id": "d2de5409-24ab-4cf0-95b7-d656f0c17f88",
      "title": "The Cult of Warren Jeff’s FLDS: “Keep Sweet”",
      "description": "Before he was your favorite podcast host, Tyler Measom was… just a dude with a camera and a crush. It was 2005, and Tyler found himself driving deep into FLDS polygamist territory - with his co-director-slash-maybe-love-interest (hey, Jennilyn) - to make a documentary about the \u0022Lost Boys\u0022 exiled from a fundamentalist Mormon cult run by none other than slimeball Warren Jeffs. That little film? Sons of Perdition premiered at Tribeca. And one of the mothers at the heart of that story? Jorjina Broadbent. This week, Jorjina, mother of twelve (yes, twelve), former sister-wife - joins us to recount what life was really like inside the FLDS: arranged marriage, relentless obedience, magical underwear, and raising a family in a trailer where babies sometimes had to sleep in drawers. And the escape is hair raising. And Tyler was there to capture it. This is Part One of Jorjina’s extraordinary story. ___ Follow Us for More Culty Content: Instagram \u0026 TikTok: @wasiinacult WATCH THE FILM: Sons of Perdition (Tyler’s baby) Stream on Amazon , Tubi , Apple TV , YouTube TV, Sling, Plex FREE for Patreon members! Support the Show: This show is listener-powered. If Jorjina’s story moved you - please rate, review, and share. Thank you to our Patreon members!! We appreciate you. And if you would like ad-free episodes and exclusive content, consider joining our Patreon . Share Your Story: Have a cultic experience of your own? We want to hear it. Email us at info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-07-23T07:00:00Z",
      "duration": "01:00:23.0260000",
      "explicit": false,
      "spotifyId": "3haz2V9EZy5KWDWfIPl2Bt",
      "appleId": 1000718744316,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3haz2V9EZy5KWDWfIPl2Bt",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-warren-jeffs-flds-keep-sweet/id1582863762?i=1000718744316"
      }
    },
    {
      "id": "eea56414-cfe9-4936-8b85-9ad9ae40bdeb",
      "title": "The Holdeman Mennonite Cult: “The Truth Behind the \u0027Humble\u0027 People”",
      "description": "Content Warning: This episode contains discussion of sexual abuse. You’ve seen them — maybe at the airport with pamphlets, or quietly shopping at a farmer’s market. Dressed in starched shirts, tie-back bonnets, pressed skirts. Singing in gentle harmonies. Smiling softly. The Holdeman Mennonites, they’ll tell you, are just humble people of faith. Quiet. Nonviolent. Pure. But purity can be a costume. And obedience, a weapon. Today’s guest, Billy Holdeman-Bass grew up in that world. And there were things that didn’t get sung about. Doors that stayed locked. And a question his mother never answered: “Why do you always follow me to the bathroom?” Behind the hymnals and homemade apple pies lies a truth that can’t stay buried forever. In this episode, that truth begins to speak. ________ Follow Us for More Culty Content: Instagram \u0026 TikTok: @wasiinacult Follow Billy’s parody account: @holdememes Support the Show: This show is listener-powered. If Billy’s story moved you—please rate, review, and share. Thank you to our Patreon members!! We appreciate you. And if you would like ad-free episodes and exclusive content, consider joining our Patreon . Share Your Story: Have a cultic experience of your own? We want to hear it. Email us at info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-07-17T07:00:00Z",
      "duration": "00:53:40.0620000",
      "explicit": false,
      "spotifyId": "2Xp7aSpvu7Pvlc3tQv0sRr",
      "appleId": 1000717782985,
      "subjects": [
        "The Church Of God In Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Xp7aSpvu7Pvlc3tQv0sRr",
        "apple": "https://podcasts.apple.com/podcast/the-holdeman-mennonite-cult-the-truth-behind/id1582863762?i=1000717782985"
      }
    },
    {
      "id": "00b25746-34f1-4849-9b99-49bac27cb41e",
      "title": "The Cult of Immanuel David Pt2: “The Cult’s Second Coming”",
      "description": "Content Warning: This episode contains references to sexual abuse, coercion, and emotional trauma.\n\nLast week, we met Zipporah—a woman who spent 44 years inside a Utah cult so small and obscure, most people never even knew it existed. That is, until 1978, when a horrific tragedy made national headlines.\nThe cult was led by Emmanuel David, a self-declared prophet who eventually proclaimed himself God. After his suicide, his wife—his most devoted follower—carried out an unspeakable murder-suicide that took the lives of their children.\n\nAll but one.\n\nTheir daughter Rachel survived—and in many ways, because she did, so did the cult. It should’ve died with its leader. But for a small group of devoted followers, it didn’t.\n\nZipporah was one of them.\n\nThis is Part 2 of her story… how the cult kept its grasp on her for the next 40 years until she finally was able to break free. \n\n________\n\nFollow Us for More Culty Content:\nInstagram \u0026 TikTok: @wasiinacult\n\nSupport the Show:\nThis show is listener-powered. If Zipporah’s story moved you—please rate, review, and share.\nThank you to our Patreon members!! We appreciate you. And if you would like ad-free episodes and exclusive content, consider joining our Patreon.\n\nShare Your Story:\nHave a cultic experience of your own? We want to hear it.\nEmail us at info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-07-08T00:48:37Z",
      "duration": "00:46:33",
      "explicit": false,
      "spotifyId": "7vn34oydHQOvkFcEzyD86l",
      "appleId": 1000716250985,
      "subjects": [
        "Immanuel David",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vn34oydHQOvkFcEzyD86l",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-emmanuel-david-pt2-the-cults-second-coming/id1582863762?i=1000716250985"
      }
    },
    {
      "id": "a4f1a2a6-1b8c-4667-9669-98d61a31233c",
      "title": "The Cult of Immanuel David Pt1: “Life After Death”",
      "description": "In August of 1978, one of the darkest chapters in Utah’s history unfolded. A man claiming to be God became the catalyst for a tragedy that left a city shaken and a family shattered. Emmanuel David—born Charles Bruce Longo—founded a small but insidious cult rooted in offshoot Mormon beliefs, prophetic delusions, and total control. Despite the mass suicide—or murder-suicide, depending on who you ask—the cult didn’t die with its leader. The remaining believers held on. They kept the doctrine alive. And for decades, they waited for their God to return. Today’s guest is one of the few who remained. This is Part 1 of her story. ________ Follow Us for More Culty Content: Instagram \u0026 TikTok: @wasiinacult Share Your Story: Have a cultic experience of your own? We want to hear it. Email us at info@wasiinacult.com Support the Show: This show is listener-powered. If Zipporah’s story moved you—please rate, review, and share. Want ad-free episodes and exclusive content? Join our Patreon . See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-07-02T03:04:45Z",
      "duration": "00:50:21.9490000",
      "explicit": false,
      "spotifyId": "3Xp6u8D4TLaSYbArIixI4Z",
      "appleId": 1000715372490,
      "subjects": [
        "Immanuel David",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Xp6u8D4TLaSYbArIixI4Z",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-emmanuel-david-pt1-life-after-death/id1582863762?i=1000715372490"
      }
    },
    {
      "id": "bda43ee5-6513-4a5e-be0c-e46028e6f7c8",
      "title": "WISE (aka Scientology): “Stop Interbulating Me!” [RE-RELEASE]",
      "description": "**This episode originally aired in May 2023** Fresh to the workforce, Amber answered a job posting for a dental assitant: “No experience needed!” Looking for something reliable to support her new life as a single mother, she was thrilled when she got hired. Little did she know, her new job would be more than just dental work… Follow Us for More Culty Content: Instagram \u0026 TikTok: @wasiinacult Support the Show: Was I In A Cult? is listener-powered. If the show has moved you, made you laugh, or made you question your group chat - please rate, review, and share. Want ad-free episodes \u0026#43; bonus content? Join our Patreon ! Share Your Story: Have a cultic experience to share? We’re listening. Email us at info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-06-02T15:58:57Z",
      "duration": "01:12:19.5130000",
      "explicit": false,
      "spotifyId": "1IMqRtZ1xKSy6l870N0l3G",
      "appleId": 1000710898432,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IMqRtZ1xKSy6l870N0l3G",
        "apple": "https://podcasts.apple.com/podcast/wise-aka-scientology-stop-interbulating-me-re-release/id1582863762?i=1000710898432"
      }
    },
    {
      "id": "8ca427fb-d5b1-472f-81d5-9118e6f94fca",
      "title": "Apocalyptic, New-Age, Nuclear Bunker Cult PT2: “Let the Bombs Descend”",
      "description": "When your mother is a self-proclaimed prophet claiming to channel the ascended master that is your deceased father as she prepares hundreds of followers for the end of the world, mother/son time isn’t baking cookies - it’s begging her not to summon nuclear holy fire so you can maybe live another day.\n\nIn Part 2 of Sean Prophet’s quite literally unbelievable story, we enter the “end times” phase of CUT (Church Universal and Triumphant) - a group that, at its peak, had thousands of members, global spiritual centers, and over $50 million in real estate. We’ve got multi-million dollar underground bunkers, military-grade weapons, mass doomsday drills, and a mother decreeing her way out of a failed apocalypse that - spoiler - never came.\n\nSean walks us through the harrowing logistics of leading hundreds of followers into bomb shelters, his mother’s unshakable belief in prophecy, and the moment he finally walked away - for good.\n\n_____\n\nSean’s new memoir, My Cult, Your Cult, is out now. Order here.\n\nFollow Us for More Culty Content:\nInstagram \u0026 TikTok: @wasiinacult\n\nSupport the Show:\nWas I In A Cult? is listener-powered. If the show has moved you, made you laugh, or made you question your group chat - please rate, review, and share.\nWant ad-free episodes \u002B bonus content? Join our Patreon!\n\nShare Your Story:\nHave a cultic experience to share? We’re listening.\nEmail us at info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-05-26T08:00:00Z",
      "duration": "00:48:33",
      "explicit": false,
      "spotifyId": "4EcJCwkllqVa6aFhATSKkR",
      "appleId": 1000709875209,
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EcJCwkllqVa6aFhATSKkR",
        "apple": "https://podcasts.apple.com/podcast/apocalyptic-new-age-nuclear-bunker-cult-pt2-let-the/id1582863762?i=1000709875209"
      }
    },
    {
      "id": "9034c06f-d958-472a-b7cf-1bffaf05ebca",
      "title": "Doomsday New-Age Religious Cult: \u0022My parents started a cult\u0022",
      "description": "He didn’t just join a cult. He was born a \u0022prince\u0022 in one. In this two-part mind-bender, we welcome Sean Prophet, son of Mark Prophet and Elizabeth Clare Prophet—founders of the Church Universal and Triumphant (aka CUT). At its height, this doomsday spiritual empire commanded tens of millions in real estate, a global following, and enough freeze-dried food and ammo to survive a nuclear winter. In Part 1, Sean takes us from his early days living in a 17,000-square-foot mansion filled with unpaid devotees, to being groomed as the next “Messenger” of God… …until a $1.5 million lawsuit shifted everything. Follow Us for More Culty Content: Instagram \u0026 TikTok: @wasiinacult Sean’s new memoir, My Cult, Your Cult, is out now. Order here . Support the Show: If Was I In A Cult? has impacted you, moved you, or made you laugh-uncomfortably-in-public, please rate \u0026 review—it helps new listeners find us. Want ad-free episodes \u0026#43; bonus content? Join our Patreon ! Share Your Story: Have a cultic experience you want to share on the show? Email us at info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-05-19T07:00:00Z",
      "duration": "01:04:21.5770000",
      "explicit": false,
      "spotifyId": "2KIEmryAqCFkpH7KVQVS40",
      "appleId": 1000708961476,
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2KIEmryAqCFkpH7KVQVS40",
        "apple": "https://podcasts.apple.com/podcast/doomsday-new-age-religious-cult-my-parents-started-a-cult/id1582863762?i=1000708961476"
      }
    },
    {
      "id": "83927083-f6a3-42aa-8108-87509ab93282",
      "title": "Endogenous Cult: “252 Consequences and Counting”",
      "description": "Today’s guest, Sara, didn’t just wear a cult uniform—she sewed it. Raised in a conservative faith that slowly morphed into a cult, Sara’s life went from dairy cows and barefoot summers to head coverings, spiritual “consequences,” and Levitical purity laws enforced with spray bottles and shame.\n\nWhat started as a desire to live a devout and simple life spiraled into isolation, abuse, and an absurd set of rules that dictated everything from her hair part to her menstrual cycle. Her story—equal parts heartbreaking, enraging, and at times darkly hilarious—includes butchering chickens in the dark, scraping cowhides in the cold, and somehow finding her way to freedom, laughter, and ice cream cones.\n\nFollow Us for More Culty Content:\nInstagram \u0026 TikTok: @wasiinacult\n\nSupport the Show:\nIf Was I In A Cult? has impacted you, moved you, or made you laugh-uncomfortably-in-public, please rate \u0026 review—it helps new listeners find us.\n\nWant ad-free episodes \u002B bonus content? Join our Patreon!\n\nShare Your Story:\nHave a cultic experience you want to share on the show? \nEmail us at info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-05-12T08:00:00Z",
      "duration": "00:56:38",
      "explicit": false,
      "spotifyId": "3BU9usyZZxBogAA2HbM5mT",
      "appleId": 1000708084175,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BU9usyZZxBogAA2HbM5mT",
        "apple": "https://podcasts.apple.com/podcast/endogenous-cult-252-consequences-and-counting/id1582863762?i=1000708084175"
      }
    },
    {
      "id": "15535fee-486b-4c0b-ab71-db4ec3ddb65e",
      "title": "WIIAC LIVE! w/Special Guest: Moses Storm",
      "description": "In our first-ever live episode, your favorite mediocre cult leaders take the stage in Napa, California to indoctrinate the masses—err, entertain a crowd. Tyler and Liz welcome comedian and actor Moses Storm (HBO’s Trash White) to tell his jaw-dropping story of growing up in a failed (as he puts it) doomsday cult… started by his great uncle. A live audience, Tyler showed off an old pair of magic underwear, Liz recruited a willing participant into a fake cult, and Moses brought the house down. This is Was I In A Cult? like you’ve never heard it before.\n\n\nFollow Us for More Culty Content:\nInstagram \u0026 TikTok: @wasiinacult\nFollow our guest Moses Storm: @mosesstorm\nNeed an acting coach? Tyler recommends @mikeostroski / mikeostroski.com\n\nSupport the Show:\nIf Was I In A Cult? has impacted you, moved you, or made you laugh-uncomfortably-in-public, please rate \u0026 review—it helps new listeners find us.\n\nWant ad-free episodes \u002B bonus content? Join our Patreon!\n\nShare Your Story:\nHave a cultic experience you want to share on the show? \nEmail us at info@wasiinacult.com\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-05-05T08:00:00Z",
      "duration": "01:10:59",
      "explicit": false,
      "spotifyId": "791Foub47AimPWDzjsTtuF",
      "appleId": 1000706330514,
      "urls": {
        "spotify": "https://open.spotify.com/episode/791Foub47AimPWDzjsTtuF",
        "apple": "https://podcasts.apple.com/podcast/wiiac-live-w-special-guest-moses-storm/id1582863762?i=1000706330514"
      }
    },
    {
      "id": "ebe01395-2084-431a-8750-02e47debc151",
      "title": "RFK, MAHA Moms, \u0026 The Cult of Wellness: “The Divided Truth”",
      "description": "This week we\u0027re diving into the cultish side of wellness culture. Liz sits down with Dr. Laura Erlich, DTCM, LAc, FABORM — a licensed acupuncturist and fertility specialist who spent decades bridging Eastern and Western medicine… until the COVID-19 pandemic exposed the dangerous cracks beneath the surface. Laura shares her deeply personal story: growing up with health-conscious \u0022hippie\u0022 parents, enduring the trauma of losing both parents young, and building a career dedicated to healing and helping. But when misinformation about vaccines and COVID exploded within her professional circles, Laura found herself isolated from a community she once considered home. LINKS \u0026 RESOURCES Find Dr. Laura: www.mothernurturela.com Follow Dr. Laura: Instagram/Facebook: @mothernurturewellness Dr. Laura’s Recommendations: Books: Vaccines Did Not Cause Rachel\u0027s Autism by Peter Hotez Autism\u0027s False Prophets: Bad Science, Risky Medicine, and the Search for a Cure by Paul Offit, MD Podcasts: Conspirituality (an unbiased science podcast) Maintenance Phase (debunking wellness and diet culture myths) Science Influencers to Follow: @drnoc @niniandthebrain @epidemiologistkat @unbiasedscipod @your_local_epidemiologist Unbiased Vaccine Resources: Children’s Hospital of Philadelphia (CHOP Vaccine Education Center) Skeptical Raptor Vaxopedia Follow Us for More Culty Content: Instagram/TikTok: @wasiinacult Support the Show: If Was I In A Cult? has impacted you, please take a moment to rate and review — it helps new listeners find us! Want ad-free episodes and bonus content? Join our Patreon (link to your Patreon page)! Share Your Story: Have a cultic experience you want to share? We’d love to hear from you. Reach out at info@wasiinacult.com . See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-04-28T07:00:00Z",
      "duration": "00:49:58.2300000",
      "explicit": false,
      "spotifyId": "4HQ8VdDnTRUk4M7x6nNhtT",
      "appleId": 1000705229154,
      "subjects": [
        "Self-Help",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4HQ8VdDnTRUk4M7x6nNhtT",
        "apple": "https://podcasts.apple.com/podcast/rfk-maha-moms-the-cult-of-wellness-the-divided-truth/id1582863762?i=1000705229154"
      }
    },
    {
      "id": "09be94ce-0665-44e9-bbcb-db5eb095fbfa",
      "title": "From a Book Cult to The Weigh Down Cult: “Oops, I Joined Another Cult!”",
      "description": "Today’s guest thought she was just signing up for a summer job. And then, years later, she thought she was just joining a church. What she got instead? \n\n\n\n\nCults. TWO OF THEM.\n\n\n\n\nMeet Aydrea — writer, stepmom, and lover of rules. In college, she joined a company that promised purpose, leadership, and a paycheck. Instead, she got cold showers, commission-only “training,” and a summer knocking on strangers\u0027 doors… while carrying 40 pounds of encyclopedias.\n\n\n\n\nBut plot twist: just when she thought she’d moved on, community came calling again. This time through a church weight loss group, …where Diet Mountain Dew became her spiritual practice, and hunger was a sign of holiness.\n\n\n\n\nFunny, sharp, and disarmingly honest, Aydrea shares what it’s like to look back and realize oh, cool cool… I joined TWO cults. And maybe more importantly, how the craving for belonging can sneak us into places we never meant to be.\n\n\n\n\nLINKS:\n\n\n\n\nLIVE SHOW! April 25th at Napa Valley Streaming Fest — with special guest Moses Storm. Info \u0026 tickets: napavalleystreamingfest.com\n\nFollow Aydrea: Tiktok @disappointingmyancestors\n\nFollow us for more culty content: insta/tiktok — @wasiinacult\n\nSupport the show: If Was I in a Cult? has impacted you, please rate and review—it really helps more people find us! And consider joining our Patreon for ad-free episodes and more.\n\nHave a story of your own? We’d love to hear it. Reach out to: info@wasiinacult.com\n\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-04-21T08:00:00Z",
      "duration": "00:55:51",
      "explicit": false,
      "spotifyId": "5aCFkF6BM13flyhmBWx0dq",
      "appleId": 1000704278663,
      "subjects": [
        "Remnant Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5aCFkF6BM13flyhmBWx0dq",
        "apple": "https://podcasts.apple.com/podcast/from-a-book-cult-to-the-weigh-down-cult-oops-i/id1582863762?i=1000704278663"
      }
    },
    {
      "id": "68e9b2db-9233-4b58-af54-f23552b65935",
      "title": "Morningland PT2: “Destructive, Evil Wench”",
      "description": "Content Warning: This episode contains graphic descriptions of sexual abuse, exploitation, and trauma. Please listen with care.\n\n\n\n\nFrankie thought she was chosen. That she was being trained to be a healer, a mystic, a disciple of spiritual truth. But the truth was far more harrowing.\n\n\n\n\nIn Part 2 of her story, we follow Frankie deeper into Morningland—where obedience meant servitude, sexual violence was disguised as divine initiation, and isolation was absolute. What began as New Age mysticism spiraled into total control, lasting trauma, and the systematic dismantling of a family.\n\n\n\n\nBut through pain, there is power. And Frankie’s voice, now, is stronger than ever.\n\n\n\n\nLINKS:\n\n\n\n\nLIVE SHOW! April 25th at Napa Valley Streaming Fest — with special guest Moses Storm. Info \u0026 tickets: napavalleystreamingfest.com\n\nFollow us for more culty content: @wasiinacult\n\nSupport the show: If Was I in a Cult? has impacted you, please rate and review—it really helps more people find us! And consider joining our Patreon for ad-free episodes and more.\n\nHave a story of your own? We’d love to hear it. Reach out to: info@wasiinacult.com\n\nSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
      "release": "2025-04-14T08:00:00Z",
      "duration": "00:49:03",
      "explicit": false,
      "spotifyId": "3Vbmg0LeZU7Ug2YFbbN5VX",
      "appleId": 1000703432195,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Vbmg0LeZU7Ug2YFbbN5VX",
        "apple": "https://podcasts.apple.com/podcast/morningland-pt2-destructive-evil-wench/id1582863762?i=1000703432195"
      }
    },
    {
      "id": "43666cf9-bb7b-4af1-936f-1ca61d46be34",
      "title": "Mary Kay Cosmetics: “The Lipstick Tornado” OR ““Faith First, Family Second, Financial Ruin Third”",
      "description": "Whitney wanted a Friday night dress. She got a pink Cadillac and a cult instead. At 21, she joined Mary Kay just trying to pay her $200 rent. What she got was a crash course in manipulation disguised as empowerment, a swirl of culty catchphrases, and a trunk full of sparkle-dusted dreams. In this episode, Whitney takes us on her journey from California cake decorator to one of Mary Kay’s youngest Sales Directors—and eventually, to the other side, where she finds healing, purpose, and a life that’s truly her own. No pins. No pearls. No plastic praise. LINKS: Come see us LIVE at the Napa Valley Streaming Festival! Follow us for more culty content: @wasiinacult Support the show: If Was I in a Cult? has impacted you, please rate and review—it really helps more people find us! And consider joining our Patreon for ad-free episodes and bonus culty goodness. Have a dark and sparkly story of your own? We’d love to hear it. Reach out anytime: info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-03-31T07:00:00Z",
      "duration": "00:52:48.8090000",
      "explicit": false,
      "spotifyId": "2wsYtQl1S1MthE9IwAV4Qr",
      "appleId": 1000701544225,
      "subjects": [
        "Mary Kay",
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2wsYtQl1S1MthE9IwAV4Qr",
        "apple": "https://podcasts.apple.com/podcast/mary-kay-cosmetics-the-lipstick-tornado-or-faith/id1582863762?i=1000701544225"
      }
    },
    {
      "id": "cc7d6a89-0218-49b3-8ef5-32e55b80cc99",
      "title": "[ENCORE] Mormon... More Women: “My Husband’s Wife”",
      "description": "Today, we’re taking it back to where it all began: our very first episode. Meet Johanne Hanks, who went from BYU grad to plural wife to party planner for Jesus in a yuppie Mormon doomsday group called The True and Living Church. You know… TLC. Faced with the fear of an impending apocalypse, Joanne and her husband move to a small Utah town to live \u0022Mormonism on steroids\u0022, which means wearing long underwear, communicating with the dead, prophetic visions, odd temple rituals, cookies with Jesus, and the law of celestial marriage (aka polygamy). We’ll be back next week with one of the OG MLMs… May Kay. Pucker up for that one. Come see us LIVE at the Napa Valley Streaming Festival! Johanne’s Book: “It’s Not About the Sex, My Ass” Follow us for more culty content: @wasiinacult Support the show: If Was I in a Cult? has impacted you, please rate and review us—it truly helps! And consider joining our Patreon for ad-free episodes and a cult-free community. Have a story of your own? We’d love to hear it. Reach out to us at info@wasiinacult.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-03-24T07:00:00Z",
      "duration": "01:27:34.5040000",
      "explicit": false,
      "spotifyId": "58V5tQqoT7lwRU5MsS9meM",
      "appleId": 1000700558117,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/58V5tQqoT7lwRU5MsS9meM",
        "apple": "https://podcasts.apple.com/podcast/encore-mormon-more-women-my-husbands-wife/id1582863762?i=1000700558117"
      }
    },
    {
      "id": "718d5b16-6481-4660-98b0-4bf42946b549",
      "title": "Pentecostal Cult: “South Central’s False Prophet”",
      "description": "As Tyler owns up to overlooking a crucial part of Orange County\u0027s troubling past, Liz is secretly grateful for his mistake—for without it, they might never have met today\u0027s inspiring guest, Vida. Growing up in South Central LA, Vida\u0027s father found salvation in a Pentecostal church led by a self-proclaimed prophet. For Vida, the church was initially a comforting community, offering structure and belonging. But over time, it became clear that what she knew as normal was deeply damaging: fasting replaced freedom, demons blamed for everyday struggles, and poverty persisted despite relentless donations. Vida shares her journey from unquestioning devotion to courageous self-discovery, ultimately reclaiming her life from the tangled legacy of faith, trauma, and generational pain. Thank you, Vida, for your courage, your honesty, and your wisdom—and yes, for challenging Tyler\u0027s musical tastes. _______ **Follow us for more culty content: @wasiinacult **Support us: If \u0027Was I in a Cult?\u0027 has impacted you, please rate and review us—it truly makes a difference! And consider joining our Patreon for ad-free episodes and more community connection. **if you have your own story of navigating spiritual trauma or culty family dynamics, reach out to us at info@wasiinacult.com —we\u0027d love to hear from you! See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-03-17T07:00:00Z",
      "duration": "00:50:46.5560000",
      "explicit": false,
      "spotifyId": "2v4fZPAZ9l3A47WCdpqeCs",
      "appleId": 1000699461498,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2v4fZPAZ9l3A47WCdpqeCs",
        "apple": "https://podcasts.apple.com/podcast/pentecostal-cult-south-centrals-false-prophet/id1582863762?i=1000699461498"
      }
    },
    {
      "id": "77b0f934-356d-40aa-85a4-7f2678091b69",
      "title": "The Raelians: “Aliens, Polygamy and Clones”",
      "description": "You’ve heard of doomsday cults and self-help cults… but what about an alien cult? This week, we’re taking you on a journey beyond the stars—or at least, beyond logic—as we explore The Raelians. This episode is love bombing at its best and most seductive form. _____________ Follow us for more culty content: @wasiinacult Have you ever been love-bombed into a belief system that felt too good to be true? Or maybe you’ve found yourself drawn into a group that promised cosmic truths, only to leave you questioning everything? We’d love to hear your story—email us at info@wasiinacult.com Want ad-free episodes? Support us on Patreon and help fund our de ep dives into the culty corners of everyday life—because sometimes, the things we accept as \u0027normal\u0027 deserve a second look. Link to register for Writing Symposium",
      "release": "2025-03-10T08:00:00Z",
      "duration": "01:04:14.9420000",
      "explicit": false,
      "spotifyId": "3BgSooLd8mDWKvoBFDnq8q",
      "appleId": 1000698573480,
      "subjects": [
        "Raëlism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BgSooLd8mDWKvoBFDnq8q",
        "apple": "https://podcasts.apple.com/podcast/the-raelians-aliens-polygamy-and-clones/id1582863762?i=1000698573480"
      }
    },
    {
      "id": "bada6eee-80d3-44af-b02e-dc3b568f87b0",
      "title": "The Cult of Fine Dining: “Yes, Chef! No, Chef! On It, Chef!”",
      "description": "Fine dining is all about precision, artistry, and luxury on the plate—but behind those kitchen doors, the pressure, hierarchy, and chaos tell a very different story.\n\nThis week, we sit down with Chef Amber Evans, who opens up about the unspoken rules of the industry, the reality of life inside a Michelin-starred kitchen, and the moment she realized she had become the very thing she once feared. Could it be that she had been in … a cult? \n________\n\nFollow Chef Amber for mouth-watering content! @chefamberevans \nFollow us for more culty content: @wasiinacult \nHave you ever worked in a high-pressure, high-control environment that blurred the lines between passion and exploitation? Or maybe you’ve broken free from a system that demanded your total devotion? We’d love to hear your story—email us at info@wasiinacult.com \nWant ad-free episodes? Support us on Patreon and help fund our de ep dives into the culty corners of everyday life—because sometimes, the things we accept as \u0027normal\u0027 deserve a second look.",
      "release": "2025-03-03T09:00:00Z",
      "duration": "01:06:48",
      "explicit": false,
      "spotifyId": "0qVC7n3RJsStmdxOInumUg",
      "appleId": 1000697355988,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0qVC7n3RJsStmdxOInumUg",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-fine-dining-yes-chef-no-chef-on-it-chef/id1582863762?i=1000697355988"
      }
    },
    {
      "id": "8f8da678-9402-4678-acd6-18f2d56cc0b6",
      "title": "Shiny Happy People: “Shiny Happy Lies”",
      "description": "Crystal was born into a world where women obeyed, children served, and questioning authority was a sin. Raised under the oppressive rule of the Institute in Basic Life Principles (IBLP)—yes, the same Christian fundamentalist cult as the Duggars, “Shiny Happy People”—she spent her youth cleaning toilets, raising her mother’s children, and being prepped for a life of submission. But Crystal had other plans. This is the ultimate rags-to-riches story. She didn’t just escape the cult—she obliterated every expectation it had for her. From eating half-eaten Snickers bars out of the trash to becoming a wildly successful entrepreneur, from being promised to a 30-year-old man at 15 to discovering (in the most hilariously ways possible) that she really enjoys sex—Crystal’s life is nothing short of jaw-dropping. At times hilarious, at others absolutely heart-wrenching, Crystal shares with raw honesty how indoctrination shapes identity, how control distorts self-worth, and how breaking free comes at a cost. But she also proves that no matter how deep the conditioning, you can defy every expectation, reclaim your power, and build a life beyond your wildest dreams. __________________ Follow us for more culty content: @wasiinacult Have your own story about high-control groups, or breaking free from an oppressive system? Email us at info@wasiinacult.com —we’d love to hear it. Want ad-free episodes? Support us on Patreon and help fund our cult-unmasking, truth-telling, freedom-fighting journey. Liz on “What Came Next”",
      "release": "2025-02-24T09:00:00Z",
      "duration": "00:51:07.1150000",
      "explicit": false,
      "spotifyId": "0TgrbUfXmLramCu5O32slu",
      "appleId": 1000695509673,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0TgrbUfXmLramCu5O32slu",
        "apple": "https://podcasts.apple.com/podcast/shiny-happy-people-shiny-happy-lies/id1582863762?i=1000695509673"
      }
    },
    {
      "id": "44d9782d-7856-4165-a9a8-6c866fbebad2",
      "title": "A Cult of One: \u0022The Professor Will See You Now\u0022",
      "description": "There was no commune. No matching robes or group chants. A charismatic leader? Yes. But no room full of followers. This is a story about a cult of one — a lesser-known, yet perhaps more common, type of cult. When Alex first met her college advisor, she thought she’d found a mentor—someone brilliant, charismatic, and seemingly invested in her success. But behind the charm lay something much darker. Slowly, methodically, he pushed boundaries under the guise of guidance and concern—first emotionally, then physically—until she was isolated from friends and family, no longer trusting her own judgment. In today’s episode, we explore how one-on-one cults operate using the same tactics as larger cults—love-bombing, coercion, and manipulation—but in the intimate, hidden space between just two people. This is a chilling tale of how a trusted authority figure became a master manipulator, pulling the strings until Alex’s world was no longer her own. It’s a stark reminder that sometimes the most dangerous cult leader isn’t the one standing on a stage—but the one sitting across from you, offering a warm smile and a seemingly harmless invitation to talk. _____ Follow us for more culty content: @wasiinacult Got a story about manipulation, power dynamics, or your own cult of one? Email us at info@wasiinacult.com Want ad-free episodes? Support us on Patreon and help fund our cult-unmasking, truth-telling, boundary-protecting journey.",
      "release": "2025-02-17T09:00:00Z",
      "duration": "00:59:33.7860000",
      "explicit": false,
      "spotifyId": "7nAXcRb6ri1N1aWs6A8oYR",
      "appleId": 1000693006740,
      "subjects": [
        "Cult Psychology",
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7nAXcRb6ri1N1aWs6A8oYR",
        "apple": "https://podcasts.apple.com/podcast/a-cult-of-one-the-professor-will-see-you-now/id1582863762?i=1000693006740"
      }
    },
    {
      "id": "1223b5a6-3da1-4bd1-92ec-46db3645c913",
      "title": "A TikTok Astrology Cult: “Mystic Manipulation”",
      "description": "What happens when your dreams of becoming a therapist are unexpectedly dashed and a TIkTok astrologer promises to solve all your problems? Meet Taylor Marie, who found herself in an online cult that claimed to have \u0022the only astrology system that works.\u0022 Led by a charismatic married couple, this group charged outrageous prices for \u0022life-altering\u0022 astrology readings, promised entrepreneurial and personal success, and preached that all other astrologers were frauds. Taylor’s story is a cautionary tale about online communities, manipulation, and the dangerous power of social media cults. In this episode, she shares how she got entangled in the group, how it slowly consumed her life (and bank account), and the toxic breaking point that forced her to see the truth and get out. Her exit isn’t pretty — the leaders fought back with lawsuits, public smears, and astrology-based threats. But today, Taylor has reclaimed her power, faced the fear-mongering from the cult head on, and found her true purpose—one that wasn’t predicted by a TikTok “guru.” _____ Follow Taylor’s NEW account: @taylormarietherapy Follow us for more culty content: @wasiinacult Got a story that’ll make us say, “The stars did NOT see that coming”? Email us at info@wasiinacult.com —we promise we won’t charge $555 for it. Want ad-free episodes? Support us on Patreon and help fund our cult-unmasking, truth-telling, astrology-free-but-still-fun journey.",
      "release": "2025-02-10T09:00:00Z",
      "duration": "00:56:40.9860000",
      "explicit": false,
      "spotifyId": "6Fr3xAp23UW4IhcCEaacae",
      "appleId": 1000690833847,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Fr3xAp23UW4IhcCEaacae",
        "apple": "https://podcasts.apple.com/podcast/a-tiktok-astrology-cult-mystic-manipulation/id1582863762?i=1000690833847"
      }
    },
    {
      "id": "0e3b04fb-8343-4f14-904b-a11925bb41c1",
      "title": "Evangelical Dragon Ball Z Doomsday Cult: “I’ll Take Space Dragons for 500, Please”",
      "description": "When the pandemic hit, Aaron found himself isolated and searching for community. So when he discovered an online occult group, he thought he’d finally found his spiritual people. What he didn’t expect? Signing an NDA, pledging allegiance to a self-proclaimed “Master,” and being told he was destined for an apocalyptic battle… alongside seven ancient space dragons.\nAt first, the group felt like a place of deep discussion, curiosity, and meaning. But as the leader’s grip tightened, so did the demands for obedience. And when the leader finally revealed his true agenda—a disturbing spiritual “shadow ritual,” Aaron realized he wasn’t just in a mystical study group—he was in a full-blown cult.\nSo how did he go from believer to whistleblower? Listen now, because—like we always say—you can’t make this shit up.\nLINKS:\nFind Aaron’s anti-cult shared profile page:  https://www.facebook.com/Michelle.rugsby \nAnd the group email: holybullcrapclub@gmail.com\nFollow us for more culty goodness: @wasiinacult \nGot a story that’ll make us say, “Wait… WHAT?!” Spill the tea at info@wasiinacult.com —we promise we won’t make you sign an NDA\nWant ad-free episodes? Support us on Patreon and help fund our cult-unmasking, story-telling, snack-buying habits.",
      "release": "2025-02-03T09:00:00Z",
      "duration": "01:08:25",
      "explicit": false,
      "spotifyId": "3BoZOVdpBONKMBGSsEpTHn",
      "appleId": 1000688509315,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BoZOVdpBONKMBGSsEpTHn",
        "apple": "https://podcasts.apple.com/podcast/evangelical-dragon-ball-z-doomsday-cult-ill-take-space/id1582863762?i=1000688509315"
      }
    },
    {
      "id": "6bb174a8-7ac0-4823-a842-409826b0799e",
      "title": "A New-Age Hypnotherapy Cult PT2: “Hypno-Con-Artist”",
      "description": "In Part 2 of her jaw-dropping story, actress and writer Danielle Nicolet continues to unpack her harrowing experience in a cult disguised as a new-age hypnotherapy practice—led by a woman who shattered families, implanted false memories, and turned lives upside down.\n\nDanielle’s journey resumes as she’s sent back to Ohio to live with her father, forced to leave behind friends, gymnastics, and the group she had come to see as family. But instead of healing, the damage only deepens. Alienated from her dad and entangled in her mother’s unraveling, Danielle finds herself emancipated at just 16, navigating the cutthroat world of Hollywood while still grappling with the scars of her past.\n\nDanielle’s story is one of resilience and transformation. Her ability to turn deep trauma into a life of joy, creativity, and meaning is nothing short of remarkable. She inspires us, and we’re honored to have her share this story with the world for the first time on our show.\n\nLINKS:\nFind Danielle: @daninicolet \nFollow us:  @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult \nMerch is here! www.wasiinacult.com",
      "release": "2025-01-27T04:22:48Z",
      "duration": "00:55:17",
      "explicit": false,
      "spotifyId": "2dg0U16t27IAyzaoat7Woc",
      "appleId": 1000685617735,
      "subjects": [
        "Therapy Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2dg0U16t27IAyzaoat7Woc",
        "apple": "https://podcasts.apple.com/podcast/a-new-age-hypnotherapy-cult-pt2-hypno-con-artist/id1582863762?i=1000685617735"
      }
    },
    {
      "id": "c9214e99-0da7-4bb8-9b2a-7968e56975c0",
      "title": "A New-Age Hypnotherapy Cult PT 1: “Split personalities, Split Families”",
      "description": "You may know Danielle Nicolet as Cecile Horton on the CW’s “The Flash,” but long before Hollywood, her life was far from scripted. At just ten years old, Danielle’s world was turned upside down when her mother fell under the influence of Judith—a therapist turned guru turned cult leader. Judith used hypnosis to “recover” memories, shattering families and exploiting Orange County housewives by diagnosing them with multiple personality disorder for her own gain. But Judith’s influence didn’t stop with her mother—Danielle herself was pulled into Judith’s orbit. Encouraged to reject modern medicine, she found herself reciting affirmations to cure strep throat and believing the fabricated traumas that demonized her own family. In Part 1 of Danielle’s story, we follow her journey from gymnastics prodigy in small-town Ohio to navigating the unsettling extremes of 1980s Orange County, an affluent and conservative enclave where she was one of the only Black kids at her school—all while having to cope with a mother who now has eight additional personalities. _______ Control Body Odor ANYWHERE with @lumedeodorant and get 15% off with promo code Inacult at Lumepodcast.com/Inacult! — #lumepod _______ LINKS: Find Danielle: @daninicolet Follow us: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com",
      "release": "2025-01-20T15:27:27Z",
      "duration": "01:00:02.5730000",
      "explicit": false,
      "spotifyId": "1Lr2FG2mBPexhYffO83eE4",
      "appleId": 1000684711553,
      "subjects": [
        "Therapy Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Lr2FG2mBPexhYffO83eE4",
        "apple": "https://podcasts.apple.com/podcast/a-new-age-hypnotherapy-cult-pt-1-split/id1582863762?i=1000684711553"
      }
    },
    {
      "id": "cfdf833a-6adb-41ed-a626-210d37bde6f5",
      "title": "A Pagan Cult?: “Witch, please!”",
      "description": "In today’s spellbinding episode, Melissa, a self-proclaimed millennial misfit, shares her journey into a Wiccan coven that took a hard left towards culty. Melissa’s tale brews up all the ingredients for a wild cauldron of a story: witchy retreats, trance magic, Norse gods, and even perfume-making. What began as a quest for spiritual identity one day led her down a winding path of manipulation, dashed promises and blind devotion. She follow the yellow brick road, only to discover that the Great and Powerful Oz was just a woman charging $90 a week for unlicensed therapy while dangling the carrot of future financial success through channeling Norse deities. But fear not—this episode isn’t all toil and trouble. Melissa’s sharp wit and self-awareness make her story as empowering as it is entertaining. Plus, she managed to turn her culty coven experience into a thriving perfume business (fittingly named Sif Sniffs). Proof that even the wildest detours can lead to a magical comeback. _______ January is CBD Awareness month! We love our sponsor VIIA Hemp. Try VIIA today! viiahemp.com and use code INACULT! ________ LINKS: Melissa’s Perfume Company: Sif Sniffs Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com",
      "release": "2025-01-13T09:15:39Z",
      "duration": "01:04:08.5680000",
      "explicit": false,
      "spotifyId": "0DvmZv22lY4MJ51GO1F9cl",
      "appleId": 1000683783168,
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0DvmZv22lY4MJ51GO1F9cl",
        "apple": "https://podcasts.apple.com/podcast/a-pagan-cult-witch-please/id1582863762?i=1000683783168"
      }
    },
    {
      "id": "6d3c7fe1-05ab-4ec4-8a34-ef0876d2a65d",
      "title": "Santa is My Cult Leader: “He Sees Everything”",
      "description": "Today we’re joined by Finrod Jellybottoms, a chosen elf who escaped Santa’s magical workshop. Beneath the candy-striped facade lies a grueling cultic system of manipulation, free labor, and fear-based loyalty. Finrod shares his harrowing journey from a hopeful young elf in Frost Hollow to years of exploitation under Santa’s rule, uncovering the dark truths behind the “joy” of Christmas and the infamous Elf on a Shelf. We are glad Finrod got out and is able to remind us about the true meaning of Christmas… Happy holidays everyone! Thank you for your continued support. We’ll be back JAN 13th 2025!!! Until then, stay safe and out of cults! _______ We love our sponsor VIIA Hemp. Try VIIA today! www.viiahemp.com and use code INACULT! ________ Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com",
      "release": "2024-12-16T09:00:00Z",
      "duration": "00:59:25.8970000",
      "explicit": false,
      "spotifyId": "4fpkQwe7PNHevxjJbZKFN5",
      "appleId": 1000680556328,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fpkQwe7PNHevxjJbZKFN5",
        "apple": "https://podcasts.apple.com/podcast/santa-is-my-cult-leader-he-sees-everything/id1582863762?i=1000680556328"
      }
    },
    {
      "id": "d8d184f7-24dc-4d63-8af3-0888ed44dd86",
      "title": "Zendik Farm PT2: “Embracing the Death Culture”",
      "description": "In the gripping conclusion to Jeanne Nolan\u0027s story, the idyllic facade of Zendik Farm finally shatters. Beneath its promises of revolution and a self-sustaining community lies a darker reality: broken families and devastating power plays. Jeanne recounts her heart-wrenching separation from her baby, the unraveling of relationships under the commune’s twisted rules, and her ultimate escape after 17 long years. Through painful truths and a hard-won sense of clarity, Jeanne forges a new life outside the cult, turning trauma into a legacy of love, family, and a thriving organic gardening business that inspires others to embrace sustainability, growth, and connection… and all in a very healthy and not-at-all culty way of course. This is a story of resilience, transformation, and the extraordinary ability to cultivate beauty from even the darkest of places.\n\n_____\n\nBuy Jeanne’s book here!! \n\nJeanne’s incredible business “The Organic Gardener” https://www.theorganicgardener.net/ \n\nAnd if you want more Zendik, read Helen Zuman’s memoir, “Mating in Captivity”\n\n_____\n\nStop Scooping! With the Littler Robot. As a special holiday offer, Whisker is offering up to $100 off Litter-Robot bundles. AND as a special offer to listeners, you can get an additional $50 off when you go to stopscooping.com/CULT . \n_______\n\nGet holiday gifts here! Quince.com/CULT \n_______\n\nResist aging at the cellular level, try Qualia Senolytic. Go to Qualialife.com/CULT  for up to 50% off and use code ‘CULT\u0027 at checkout for an additional 15% off.\n________\n\nFollow us on Instagram/TikTok/FB: @wasiinacult  \n\nHave your own story? Email us: info@wasiinacult.com \n\nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult  \n\nMerch is here! www.wasiinacult.com",
      "release": "2024-12-09T09:00:00Z",
      "duration": "01:09:54",
      "explicit": false,
      "spotifyId": "6tGA6MzpKI8rzzvSHR673Q",
      "appleId": 1000679733375,
      "subjects": [
        "Zendik Farm"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6tGA6MzpKI8rzzvSHR673Q",
        "apple": "https://podcasts.apple.com/podcast/zendik-farm-pt2-embracing-the-death-culture/id1582863762?i=1000679733375"
      }
    },
    {
      "id": "29267967-df20-4fc5-a4bf-ccb668221dc3",
      "title": "Zendik Farm PT1: “Stop Bitching, Start a Revolution”",
      "description": "What happens when an idealistic teen swaps suburban comforts for a “revolutionary” arts cooperative promising harmony with the Earth, free love, and organic farming? Jeanne Nolan thought she’d found utopia at Zendik Farm—a bohemian paradise where creativity and sustainability reigned supreme. But behind the lush gardens and groovy slogans lurked manipulation, sexual politics, and a strict hierarchy led by two enigmatic leaders. In part one of this captivating two-parter, Jeanne reveals her journey from wide-eyed seeker to “Zendik warrior,” the allure of life on the fringe, and the cracks that began to form in the farm’s idyllic facade. Was Zendik Farm truly a haven, or just another cleverly veiled cult? Let’s dig into the dirt.\n_____\nControl Body Odor ANYWHERE with @lumedeodorant and get 15% off with promo code inacult at Lumepodcast.com/inacult! #lumepod \n_____\nThis holiday season, gift yourself some peace of mind. If you’re 21\u002B, head to Viiahemp.com and use the  code [inacult] to receive 15% off.\nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): patreon.com/wasiinacult \nMerch is here! wasiinacult.com",
      "release": "2024-12-02T09:00:00Z",
      "duration": "01:06:39",
      "explicit": false,
      "spotifyId": "0ed2HOyVVjbAq96C7vw3IM",
      "appleId": 1000678911718,
      "subjects": [
        "Zendik Farm"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ed2HOyVVjbAq96C7vw3IM",
        "apple": "https://podcasts.apple.com/podcast/zendik-farm-pt1-stop-bitching-start-a-revolution/id1582863762?i=1000678911718"
      }
    },
    {
      "id": "53109d04-15e4-453e-8780-492114e2a46d",
      "title": "The BDSM Kink Scene PT2: “My Kink is Not Your Kink”",
      "description": "CONTENT WARNING: This episode discusses sensitive and potentially triggering topics around sex and sexual dynamics. Amelia returns to share the conclusion of her story, exposing the hidden dangers she encountered within the BDSM kink scene in the UK. While this subculture promised sexual liberation and empowerment, Amelia reveals how it often justified harmful dynamics and enabled exploitation. In this episode, Amelia reveals the unsettling realities of concepts like ‘dark age play’ and ‘consensual non-consent,’ where blurred boundaries and the guise of consent are used to excuse abuse and shield predators from accountability. Her candid account delves into the manipulation, cult-like groupthink, and the profound psychological toll of her more than 10-years immersed in the scene. Through her story, Amelia highlights the importance of questioning systems that silence dissent, the slippery slope of power dynamics, and the courage it takes to finally shut the door for good on an environment that no longer reflects your values. Amelia\u0027s journey serves as a reminder that true empowerment comes from recognizing harm, standing against exploitation, and reclaiming your voice—even when it means walking away from the spaces you once called home. ____ Control Body Odor ANYWHERE with @lumedeodorant and get 15% off with promo code “INACULT” at LumeDeodorant.com! ____ Resist aging at the cellular level, try Qualia Senolytic. Go to Qualialife.com/CULT for up to 50% off and use code “CULT” at checkout for an additional 15% off. ____ Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): patreon.com/wasiinacult Merch is here! wasiinacult.com",
      "release": "2024-11-25T09:00:00Z",
      "duration": "00:45:22.5600000",
      "explicit": false,
      "spotifyId": "2NAEQ7Kcp239pEu7aeQRWk",
      "appleId": 1000678152426,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NAEQ7Kcp239pEu7aeQRWk",
        "apple": "https://podcasts.apple.com/podcast/the-bdsm-kink-scene-pt2-my-kink-is-not-your-kink/id1582863762?i=1000678152426"
      }
    },
    {
      "id": "13bf8946-df37-4840-92bb-9ce251914e41",
      "title": "The BDSM Kink Scene PT1: “Don’t Yuck My Yum”",
      "description": "Warning: This episode discusses sex and adult themes. Amelia King spent over a decade immersed in the UK’s BDSM scene, an underground world of role play, power dynamics, and boundaries—both pushed and broken. In this candid conversation, Amelia sheds light on how what began as playful exploration became a subculture steeped in manipulation, exploitation, and troubling parallels to cult-like behavior. From “munches” to “play partners,” she shares the layers of the scene’s allure, hierarchy, and darker truths. This is the first of a two-part series delving into Amelia’s story. Next week, we’ll explore the deeper, more sinister aspects of this subculture. ____ Donate to CUDDLY today! Head to cuddly.com/CULT and help make a difference! ____ Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): patreon.com/wasiinacult Merch is here! wasiinacult.com",
      "release": "2024-11-18T09:00:00Z",
      "duration": "00:51:37.8080000",
      "explicit": false,
      "spotifyId": "7wZBTMvqPLRDfQdby4XPnz",
      "appleId": 1000677334119,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7wZBTMvqPLRDfQdby4XPnz",
        "apple": "https://podcasts.apple.com/podcast/the-bdsm-kink-scene-pt1-dont-yuck-my-yum/id1582863762?i=1000677334119"
      }
    },
    {
      "id": "fcd2cee8-6bf2-4ac9-823b-e1777def24c4",
      "title": "BONUS: Bethany Joy Lenz on “The Big House Family”",
      "description": "In this special bonus episode, Liz sits down with actress, writer, and singer Joy Lenz (One Tree Hill) to discuss her harrowing and deeply personal journey through a Christian cult called “The Big House Family.” Having recently published her New York Times bestselling memoir, Dinner for Vampires, Joy opens up about how the group’s leader preyed on her longing for deep connection, manipulated her emotions and exerted financial control— eventually isolating her from her family and friends. From years of spiritual gaslighting to reclaiming her identity as an artist and mother, Joy’s story is one of resilience, self-discovery, and the power of reclaiming one’s voice. Want more? Patreon members can access the full, extended interview HERE Buy Joy’s memoir, Dinner For Vampires HERE. ___ Find Joy (see what we did there?): @msbethanyjoylenz Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com",
      "release": "2024-11-11T09:00:00Z",
      "duration": "00:51:52.8030000",
      "explicit": false,
      "spotifyId": "2rqbDrwNmJksZwlWuugKmY",
      "appleId": 1000676484262,
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rqbDrwNmJksZwlWuugKmY",
        "apple": "https://podcasts.apple.com/podcast/bonus-bethany-joy-lenz-on-the-big-house-family/id1582863762?i=1000676484262"
      }
    },
    {
      "id": "83a9c5d1-cb30-4274-8617-88d6b78e6c8c",
      "title": "Dollar Bill’s Cult: “My Father Stole My Wife”",
      "description": "In this heart-wrenching continuation of Emily Maldonado’s story, we delve into the life of her brother, Drew Matthews. Drew grew up under the domineering influence of his father, “Dollar Bill” Matthews, a pastor whose self-interest knew no bounds. From childhood indoctrination to traumatic \u0022exorcisms\u0022 and endless demands for loyalty, Drew was constantly searching for the love and acceptance his father never offered. This episode unravels a tale of betrayal on every level—Drew’s own father not only controlled his life but ultimately orchestrated the unthinkable: the estrangement of Drew’s wife and daughter. As Drew sought refuge in the military, hoping to escape his father’s grip, his father seized the opportunity to drive a permanent wedge between him and his family by doing the unthinkable. Drew’s resilience and strength in the face of unimaginable loss serve as a powerful testament to the endurance of the human spirit. We are in awe of you, Drew! ———— Try VIIA! www.viiahemp.com/inacult and use code: inacult Visit www.uncommongoods.com/cult for 15% off! Control Body Odor ANYWHERE with @lumedeodorant and get 15% off with promo code Inacult LumeDeodorant.com! #lumepod ———— Follow Drew on TikTok: @notreallysur.e / Instagram: @dapper_man Follow us on Instagram / TikTok / F B : @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com",
      "release": "2024-11-04T09:00:00Z",
      "duration": "00:58:48.5680000",
      "explicit": false,
      "spotifyId": "6736bTHnBUj5t4F5bsLDi3",
      "appleId": 1000675617756,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6736bTHnBUj5t4F5bsLDi3",
        "apple": "https://podcasts.apple.com/podcast/dollar-bills-cult-my-father-stole-my-wife/id1582863762?i=1000675617756"
      }
    },
    {
      "id": "a347f69b-ee7d-4fb3-8538-5f9bbd2327d4",
      "title": "Solid Rock Church: “My Dad, the Cult Leader”",
      "description": "What happens when your father becomes your pastor and eventually your cult leader? In this episode, Emily Maldonado shares the raw truth about growing up in a cult led by her own dad. From staged exorcisms to discovering that love and freedom could only come by breaking every rule, Emily’s story is heartbreaking and inspiring. With gripping honesty, she unpacks the jaw-dropping moment she knew she had no choice but to leave… and for Emily, leaving meant losing her entire family. With humor and profound resilience, Emily shares how she escaped a life dictated by manipulation—and found the strength to rebuild a life of joy and authenticity.  \n___\nControl Body Odor ANYWHERE with @lumedeodorant and get 15% off with promo code “inacult” LumeDeodorant.com! #lumepod\n__\nFollow Emily on Insta/Tiktok: @styledmicasa\n__\nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult  \nMerch is here! www.wasiinacult.com",
      "release": "2024-10-28T04:10:50Z",
      "duration": "01:13:41",
      "explicit": false,
      "spotifyId": "5rHVdAnH3Jlb9V90KzN8ke",
      "appleId": 1000674695035,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rHVdAnH3Jlb9V90KzN8ke",
        "apple": "https://podcasts.apple.com/podcast/solid-rock-church-my-dad-the-cult-leader/id1582863762?i=1000674695035"
      }
    },
    {
      "id": "df673f02-f088-4017-a94f-645b7968fad3",
      "title": "QAnon: “Control \u002B Alt \u002B Delulu”",
      "description": "Ashley takes us inside the twisted world of QAnon—an online cult that spread like wildfire during the pandemic, offering false hope through dangerous conspiracies to those seeking community, connection and autonomy in an unraveling world. Ashley reveals how fear tactics and manipulation lured her into a space where JFK Jr. was alive, Tom Hanks was an international trafficker, and every catastrophe was proof of an elite plot.\n\nFrom Instagram rabbit holes to FOIA requests about hot dogs at the White House, Ashley unpacks the absurdity and real danger behind QAnon’s grip. This is not just a story of strange beliefs—it’s a story of control, trauma, and ultimately, resilience. Join us as Ashley explains how she reclaimed her mind, her sanity, and her life—one hard truth at a time.\n____\n\nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult  \nMerch is here! www.wasiinacult.com",
      "release": "2024-10-21T01:59:21Z",
      "duration": "01:04:33",
      "explicit": false,
      "spotifyId": "6cyPTupUQN4KpzDtxOtK1P",
      "appleId": 1000673814087,
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cyPTupUQN4KpzDtxOtK1P",
        "apple": "https://podcasts.apple.com/podcast/qanon-control-alt-delulu/id1582863762?i=1000673814087"
      }
    },
    {
      "id": "6b0d1beb-8dce-4007-998e-63677148679a",
      "title": "Falun Gong P2: “Falun Gone… For Good”",
      "description": "In Part 2 of Angela\u0027s story, the realities of Falun Gong’s grip on her family deepen. Angela reflects on the emotional toll of a cult that prioritized spiritual salvation over physical health—even as her mother’s condition worsens. But escaping isn’t easy when your family remains deep in the cult’s ideologies… Angela’s journey out of this cult is filled with heartbreaking revelations and the resilience that defines a true “surthirver.” ____ Donate to CUDDLY today! Head to cuddly.com/CULT and help make a difference! Angela on TikTok/Instagram: @workplace_doodles Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys) Merch is here! www.wasiinacult.com",
      "release": "2024-10-14T05:19:26Z",
      "duration": "00:52:57.1160000",
      "explicit": false,
      "spotifyId": "5KGYXaDe7AYHxnapxUMi3T",
      "appleId": 1000673017153,
      "subjects": [
        "Falun Gong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KGYXaDe7AYHxnapxUMi3T",
        "apple": "https://podcasts.apple.com/podcast/falun-gong-p2-falun-gone-for-good/id1582863762?i=1000673017153"
      }
    },
    {
      "id": "549cf62a-7e44-434f-884d-422fab99db03",
      "title": "Falun Gong P1: “Karma Claus... He’s Always Watching\u0022",
      "description": "When her mother fell sick, young Angela had no idea that she would spend her childhood growing up in a dangerous cult. Falun Gong, a Chinese spiritual movement-slash-religion-slash-cult, known for its Shen Yun dancers and its ties to \u0027The Epoch Times’ entangled her family in its facade of meditation and enlightenment. In this two-part episode, Angela recounts her experience in a world where karma is not just a bitch, but a force that can dictate life and death… with suffering seen as path to salvation and modern medicine demonized as an obstacle to spiritual purity. And just when you think it can’t get any wilder, the Capitol Insurrection storms into the story… Stay tuned next week for Part Two. ____ Angela on TikTok: @workplace_doodles Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com Tyler’s Boring Book Club addition: \u0022How We Got to Now: Six Innovations That Made the Modern World\u0022",
      "release": "2024-10-07T05:22:44Z",
      "duration": "00:47:04.2020000",
      "explicit": false,
      "spotifyId": "3QlN2mKh2iMks0RhF8jEjR",
      "appleId": 1000672046482,
      "subjects": [
        "Falun Gong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QlN2mKh2iMks0RhF8jEjR",
        "apple": "https://podcasts.apple.com/podcast/falun-gong-p1-karma-claus-hes-always-watching/id1582863762?i=1000672046482"
      }
    },
    {
      "id": "738c118c-843f-4c2f-aa24-3091e3d179d6",
      "title": "Women Only Secret Society (NXIVM) PT1: “The Magic Sauce” (UPDATE)",
      "description": "**NOTE: This episode originally aired in 2021** When the LA party scene didn\u0027t fit Jessica\u0027s lifestyle anymore, she replaced martinis and after-hour clubs with green juices and tonic bars. But the reemergence of a childhood trauma forced her to examine her inner self. One day, a friend told her about a class that could improve her life even more. That class turned out to be part of a larger entity. A self-empowerment company that purported to help you become the master of your own life. A little group called... NXIVM. Find Jessica\u0027s book here Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com",
      "release": "2024-09-30T05:06:44Z",
      "duration": "01:03:15.6170000",
      "explicit": false,
      "spotifyId": "1aJZ9Zs1H6FbVAtlPO7r4x",
      "appleId": 1000671282811,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1aJZ9Zs1H6FbVAtlPO7r4x",
        "apple": "https://podcasts.apple.com/podcast/women-only-secret-society-nxivm-pt1-the-magic-sauce-update/id1582863762?i=1000671282811"
      }
    },
    {
      "id": "eecd846e-607b-4679-9d7f-ed269f82d4e0",
      "title": "Australian Vegan Cult: “Lambs on the Lam”",
      "description": "In this week’s episode, Hannah takes us from her Jehovah’s Witness upbringing to a wild journey through the world of an extreme vegan cult. What started as a passion for animal welfare escalated into living on a full fledged animal sanctuary, becoming the hub for Vegan’s of Geelong, and spiraling into breaking and entering in the name of “liberation.” Fueled by conspiracies and paranoia, Hannah’s new “family” pushed the boundaries of activism. With candor and lightheartedness, Hannah shares how she escaped one cult, only to fall into another, and what it took to break free for good. ____ Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys): https://www.patreon.com/wasiinacult Merch is here! www.wasiinacult.com",
      "release": "2024-09-23T05:15:39Z",
      "duration": "00:58:54.6280000",
      "explicit": false,
      "spotifyId": "5CCtofL8lX3Z0NmUPFL0AX",
      "appleId": 1000670397767,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5CCtofL8lX3Z0NmUPFL0AX",
        "apple": "https://podcasts.apple.com/podcast/australian-vegan-cult-lambs-on-the-lam/id1582863762?i=1000670397767"
      }
    },
    {
      "id": "007a56bd-ab62-4e23-815c-760707ae132c",
      "title": "The Two-by-Twos: “Be sad and die.”",
      "description": "Today’s guest, Meagan, host of the \u0022Trust Me\u0022 podcast, shares her journey growing up in the secretive Christian cult known as the Two-by-Twos. From a childhood dictated by oppressive rules that governed her every move, she reveals how this “hidden” religion shaped her life. With wit and raw honesty, Meagan recounts the manipulation and isolation she endured, and how she finally found the strength to break free. \nAnd shortly after, when the cult’s darkest truths finally surfaced for all the world to see, her entire idea of her childhood came crashing down. This wasn’t just a tightly controlled Christian sect, but something far more sinister… \n_____\n\nListen to Meagan’s podcast, “Trust Me: Cults, Extreme Beliefs, \u0026 Manipulation” wherever you get your podcasts.  \nFollow Trust Me: @trustmepodcast\nFollow Meagan: @meaganelizabethgrainger\nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys) \nMerch is here! www.wasiinacult.com",
      "release": "2024-09-16T05:53:31Z",
      "duration": "01:01:06",
      "explicit": false,
      "spotifyId": "7vtLKRx3e2BCEA8HOAEhDp",
      "appleId": 1000669693709,
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vtLKRx3e2BCEA8HOAEhDp",
        "apple": "https://podcasts.apple.com/us/podcast/the-two-by-twos-be-sad-and-die/id1582863762?i=1000669693709"
      }
    },
    {
      "id": "200555a7-6f5b-40f6-829d-912e0bc9fe9c",
      "title": "A Theater Group: “Lights… Camera… Cult!”",
      "description": "They say when you dream, dream big. And teenage Alex did just that. With an accent to die fahhh, this East Bostonian shares his story of joining an acting class with the promise of stardom, only to eventually realize, he was in a manipulative cult. Under the influence of a charismatic coach, Alex and his fellow students were pushed to the brink—endless rehearsals, emotional abuse, and mind games that blurred the line between ambition and exploitation. Alex exposes the dangerous allure of fame when you place the success of your future in the wrong hands... What happens when your dream become a nightmare? _____ Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys) Merch is here! www.wasiinacult.com ______ Control Body Odor ANYWHERE with @lumedeodorant and get 15% off with promo code Inacult at LumeDeodorant.com! #lumepod ______ Try CBD at cbdistillery.com and use code CU LT for 20% off.",
      "release": "2024-09-09T05:14:55Z",
      "duration": "00:48:30.2750000",
      "explicit": false,
      "spotifyId": "2zdwEdyIZqc614w5hon4Y2",
      "appleId": 1000668869841,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zdwEdyIZqc614w5hon4Y2",
        "apple": "https://podcasts.apple.com/podcast/a-theater-group-lights-camera-cult/id1582863762?i=1000668869841"
      }
    },
    {
      "id": "c4871b48-b324-42a1-aa72-bb9a50532a9a",
      "title": "The Wolf of Wall Street: “A Cult of One”",
      "description": "Dr. Nadine Macaluso joins us today to discuss our first of its kind on this show… a cult of one. Who exactly was her cult leader? None other than “The Wolf of Wall Street,” her ex-husband, Jordan Belfort.  In the movie adaptation of Jordan’s book, “The Wolf of Wall Street,” Dr. Nadine was portrayed by Margot Robbie and had no say in how her life was portrayed. Well, today Dr. Nadine is here to share the truth behind her picture perfect life. On the outside she had beauty, wealth, the doting husband, and two wonderful kids. But today she shares the truth about what was going on behind closed doors: the isolation, the loss of self, the abuse, the control, the manipulation and the gaslighting that kept her in a haze of confusion and pain. But, like every guest on this show, she shares the moment she finally found the strength and courage to walk away for good. \n\nNow a respected therapist, Dr. Nae emphasizes the importance of therapy in her healing process and destigmatizing the experiences of victims of cult leaders or pathological lovers. A Brooklyn gal at heart, Dr. Nae is as real as they get and was an absolute joy to have on the show. \n_____\n\nFollow Dr. Nae: Instagram: @therealdrnadine / TikTok: @drnaelmft\nBuy Dr. Nae\u0027s book HERE \nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon (we appreciate the hell out of you guys) \nMerch is here! www.wasiinacult.com",
      "release": "2024-09-02T06:41:47Z",
      "duration": "01:04:29",
      "explicit": false,
      "spotifyId": "1KdAjsQhkqhx2JqIGVgw3g",
      "appleId": 1000668051997,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1KdAjsQhkqhx2JqIGVgw3g",
        "apple": "https://podcasts.apple.com/us/podcast/the-wolf-of-wall-street-a-cult-of-one/id1582863762?i=1000668051997"
      }
    },
    {
      "id": "c5cf43e5-e2dd-4c35-a445-722aaf061e40",
      "title": "TITLE: The Mel Lyman Family PT1: “People Get Ready” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2021**\nAs an actor and writer, Guinevere Turner understands more than most, that some stories just can\u0027t be contrived. Because sometimes life is far stranger than fiction. As is the case with Guinevere\u0027s upbringing. Not your typical getting out story, it would take years for Guinevere to understand that, no, she didn\u0027t grow up on a hippie commune in the 1970s and 80s... she grew up in a cult. \n______ \nFollow Guinevere: @guinevereturner \nBuy Guinevere’s book HERE \nFollow us on Instagram/TikTok/FB: @wasiinacult \nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon \nMerch is here! www.wasiinacult.com \nLink to Spotify playlist for this episode",
      "release": "2024-08-26T00:04:58Z",
      "duration": "00:56:42",
      "explicit": false,
      "spotifyId": "4ra6RJ59Z00AhGdPyFrRdU",
      "appleId": 1000666646490,
      "subjects": [
        "The Lyman Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ra6RJ59Z00AhGdPyFrRdU",
        "apple": "https://podcasts.apple.com/us/podcast/title-the-mel-lyman-family-pt1-people-get-ready-update/id1582863762?i=1000666646490"
      }
    },
    {
      "id": "ba7984b2-a492-4d68-b3be-3389932f186f",
      "title": "LISTEN NOW: “Nobody Should Believe Me”",
      "description": "Today, we\u0027re excited to bring you a special episode from our friend Andrea Dunlop of the “Nobody Should Believe Me” podcast.Last week, Andrea joined us to share her personal story about how Munchausen by Proxy tore her family apart, and the response was overwhelming. We know many of you were left with questions and a desire to dive deeper into this rare and troubling condition. That’s why we wanted to share Andrea’s own podcast, where she explores these themes in greater depth and answers the questions that our conversation only began to uncover. We hope you find this episode as compelling as we do. We’ll be back in two weeks with an all-new episode. Thank you, as always, for your continued support! —— We meet accomplished novelist and loving mother Andrea Dunlop as she embarks on a journey to understand the series of events that tore her family apart. We learn that her older sister has been investigated twice for Munchausen by Proxy abuse, which inspired Andrea to learn everything she could about this complex and misunderstood issue. We see Andrea become captivated by the story of Hope Ybarra and go along with her to meet Hope’s father, sister, and brother: the first people Andrea has ever spoken to who’ve actually lived through a case. But can anything prepare Andrea for the truth? __ LISTEN TO “Nobody Should Believe Me” here: https://www.nobodyshouldbelieveme.com/ ___ Merch is here! www.wasiinacult.com Follow us on Instagram/TikTok/FB: @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon",
      "release": "2024-08-19T05:02:29Z",
      "duration": "00:35:17.7990000",
      "explicit": false,
      "spotifyId": "590GGerMEEHdsLBQYCl8c8",
      "appleId": 1000665877885,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/590GGerMEEHdsLBQYCl8c8",
        "apple": "https://podcasts.apple.com/podcast/listen-now-nobody-should-believe-me/id1582863762?i=1000665877885"
      }
    },
    {
      "id": "cf5af743-d922-4a13-b092-90be48835ca0",
      "title": "Munchausen by Proxy: “My Sister the Perpetrator”",
      "description": "When your sister, whom you love, fabricates a pregnancy with twins, it’s alarming. But when you eventually come to discover that your sister is the culprit of Munchausen by Proxy, life as you know it will never be the same.\n\nToday, Andrea Dunlop, a novelist and podcaster of the successful podcast, “Nobody Should Believe Me” joins us to share her personal experience with her sister’s Munchausen by Proxy abuse and delves into her family background and where it all began. Fabricated illnesses and surgeries escalate to abuse of her own children. And the question we are all wondering: Are instigators of this disorder aware of what they are doing?? Listen now to find out… \n\nFollow Andrea: @andreadunlop \nListen to “Nobody Should Believe Me” wherever you get your podcasts.\nFollow the show: @nobodyshouldbelievemepod\nResources for those dealing Munchausen by Proxy, visit: munchausensupport.com \nAndrea’s Books:\nWe Came Here to Forget \nLosing the Light\nShe Regrets Nothing\nWomen are the Fiercest Creatures \n\nFollow us on Instagram/TikTok/F B:  @wasiinacult\n\nHave your own story? Email us: info@wasiinacult.com \n\nPlease support Was I In A Cult? Through Patreon\n\nWe have MERCH! Head to our website for the link: www.wasiinacult.com",
      "release": "2024-08-12T04:16:31Z",
      "duration": "01:05:19",
      "explicit": false,
      "spotifyId": "65xjRaCkgPUVCNM2W74qRv",
      "appleId": 1000665023054,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65xjRaCkgPUVCNM2W74qRv",
        "apple": "https://podcasts.apple.com/us/podcast/munchausen-by-proxy-my-sister-the-perpetrator/id1582863762?i=1000665023054"
      }
    },
    {
      "id": "47122fb3-5f82-488e-b7e4-49e969a897b3",
      "title": "Maum Meditation “Cleanse Mind (aka) Brain Wash”",
      "description": "Today, Diamond King shares her poignant journey of being ensnared by a meditation cult known as MAUM Meditation. Promising enlightenment, the group diverted her from personal goals and desires, ultimately causing her to completely disassociate from reality. Through the unwavering support of a loved one and diligent personal research, Diamond uncovered the cult\u0027s financial and spiritual abuse and manipulation, empowering her to break free. Now a thriving teacher, she travels the world, spreading her wisdom and embracing her authentic self. Diamond shares her cautionary tale with humor and compassion, and it was truly a delight to have her on the show. ___ Find Diamond: @therealdiamondking Follow us on Instagram / TikTok / F B : @wasiinacult Have your own story? Email us: info@wasiinacult.com Please support Was I In A Cult? Through Patreon We have MERCH! Head to our website for the link: www.wasiinacult.com",
      "release": "2024-08-05T05:36:17Z",
      "duration": "00:46:16.0320000",
      "explicit": false,
      "spotifyId": "1frMvRZfaHtcfW2Fk25GkI",
      "appleId": 1000664363264,
      "subjects": [
        "Maum Meditation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1frMvRZfaHtcfW2Fk25GkI",
        "apple": "https://podcasts.apple.com/podcast/maum-meditation-cleanse-mind-aka-brain-wash/id1582863762?i=1000664363264"
      }
    },
    {
      "id": "63eeb8e8-fe75-47e4-82cf-2b97ea2d8cc2",
      "title": "Millionaire’s Club: “The World Was Gonna Open Up” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2022**\nCONTENT WARNING: This episode discusses sexual assault. \n\nArianna was a recent college graduate with dreams of one day opening her own marketing company. So when a LinkedIn opportunity for a social media marketing assistant fell into her lap, it felt too good to be true. Soon, she would be brushing shoulders with millionaires, in hopes that some of their mojo would rub off. After all, she had big plans for her future and a self-made father to prove herself to. But, you know what they say about things being too good to be true... They usually are. This brave, inspiring woman is here to share her very important story of what exactly happened when she got involved with this Nashville \u0022Millionaire\u0027s Club.” \n___\n\nArianna on Instagram: @ariannasprabary  \nArianna on TikTok: Aristrawberry0  \nFollow us on Instagram/TikTok/F B:  @wasiinacult\nHave your own story? Email us: info@wasiinacult.com \nPlease support Was I In A Cult? Through Patreon  \nWe have MERCH! Head to our website for the link: www.wasiinacult.com",
      "release": "2024-07-29T06:30:07Z",
      "duration": "01:06:39",
      "explicit": false,
      "spotifyId": "5FZa3rigKpeO539M6O2eiz",
      "appleId": 1000663679239,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5FZa3rigKpeO539M6O2eiz",
        "apple": "https://podcasts.apple.com/us/podcast/millionaires-club-the-world-was-gonna-open-up-update/id1582863762?i=1000663679239"
      }
    },
    {
      "id": "9fd91578-2239-4c09-8264-4693f61c0d8a",
      "title": "Bikram Yoga: “Smells Like Wet Carpet”",
      "description": "After finding her passion in Bikram Yoga while in her 20s, Jennifer Boeder aspires to become a Bikram teacher and plops down $5000 to sign up for the two-month teacher training. But after only a few days of being trapped in a smelly, windowless warehouse and getting yelled at by sycophantic trainers, she starts to see the truth. Turns out the \u0022great and powerful guru,\u0022 Bikram Choudhury, is less great and powerful, and more toxic and tyrannical. From the degrading remarks to the unbearable conditions, Jennifer’s story highlights the dark side of a supposed path to enlightenment. —— Merch is arriving! Click here to check it out. —— Thanks to everyone who supports our show. It really helps us. Can’t afford to contribute monetarily? Reviews and ratings help a bunch. Thank you. If you would like to support us, head to our Patreon Follow us: instagram / TikTok @ wasiinacult Find Jennifer: @jenniferruth Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-07-22T05:23:25Z",
      "duration": "00:59:15.9700000",
      "explicit": false,
      "spotifyId": "4cwwrH03ekmLTdstY7h1rN",
      "appleId": 1000662973602,
      "subjects": [
        "Bikram Yoga"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cwwrH03ekmLTdstY7h1rN",
        "apple": "https://podcasts.apple.com/podcast/bikram-yoga-smells-like-wet-carpet/id1582863762?i=1000662973602"
      }
    },
    {
      "id": "d81f5b08-50c4-49fb-a925-6204dd1ba9ac",
      "title": "My Dad’s A Cult Leader: “The Failed Love Movement\u0022",
      "description": "A couple weeks ago we published an episode featuring Ashleigh Teeter, who was ostracized from her family because of her cult leader father. Today we feature her youngest brother\u0027s story of growing up in that house long after Ashleigh was gone. 14 years her junior, Mattie was just a young boy when her sister was deemed demonic by his father. And for almost 25 years the siblings never spoke to each other. Today we welcome Mattie to share his heartbreaking story… a boy who was never allowed to talk to a girl without brutal consequences. —— Today, Mattie and Ashleigh are not only reunited but they host a podcast about their upbringing together. It’s called “The Cult Next Door” and is available wherever you get your podcasts. —— Thanks to everyone who supports our show. It really helps us. Can’t afford to contribute monetarily? Reviews and ratings help a bunch. Thank you! If you would like to support us, head to our Patreon Follow us: instagram/TikTok @wasiinacult Listen to Mattie \u0026 Ashleigh\u0027s podcast: The Cult Next Door @cultnextdoorpodcast (insta/tiktok) Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-07-15T00:00:00",
      "duration": "01:02:11.6700000",
      "explicit": false,
      "spotifyId": "7sKNLiRX85odAr1VEkzKGZ",
      "appleId": 1000662277507,
      "subjects": [
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7sKNLiRX85odAr1VEkzKGZ",
        "apple": "https://podcasts.apple.com/us/podcast/my-dads-a-cult-leader-the-failed-love-movement/id1582863762?i=1000662277507"
      }
    },
    {
      "id": "670c1f9e-83e4-4157-b392-6392f99b11c0",
      "title": "MLM LuLaRoe: “What’s Your Why?” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2022** She\u0027s a hustler, baby. And she just wants you to know. Roberta Blevins was taught to be a self-starter. Inspired by her self-made father, she knew that if you put your mind to it, anything can happen. And it\u0027s true. Anything can happen. But that\u0027s the problem with anything. Anything sometimes includes MLM\u0027s. Multi-level marketing (schemes). This is a story of a dynamite go-getter and how she crawled her way into a box of fart leggings and eventually... crawled her way out. — Roberta hosts her own podcast: Life After MLM. Check it out! @lifeaftermlmpodcast — Find us on Instagram/Tiktok: @wasiinacult (Instagram for the legging pic!) Help keep this show going by supporting us on Patreon Have your own story and want to be on our show? Email us: info@wasiinacult.com Follow Roberta: @therealrobertablevins",
      "release": "2024-07-08T08:00:00Z",
      "duration": "01:07:58.1840000",
      "explicit": false,
      "spotifyId": "3XNP5btzknv5MWtQxVjsom",
      "appleId": 1000661521348,
      "subjects": [
        "Multi-Level Marketing",
        "LuLaRoe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XNP5btzknv5MWtQxVjsom",
        "apple": "https://podcasts.apple.com/podcast/mlm-lularoe-whats-your-why-update/id1582863762?i=1000661521348"
      }
    },
    {
      "id": "c837cf1a-2104-434c-ba01-8dc2a92a684c",
      "title": "A Cult Divided: “Running to Freedom\u0022",
      "description": "Today\u0027s episode dives into the extraordinary story of Ashleigh Teeter, who grew up in the World Wide Church of God... a cult in its own right. But when the church splits due to a new leader’s ideas, Ashleigh’s world gets turned upside down. She witnesses her own father become a cult leader, and then get ostracized from her nuclear family for almost 25 years. Why? Listen to find out.\n—— \nAshleigh hosts her own podcast about her upbringing. It’s called “The Cult Next Door” and is available wherever you get your podcasts.\n—— \nThanks to everyone who supports our show. It really helps! \nIf you don’t yet, but would like to, head to our Patreon \nFollow us: instagram/TikTok @wasiinacult\nListen to Ashleigh’s podcast: The Cult Next Door @cultnextdoorpodcast (insta/tiktok)\nFollow Ashleigh: @ashleighrb5\nHave your own story and want to be on our show? \nEmail us: info@wasiinacult.com\n—— \nTry VIIA Hemp! https://bit.ly/viiainacult and use code INACULT! (15% off)",
      "release": "2024-07-01T04:24:54Z",
      "duration": "01:03:50",
      "explicit": false,
      "spotifyId": "6scGzkBDQnsfGZd5FjGQHp",
      "appleId": 1000660749075,
      "subjects": [
        "Worldwide Church Of God",
        "The Crusade Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6scGzkBDQnsfGZd5FjGQHp",
        "apple": "https://podcasts.apple.com/us/podcast/a-cult-divided-running-to-freedom/id1582863762?i=1000660749075"
      }
    },
    {
      "id": "ad51df13-a8de-4f51-b00c-de07b68345d5",
      "title": "US Air Force: “Not Just a Pretty Face, Sir.”",
      "description": "WARNING: This episode discuss sexual assault. A girl with a dream, Amanda was recruited from high school into what she thought would be the path to fulfilling that dream. But a superior\u0027s abuse of power forced her life in a different direction. This is a powerful and important story shared from an often underrepresented perspective: a woman in the US military. Told with grace, strength, humility, and humor, it is an absolute pleasure providing Amanda with a platform to let her story be known. ___ Thanks to everyone who supports our show. It really helps! If you don’t yet, but would like to, head to our Patreon (thank you and thank you) Follow us: instagram/TikTok @wasiinacult Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-06-24T05:37:14Z",
      "duration": "01:02:16.3200000",
      "explicit": false,
      "spotifyId": "6BNYzpiwpIaDcFqnR1RGfu",
      "appleId": 1000660047310,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6BNYzpiwpIaDcFqnR1RGfu",
        "apple": "https://podcasts.apple.com/podcast/us-air-force-not-just-a-pretty-face-sir/id1582863762?i=1000660047310"
      }
    },
    {
      "id": "eff99f72-62e4-43f3-8ee3-a327c33915a2",
      "title": "S-Factor Pole Dancing - PT2: “Emotional Roadkill”",
      "description": "Welcome to PART 2 of Jessica Hopper’s journey into and out of a pole dancing cult. This episode takes us to the peak of the cult, including protégés, unpaid labor, surreal bookclubs, emotional breakdowns, and coercion retreats. The leader, Sheila, is quite “pole\u0022-arizing, to say the least. Jessica’s breaking point, comes at an unexpected but important time in history, and leads to her eventually breaking free. A wonderfully articulate soul who shares her story with a no-holds-bar type of attitude, Jessica’s wit and vulnerability shine through in her retelling. Thank you again for showing us, Jessica, that cults can live literally anywhere. Support us and our show on Patreon Follow us: instagram/TikTok @wasiinacult Follow Jessica: instagram: @jesshopperpole Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-06-17T04:22:24Z",
      "duration": "00:55:15.3560000",
      "explicit": false,
      "spotifyId": "2eoPIixJqBwMXhZvJqHUnR",
      "appleId": 1000659255117,
      "subjects": [
        "S Factor Studio"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2eoPIixJqBwMXhZvJqHUnR",
        "apple": "https://podcasts.apple.com/podcast/s-factor-pole-dancing-pt2-emotional-roadkill/id1582863762?i=1000659255117"
      }
    },
    {
      "id": "027f37a1-3a38-4b68-a71f-55077375af23",
      "title": "S-Factor - PT1: “Pole Dancing to Solve the Patriarchy”",
      "description": "Meet the very funny and very bold Jessica Hopper, as she dives into her bizarre and unexpected journey into a pole dancing cult. Yes, a pole dancing cult at a studio called S-Factor in Los Angeles, CA. What began as a fun pole dancing class turned into an intense, all-consuming experience. Jessica shares her story of quitting her job, enduring rigorous and costly training, and grappling with the beginnings of the cult-like culture within S-Factor. With humor and honesty, Jessica reveals the highs and lows, the camaraderie and the disillusionment. This is just PART 1 of her illuminating experience. Thank you, Jessica. You are an absolute hoot, and it was so fun to have you on the show. Support us and our show on Patreon Follow us: instagram/TikTok @wasiinacult Follow Jessica: instagram: @jesshopperpole Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-06-10T05:13:48Z",
      "duration": "01:09:36.8210000",
      "explicit": false,
      "spotifyId": "09lBNkoGLFeX2c6IXTc0qD",
      "appleId": 1000658446597,
      "subjects": [
        "S Factor Studio"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09lBNkoGLFeX2c6IXTc0qD",
        "apple": "https://podcasts.apple.com/podcast/s-factor-pt1-pole-dancing-to-solve-the-patriarchy/id1582863762?i=1000658446597"
      }
    },
    {
      "id": "a31a1ead-17bd-4482-a46b-6f09a8d0d043",
      "title": "An Islamic Sect: “Stolen Innocence”",
      "description": "WARNING: This episode contains graphic discussions of abuse and self-harm. Raised by a single mother in the Muslim community, Samir Ahmed was sent to a Tablighi Jamaat-focused madrasa at age 11, a religious boarding school for boys under 15. With good intentions and pressure from the community, his mother hoped this would keep her son away from drugs and knocking up girls. What transpires is one of the most harrowing stories we have ever featured on this show. But as Samir recounts his traumatic experiences with remarkable vulnerably and poise, listeners will hear the resilience and strength that define him. With his huge heart, Samir proves that your voice is one of the most powerful tools you own. Thank you again, Samir. It was an honor to share your story. Support us and our show on Patreon Follow us on Instagram/TikTok: @wasiinacult Have your own story and want to be on our show? Email us: info@wasiinacult.com Try VIIA Hemp! and use code INACULT! (15% off)",
      "release": "2024-06-03T03:45:35Z",
      "duration": "00:59:54.1350000",
      "explicit": false,
      "spotifyId": "4BK6bvOEaSCM8yPZohAIdJ",
      "appleId": 1000657652348,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BK6bvOEaSCM8yPZohAIdJ",
        "apple": "https://podcasts.apple.com/podcast/an-islamic-sect-stolen-innocence/id1582863762?i=1000657652348"
      }
    },
    {
      "id": "403cc029-bbb1-4556-969b-8a94cb4d4778",
      "title": "John Frum Movement: “GI Joe, The American… God?”",
      "description": "On a “Very Special Episode” of \u0022Was I In A Cult?\u0022 … Today, we take a detour from our usual format to pay homage to Memorial Day by uncovering the bizarre and captivating tale of the John Frum Movement. Yes, that’s ‘from’ with a ‘u’, homies. Today, we’re diving into the South Pacific’s volcanic island of Tanna, where WWII soldiers inspired a cult devoted to a mystical American GI promising endless cargo. Yup, infinite Spam. Think of it as Amazon Prime meets religious zeal. So join Tyler \u0026 Liz as they explore this fascinating slice of history, filled with bamboo runways, makeshift military drills, and a whole lot of hope. So, if you’re ready for a wild ride through the enchanting and eccentric world of cargo cults, buckle up. We’re sorry—and you’re welcome. Don’t forget to join “Tyler’s Boring Book Club” by supporting his book recommendations here: \u0022Guns, Germs, and Steel” by Jared Diamond: https://www.amazon.com/dp/0393354326/ref=cm_sw_r_as_gl_api_gl_i_4VQFG86WC22Z6WV3780Q?linkCode=ml1\u0026tag=wasiinacult-20 \u0022Prisioners of the Castle\u0022 by Ben Macintyre: https://www.amazon.com/dp/0593136357/ref=cm_sw_r_as_gl_api_gl_i_2FQQA5EN2YVAGPA9YV9F?linkCode=ml1\u0026tag=wasiinacult-20 And support us on Patreon to keep the weirdness coming: https://www.patreon.com/wasiinacult Follow us: @wasiinacult Have your own story and want to be on our show? Email us: info@wasiinacult.com",
      "release": "2024-05-27T06:44:42Z",
      "duration": "00:37:24.8060000",
      "explicit": false,
      "spotifyId": "5jllUbWyKGj62LNXcFsAkL",
      "appleId": 1000656901905,
      "subjects": [
        "John Frum"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jllUbWyKGj62LNXcFsAkL",
        "apple": "https://podcasts.apple.com/podcast/john-frum-movement-gi-joe-the-american-god/id1582863762?i=1000656901905"
      }
    },
    {
      "id": "641c82fe-522c-49a6-a782-cd64371d4e8e",
      "title": "Ballet 58: “Pray, then plié!”",
      "description": "SHOWNOTES: \u0022A ballet cult?” We asked the same thing. But today’s brave guest, Summer Smith, shares what happens when the world of pliés and pirouettes meets dogmatic devotion. Raised in a strict religious family and molded by the intense world of competitive ballet, Summer\u0027s journey takes a surprising twist when she joins Ballet 58, a seemingly innocuous Christian ballet company in Chicago. Soon devotions blend with dance routines, and artistic discipline intertwines with cult-like control. As Summer navigates the thin line between dedication and manipulation, you\u0027ll be left questioning just how far the influence of a charismatic leader can reach. LINKS: Follow Us: Instagram/Tik Tok: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email Us: info@wasiinacult.com Find Summer and all the ex Ballet 58’ers sub Reddit: https://www.reddit.com/r/ex58/ Watch In The Balance: https://vimeo.com/535912792/7551d1ed90",
      "release": "2024-05-20T04:33:55Z",
      "duration": "00:58:23.8040000",
      "explicit": false,
      "spotifyId": "2NuqeSwgWi24Atv0ZkFxHo",
      "appleId": 1000656130800,
      "subjects": [
        "Ballet 5:8"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NuqeSwgWi24Atv0ZkFxHo",
        "apple": "https://podcasts.apple.com/podcast/ballet-58-pray-then-pli%C3%A9/id1582863762?i=1000656130800"
      }
    },
    {
      "id": "ba66e574-5948-4dc6-ad1b-a40f228ceca3",
      "title": "UCKG: “Taking down a Billionaire Megachurch Cult”",
      "description": "Meet Rachael Reign, a tenacious activist battling to dismantle a billionaire megachurch cult. The cult that once owned her life. From her innocent introduction to the Universal Church of the Kingdom of God (UCKG) in South London as a 13-year-old girl, to devastating financial coercion and insidious practices, including exorcisms and grooming to become a pastor’s wife, Rachael\u0027s journey is one of transformation from victim to advocate. Through her story, she exposes the cult’s billionaire leader, Edir Macedo, and the exploitation under the guise of religion. With unwavering determination, Rachael empowers survivors and fights for justice, symbolizing the triumph of the human spirit over oppression. She\u0027s an inspiration for reclaiming freedom and standing against abuse. And she was a delight to have on the show. LINKS: Follow Us: Instagram/Tik Tok: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email Us: info@wasiinacult.com Follow Rachael: Instagram : @msrachaelreign Follow her movement: Instagram/Tik Tok: @survivinguniversaluk",
      "release": "2024-05-13T03:40:48Z",
      "duration": "00:58:58.4940000",
      "explicit": false,
      "spotifyId": "4icwIpKCm57HkI2OOzhjSL",
      "appleId": 1000655396883,
      "subjects": [
        "Universal Church Of The Kingdom Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4icwIpKCm57HkI2OOzhjSL",
        "apple": "https://podcasts.apple.com/podcast/uckg-taking-down-a-billionaire-megachurch-cult/id1582863762?i=1000655396883"
      }
    },
    {
      "id": "58c98357-c16a-4a6f-a7ea-3fa3690266bf",
      "title": "Teen Challenge: “444 Days Without Love”",
      "description": "SHOWNOTES: Our youngest guest to-date, Aliya Kasabian recounts her chilling involuntary initiation into the Boise Girls Academy, an institution that masquerades as a haven for troubled teens. From controlling communication with families to enforced silence and the denial of basic necessities like tampons, Aliya’s story exposes the depths of manipulation and coercion wielded by the program’s directors. But resistance only extends your time at this prison-like “healing facility.” So, eventually, Aliya discovers that if she is ever to be free, the only way out is to become… a true believer. LINKS: Follow Us: Instagram/Tik Tok: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email Us: info@wasiinacult.com Follow Aliya: Instagram/Tik Tok : @sandb0xb0y Try VIIA Hemp! https://bit.ly/viiainacult and use code INACULT! (15% off)",
      "release": "2024-05-06T07:37:36Z",
      "duration": "01:01:40.9760000",
      "explicit": false,
      "spotifyId": "62xP4ehqiVA8NWqhEV4jj8",
      "appleId": 1000654681140,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/62xP4ehqiVA8NWqhEV4jj8",
        "apple": "https://podcasts.apple.com/podcast/teen-challenge-444-days-without-love/id1582863762?i=1000654681140"
      }
    },
    {
      "id": "95c9c252-4488-47a0-98e2-cc8b4ecca039",
      "title": "Zendik Farm: “Mating in Captivity” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2023** **NEW EP DROP NEXT WEEK MONDAY MAY 6TH** Imagine having to ask a group of eco-farmers for permission to have sex. And when granted permission, your options of consummation include… the back of a van or the loft of a goat barn. Well that\u0027s what happened when Helen Zuman, a spelling bee whiz looking to explore her interest in eco-farming, visited Zendik Farm in North Carolina shortly after graduating from Harvard. A two-week experience turned into years of her life. And that, ladies and gentlemen, is how you spell C-U-L-T. Support Was I In A Cult? on Patreon for goodies \u0026 extra content: https://www.patreon.com/wasiinacult (https://www.patreon.com/wasiinacult) Follow us on Instagram: @wasiinacult Contact us: Have a cult story of your own and want to share it on our show? Send us an email: info@wasiinacult.com. MORE ABOUT HELEN: https://helenzuman.com/",
      "release": "2024-04-29T02:27:00Z",
      "duration": "01:13:20.3260000",
      "explicit": false,
      "spotifyId": "4c83YQoKLummEVb4z4prGp",
      "appleId": 1000653889824,
      "subjects": [
        "Zendik Farm"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4c83YQoKLummEVb4z4prGp",
        "apple": "https://podcasts.apple.com/podcast/zendik-farm-mating-in-captivity-update/id1582863762?i=1000653889824"
      }
    },
    {
      "id": "c4e1c86e-d1b6-4404-bd7b-57a82eb25d78",
      "title": "Psychic Scientology: “Clearing the BS”",
      "description": "Ever heard of a Scientology-laced organization for spiritual growth? Neither had we, until we sat down with Kim Periano. Today, Kim recounts her bizarre experience with the Foundation for Spiritual Development (FSD). From hypnotic meditations to chilling encounters with supposed extraterrestrial beings, Kim\u0027s account unveils the disturbing truth behind the FSD\u0027s facade of spiritual growth. And as she progresses through the levels, Kim finds herself trapped in a web of manipulation, fear and coercion, questioning her own sanity and the true intentions of those she once trusted. LINKS: Find Kim: Acupuncture: https://www.lionsheartwellness.com/ \u0026 Coaching: https://couragetotransform.com/ Follow Kim: @couragetotransform Follow Us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email Us: info@wasiinacult.com Try VIIA Hemp! https://bit.ly/viiainacult and use code INACULT! (15% off)",
      "release": "2024-04-22T04:54:38Z",
      "duration": "01:01:48.8910000",
      "explicit": false,
      "spotifyId": "2NSL3MHBRRdfccAIAd2bNx",
      "appleId": 1000653194405,
      "subjects": [
        "Foundation for Spiritual Development",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NSL3MHBRRdfccAIAd2bNx",
        "apple": "https://podcasts.apple.com/podcast/psychic-scientology-clearing-the-bs/id1582863762?i=1000653194405"
      }
    },
    {
      "id": "df1f6125-c8d1-4d32-a5fb-283471d684ab",
      "title": "Tyler’s Story Part 2: “Man On a Mission”",
      "description": "Today is the final part of your fearless co-host, Tyler Measom\u0027s, story of being raised a Mormon, and finding the strength to finally say goodbye to the underwear. Now an acclaimed filmmaker and podcaster, much of Tyler’s work is inspired by the shadows of his past. He would go on and on, but Liz is telling him to wrap it up. So, enjoy the episode. And if you haven’t listened to PART 1 yet, do so first. Thanks again, Tyler, for your candor and insight. LINKS Follow Tyler: @tylermeasom Follow us: Instagram @wasiinacult Want Tyler’s Magic Underwear? Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-04-15T05:29:01Z",
      "duration": "00:57:13.6650000",
      "explicit": false,
      "spotifyId": "7lmbu7GpkeYiu5mX5w67We",
      "appleId": 1000652485922,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7lmbu7GpkeYiu5mX5w67We",
        "apple": "https://podcasts.apple.com/podcast/tylers-story-part-2-man-on-a-mission/id1582863762?i=1000652485922"
      }
    },
    {
      "id": "939a2bb5-c356-44c2-929b-bde46f6f3300",
      "title": "Tyler’s Story  - Part 1: “Mormon Mission to… Not France”",
      "description": "Tyler Measom, your fearless co-host, stopped by the studio in his magic underwear to chat with Liz about his cultic upbringing as a good (clean) Mormon Boy in Pleasant Grove, Utah. It’s everything you could hope for and less… or more… more or less. LINKS Follow Tyler: @tylermeasom Follow us: Instagram @wasiinacult Want Tyler’s Magic Underwear? Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-04-08T05:30:29Z",
      "duration": "00:46:09.0050000",
      "explicit": false,
      "spotifyId": "5lWk6S6SSSdxe1Pnr8LwO7",
      "appleId": 1000651769612,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5lWk6S6SSSdxe1Pnr8LwO7",
        "apple": "https://podcasts.apple.com/podcast/tylers-story-part-1-mormon-mission-to-not-france/id1582863762?i=1000651769612"
      }
    },
    {
      "id": "08810968-dacd-418f-b172-8dfc4aa7984c",
      "title": "The Cult Guru: “How to Save The World w/ Dr. Steven Hassan”",
      "description": "WE NEED YOUR INPUT!! We’re launching a new membership on Patreon and want to know… If you were to support this membership, what content do YOU crave more of? Please head to THIS LINK and GIVE US YOUR THOUGHTS!: https://forms.gle/9M8TSjfBvpNHKbxD6 TODAY’S EPISODE: A former Moonie, Dr. Hassan has spent the last 45 years helping thousands break free from cults and cult-like environments. He is is America\u0027s leading cult expert and the author of several groundbreaking books that have become invaluable resources for those seeking to understand and recover from the trauma of cult involvement. These critically acclaimed books, including “Combating Cult Mind Control,” “Freedom of Mind,” and “The Cult of Trump,” have shed light on the psychological, social, and emotional aspects of undue influence, while providing practical tools for healing and recovery. Visit freedomofmind.com (http://freedomofmind.com/) for more information about Dr. Hassan\u0027s recovery and intervention services, and his offering of both general and professional Continuing Education courses on cults and mind control. LINKS: FIND DR. Steven Hassan: freedomofmind.com Follow us: Instagram @wasiinacult Give us your thoughts! https://forms.gle/9M8TSjfBvpNHKbxD6 Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-04-01T05:01:49Z",
      "duration": "00:55:51.1180000",
      "explicit": false,
      "spotifyId": "5oNAkHzMffUI2h4wO9ch31",
      "appleId": 1000651059394,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5oNAkHzMffUI2h4wO9ch31",
        "apple": "https://podcasts.apple.com/podcast/the-cult-guru-how-to-save-the-world-w-dr-steven-hassan/id1582863762?i=1000651059394"
      }
    },
    {
      "id": "829367ff-1259-475d-9909-6b471c6f4f76",
      "title": "Married to the Cult Leader: “Symbol of The Whore\u0022",
      "description": "Christina takes us on a harrowing journey trapped in a cult led by (none other than) her husband, who claimed to be the reincarnation of Christ. Of course when they first met, he was a rebel who stole cars and did drugs, but we digress. From manipulation to isolation and justified adultery through \u0027God’s will,\u0027 Christina\u0027s story is a rollercoaster of control and resilience. As she faces threats to her family and identity, Christina bravely shares her experiences with humor and hope, showing us that even in the darkest of times, there is always a glimmer of light. LINKS Follow us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com — “This episode is sponsored by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.”",
      "release": "2024-03-25T02:02:39Z",
      "duration": "01:01:43.0660000",
      "explicit": false,
      "spotifyId": "2yq9a3NZfZ3rO0mrEHnfc0",
      "appleId": 1000650351750,
      "subjects": [
        "Equipping Christian Center"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2yq9a3NZfZ3rO0mrEHnfc0",
        "apple": "https://podcasts.apple.com/podcast/married-to-the-cult-leader-symbol-of-the-whore/id1582863762?i=1000650351750"
      }
    },
    {
      "id": "2ef60e7e-0ddd-404b-9b8c-f24e90b1eef2",
      "title": "Mormonism w/ Tal Bachman: “He’s So Hiiiiigh… On Doctrine\u0022",
      "description": "In the electrifying world of rock ’n roll, Canadian Tal Bachman, son of legendary Randy Bachman from Bachman Turner Overdrive, seemed destined for stardom. Yet, his path was anything but straightforward. For Tal, it was a constant dance between the chords of fame and the doctrines of his devout Mormon upbringing. And as the spotlight beckoned, Tal found himself at a crossroads, as the requirements for stardom clashed with rules of his religion. What led him to step away from the stage? And once he finally breaks free from the cult, does he find his way back? LINKS: Jingle writer: @angelasoffemusic Tal Bachman: @talbachman Follow us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com — Head to Viiahemp.com and use the code: ‘inacult\u0027 to receive 15% off \u0026#43; one free sample of their sleepy Dreams gummies. (21\u0026#43;).",
      "release": "2024-03-17T07:00:00Z",
      "duration": "01:20:05.2240000",
      "explicit": false,
      "spotifyId": "1j5FdJQrLSREq8pegNBqbn",
      "appleId": 1000649569717,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1j5FdJQrLSREq8pegNBqbn",
        "apple": "https://podcasts.apple.com/podcast/mormonism-w-tal-bachman-hes-so-hiiiiigh-on-doctrine/id1582863762?i=1000649569717"
      }
    },
    {
      "id": "9adc5b29-3a05-4e06-a34f-da3ee9d6a1e2",
      "title": "Gloriavale: “Gloria Fail\u0022",
      "description": "Jason Christian was born into Gloriavale — a self-proclaimed utopic Christian community of more than 500 people on the West Coast of New Zealand’s South Island. His grandfather, Hopeful Christian, was the leader. Shut out from the outside world and forced to work on the farm at the age of six, Jason was primed to live a life without actual freedom, as this group of true believers was all he knew. But when it was time for him to marry a woman in the community that was chosen for him, Jason made a different choice. LINKS Gloriavale documentary: https://www.gloriavale.com/ Follow us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com — “This episode is sponsored by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.”",
      "release": "2024-03-11T05:40:50Z",
      "duration": "01:04:22.4130000",
      "explicit": false,
      "spotifyId": "6Ie5SMEG9oOZr65AUK1GXZ",
      "appleId": 1000648761374,
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Ie5SMEG9oOZr65AUK1GXZ",
        "apple": "https://podcasts.apple.com/podcast/gloriavale-gloria-fail/id1582863762?i=1000648761374"
      }
    },
    {
      "id": "597a03a5-4b8a-4cae-9501-8587033b0924",
      "title": "Sufism - Part 2: “Freedom at 23”",
      "description": "This is Part 2 of Sara Tasneem’s heroic story. If you haven’t listened to Part 1, please start there. This episode reveals Sara’s immense strength, her re-brith, her new found freedom. But after years of imprisionment, the real world isn’t always an easy road… especially when you have mouths to feed. Thank you Sara. You’re an inspiration. Want to help end child marriage? You can! Get involved. It will take us all to finally end child marriages for good. Here are some helpful links to get you started: — Zonta USA: https://zontausa.org/end-child-marriage-in-the-usa/end-child-marriage-action/ — Unchained At Last: https://www.unchainedatlast.org/ — The AHA Foundation: https://www.theahafoundation.org/get-involved/ — United Nations Sustainable Development Goal 5.3 to end child marriage worldwide by 2030: https://sdgs.un.org/goals/goal5#targets_and_indicators — Tahirih Justice Center Forced Marriage Initiative: https://www.tahirih.org/who-we-serve/forms-of-violence/forced-marriage/ — Link to HB2924 in California (call your legislator and support this bill!!): https://legiscan.com/CA/text/AB2924/2023 — Sara’s activism: https://www.facebook.com/thrivingaftersurviving \u0026 https://tasneemsfadvocacy.home.blog/ — Follow us: Instagram: @wasiinacult — Support Us: https://www.patreon.com/wasiinacult — Have a story to share on our show? Email us: info@wasiinacult.com — “This episode is sponsored by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.”",
      "release": "2024-03-04T06:19:21Z",
      "duration": "00:50:54.4190000",
      "explicit": false,
      "spotifyId": "01IbuKaMxFkF46W0eLMhoW",
      "appleId": 1000647932119,
      "subjects": [
        "Sufi"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/01IbuKaMxFkF46W0eLMhoW",
        "apple": "https://podcasts.apple.com/podcast/sufism-part-2-freedom-at-23/id1582863762?i=1000647932119"
      }
    },
    {
      "id": "ee1fb426-8502-436b-aa0b-e160613f5ccd",
      "title": "Sufism - Part 1: “Forced at 15”",
      "description": "Sara Tasneem\u0027s journey began in Boulder, Colorado, where she was born into the Islamic faith. However, at the age of five, her parents divorced, causing her faith to split as well. Her mother distanced herself from the religion, while her father delved deeper, immersing himself in a Sufi group that would soon dominate Sara\u0027s existence. Then, at the age of 15, Sara\u0027s life took an unexpected turn when her father brought her to a conference led by the group\u0027s sheikh in Los Angeles, California. Little did she anticipate that this seemingly ordinary weekend would change the trajectory of her life in ways beyond imagination. Find Sara: https://tasneemsfadvocacy.home.blog/ Follow us: Instagram: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com This episode is brought to you by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.",
      "release": "2024-02-26T07:05:59Z",
      "duration": "00:49:01.3870000",
      "explicit": false,
      "spotifyId": "4s4eP6rBC7i7HXWyXWdKot",
      "appleId": 1000646879604,
      "subjects": [
        "Sufi"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4s4eP6rBC7i7HXWyXWdKot",
        "apple": "https://podcasts.apple.com/podcast/sufism-part-1-forced-at-15/id1582863762?i=1000646879604"
      }
    },
    {
      "id": "d43cf93a-06b6-4afb-aee8-7faccda05476",
      "title": "Multi-Level Manipulator (MLM): “Hey, Hun! Hey, Girl! Hey, sis!”",
      "description": "Emily Lynn Paulson was a busy, ass-kicking mom to five children when she realized something was missing. Wanting to find a way to enter the workforce again, she met up with an old friend one night who introduced her to some products. Products her friend was selling. Products that Emily could sell too. She could work her own hours, be her own boss, and still spend all the time with her kids. It sounded perfect. And it was. Until… well, it wasn’t. -- Emily’s book, “Hey, Hun: Sales, Sisterhood, Supremacy, and the Other Lies Behind Multilevel Marketing” was a book of the year pick by NPR for 2023. — LINKS Find Emily: Instagram @emilylynnpaulson Founder of @sobermomsquad Follow us: Instagram @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-02-19T04:09:51Z",
      "duration": "00:49:01.4130000",
      "explicit": false,
      "spotifyId": "355a2lsCxeGIYVX4UyVppH",
      "appleId": 1000645858639,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/355a2lsCxeGIYVX4UyVppH",
        "apple": "https://podcasts.apple.com/podcast/multi-level-manipulator-mlm-hey-hun-hey-girl-hey-sis/id1582863762?i=1000645858639"
      }
    },
    {
      "id": "4a7cf7b9-2e19-49b7-8bce-5911d711c0ed",
      "title": "Deer Tribe — PART 2: “This is Not Sexual Healing.\u0022",
      "description": "Now fully committed, Kit works her way through the Deer Tribe Medicine Society and Quodoushka programs, each level more intense than the last. After moving to Phoenix due to pressure from the group, she begins to really question whether or not this is providing the healing she set out to recieve. And then, when quarantine strikes, a woman joins the group that may just save her life. LINKS Deer Tribe: dtmms.org/ Amara Charles: www.amaracharles.com/ Quodoushka: www.quodoushka.org/ Ruda Center (aka the Ashram): rudracenter.org Follow us: Instagram: \u0026#64;wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info\u0026#64;wasiinacult.com Theme Song: www.maurastreppa.com Instagram/TikTok: \u0026#64;maurastreppamusic Spotify/Apple/Amazon Music/wherever you get your music: Maura Streppa This episode is brought to you by BetterHelp. Give online therapy a try at betterhelp.com/INACULT and get on your way to being your best self.",
      "release": "2024-02-12T05:06:55Z",
      "duration": "00:50:01.5730000",
      "explicit": false,
      "spotifyId": "27Sz6pWNRXT3dkwCS8kA8e",
      "appleId": 1000645024744,
      "subjects": [
        "Deer Tribe Metis Medicine Society"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/27Sz6pWNRXT3dkwCS8kA8e",
        "apple": "https://podcasts.apple.com/podcast/deer-tribe-part-2-this-is-not-sexual-healing/id1582863762?i=1000645024744"
      }
    },
    {
      "id": "fbb6b815-967c-40ed-9cbe-b5a00e3e8c4d",
      "title": "Deer Tribe — PART 1: “This Is Sexual Healing?\u0022",
      "description": "While attending college in Texas, a friend suggested that Kit attend a sweat lodge. Innocently, she did. Little did she know this sweat lodge was part of a bigger community known as ‘The Ashram\u0027. Soon she was recruited into more than just the sweat and before she knew it, she was in the inner circle.   Eventually, she would discover that this ashram was part of an even larger organization: The Deer Tribe Medicine Society. And one day she was recruited into a program that promised to heal her sexual trauma.  We’ll let you be the judge of how well that promise was fulfilled…    LINKS Deer Tribe: dtmms.org/  Amara Charles: www.amaracharles.com/  Quodoushka: www.quodoushka.org/  Ruda Center (aka the Ashram): rudracenter.org   Follow us: Instagram: @wasiinacult Support Us: https://www.patreon.com/wasiinacult Have a story to share on our show? Email us: info@wasiinacult.com",
      "release": "2024-02-05T07:21:15Z",
      "duration": "00:56:33.9060000",
      "explicit": false,
      "spotifyId": "2nkWp5F3yn1oOTdgv6RLER",
      "appleId": 1000644218793,
      "subjects": [
        "Deer Tribe Metis Medicine Society"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2nkWp5F3yn1oOTdgv6RLER",
        "apple": "https://podcasts.apple.com/podcast/deer-tribe-part-1-this-is-sexual-healing/id1582863762?i=1000644218793"
      }
    },
    {
      "id": "d8ff2137-a233-4830-be1b-10f4898d9dd1",
      "title": "Children of God: “You’re Enough As You Are” (UPDATE)",
      "description": "**NOTE: This episode originally ran in 2021**  **NEW EPS DROP NEXT WEEK MONDAY FEB 5th**  Welcome to the worst cult ever (in our humble opinions). This is a story of incredible resilience, bravery, and inspiration. Being born into a cult always comes with its challenges, but learning how to have an original thought in your mid-20s is a rare struggle that most people are fortunate enough to never have to face. This is just one of many obstacles Angel had to overcome as she ventured out of the cult and into the world. But when you\u0027ve spent over 20 years of your life in a cult and it\u0027s all you know, the real world isn\u0027t always as sparkly as you hoped. Find Angel: www.theprocessbyangel.com  Insta: @whatisangeldoing Youtube Channel: https://www.youtube.com/user/MrAngeladesantis Follow us: Insta @wasiinacult Email us with your story: info@wasiinacult.com Support us on Patreon: patreon.com/wasiinacult",
      "release": "2024-01-29T08:00:00Z",
      "duration": "00:41:56.7410000",
      "explicit": false,
      "spotifyId": "6faLrLC7xcF5Wvw1QSmrlg",
      "appleId": 1000643349602,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6faLrLC7xcF5Wvw1QSmrlg",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-youre-enough-as-you-are-update/id1582863762?i=1000643349602"
      }
    },
    {
      "id": "81e369ec-adb8-4cf7-8401-2ea5f48505e1",
      "title": "Thou Shan’t Be Named: “Non-Church Church” (UPDATE)",
      "description": "*NOTE: This episode originally ran in 2022*  TITLE: Thou Shan\u0027t Be Named: \u0022Non-Church Church\u0022 Non-Denominational Christianity. Sounds innocent enough, and for many non-denominational churches, it is. But for others, the non-affiliation creates a dangerous pathway to a choose your own adventure \u0022religion.\u0022 For Shannon Payton, it was an adventure all right, but not one she necessarily would\u0027ve chosen...if, of course, given the choice. Shannon has lived more of her life inside the cult than out, but this social media comedian is just starting to scratch the surface of having her voice heard. A voice, of course, that wasn\u0027t allowed to be heard for most of her life. And trust us, it\u0027s a voice worth hearing. Shannon now has her own podcast called: The Shanny Pants Show podcast. Check it out!  Find Shannon: www.shannypantsshow.com Follow Shannon: Insta/ TikTok @therealshannypants Follow us: Insta @wasiinacult  Email us: info@wasiinacult.com  Support us on Patreon: patreon.com/wasiinacult",
      "release": "2024-01-22T18:02:49Z",
      "duration": "00:53:47.5330000",
      "explicit": false,
      "spotifyId": "4LrqZTTkZWTOJdA0CZnPZW",
      "appleId": 1000642528579,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LrqZTTkZWTOJdA0CZnPZW",
        "apple": "https://podcasts.apple.com/podcast/thou-shant-be-named-non-church-church-update/id1582863762?i=1000642528579"
      }
    },
    {
      "id": "4e36ff9c-9a49-416a-a12e-bec563982696",
      "title": "WISE(aka Scientology) — “Stop interbulating me!”",
      "description": "Fresh to the workforce, Amber answered a job posting for a dental assitant: “No experience needed!” Looking for something reliable to support her new life as a single mother, she was thrilled when she got hired. Little did she know, her new job would be more than just dental work… —— We’ll be back in a few weeks with SEASON 3. Thank you for all your love and support! We appreciate you more than you know. To help us continue to create this show, please consider supporting us on Patreon. https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com",
      "release": "2023-05-15T01:29:53Z",
      "duration": "01:11:38.1610000",
      "explicit": true,
      "spotifyId": "6JIHTXHVjE84muuAQvNEFP",
      "appleId": 1000613040986,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6JIHTXHVjE84muuAQvNEFP",
        "apple": "https://podcasts.apple.com/podcast/wise-aka-scientology-stop-interbulating-me/id1582863762?i=1000613040986"
      }
    },
    {
      "id": "f4e34987-6b7e-461e-8426-0d98d2a2a804",
      "title": "Divine Madness: “Ultra Mara-con”",
      "description": "Colorado is known to draw the hippies, the free-thinkers, the adventurous… so when a group of alternative medicine devotees convinces our guest that they can cure her severe back pain, she’s open to suggestion. But soon, she finds herself sleeping in a van and questioning everything that got her to this point. —— Support us on Patreon!  https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com This episode is brought to you by BetterHelp. Give online therapy a try at www.betterhelp.com/INACULT and get on your way to being your best self.",
      "release": "2023-05-08T01:16:56Z",
      "duration": "00:52:37.2110000",
      "explicit": true,
      "spotifyId": "71YIeKak0qUQjWvMx3P6Sb",
      "appleId": 1000612132491,
      "subjects": [
        "Divine Madness Running Club"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/71YIeKak0qUQjWvMx3P6Sb",
        "apple": "https://podcasts.apple.com/podcast/divine-madness-ultra-mara-con/id1582863762?i=1000612132491"
      }
    },
    {
      "id": "347933c7-57a9-4a11-a420-ddbecd524682",
      "title": "Chung Moo Quan — Part 2: “Be Alright to Leave?”",
      "description": "Russell D. Johnson’s story continues. A journey into and out of a martial arts cult. …PART TWO… So Russell survives his emergency, life-threatening arm surgery, but shockingly, that won’t be the hardest thing. So the next question becomes… Can he survive the stalking and death threats that occur after he speaks up and out against the cult? Well, if anyone can, it’s our unassuming Bruce Banner… \u0027Cause watch out ya’ll… he’s about to “HULK SMASH!” —— Support us on Patreon!  https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com More Russell: Russell’s podcast: https://www.deceivedpodcast.com Gruesome arm pics (not for faint of heart): https://www.deceivedpodcast.com/gallery",
      "release": "2023-05-01T01:28:29Z",
      "duration": "00:40:04.8580000",
      "explicit": true,
      "spotifyId": "737R7eEDiU6gtPxuSSZsao",
      "appleId": 1000611267464,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/737R7eEDiU6gtPxuSSZsao",
        "apple": "https://podcasts.apple.com/podcast/chung-moo-quan-part-2-be-alright-to-leave/id1582863762?i=1000611267464"
      }
    },
    {
      "id": "037ffe5e-9ad5-4b22-8ccf-07e55476128c",
      "title": "Chung Moo Quan — Part 1: “Kult Fu Fighting”",
      "description": "It’s the 1970s and Kung Fu is all the rage. So when 16-year-old Russell Johnson looks to channel his (inner) rage, he signs up for a local class to learn how to become a peaceful warrior. Only what he doesn’t know is that what he signed up for would one day almost cost him his life… —— Support us on Patreon! Your donation is our salvation (we made that up but it sounded nice ‘n culty…) Truly, your contributions really do help. https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com Find Russell: https://www.deceivedpodcast.com And as promised, gruesome arm pics (not for the faint of heart): https://www.deceivedpodcast.com/gallery __ This episode is sponsored by Mindbloom. Take the first step and break free from your anxiety and depression with Mindbloom. Right now, Mindbloom is offering our listeners $100 off your first six session program when you sign up at Mindbloom.com/cult and use promo code CULT.  __ This episode is also sponsored by ZocDoc. Finding a trusted doctor has never been easier than with Zocdoc. Go to Zocdoc.com/INACULT and download the Zocdoc app for FREE. Then find a book a top-rated doctor today. ",
      "release": "2023-04-24T02:00:39Z",
      "duration": "00:54:14.4960000",
      "explicit": true,
      "spotifyId": "3sJRTnxfwVtcvemPuXaxXU",
      "appleId": 1000610336688,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sJRTnxfwVtcvemPuXaxXU",
        "apple": "https://podcasts.apple.com/podcast/chung-moo-quan-part-1-kult-fu-fighting/id1582863762?i=1000610336688"
      }
    },
    {
      "id": "66bcb7e7-8826-46a6-9bfa-b3a27568a014",
      "title": "Carol the Cult Assassin: \u0022Out of Fear Into Power\u0022",
      "description": "So you\u0027ve survived an abusive cult. Now what? What exactly are the legal options available to you? An investigative litigator who represents victims of cultic and religious abuse, Carol Merchasin, sat down with us to discuss just that. She is our hero. - Find Carol at Mcolaw.com. Support us on Patreon! : https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com",
      "release": "2023-04-17T04:00:00Z",
      "duration": "00:44:32.5910000",
      "explicit": false,
      "spotifyId": "5Uj7lbiuc34BxXCidGOizn",
      "appleId": 1000641082297,
      "subjects": [
        "Cult-Expert",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Uj7lbiuc34BxXCidGOizn",
        "apple": "https://podcasts.apple.com/podcast/carol-the-cult-assassin-out-of-fear-into-power/id1582863762?i=1000641082297"
      }
    },
    {
      "id": "d4857fe6-4450-4082-a512-33a6cece5cbc",
      "title": "Religious Texas Commune — Part 2: “The Least Beloved\u0022",
      "description": "Tamara, the beloved, has just been upgraded from the commune to the big house on the hill with the leader and his multiple wives. But it isn’t long before she realizes that the reason she thought she was brought to live with them is not the reason she is there at all… __ Support us on Patreon! : https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com Follow Tamara: https://tamaramc.com Twitter: @TamaraMCPhD Instagram: @tamaramcphd __ Today\u0027s episode is sponsored by BetterHelp. Visit Betterhelp.com/INACULT for 10% off your first month. This episode is also sponsored by Babbel. Purchase a Babbel subscription and get six months for the price of three. Go to Babbel.com and use code INACULT for three free months.",
      "release": "2023-04-10T16:46:43Z",
      "duration": "00:42:53.5430000",
      "explicit": true,
      "spotifyId": "0uxcv3mty4GWDVJOKB8gPh",
      "appleId": 1000608228008,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0uxcv3mty4GWDVJOKB8gPh",
        "apple": "https://podcasts.apple.com/podcast/religious-texas-commune-part-2-the-least-beloved/id1582863762?i=1000608228008"
      }
    },
    {
      "id": "a15e4487-f96e-413c-8605-4232b84b7e9d",
      "title": "Religious Texas Commune — Part 1: “The Most Beloved”",
      "description": "Raised by two Jewish parents, Tamara and her family are splintered when her father finds a new religion. Five-year-old Tamara is now forced to live two separate worlds. One with mom, going to public school… and one with Dad on a strict religious commune. When gifted the name “Beloved” by the leader, it’s not exactly the honor she was expecting.  Support us on Patreon!: https://www.patreon.com/wasiinacult Follow us on Instagram: @wasiinacult Have your own story and want to be on the show? Email us: info@wasiinacult.com Follow Tamara:  https://tamaramc.com Twitter: @TamaraMCPhD Instagram: @tamaramcphd - This episode is sponsored by Babbel. Purchase a Babbel subscription and get 6 months for the price of 3! Go to Babbel.com and use code INACULT for three free months.",
      "release": "2023-04-03T05:00:00Z",
      "duration": "00:39:27.9360000",
      "explicit": true,
      "spotifyId": "29b1aFGVxZdwa8Vv7d3eMQ",
      "appleId": 1000607056071,
      "urls": {
        "spotify": "https://open.spotify.com/episode/29b1aFGVxZdwa8Vv7d3eMQ",
        "apple": "https://podcasts.apple.com/podcast/religious-texas-commune-part-1-the-most-beloved/id1582863762?i=1000607056071"
      }
    },
    {
      "id": "51f5ab7c-f659-49c0-ba27-c01695a28862",
      "title": "Zendik Farm: \u0022Mating in Captivity\u0022",
      "description": "Imagine having to ask a group of eco-farmers for permission to have sex. And when granted permission, your options of consummation include… the back of a van or the loft of a goat barn.  Well that’s what happened when Helen Zuman, a spelling bee whiz looking to explore her interest in eco-farming, visited Zendik Farm in North Carolina shortly after graduating from Harvard.  A two-week experience turned into years of her life. And that, ladies and gentlemen, is how you spell… C-U-L-T.  - Support Was I In A Cult? on Patreon for goodies, extra content, and a chance to win a signed copy of Helen’s book: Mating in Captivity! Follow us on Instagram: @wasiinacult Contact us: Have a cult story of your own and want to share it on our show? Send us an email at info@wasiinacult.com. MORE ABOUT HELEN: https://helenzuman.com/ Find her book, Mating In Captivity, HERE.Follow Helen: Twitter - @HelenZuman // Instagram - @helenzuman - This episode is sponsored by the Wondery podcast This Is Actually Happening. Follow wherever you listen to podcasts. You can listen ad-free on the Amazon Music or Wondery App. This episode is also sponsored by ZocDoc. Go to Zocdoc.com/INACULT and download the Zocdoc app for FREE. Then find and book a top-rated doctor today.   ",
      "release": "2023-03-27T05:00:00Z",
      "duration": "01:08:52.1280000",
      "explicit": true,
      "spotifyId": "29En6TJx10PhBMQiklAmO4",
      "appleId": 1000606019670,
      "subjects": [
        "Zendik Farm"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/29En6TJx10PhBMQiklAmO4",
        "apple": "https://podcasts.apple.com/podcast/zendik-farm-mating-in-captivity/id1582863762?i=1000606019670"
      }
    },
    {
      "id": "10551979-15fb-4bfe-945c-41fff2491911",
      "title": "The Body of Christ Church: “When God is a House I Can’t Leave.”",
      "description": "Cults can be well-known, they can be obscure, and sometimes they can be hiding in plain sight. So when poet laureate Diannely’s family joins a seemingly “typical” church in Haverhill, Massachusetts… how does it become a cult? Let’s let her tell you.  - This episode is sponsored by BetterHelp. Give online therapy a try with 10% off your first month at betterhelp.com/INACULT. This episode is also brought to you by This Is Actually Happening. Follow wherever you get your podcasts, or listen ad-free on the Amazon Music or Wondery apps.  Find Diannely and her Whiting Award-winning book of poetry, Ugly Music, at DiannelyAntigua.com. Support Was I In A Cult? on Patreon! Visit patreon.com/wasiinacult.  Follow us on Instagram @wasiinacult. Have a story to share? Email us at info@wasiinacult.com or contact us at wasiinacult.com. ",
      "release": "2023-03-20T05:00:00Z",
      "duration": "00:55:27.0710000",
      "explicit": true,
      "spotifyId": "6ab5kboHJV3GOq9QzULpdK",
      "appleId": 1000604912082,
      "subjects": [
        "Body Of Christ Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ab5kboHJV3GOq9QzULpdK",
        "apple": "https://podcasts.apple.com/podcast/the-body-of-christ-church-when-god-is-a-house-i-cant-leave/id1582863762?i=1000604912082"
      }
    },
    {
      "id": "bbaa6e6a-0608-4587-80a7-afcf5038545c",
      "title": "SEASON 2 - COMING MARCH 6TH",
      "description": "More crazy cults, more wild stories, and more of us. Hosted by Tyler Measom and Liz Iacuzzi, Was I In A Cult? is a documentary-style podcast featuring far-out, first-hand stories of survivors who unwittingly joined, lived in, and escaped cults. Using levity and infotainment, the show humanizes the cultic experience and may leave some of our listeners asking themselves, \u0022Wait...was I in a cult?\u0022 You can support Was I In A Cult? through Patreon at patreon.com/wasiinacult and follow along with us on Instagram @wasiinacult.",
      "release": "2023-02-27T05:22:51Z",
      "duration": "00:01:00.0480000",
      "explicit": true,
      "spotifyId": "6RuPDQyvkdTmsTHdA2urlP",
      "appleId": 1000601809023,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RuPDQyvkdTmsTHdA2urlP",
        "apple": "https://podcasts.apple.com/podcast/season-2-coming-march-6th/id1582863762?i=1000601809023"
      }
    },
    {
      "id": "7d2f1060-44f2-4f39-a708-a1f9d97f5ec2",
      "title": "STATUS UPDATE: \u0022New Email Who Dis?\u0022",
      "description": "Liz and Tyler pop by to update you on their lives, and to reassure you that they will be back! Please support Was I In A Cult? Through Patreon  See omnystudio.com/listener for privacy information.",
      "release": "2022-08-23T09:00:00Z",
      "duration": "00:06:02.2660000",
      "explicit": false,
      "spotifyId": "3RzMlgybwW2HX00pK3dhIm",
      "appleId": 1000577074136,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3RzMlgybwW2HX00pK3dhIm",
        "apple": "https://podcasts.apple.com/podcast/status-update-new-email-who-dis/id1582863762?i=1000577074136"
      }
    },
    {
      "id": "e48d7be6-4dd8-403a-82da-37b8631d53f6",
      "title": "Millionaire’s Club: “The World Was Gonna Open Up”",
      "description": "Arianna was a recent college graduate with dreams of one day opening her own marketing company. So when a LinkedIn opportunity for a social media marketing assistant fell into her lap, it felt too good to be true.    Soon, she would be brushing shoulders with millionaires, in hopes that some of their mojo would rub off. After all, she had big plans for her future and a self-made father to prove herself to.    But, you know what they say about things being too good to be true…   They usually are.    This brave, inspiring woman is here to share her very important story of what exactly happened when she got involved with this Nashville “Millionaire’s Club.”   ____   Arianna on Instagram: @ariannasprabary   Arianna on TikTok: Aristrawberry0   Follow us on Instagram @wasiinacult   Have your own story? Email us: info@wasiinacult.com   Please support Was I In A Cult? Through Patreon  See omnystudio.com/listener for privacy information.",
      "release": "2022-02-10T11:45:00Z",
      "duration": "00:58:55.9600000",
      "explicit": false,
      "spotifyId": "5ercVEFHfPLQxrOv9JpmAV",
      "appleId": 1000550670436,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ercVEFHfPLQxrOv9JpmAV",
        "apple": "https://podcasts.apple.com/podcast/millionaires-club-the-world-was-gonna-open-up/id1582863762?i=1000550670436"
      }
    },
    {
      "id": "e219bb34-5247-4a7e-a2c2-417a6ec310ba",
      "title": "Armstrongism: “Saving For the Feast”",
      "description": "A humble upbringing is an understatement for Dan McIntrye. Canada born and bred, Dan’s cult journey took him from guitar god, to free desserts to cult escape, only to land him right in the arms of… another one?     A double survivor. A triple thriver. And one extremely nice guy. Damn, Canadians, you really are as kind as they say.   --------   Link to Dan\u0027s song \u0022Any Given Sunday\u0022   Listen to Tyler guest on the \u0022Latter-Day Lesbian\u0022 podcast!   Think you were in a cult? Contact us to be on the show: info@wasiinacult.com   Follow us: Instagram @wasiinacult Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2022-02-03T11:50:00Z",
      "duration": "00:59:32.5580000",
      "explicit": false,
      "spotifyId": "11EFmypt296f3OO1LO4HeB",
      "appleId": 1000549888936,
      "urls": {
        "spotify": "https://open.spotify.com/episode/11EFmypt296f3OO1LO4HeB",
        "apple": "https://podcasts.apple.com/podcast/armstrongism-saving-for-the-feast/id1582863762?i=1000549888936"
      }
    },
    {
      "id": "0ea673f1-7dd3-4b88-bf6c-7a70d3da8bbf",
      "title": "MLM LuLaRoe: “What’s your why?”",
      "description": "She’s a hustler, baby. And she just wants you to know.  Roberta Blevins was taught to be a self-starter. Inspired by her self-made father, she knew that if you put your mind to it, anything can happen. And it’s true. Anything can happen. But that’s the problem with anything. Anything sometimes includes MLM’s. Multi-level marketing (schemes).  This is a story of a dynamite go-getter and how she crawled her way into a box of fart leggings and eventually… crawled her way out.    ——   Follow Roberta’s Anti-MLM Movement:    Instagram - @therealrobertablevins @lifeaftermlmpodcast   Listen to her podcast “Life After MLM”: Spotify Apple   ——   Contact us with your stories to be featured on the show: info@wasiinacult.com   Follow us: Instagram  Please support Was I In A Cult? Through Patreon ——   Michael Scott tried his hand at a “new company idea”  See omnystudio.com/listener for privacy information.",
      "release": "2022-01-27T04:52:00Z",
      "duration": "00:57:57.4720000",
      "explicit": false,
      "spotifyId": "3xNFdvbY3jq6IsTy6epuwu",
      "appleId": 1000549128882,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3xNFdvbY3jq6IsTy6epuwu",
        "apple": "https://podcasts.apple.com/podcast/mlm-lularoe-whats-your-why/id1582863762?i=1000549128882"
      }
    },
    {
      "id": "1077ef0b-792b-4d3d-8b3b-486c939e3e61",
      "title": "Black Hebrew Israelites: “Cursed and Chosen”",
      "description": "Lauren’s initial years of her life, for lack of a better word, were quite normal. Along with her five siblings, she lived a very comfortable life in Corona, CA. Then one day, her once atheist father found religion.   And that discovery took him on a journey to finding “the truth”. A truth that would one day take the family all the way to Egypt.   —   Follow us: @wasiinacult instagram Contact us: info@wasiinacult.com Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2022-01-20T10:10:00Z",
      "duration": "00:49:41.1460000",
      "explicit": false,
      "spotifyId": "51xgL3kGhG40NRF5qV9WW5",
      "appleId": 1000548460887,
      "subjects": [
        "Black Hebrew Israelites"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/51xgL3kGhG40NRF5qV9WW5",
        "apple": "https://podcasts.apple.com/podcast/black-hebrew-israelites-cursed-and-chosen/id1582863762?i=1000548460887"
      }
    },
    {
      "id": "0052211e-ca9b-4601-8216-989637c58da8",
      "title": "Thou Shan’t Be Named: “Non-Church Church”",
      "description": "TITLE: Thou Shan’t Be Named: “Non-Church Church”  Non-Denominational Christianity. Sounds innocent enough, and for many non-denominational churches, it is. But for others, the non-affiliation creates a dangerous pathway to a choose your own adventure “religion.” For Shannon Payton, it was an adventure all right, but not one she necessarily would’ve chosen…if, of course, given the choice.    Shannon has lived more of her life inside the cult than out, but this social media comedian is just starting to scratch the surface of having her voice heard. A voice, of course, that wasn’t allowed to be heard for most of her life.    And trust us, it’s a voice worth hearing.   —   Follow Shannon: Insta/ TikTok @officialshannypants   Listen to our interview on The Daily Zeitgeist   Follow us: insta @wasiinacult Email us: info@wasiinacult.com   Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2022-01-12T22:29:00Z",
      "duration": "00:43:35.0920000",
      "explicit": false,
      "spotifyId": "0KX3fKRKZWTRujMuh6BExO",
      "appleId": 1000547723527,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0KX3fKRKZWTRujMuh6BExO",
        "apple": "https://podcasts.apple.com/podcast/thou-shant-be-named-non-church-church/id1582863762?i=1000547723527"
      }
    },
    {
      "id": "5b1e5962-b599-436f-a356-1ab56a823bdf",
      "title": "CHRISTMAS BONUS!: “Here Comes Santa Cult”",
      "description": "There are many a Christmas tale that we all know and love, but this one, dear listener, we can (almost) guarantee… that you have never ever heard this one.   ’Twas the night before Christmas and through the town’s center, not a creature was stirring, not even a cult member…   Merry Christmas \u0026 Happy Holidays! From our family, to yours.   ----   \u0022Was I In A Cult\u0022 Instagram   ----   Research NY TIMES ARTICLE FROM 1899: Mnason got arrested  GUILTY! After Mnason got out of prison, 1903 Thomas Nast Changed Santa  Mnason T Hunstman Obituary   Please support Was I In A Cult? Through Patreon  See omnystudio.com/listener for privacy information.",
      "release": "2021-12-22T17:11:00Z",
      "duration": "00:20:52.0750000",
      "explicit": false,
      "spotifyId": "0Sv3yw5rgwxpryBVjLTCfK",
      "appleId": 1000545834689,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Sv3yw5rgwxpryBVjLTCfK",
        "apple": "https://podcasts.apple.com/podcast/christmas-bonus-here-comes-santa-cult/id1582863762?i=1000545834689"
      }
    },
    {
      "id": "bf8ab496-4963-4dff-82af-07b6d447d23e",
      "title": "Hollyweirder: “Nothing is Free”",
      "description": "Hollywood is filled with the rich, the famous, and the people looking to take advantage of both. Because everyone in Hollywood is either someone, knows someone, or claims to be able to help you become someone. So when actress Lindsey McKeon, and singer/performer Jessica Sutta, stumble into an impressive acting class led by a teacher claiming to take their work to the next level, they don’t bat an eye. But it would be years of financial and emotional abuse disguised as self-growth before the two of them would realize… holy sh*t — their teacher turned “guru” is in fact… a cult leader.  Learn more about your ad-choices at https://www.iheartpodcastnetwork.comSee omnystudio.com/listener for privacy information.See omnystudio.com/listener for privacy information.",
      "release": "2021-12-16T13:05:00Z",
      "duration": "00:44:05.6030000",
      "explicit": false,
      "spotifyId": "31t8OGJjSI1uNFrt7FhJDs",
      "appleId": 1000545170307,
      "urls": {
        "spotify": "https://open.spotify.com/episode/31t8OGJjSI1uNFrt7FhJDs",
        "apple": "https://podcasts.apple.com/podcast/hollyweirder-nothing-is-free/id1582863762?i=1000545170307"
      }
    },
    {
      "id": "8c034a8b-c3f0-43ae-a92d-87cf29d1ef9b",
      "title": "Children of God: “You’re Enough As You Are\u0022",
      "description": "Welcome to the worst cult ever (in our humble opinions). This is a story of incredible resilience, bravery, and inspiration. Being born into a cult always comes with its challenges, but learning how to have an original thought in your mid-20s is a rare struggle that most people are fortunate enough to never have to face. This is just one of many obstacles Angel had to overcome as she ventured out of the cult and into the world.But when you’ve spent over 20 years of your life in a cult and it’s all you know, the real world isn’t always as sparkly as you hoped.____Insta: @whatisangeldoingYoutube Channel: https://www.youtube.com/user/MrAngeladesantishttps://www.theprocessbyangel.com  Learn more about your ad-choices at https://www.iheartpodcastnetwork.comSee omnystudio.com/listener for privacy information.See omnystudio.com/listener for privacy information.",
      "release": "2021-12-09T04:56:00Z",
      "duration": "00:40:03.1080000",
      "explicit": false,
      "spotifyId": "1HM6RmPbKl3ybf3N83dA9T",
      "appleId": 1000544388440,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1HM6RmPbKl3ybf3N83dA9T",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-youre-enough-as-you-are/id1582863762?i=1000544388440"
      }
    },
    {
      "id": "d7ec0431-32e6-4c85-8518-ea9ecd1b9c4f",
      "title": "Hollyweird: “Thief of Dreams\u0022",
      "description": "Los Angeles, CA is full of dreamers. After all, dreams are what people move to the City of Lost Angels to chase. But did anyone know that an acting teacher can turn into a cult leader? Is that even possible? Apparently stranger things have happened, because the answer is… Oh hell yes she can. Two former students studying under an acting coach turned self-help cult leader are here to share their harrowing stories of showing up with their dreams in their hands… but unfortunately, giving them over to the wrong “guide”. _ Podsauce ft. Liz Iacuzzi \u0026 Tyler Measom If you would like to be considered as a guest on the show, please contact us at info@wasiinacult.com Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-12-02T03:17:00Z",
      "duration": "00:56:25.1030000",
      "explicit": false,
      "spotifyId": "4JjT8T1Rb61Tg1mptvmEZT",
      "appleId": 1000543689523,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4JjT8T1Rb61Tg1mptvmEZT",
        "apple": "https://podcasts.apple.com/podcast/hollyweird-thief-of-dreams/id1582863762?i=1000543689523"
      }
    },
    {
      "id": "f3cc97ea-2515-4028-8e41-ebadc859cb4d",
      "title": "The Order: “Feel Like a Number”",
      "description": "When you\u0027re numbered among the Lord\u0027s anointed, you\u0027re supposed to feel special, but for Jeremy Tucker, he was just another mindless cog in the machine of the Kingdom of God. It didn\u0027t matter though, he would work hard to do his part, until that hard work nearly cost him his life…   From guest producer Lindsay Hansen Park.    https://www.yearofpolygamy.com/   https://sunstone.org/sunstone-history-podcast/   https://www.tiktok.com/@lindsayhansenpark?lang=en   Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-11-04T21:12:00Z",
      "duration": "00:51:17.7200000",
      "explicit": false,
      "spotifyId": "0HrTHz2rgOPXU4il726wrM",
      "appleId": 1000540812128,
      "subjects": [
        "Latter Day Church of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0HrTHz2rgOPXU4il726wrM",
        "apple": "https://podcasts.apple.com/podcast/the-order-feel-like-a-number/id1582863762?i=1000540812128"
      }
    },
    {
      "id": "a548e012-55d6-4b78-935b-7decc2387bb3",
      "title": "The Mel Lyman Family PT 2: “Wanted at the Big House\u0022",
      "description": "When you grow up in a cult, life on the outside can be rough. So rough, that one might actually prefer to stay inside the cult. When Guinevere finally experiences life on the outside, she witnesses firsthand that one can physically leave a cult, but mentally, still be in it.    And the moment of true clarity for Guinevere comes at a moment no one sees coming. Especially not herself.    ______   Guinevere’s Instagram: @guinevereturner   Twitter: @turnerguinevere   Link to Charlie Says: https ://www.netflix.com/title/81023720 Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-10-27T22:30:00Z",
      "duration": "00:37:43.4050000",
      "explicit": false,
      "spotifyId": "0H8EVzRmgQT2vnuSziQ9wC",
      "appleId": 1000539939048,
      "subjects": [
        "The Lyman Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0H8EVzRmgQT2vnuSziQ9wC",
        "apple": "https://podcasts.apple.com/podcast/the-mel-lyman-family-pt-2-wanted-at-the-big-house/id1582863762?i=1000539939048"
      }
    },
    {
      "id": "1c32f897-1800-45fb-87ea-70e781382e00",
      "title": "The Mel Lyman Family PT1: “People Get Ready“",
      "description": "As an actor and writer, Guinevere Turner understands more than most, that some stories just can’t be contrived. Because sometimes life is far stranger than fiction.    As is the case with Guinevere’s upbringing.    Not your typical getting out story, it would take years for Guinevere to understand that, no, she didn’t grow up on a hippie commune in the 1970s and 80s… she grew up in a cult.    ______   Guinevere’s Instagram: @guinevereturner / Twitter: @turnerguinevere   Link to Spotify playlist for this episode:  https://open.spotify.com/playlist/4OqNnobOP5tj3rB1tBytpC?si=dc2760b11c6f4e57 Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-10-20T19:15:00Z",
      "duration": "00:43:14.1680000",
      "explicit": false,
      "spotifyId": "5hvi6ErsTZgn7Zj65ML2z4",
      "appleId": 1000539210693,
      "subjects": [
        "The Lyman Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5hvi6ErsTZgn7Zj65ML2z4",
        "apple": "https://podcasts.apple.com/podcast/the-mel-lyman-family-pt1-people-get-ready/id1582863762?i=1000539210693"
      }
    },
    {
      "id": "7df0018b-0d2f-435a-a99c-34f457fc3c0c",
      "title": "Atypicult: “Mental Parental”",
      "description": "This is not your typical cult. But for comedian, Ariel, it was all she knew. Filled with isolation and abuse, it would take her years to break free.    Ariel’s Insta: @Arielsnotamermaid Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-10-13T10:00:00Z",
      "duration": "00:40:05.2760000",
      "explicit": false,
      "spotifyId": "7BfNfbKmvbKjm4L96ZRWuu",
      "appleId": 1000538440607,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7BfNfbKmvbKjm4L96ZRWuu",
        "apple": "https://podcasts.apple.com/podcast/atypicult-mental-parental/id1582863762?i=1000538440607"
      }
    },
    {
      "id": "b4675c8c-e918-44e2-b76d-35e545608c65",
      "title": "Children of God: “Pray for Death”",
      "description": "When you’re born into a cult, it’s difficult enough. But when you’re born into a cult with a raging alcoholic pedophile as the leader, it’s a nightmare.   Author, Flor Edwards was raised in the Children of God. And praise the lord she got out.    But getting out didn’t come without its own challenges…   ____   Link to Flor\u0027s autobiography:  https://www.amazon.com/Apocalypse-Child-Flor-Edwards/dp/1683367685   Follow Flor on social media: @floredwardsauthor Please support Was I In A Cult? Through Patreon  See omnystudio.com/listener for privacy information.",
      "release": "2021-10-06T11:00:00Z",
      "duration": "00:43:06.3830000",
      "explicit": false,
      "spotifyId": "3edBMXbPukHLn41AurQqTN",
      "appleId": 1000537721637,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3edBMXbPukHLn41AurQqTN",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-pray-for-death/id1582863762?i=1000537721637"
      }
    },
    {
      "id": "d0c821ef-102c-4705-8a96-4513615fcb83",
      "title": "Jehovah’s Witnesses: “Shut Up and Be Blessed“",
      "description": "With rockstar aspirations, Daniel O’Brien wasn’t looking for anything but a good time. But when heartbreak rocked his world, he tripped into something that lifted his spirits and rallied his hopes - the Jehovah’s Witnesses.    Before he knew it, Daniel had traded his guitar for a green Bible and found himself rapidly rising through the ranks of the religion. A wife, and two kids later, he was a fully indoctrinated, high ranking Elder in the church.   But when Daniel realizes that he’s part of a life much different than the one he originally signed up for, he knows that he must leave.    The only problem is… he can’t.   ___   If you, or anyone you know has ever been in a cult, please email us at info@wasiinacult.com, we’d love to hear from you. Your story could be featured in a future episode… Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-29T12:30:00Z",
      "duration": "00:47:40.7210000",
      "explicit": false,
      "spotifyId": "21IvhtxZQO9cJQ4cMJJ1WI",
      "appleId": 1000536988521,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21IvhtxZQO9cJQ4cMJJ1WI",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-shut-up-and-be-blessed/id1582863762?i=1000536988521"
      }
    },
    {
      "id": "a993dd66-d87d-41b5-802f-87268e6f21eb",
      "title": "Women Only Secret Society (NXIVM) PT 2: \u0022Collateral Damaged\u0022",
      "description": "“It’s exclusive,” she was told. A women only secret society.  She was a chosen one, after all.  A badass ninja warrior woman, she was ready to set the world on fire.  Finally surrounded by people that shared her same vision, she would do whatever it takes.  Jessica Joan was ready for anything. Well... almost anything.    __   If you, or anyone you know, has successfully escaped a cult, please reach out to us. We\u0027d love to hear from you and have your story and voice be heard on a future episode: info@wasiinacult.com Please support Was I In A Cult? Through Patreon     __   Jessica Joan\u0027s Instagram: https://www.instagram.com/lovejessjoan/?hl=en   You can purchase Jessica\u0027s book here: http://theuntouchablejessicajoan.comSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-22T12:30:00Z",
      "duration": "00:56:52.7930000",
      "explicit": false,
      "spotifyId": "0E0CDjoOQBkJaXyHZkCtTd",
      "appleId": 1000536272691,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0E0CDjoOQBkJaXyHZkCtTd",
        "apple": "https://podcasts.apple.com/podcast/women-only-secret-society-nxivm-pt-2-collateral-damaged/id1582863762?i=1000536272691"
      }
    },
    {
      "id": "b9efb4b4-e94b-4681-9e8d-056272ecdd17",
      "title": "Women Only Secret Society (NXIVM) PT 1: \u0022The Magic Sauce\u0022",
      "description": "When the LA party scene didn’t fit Jessica’s lifestyle anymore, she replaced martinis and after-hour clubs with green juices and tonic bars. But the reemergence of a childhood trauma forced her to examine her inner self.  One day, a friend told her about a class that could improve her life even more. That class turned out to be part of a larger entity. A self-empowerment company that purported to help you become the master of your own life.  A little group called… NXIVM. Jessica Joan\u0027s Instagram: https://www.instagram.com/lovejessjoan/?hl=en You can purchase Jessica\u0027s book here: http://theuntouchablejessicajoan.com Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-15T11:30:00Z",
      "duration": "00:49:05.5930000",
      "explicit": false,
      "spotifyId": "22tAbDchVWthXnDRVYhr2D",
      "appleId": 1000535408698,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22tAbDchVWthXnDRVYhr2D",
        "apple": "https://podcasts.apple.com/podcast/women-only-secret-society-nxivm-pt-1-the-magic-sauce/id1582863762?i=1000535408698"
      }
    },
    {
      "id": "02a01b65-d6aa-49d1-b964-9e43fb8e05e1",
      "title": "Mormon…More Women PT 2: \u0022I do… I do… I don’t.\u0022",
      "description": "Faced with the fear of an impending apocalypse, Joanne and her husband move to a small Utah town to live “Mormonism on steroids”, which means wearing long underwear, communicating with the dead, prophetic visions, odd temple rituals, cookies with Jesus, and the law of celestial marriage (i.e. polygamy). If you or someone you know has been in a cult and want to share your story, contact us at info@wasiinacult.com. We\u0027d love to hear from you. Link to Joanne\u0027s Book, \u0022It\u0027s Not About Sex My Ass: Confessions of an Ex-Mormon Ex-Polygamist Ex-Wife\u0022: https://www.amazon.com/Its-Not-About-Sex-Ex-Polygamist-ebook/dp/B008Q4D6E4 Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-08T10:15:00Z",
      "duration": "00:37:52.7570000",
      "explicit": false,
      "spotifyId": "3BFbp4kgfDoMn5tG0bHV0s",
      "appleId": 1000534681663,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BFbp4kgfDoMn5tG0bHV0s",
        "apple": "https://podcasts.apple.com/podcast/mormon-more-women-pt-2-i-do-i-do-i-dont/id1582863762?i=1000534681663"
      }
    },
    {
      "id": "e7707c44-d3f4-45bb-95b2-28c53d005bb8",
      "title": "Mormon…More Women PT 1: \u0022My Husband’s Wife\u0022",
      "description": "Faced with the fear of an impending apocalypse, Joanne and her husband move to a small Utah town to live “Mormonism on steroids”, which means wearing long underwear, communicating with the dead, prophetic visions, odd temple rituals, cookies with Jesus, and the law of celestial marriage (i.e. polygamy). If you or someone you know has been in a cult and want to share your story, contact us at info@wasiinacult.com We\u0027d love to hear from you. Link to Joanne\u0027s Book, \u0022It\u0027s Not About Sex My Ass: Confessions of an Ex-Mormon Ex-Polygamist Ex-Wife\u0022: https://www.amazon.com/Its-Not-About-Sex-Ex-Polygamist-ebook/dp/B008Q4D6E4 Please support Was I In A Cult? Through PatreonSee omnystudio.com/listener for privacy information.",
      "release": "2021-09-08T10:00:00Z",
      "duration": "00:35:59.3860000",
      "explicit": false,
      "spotifyId": "3P3AmH2jeTVricdgRkWg7w",
      "appleId": 1000534679142,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3P3AmH2jeTVricdgRkWg7w",
        "apple": "https://podcasts.apple.com/podcast/mormon-more-women-pt-1-my-husbands-wife/id1582863762?i=1000534679142"
      }
    }
  ]
}