{
  "id": "799fb5ac-1734-4609-85c0-6497a42cdc1c",
  "name": "Wasteland By Wednesday",
  "youTubeChannelId": "UC9xC86mUNxf_XudyBBkxb4g",
  "episodes": [
    {
      "id": "16c916c2-92f2-4fc1-99c9-46f036f8245d",
      "title": "Abandoned Doomsday Prepper Cult Compound (Wasteland Spotlight)",
      "description": "Take a guided tour of an abandoned and decaying old desert compound that was once the home to a religious cult of doomsday preppers. This place was once the home of the “Gothardite” followers of Bill Gothard, a religious fundamentalist preacher who gained fame and traction from his association with the Duggar family. The Duggars were the stars of the TLC show “17 Kids And Counting,” as well as a few spinoffs. They were themselves followers of Bill Gothard and his ideas about family and religion.\n\nThis particular group of Gothardites ended up taking a slightly different angle from Bill Gothard, embracing the idea of prepping for the biblical doomsday of Armageddon. Eventually, through drug use and other crimes, the group was broken up and their compound left to rust away under the hot desert sun.\n\nAnother Wasteland Spotlight for you, and here I will talk in detail about the lessons that can be learned from the fate this place faced, and the prepping wisdom that can be found in such ruins. The post-collapse world will be home to all sorts of survivors, both well-prepped and not so much. Some may end up being like these Gothardites with their strange fundamentalist beliefs and cult-like practices. Here you can get a preview of what such a compound may look like down the road.\n\nMore about the Institute in Basic Youth Conflicts, Bill Gothard\u0027s original organization, can be found on the following wikipedia page:\n\nhttps://en.wikipedia.org/wiki/Institute_in_Basic_Life_Principles\n\nFor more about the Duggar family and their connection to the Gothardites, here is another link that talks about the documentary:\n\nhttps://en.wikipedia.org/wiki/Shiny_Happy_People:_Duggar_Family_Secrets\n\n\n👍 Like, Comment, and Subscribe to support the channel and help spread The word!\n\nFor those who are interested in my in-depth analysis of the causes of collapse and how to be prepared for it, you can get my books on the subjects from Amazon:\n\nWasteland By Wednesday [https://amzn.to/3Th3a38] What collapse means and how it could happen soon.\n\nPrepping For Collapse [https://amzn.to/3IB2ArQ] How to get prepped for the global collapse of civilization.\n\nMore information, articles, and helpful links are available on my website [https://wastelandbywednesday.com/]\n\nThanks for watching!\n\n#abandoned #prepping #doomsday",
      "release": "2025-07-15T00:58:36Z",
      "duration": "00:39:37",
      "explicit": false,
      "youTubeId": "LCuZfzOCMv4",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LCuZfzOCMv4"
      }
    }
  ]
}