{
  "id": "39afca64-49ee-41ca-bfbf-b13c491a3e88",
  "name": "watchJojo",
  "youTubeChannelId": "UCDraeOigzyHfJCa7LJxf10w",
  "episodes": [
    {
      "id": "4ad8444d-cdbe-42b6-b5ec-2bfe9089b71e",
      "title": "The Heartbreaking Story of River Phoenix: From Cult Survivor to Hollywood Icon",
      "description": "The Heartbreaking Story of River Phoenix: A Life of Talent and Tragedy\n\nRiver Phoenix was the \u0022golden boy\u0022 of 1990s Hollywood—a brilliant actor, a passionate activist, and a clean-living icon. But on Halloween night in 1993, the world was shocked when he collapsed outside the Viper Room in Los Angeles.\n\nIn this video, we dive deep into the untold truth of River Phoenix’s life. From his traumatic childhood and his family\u0027s time in the \u0022Children of God\u0022 cult to his meteoric rise in legendary films like Stand By Me and My Own Private Idaho, we explore the complex layers of the man behind the movie star.\n\nIn this video, we explore:\n\nThe Cult Years: The difficult upbringing River and his siblings endured before escaping to America.\n\nThe Breakout: How his real-life sensitivity and pain fueled his most legendary performances.\n\nThe Activist: River’s pioneering work for animal rights and the environment long before it was \u0022cool\u0022 in Hollywood.\n\nThe Final Night: A respectful look at his final hours and the circumstances surrounding the tragedy at the Viper Room.\n\nThe Legacy: How his brother, Joaquin Phoenix, and the rest of the Phoenix family continue to honor his memory today.\n\nRiver Phoenix was more than just a tabloid headline. He was a sensitive soul who famously said he wanted to \u0022run to the rescue with love.\u0022 Join us as we remember his incredible talent, his unique spirit, and the lasting legacy he left on cinema.\n\nIf you enjoyed this deep dive into Hollywood history, please LIKE this video and SUBSCRIBE to the channel for more untold stories and biographies.\n\nRead MORE Articles: https://www.jojostories.com/\n\n\n➥➥➥  MY YouTube Channels➥➥➥\n\nWatchjojo Health     ⇢ http://bit.ly/2V6E9vc\nWatchjojo Animals  ⇢ http://bit.ly/3bQQCJ9\nWatchjojo MDS        ⇢ http://bit.ly/2P7Rtvv\nJojo Discovery         ⇢ https://bit.ly/3UpKw9j\n\n\n➥➥➥ FOLLOW ME ➥➥➥\n\nFacebook ⇢ https://www.facebook.com/WatchJojo-Stories-349669519123566/\n\n\n➥➥➥ For more videos and articles visit:➥➥➥\n\n▶ https://watchjojo.com/\n▶ https://www.jojostories.com/\n-------------------------------------------------------------------------\nFor Any Copyright Concerns, Contact Us at our email address. We will act upon your query immediately. Copyright@watchjojo.com\n\n\n\n\n#RiverPhoenix #HollywoodHistory #StandByMe #JoaquinPhoenix #TrueStory #90sNostalgia #Biographies #HollywoodTragedy",
      "release": "2026-01-08T18:53:29Z",
      "duration": "00:08:53",
      "explicit": false,
      "youTubeId": "wR1ZQkSWYCA",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wR1ZQkSWYCA"
      }
    }
  ]
}