{
  "id": "6ef44828-e811-4c8e-a7cb-158858c6edcc",
  "name": "Watchtower Examination",
  "youTubeChannelId": "UCmFy5skgfYsQ36UG1isMNSg",
  "episodes": [
    {
      "id": "806408fa-452e-4957-93a4-4de4f76c1dee",
      "title": "1,083 - PREVIEW - Stephen Lett\u0027s Shameless Projection | JWs Warned",
      "description": "I am lost for words to TRULY describe what is going on here. Of course, dubious people have been using the mind-controlling or propaganda device, PROJECTION, where the messenger seeks to shift focus from their evil by claiming others are guilty of it. \n\nIt makes them look all the more innocent in the eyes of their captives, because they seem to totally opposed to and disgusted by the very thing they are doing.\n\nStephen Lett and the governing body of \u0022Jehovah\u0027s Witnesses\u0022 take it to a new level - a new low. The hypocrisy is astounding, yet not surprising.\n\n____________________________\n\nDue to serious illness I am struggling to produce videos every day (as usual) or to work otherwise. I have very little income at this time\n\nTO SUPPORT THE CONTINUED PRODUCTION OF THESE VIDEOS\n\nTHE MOST CONVENIENT WAY TO HELP IS VIA XOOM.COM (a Paypal service)\nhttps://xoom.com - sending to JAMAICA to Winston Gilling, Montego Bay, St. James for JMMB - to debit card: 4263 6712 2603 6939.  Telephone: 1-876-344-1382\n\nThe second option is Paypal\nhttps://paypal.me/winstongg\n\nCONSIDER BECOMING A PATREON\nhttps://www.patreon.com/watchtowerexamination",
      "release": "2022-10-26T13:58:23Z",
      "duration": "00:03:42",
      "explicit": false,
      "youTubeId": "pSjPR-vH1as",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pSjPR-vH1as"
      }
    },
    {
      "id": "b1325330-68ec-4d63-ba2c-6a93ab92f25d",
      "title": "562 - Gerrit Losche Caught By His Own Words",
      "description": "The man who told Jehovah\u0027s Witnesses how they should not deceive by withholding relevant, pertinent information in order to paint a different picture, is found doing the very thing he prohibited.\n________________________\n\nSUPPORT THIS CHANNEL\nSubscribe to my other channel\nhttps://www.youtube.com/channel/UC5QU3kSoBiDU3uVWVHDs4vA\n\nDonate\nhttp://watchtowerexamination.com/support.html",
      "release": "2020-01-03T20:25:55Z",
      "duration": "00:28:21",
      "explicit": false,
      "youTubeId": "OOOSLnwqzdE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OOOSLnwqzdE"
      }
    },
    {
      "id": "a3477b1a-6dec-452e-8548-c9bc40ae8064",
      "title": "305 - Jehovah Had No People Until Rutherford Created Them",
      "description": "What Can I say?\n\nWATCHTOWER QUOTES USED \nThe ones calling on people with the hope-filled message of God’s new world are described at Acts 15:14 as “a people for [God’s] name.” Who bear Jehovah’s name and give the global witness about Jehovah and his Kingdom? The historical record of the 20th century answers: only Jehovah’s Witnesses.\nWatchtower – April 1, 1992, p12 par14\n\nIn 1931, the name Jehovah’s Witnesses was adopted by the Bible Students. Afterward, many letters of appreciation were published in this journal. “The good news that we are ‘Jehovah’s witnesses’ has thrilled us, and filled us with renewed determination to be worthy of the new name,” wrote one congregation from Canada.\nWatchtower – July 15, 2014, p24 par3\n\nJEHOVAH GOD is the Grand Identifier of his true messengers. He identifies them by making the messages he delivers through them come true. Jehovah is also the Great Exposer of false messengers. How does he expose them? He frustrates their signs and predictions. In this way he shows that they are self-appointed prognosticators, whose messages really spring from their own false reasoning—yes, their foolish, fleshly thinking!\nWatchtower - May 1, 1997, p8 par1\n\nReports are heard of brothers selling their homes and property and planning to finish out the rest of their days in this old system in the pioneer service. Certainly this is a fine way to spend the short time remaining before the wicked world’s end.\n\nBe not surprised, then, when in subsequent chapters we present proofs that the setting up of the Kingdom of God is already begun, that it is pointed out in prophecy as due to begin the exercise of power in A.D. 1878, and that the \u0027battle of the great day of God Almighty (Rev. 16:14) which will end in A.D. 1914 with the complete overthrow of earth\u0027s present rulership, is already commenced.\nThe Time Is At Hand, 1889 Ed., p. 101.\n\nIn view of this strong Bible evidence concerning the Times of the Gentiles, we consider it an established truth that the final end of the kingdoms of this world, and the full establishment of the kingdom of God, will be accomplished near the end of A.D. 1915.\nThe Time Is At Hand, 1915 edition, p. 99\n\nAlso, in the year 1918, when God destroys the churches wholesale, and the church members by millions, it shall be that any that escape shall come to the works of Pastor Russell, to learn the meaning of the downfall of Christianity.\nThe Finished Mystery, p485\n\nThe period must end in 1925. The type ending, the antitype must begin; and therefore 1925 is definitely fixed in the scriptures. every thinking person can see that a great climax is at hand. The Scriptures clearly indicate that the climax is the fall of Satan\u0027s empire, and the full establishment of the Messianic kingdom. This climax being reached by 1925\nGolden Age, Jan. 4, 1922, p. 217\n\nTherefore we may confidently expect that 1925 will mark the return of Abraham, Isaac, Jacob and the faithful prophets of old. \nMillions Now Living Will Never Die, pp89-90",
      "release": "2018-10-15T10:14:15Z",
      "duration": "00:10:41",
      "explicit": false,
      "youTubeId": "41W9v9TJ6iY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=41W9v9TJ6iY"
      }
    },
    {
      "id": "ff98c4db-0584-4d0e-a6c5-918245f0d94c",
      "title": "275 - Another Amazing Governing Body Denial",
      "description": "First it was M. Stephen Lett. Now it is Mark Sanderson. These men are really  a class act. At least,  they are consistent in one thing: They use the word, \u0022ridiculous\u0022 in their denial of the facts. \n\nTo demonstrate how ridiculous the \u0022lies\u0022 are, I give you some clips. Remove those clips and Witnesses would have charged that he was being taken out of context (the usual cover).\n\nVideo of Mark Sanderson\nhttps://tv.jw.org/#en/mediaitems/pub-jwb_201705_16_VIDEO",
      "release": "2018-09-03T07:22:54Z",
      "duration": "00:05:18",
      "explicit": false,
      "youTubeId": "kVKmiKjqXog",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kVKmiKjqXog"
      }
    },
    {
      "id": "c72774c3-1bac-42f8-b7b7-10d9a4105134",
      "title": "255 - 1 new light \u002B 10 discrepancies = 0 faithful and discreet slave",
      "description": "New information I gleaned from Watchtower literature and further analysis of what has already been revealed has not only discredited the Watchtower doctrine of the faithful and discreet slave; not only demonstrates that it is not not the governing body, but that no such thing actually exists.",
      "release": "2018-08-16T07:47:33Z",
      "duration": "00:11:44",
      "explicit": false,
      "youTubeId": "yOp51se09mw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yOp51se09mw"
      }
    },
    {
      "id": "62e80ded-b681-4cd6-b1a3-b15a5c886adb",
      "title": "219 - Who REALLY Is the Faithful Slave?",
      "description": "The identity of the \u0022faithful slave\u0022 has been a question asked in the Watchtower organization several times, with a number of reviews over the last 100 years.\n\nI believe the time has come for all Witnesses to ask that question again, given where the organization is today.",
      "release": "2018-06-10T11:00:04Z",
      "duration": "00:02:09",
      "explicit": false,
      "youTubeId": "TrIo-62mX88",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TrIo-62mX88"
      }
    },
    {
      "id": "85fd5136-5751-4895-95e3-724e4a675f03",
      "title": "207 -  Governing Body Exalts Self to Same Level AS GOD",
      "description": "Desperate that the truth about the Watchtower organization is coming out and members are leaving, the governing body is encouraging members to trust then on the same level as the Father and the Son.",
      "release": "2018-04-03T12:47:32Z",
      "duration": "00:18:25",
      "explicit": false,
      "youTubeId": "bCZuFXWqQ74",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bCZuFXWqQ74"
      }
    },
    {
      "id": "2c34601f-05e4-4564-9dc6-4b83dbd067b5",
      "title": "54 - Response to \u0022Poisonous Lies\u0022 (2013 Convention Speech)",
      "description": "As the title suggests, this is a response to a speech made at a Jehovah\u0027s Witness Convention in 2013, in Wisconsin, USA.\n\nLink to full speech:\nhttps://www.youtube.com/watch?v=5_AdAVbhMRg",
      "release": "2014-12-02T01:37:50Z",
      "duration": "00:12:46",
      "explicit": false,
      "youTubeId": "HKfQWAu-JBQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HKfQWAu-JBQ"
      }
    }
  ]
}