{
  "id": "32709c45-cf89-4cf6-b9f1-9da72b77fb56",
  "name": "WBNS 10TV",
  "youTubeChannelId": "UCAKK8dbcSmckr2sWJhv5ezA",
  "episodes": [
    {
      "id": "c1d94fbf-ecd2-41af-a5cb-e169966cb19b",
      "title": "\u0027Oust Wexner\u0027 banner hung at Ohio State, drawing connection to Jeffrey Epstein",
      "description": "A 36-foot-long hand-painted canvas banner with the face of Les Wexner hung from Ohio State\u0027s Knowlton School of Architecture on Wednesday.",
      "release": "2026-02-20T21:12:16Z",
      "duration": "00:02:52",
      "explicit": false,
      "youTubeId": "1sgx5IeNuuk",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1sgx5IeNuuk"
      }
    },
    {
      "id": "2ce82a7c-eeb6-41f6-ad56-56d20cf989eb",
      "title": "Les Wexner was deposed by a House committee in the Epstein investigation. Here\u0027s what happened",
      "description": "The billionaire behind the retail empire that once blanketed shopping malls with names such as Victoria’s Secret and Abercrombie \u0026 Fitch told members of Congress on Wednesday that he was “duped by a world-class con man” — close financial adviser Jeffrey Epstein. Les Wexner also denied knowing about the late sex offender’s crimes or participating in Epstein’s abuse of girls and young women.\r\n\r\n“I was naive, foolish, and gullible to put any trust in Jeffrey Epstein. He was a con man. And while I was conned, I have done nothing wrong and have nothing to hide,” the 88-year-old retired founder of L Brands said in a statement to the House Oversight and Reform Committee released before his interview.\r\n\r\nFULL STORY: https://www.10tv.com/article/news/local/les-wexner-deposed-house-committee-jeffrey-epstein-investigation/530-8a3ab5d1-3452-4855-b427-a4c4ec58e82a\r\n\r\nThe panel\u0027s Democrats had subpoenaed him after the latest Justice Department release of Epstein-related documents revealed new details about Wexner’s relationship with the well-connected financier. Ranking member Rep. James Comer, a Kentucky Republican, said that Wexner “answered every question asked of him” during the 6-hour proceeding and that a video and transcript would be released soon.\r\n\r\nWexner described himself to the lawmakers as a philanthropist, community builder and grandfather who always strove “to live my life in an ethical manner in line with my moral compass,” according to the statement. He said he was eager “to set the record straight” about his ties with Epstein. Their relation ended bitterly in 2007, after the Wexners discovered he\u0027d been stealing from them.\r\n\r\nAs one of Epstein’s most prominent former friends, Wexner has spent years answering for their decades-long association and he sought to use the proceeding to dispel what he called “outrageous untrue statements and hurtful rumor, innuendo, and speculation” that have shadowed him.\r\n\r\nRep. Robert Garcia, a California Democrat who sat in on Wednesday\u0027s interview, expressed skepticism in comments to reporters gathered near the proceeding.\r\n\r\n“There is no single person that was more involved in providing Jeffrey Epstein with the financial support to commit his crimes than Les Wexner,” he said.\r\n\r\nIn response to allegations by the prominent late Epstein victim Virginia Giuffre, who claimed in court documents that Wexner was among men Epstein trafficked her to, Wexner testified to utter devotion to his wife of 33 years, Abigail. He said he\u0027d never once been unfaithful “in any way, shape, or form. Never. Any suggestion to the contrary is absolutely and entirely false.”\r\n\r\nWexner\u0027s name appears more than 1,000 times in the Epstein files, which does not imply guilt and Wexner has never been charged with any crimes. His spokesperson said the number of mentions is not unexpected given their long-running ties.",
      "release": "2026-02-19T00:51:04Z",
      "duration": "00:08:06",
      "explicit": false,
      "youTubeId": "FGsFtkvlun8",
      "subjects": [
        "Human Trafficking",
        "Abercrombie \u0026 Fitch",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FGsFtkvlun8"
      }
    },
    {
      "id": "ff56ed98-ee7e-4d8a-a7c8-f2931283220a",
      "title": "Les Wexner issues statement related to Epstein investigation: \u0027An abuser, a crook, and a liar\u0027",
      "description": "In his three-page statement, Wexner said that he was pleased to testify because \u0022it is an opportunity to set the record straight.\u0022",
      "release": "2026-02-19T00:03:43Z",
      "duration": "00:02:47",
      "explicit": false,
      "youTubeId": "1YWNI1Q_R4Y",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1YWNI1Q_R4Y"
      }
    },
    {
      "id": "c1b446b8-ac94-46b9-8637-35fa41ddece9",
      "title": "Examining Les Wexner\u0027s relationship with Jeffrey Epstein",
      "description": "Lawmakers on Wednesday said they believe Wexner is downplaying his relationship with Epstein.",
      "release": "2026-02-18T22:24:27Z",
      "duration": "00:02:10",
      "explicit": false,
      "youTubeId": "QVZsorpzbrQ",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QVZsorpzbrQ"
      }
    },
    {
      "id": "7ac9bba1-cf09-449c-8bd5-fc13a906f906",
      "title": "House committee deposing Les Wexner holds press conference",
      "description": "The U.S. House Oversight and Government Reform Committee held a press conference on Les Wexner\u0027s deposition on Wednesday.",
      "release": "2026-02-18T20:26:35Z",
      "duration": "00:25:55",
      "explicit": false,
      "youTubeId": "EbTm_Gkk0Xs",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EbTm_Gkk0Xs"
      }
    },
    {
      "id": "ee202b05-abe5-45ba-8527-5e603b1af599",
      "title": "Democrats on Oversight Committee discuss Lex Wexner deposition — watch live",
      "description": "Democrats are discussing the deposition of Columbus billionaire Les Wexner in the congressional investigation of Jeffrey Epstein.",
      "release": "2026-02-18T16:56:00Z",
      "duration": "00:36:27",
      "explicit": false,
      "youTubeId": "yh_pXqXhIt0",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yh_pXqXhIt0"
      }
    },
    {
      "id": "1717c893-4056-44e3-b07d-9abbd8c4b9d8",
      "title": "Les Wexner scheduled to be deposed in Epstein investigation",
      "description": "Les Wexner is scheduled to be deposed next week by the U.S. House in connection with the Epstein investigation.",
      "release": "2026-02-13T22:43:52Z",
      "duration": "00:02:08",
      "explicit": false,
      "youTubeId": "pybn-IIGaQM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pybn-IIGaQM"
      }
    },
    {
      "id": "695d7ab3-b6f7-485c-bf26-aff4aac04fbd",
      "title": "\u0027Soldiers of Christ\u0027 killing unsettles Korean Americans in Georgia and stokes fear of cults",
      "description": "The slaying of a South Korean woman during an initiation process for a group that called itself Soldiers of Christ has shocked the large Korean American community in metro Atlanta. \n\nCommunity leaders say Korean Americans need to be more vigilant to protect against religious cults and the possible exploitation of new arrivals from South Korea. \n\nPolice discovered 33-year-old Sehee Cho\u0027s emaciated body in September in the trunk of a car left outside a Korean spa. The spa is located in an area of metro Atlanta dubbed “The Seoul of the South” for its abundance of Korean businesses. \n\nProsecutors have lodged murder charges against three brothers, their mom, and three others.",
      "release": "2024-01-08T16:01:05Z",
      "duration": "00:01:59",
      "explicit": false,
      "youTubeId": "9yMCsQPWcbc",
      "subjects": [
        "Soldiers of Christ"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9yMCsQPWcbc"
      }
    }
  ]
}