{
  "id": "9d0143a7-7136-4a2d-95a6-fce30136720a",
  "name": "We are listening!",
  "spotifyId": "4BttXbF3UFQmBHmqCN0TyB",
  "appleId": 1803114599,
  "youTubeChannelId": "UCzrz3IuCUAlbhWGbQh9nsFA",
  "episodes": [
    {
      "id": "0e45c7ce-ca14-4718-984b-b36a5bf1a02f",
      "title": "Escaping Control, Embracing Consciousness: A Cult Survivor\u0027s Journey to Freedom and Healing with Isabella Young",
      "description": "What happens when the very place you seek healing becomes the cage that breaks you?\n\nIn this powerful and deeply human episode of We Are Listening, host Pulkit Garg, Founder of Aanya Wellness, sits down with Isabella Young—a woman whose journey through trauma, loss, and awakening redefines what it means to heal and reclaim freedom.\n\nSeventeen years ago, Isabella escaped from a messianic cult after enduring unimaginable emotional and spiritual abuse, and the devastating loss of her son. Raised in an atheist household that dismissed faith as weakness, Isabella’s search for meaning led her into the arms of a spiritual leader who promised enlightenment—but delivered control, manipulation, and psychological imprisonment instead.\n\nIn this unfiltered conversation, Isabella takes us through the chilling realities of cult programming, the invisible chains of mind control, and the lifelong process of rebuilding self-trust. She shares how nature, meditation, and what she calls “expanding consciousness” became her lifelines to reclaim sovereignty over her mind, body, and spirit.\n\nFrom identifying red flags in controlling relationships to helping loved ones recognize cult-like behaviors, Isabella’s insights are a wake-up call for anyone navigating spiritual spaces or searching for belonging in a noisy, complex world.\n\nThe episode also explores her book, New Human of New Earth, where she bridges ancient Lemurian wisdom with modern healing practices—inviting listeners to step into their divine humanity and reconnect with the Earth.\n\nThis is not just a story of survival—it’s an invitation to awaken.\nIf you’ve ever questioned your beliefs, struggled with self-doubt, or felt trapped by invisible systems of control, this episode reminds you that healing begins when you choose awareness.\n\n Share your thoughts, triggers, or experiences anonymously on our mental health platform linked in the description—because at We Are Listening, your story truly matters.\n\nSubscribe to \u0022We Are Listening\u0022 for an enriching conversation that unveils the transformative potential of conscious breathing. Join us as we learn, listen, and breathe our way to holistic well-being.\n\nAre you also looking to share your knowledge with the world? If yes, please schedule an introductory call with our team: https://calendly.com/aanya-wellness/explore-synergies\n\nWe run a community of wellness experts, where we help foster more meaningful relationships and value adds for our members. Join the community by sharing your interest here: https://forms.gle/fQLDZt8u2sTEVSoL6\n\nAlso, we run a free initiative to help you with your mental health struggles. Vent out all you want today: https://facebook.com/wearelisteningaw\n\nBe a part of the Aanya Wellness wellness community: https://forms.gle/4ABZspqs1a1CSXEW7",
      "release": "2025-10-04T10:11:33Z",
      "duration": "01:07:48",
      "explicit": false,
      "spotifyId": "2y1ntDC1HXpCp0q9GifofF",
      "appleId": 1000730072680,
      "youTubeId": "iHu4jvqQbCc",
      "subjects": [
        "Louix Dor Dempriey"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2y1ntDC1HXpCp0q9GifofF",
        "apple": "https://podcasts.apple.com/podcast/escaping-control-embracing-consciousness-a-cult/id1803114599?i=1000730072680",
        "youtube": "https://www.youtube.com/watch?v=iHu4jvqQbCc"
      }
    }
  ]
}