{
  "id": "03f6aeff-399b-48c7-ba5f-8251b09632c9",
  "name": "We Are Chaffee: Looking Upstream",
  "spotifyId": "2MpJqmsxpaXLUCWScIJsx5",
  "appleId": 1643156341,
  "episodes": [
    {
      "id": "ba458b62-3efc-4861-8247-44a30b901909",
      "title": "Thuy Nguyen, on self-empowerment \u0026 breaking free from a cult-like religion, overcoming postpartum depression, choosing gratitude \u0026 the pursuit of joy",
      "description": "Thuy Nguyen is a poet, writer and speaker on self-empowerment. She came up in a cult-like religious environment. When Thuy was a teen, she was preyed upon by a church leader and, ultimately, shunned by that community. Adam talks with Thuy about those experiences, how she broke free from the church, and what she’s learned about leadership, accountability and forgiveness in the process. They also talk about mental health, including Thuy’s experience of postpartum depression – the fear, the extreme paranoia – and how she worked her way through that and found the light again.__________ We Are Chaffee\u0027s Looking Upstream podcast is a collaboration with Chaffee County (Colo.) Public Health and the Chaffee Housing Authority, and is supported by the Colorado Public Health \u0026 Environment: Office of Health Disparities. You can see show notes, read the show transcript, and learn more about the Looking Upstream podcast (and related storytelling initiatives) at wearechaffee.org , and on Instagram @wearechaffeepod . We Are Chaffee (wearechaffee.org) partners with KHEN radio (khen.org) in Salida, Colo., for local broadcasting of the Looking Upstream podcast. Credits Adam Williams, host, producer and photographer; Jon Pray, engineer and producer; Andrea Carlstrom, Director of Chaffee County Public Health and Environment; Lisa Martin, We Are Chaffee Community Advocacy Coordinator; and Heather Gorby, logo and web design.",
      "release": "2024-05-21T12:15:00Z",
      "duration": "01:11:27.9780000",
      "explicit": false,
      "spotifyId": "42dPzFxjdnlIBqQoLWafz6",
      "appleId": 1000656263528,
      "urls": {
        "spotify": "https://open.spotify.com/episode/42dPzFxjdnlIBqQoLWafz6",
        "apple": "https://podcasts.apple.com/podcast/thuy-nguyen-on-self-empowerment-breaking-free-from/id1643156341?i=1000656263528"
      }
    }
  ]
}