{
  "_ts": 0,
  "id": "cf288bf6-cbd3-4a0b-92e1-fed4f47ce18b",
  "name": "We Can Do Hard Things with Glennon Doyle",
  "spotifyId": "0eFL5HJejQHZrdgAFdPnOm",
  "appleId": 1564530722,
  "episodes": [
    {
      "id": "dea12419-d752-4f02-9fe8-6fdbabfc71e0",
      "title": "How to Know if You’re in a Cult with Tia Levings (Pt. 2)",
      "description": "370. How to Know if You’re in a Cult with Tia Levings (Pt. 2) Glennon, Amanda, and Abby welcome back Tia Levings for part two of this amazing conversation on her experience leaving a high control Christian Fundamentalist cult. Tia shares her experience leaving the church and her husband and offers advice for others in a similar situation. Discover: -The life-saving power of women sharing their stories—and why it threatens patriarchy -How she finally heard her own voice—and how you can find yours, too -Why people crave fundamentalism—and a solution they’re searching for -Tia’s life-saving advice for women escaping abuse or high-control groups More on Tia: Tia Levings is the New York Times Bestselling author of A Well-Trained Wife, her memoir of escape from Christian Patriarchy. She writes about the realities of Christian fundamentalism, evangelical patriarchy, and religious trauma. She also appeared in the hit Amazon docu-series, Shiny Happy People. Based in North Carolina, she is mom to four incredible adults and likes to travel, hike, paint, and daydream. Find her on social media @TiaLevingsWriter. To learn more about listener data and our privacy practices visit: https://www.audacyinc.com/privacy-policy Learn more about your ad choices. Visit https://podcastchoices.com/adchoices",
      "release": "2024-12-12T05:01:00Z",
      "duration": "01:01:25.3020000",
      "explicit": false,
      "spotifyId": "4PuZgNd1LkixhF1kBasZlg",
      "appleId": 1000680097665,
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4PuZgNd1LkixhF1kBasZlg",
        "apple": "https://podcasts.apple.com/podcast/how-to-know-if-youre-in-a-cult-with-tia-levings-pt-2/id1564530722?i=1000680097665"
      }
    },
    {
      "id": "4a0d27d1-bd94-4129-86e0-c93d931b18fe",
      "title": "Trad Wife Cults: How Tia Levings Escaped (Pt 1)",
      "description": "369. Trad Wife Cults: How Tia Levings Escaped (Pt 1) Glennon, Amanda, and Abby sit down with Tia Levings, NYT bestselling author, to discuss her experience in a high control Christian Fundamentalist cult: her journey from indoctrination to freedom to healing from religious trauma. Discover: -Why strong women are often drawn into Christian extremism—and how they can break free -Why parents are taught to hit infants, and husbands are taught to spank their wives -The hidden agenda behind why Christian Fundamentalists encourage large families -The moment Glennon busted her kids out of Christian school -The eerie crossover of wellness culture and Christian extremism More on Tia: Tia Levings is the New York Times Bestselling author of A Well-Trained Wife, her memoir of escape from Christian Patriarchy. She writes about the realities of Christian fundamentalism, evangelical patriarchy, and religious trauma. She also appeared in the hit Amazon docu-series, Shiny Happy People. Based in North Carolina, she is mom to four incredible adults and likes to travel, hike, paint, and daydream. Find her on social media @TiaLevingsWriter. To learn more about listener data and our privacy practices visit: https://www.audacyinc.com/privacy-policy Learn more about your ad choices. Visit https://podcastchoices.com/adchoices",
      "release": "2024-12-10T05:01:00Z",
      "duration": "00:52:25.3770000",
      "explicit": false,
      "spotifyId": "6EL5fu62nCdxa37FAMdOd8",
      "appleId": 1000679842847,
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6EL5fu62nCdxa37FAMdOd8",
        "apple": "https://podcasts.apple.com/podcast/trad-wife-cults-how-tia-levings-escaped-pt-1/id1564530722?i=1000679842847"
      }
    },
    {
      "id": "e634e3c6-ac54-4ac5-bca7-4fb52ec1a7a2",
      "title": "157. CULTS: How NXIVM Controlled Women \u0026 How Sarah Edmondson Helped Take It Down",
      "description": "1. How attending a personal development training at a Holiday Inn led to Sarah being branded in a sex \u0022secret sisterhood\u0022 initiation ceremony. 2. Her path from top recruiter to the whistleblower who helped take down the cult and its leader Keith Ranieri.  3. Why we’re all susceptible to cult culture – the need for belonging, the temptation of simplification, and how we’re trained to deny our gut instincts.  CW: Discussion of cult culture and sexual coercion  About Sarah:  Sarah Edmondson is an actor, podcaster, author, and cult-recovery advocate.  Sarah has starred in a number of TV series, yet she is most recently known for her real-life saga escaping the multi-level marketing company NXIVM – and DOS, a “secret sisterhood” within NXIVM – which can also be seen on HBO’s The Vow. Sarah’s memoir Scarred shares her true story from the moment she joined NXIVM, to her harrowing fight to get out and bring its founder to justice. Sarah co-hosts the podcast A Little Bit Culty with her husband Anthony ‘Nippy’ Ames, and lives in Atlanta with her husband and two sons.  TW: @sarahjedmondson IG: @sarahedmondson  Sarah’s resource page: https://www.sarahedmondson.com/resources Steven Hassan’s BITE model: https://freedomofmind.com/cult-mind-control/bite-model/   To learn more about listener data and our privacy practices visit: https://www.audacyinc.com/privacy-policy     Learn more about your ad choices. Visit https://podcastchoices.com/adchoices",
      "release": "2022-12-06T00:00:00",
      "duration": "01:02:11.4610000",
      "explicit": false,
      "spotifyId": "4zBhOz6gkFo2Y3gGKoV91B",
      "appleId": 1000588973492,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4zBhOz6gkFo2Y3gGKoV91B",
        "apple": "https://podcasts.apple.com/podcast/157-cults-how-nxivm-controlled-women-how-sarah-edmondson/id1564530722?i=1000588973492"
      }
    }
  ]
}