{
  "id": "903e676e-4ea3-4322-94e1-a9d3e574bd71",
  "name": "We Need To Talk with Paul C. Brunson",
  "spotifyId": "5f3h5kIP4imtOLs1p3Z6bG",
  "appleId": 1765126946,
  "youTubeChannelId": "UCzt4U1I0Wn-mWwZSOQp9lbQ",
  "episodes": [
    {
      "id": "6c1756f9-8708-45ff-9e96-fe0f6bda7d5a",
      "title": "Rose McGowan “Hollywood Was Worse Than The Cult I Escaped”",
      "description": "After being shut out of Hollywood, Rose McGowan explains how she was forced to step away - and slowly rebuild her life on her own terms. Rose speaks openly about her experiences in Hollywood, the cost of refusing to stay silent, and how leaving the industry became part of reclaiming her creativity, identity and sense of self. Rose was one of the first to go public with claims of sexual assault against Harvey Weinstein, and she explains how she was allegedly raped by the movie producer at the age of 23 - and what it cost her to speak out. She reflects on the severe personal and professional consequences that followed. Content warning: this conversation includes discussion of sexual assault. From being raised in a cult in Italy to navigating Hollywood, she reflects on how early experiences shaped her instincts around control, belonging and survival. She also speaks about what came after: the unexpected support she found through fans and Comic-Con, stepping away from the US to recover in Mexico, reconnecting with creativity through music, and why reclaiming her real name - Rosa - feels like coming home. She shares: ◽ What it was like growing up inside The Children of God ◽ Being alone at 13 and realising no one was looking for her ◽ Why speaking out about Harvey Weinstein meant career death ◽ What was really happening behind the scenes on Charmed ◽ The truth behind the VMA dress and what people misunderstood ◽ Nearly losing her life, leaving the US and starting again ◽ How fans, creativity and music helped bring her back to herself Rose McGowan, We Need To Talk Support charities: Survivor’s Trust: https://g2ul0.app.link/HOj44LvWZUb CALM: https://g2ul0.app.link/uULaUXcM3Nb MIND: https://g2ul0.app.link/gbuRaxjM3Nb Follow me here: https://www.instagram.com/needtotalk https://www.tiktok.com/@weneedtotalkpod Support Rose here: Website: https://www.rosemcg.com/ Instagram: www.instagram.com/rosemcgowan/ (00:00) Intro (02:23) How Does Rose Identify? (03:39) \u0027The Children of God\u0027 and the Circumstances of Rose\u0027s Upbringing (04:31) How Do You Define a Cult? (06:47) Rose\u0027s Father and His Role Within \u0027The Children of God\u0027 (09:31) The Beginnings of Rose\u0027s Career in Performance (12:05) The British Court Ruling on \u0027The Children of God\u0027 (14:22) How Rose Left \u0027The Children of God\u0027 and Her First Experiences in the USA (19:32) Rose\u0027s Friction With Her Mother\u0027s Partners (22:42) Rose\u0027s Experience With Her Father in the USA (24:35) Rose\u0027s Perspective of Herself as a Teenager (26:12) Being Forced To Go To Rehab at 13 (29:59) How Rose Left Rehab and What She Did Afterwards (33:22) Rose\u0027s Attraction to Performing (34:25) How Rose\u0027s Relationship With Her Father Developed During Adolescence (38:42) Paul Surprises Rose With a Photo (41:51) Adobe Express Ad (43:11) How and Why Rose Moved to Hollywood (52:19) Rose\u0027s First Featured Film Role (55:35) Rose\u0027s Early Experiences of Hollywood\u0027s Inner Workings (58:29) How Rose Met Harvey Weinstein (01:01:52) Rose Details Her Encounter With Harvey Weinstein (01:07:11) How Weinstein Covered His Tracks (01:16:45) Sexual Assault and Its Prevalence in Society (01:23:35) Rose\u0027s Relationship With Marilyn Manson (01:32:11) How Rose Joined Charmed (01:40:00) Fame During Charmed and How Rose Dealt With It (01:42:27) Rose\u0027s Relationship With Robert Rodriguez (01:49:47) What Led Rose to Activism and the MeToo Movement (01:59:24) How Rose Felt When Harvey Weinstein Was Convicted (02:03:39) Rose on Public Perception of Her (02:04:54) How and Why Rose Moved to Mexico (02:07:40) How Rose Bounced Back From Health Issues During Covid (02:08:17) Rose\u0027s Unexpected Entry Into the UK Music Scene (02:12:39) What Rose Would Tell Her 12-Year-Old Self (02:13:59) Most Memorable Conversation (02:18:34) Paul’s Takeaways Sponsored by: Adobe Express: https://ADOBE.LY/PAUL Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2026-01-06T06:00:00Z",
      "duration": "02:20:56.2560000",
      "explicit": false,
      "spotifyId": "6K4vlENvYu8WnYe4lK4rPB",
      "appleId": 1000743928550,
      "youTubeId": "CRBvUVNEBFk",
      "subjects": [
        "Children Of God",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6K4vlENvYu8WnYe4lK4rPB",
        "apple": "https://podcasts.apple.com/podcast/rose-mcgowan-hollywood-was-worse-than-the-cult-i-escaped/id1765126946?i=1000743928550",
        "youtube": "https://www.youtube.com/watch?v=CRBvUVNEBFk"
      }
    }
  ]
}