{
  "_ts": 0,
  "id": "9daa71e7-e45b-4748-862a-921fb6158a98",
  "name": "Weird Reads with Emily Louise",
  "youTubeChannelId": "UCs4nw0vqSbymJ-ZguMS2-RQ",
  "youTubePlaylistId": "PLCRLHPUjJzAEKc8gmD4jV9fTGh0KZ3SnN",
  "episodes": [
    {
      "id": "d947b05e-43db-4f17-bbf8-326dde1fd756",
      "title": "The Bizarre Cult of Brother Carson and the Solar Temple",
      "description": "This is the story of the Bizarre Cult of Brother Carson and the Solar Temple. On October 12th, 1935, The Vancouver Sun in Canada ran a front page article that would’ve immediately captured the attention of just about anyone passing by. It read, ‘Husband Seeks Ban On Cult’ and the contents were bizarre and salacious — there were allegations of theft, hypnosis, mysterious telephone calls and even a kidnapping. Little was known about this strange Vancouver sect or the man that led them. Who were they and did they really hypnotize a woman, ultimately kidnapping her?\n\nYou can support the channel by joining my Patreon:\nhttps://www.patreon.com/weirdreadsemilylouise\n\nCHAPTERS\n00:00 INTRO\n00:40 AD BREAK\n01:46 PART ONE: NEW THOUGHT \u0026 THE UNITY FELLOWSHIP\n07:48 PART TWO: THE SOLAR TEMPLE\n17:57 PART THREE: KIDNAPPED?\n25:36 PART FOUR: OH BROTHER, WHERE ART THOU?",
      "release": "2024-05-09T22:00:31Z",
      "duration": "00:30:02",
      "explicit": false,
      "youTubeId": "ZNUpGqJae8I",
      "subjects": [
        "Brother Carson",
        "Order of the Solar Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZNUpGqJae8I"
      }
    },
    {
      "id": "7684d804-62e2-41e0-9095-2c324706fb9a",
      "title": "Cranks, Christ and Cults with Fundie Fridays | Weird Reads with Emily Louise LIVE",
      "description": "Thank God for Fundie Fridays! Tonight’s guests are Reverend Jen and King James, a married couple who just so happen to be my favourite YouTube creators. Their hilarious and well researched deep dives into Christian fundamentalism and conservative politics are not only incredibly entertaining, but are also helping people to deconstruct harmful belief systems and ultimately improve their lives. From The Duggars and Abby Shapiro to Amy Carlson and George Santos — they seek to make big, important topics easier to deal with for their audience with thorough analysis, compassionate insight and rowdy humor.\n\nWe\u0027ll be talking about conservative cranks, Christian fundamentalism, cults and so much more!",
      "release": "2024-04-14T01:19:51Z",
      "duration": "01:53:26",
      "explicit": false,
      "youTubeId": "CS4J9n4mFL0",
      "subjects": [
        "Christian Fundamentalist",
        "Institute In Basic Life Principles",
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CS4J9n4mFL0"
      }
    },
    {
      "id": "6a52babe-e90c-4530-8701-6c2bf7c73328",
      "title": "The Cult That Manifested A Baby",
      "description": "In July 1938 a startling announcement rocked the city of Richmond, Virginia — the twin ray of Jesus Christ had been received in the form of a two month old baby, and it was here to usher in a new Golden Age. The three people at the center of the claim were devout disciples of Guy and Edna Ballard’s I AM Activity — a bizarre proto-new age movement that had stirred controversy and accusations of being a cult throughout the 1930s. Their claim of precipitating, or manifesting the twin ray, culminated in a disturbing all-night ritual, charges of insanity, a mysterious abduction, a court case, and an even deeper, more earthly mystery at the heart of it all. \n\nYou can support my work on Patreon:\nhttps://www.patreon.com/weirdreadsemilylouise\n\nYou can watch my original video on the Cult of I AM here:\nhttps://www.youtube.com/watch?v=jsKt4edO98w\n\nCHAPTERS\n00:00:00 INTRO\n00:02:03 PART ONE: THE TWIN FLAME OF JESUS\n00:21:30 PART TWO: THE STORY FALLS APART\n00:33:40 PART THREE: LOCKED UP\n00:39:58 PART FOUR: THE LAWSUIT\n00:50:27 PART FIVE: THE MYSTERY OF LUCILLE SILVER\n\nTWITTER 🐦\nhttps://twitter.com/Weirdreadsemily\n\nINSTAGRAM 📷\nhttps://www.instagram.com/weirdreadsemilylouise/",
      "release": "2024-04-11T20:00:08Z",
      "duration": "01:07:25",
      "explicit": false,
      "youTubeId": "LFMx36MGuVU",
      "subjects": [
        "Saint Germain Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LFMx36MGuVU"
      }
    },
    {
      "id": "3b1261da-08c3-445d-bb23-23964db5e94c",
      "title": "The Cult of Aristasia (Part 1) with Reid @seriations | Weird Reads with Emily Louise LIVE",
      "description": "My guest this week is the insightful and endlessly knowledgeable Reid, aka @seriations on Twitter. He is an independent historian of science, focusing on the intersection of espionage and the occult in the Cold War. From controversial figures like Ira Einhorn and James Shelby Downard, and topics like starseeds, UFOs and Atlantis, Reid\u0027s highly informative Twitter threads and podcast appearances are must-reads/listens. \n\nThis week he joins me to explore the bizarre cult of Aristasia. Why were so-called \u0022traditionalists\u0022 making violent video games? Why were they seemingly obsessed with corporal punishment? And how are they linked to fascism? Let\u0027s find out!\n\nFollow Reid on Twitter:\nhttps://twitter.com/seriations",
      "release": "2024-03-24T01:51:51Z",
      "duration": "02:42:02",
      "explicit": false,
      "youTubeId": "ThXke7peG64",
      "subjects": [
        "Silver Sisterhood"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ThXke7peG64"
      }
    },
    {
      "id": "787a3a03-f4bb-4b5b-9e0f-69bc6cdcf543",
      "title": "The Self Help Cult That Tried To Raise an IMMORTAL BABY : The Master Metaphysicians",
      "description": "Use code EMILYLOUISE16 for up to 16 FREE MEALS \u002B 3 Surprise Gifts across 6 HelloFresh boxes plus free shipping at https://bit.ly/3QInkAM\n\nJames B. Schafer and his Royal Fraternity of Master Metaphysicians are definitely one of the strangest and least well known self help cults to be born out of the economic depression of the 1930\u0027s. They hit the headlines when they claimed to be raising a baby named Jean to be immortal -- she was to be reared on a diet of vegetarianism and positive thinking. She would be Miss Immortality, designed to live forever! But did you know that their experiment in immortality was actually inspired by none other than author of Think and Grow Rich, Napoleon Hill?\n\nJoin me as we dive deep into yet another strange cult tale from the early 20th century!\n\nSpecial thanks to Triskaidekapho13ic for helping source archive materials \u0026 creating an actual sources document for me.\n\nSOURCES 📜 \nhttps://bit.ly/3noo68Y\n\nEnjoyed the video? You can support me directly via Ko-Fi☕ \nhttps://bit.ly/3ugO5AN \n\nCHAPTERS 🕮 \n00:00 Introduction\n02:42 Part I : It\u0027s All In The Mind\n12:19 Part II : Royal Fraternity of Master Metaphysicians\n22:07 Part III : The Immortal Baby Jean\n28:48 Part IV : The Downfall of the Spiritual Gigolo\n39:50 Part V : An Untimely End\n\nOTHER STUFF\n🎥 TikTok 🎥 @weirdreadsemilylouise \n📷 Instagram 📷 @weirdreadsemilylouise \n🐦 Twitter 🐦 @weirdreadsemily",
      "release": "2022-06-30T20:00:02Z",
      "duration": "00:46:20",
      "explicit": false,
      "youTubeId": "80Gl74Sra04",
      "subjects": [
        "Royal Fraternity of Master Metaphysicians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=80Gl74Sra04"
      }
    },
    {
      "id": "5f1d312d-28eb-45c6-b431-dfaf80077e0b",
      "title": "The Cult of I AM : The WILD Story of Guy \u0026 Edna Ballard\u0027s New Age Religious Movement",
      "description": "CW : Anti-s*mitism, f*cism…and me ranting about capitalism (again).\n\nThe new age world is murky, filled with ascended masters, violet flames and people talking about their \u0022I AM presence\u0022 - but where did all of that come from? \n\nIn the 1930\u0027s, Guy \u0026 Edna Ballard started their cult of I AM - a new age religious movement and offshoot of Helena Blavatsky\u0027s theosophical teachings, and the work of neo-theosophists like Alice Bailey and C.W Leadbeater. They were guided by the ascended masters - a group of spiritual advisors that Guy, Edna and their son Donald claimed to have direct contact with, including Jesus and St Germain.\n\nBut behind the brightly coloured charts and strangely aesthetically appealing artwork, lies a more sinister story, connecting this world of new age woo-woo directly to f*scists and right-wing ideology that\u0027s still very much present to this day.\n\nEnjoyed the video? You can support me directly via Ko-Fi☕ \nhttps://bit.ly/3ugO5AN \n\nSpecial thanks to Triskaidekapho13ic for helping source archive materials \u0026 creating an amazing sources document for me...\n\nSOURCES 📜 \nhttps://bit.ly/3O8OAXZ\n\nCHAPTERS 🕮 \n00:00:00 INTRO\n00:01:30 PART I: A Man, A Mountain \u0026 A Master\n00:20:28 PART II : SILVER SHIRTS \u0026 SILVER TONGUES\n00:38:49 PART III : TAKING THE SHOW ON THE ROAD\n00:58:20 PART IV : FRAUD, FEDS \u0026 THE FINAL ASCENSION\n01:14:59 PART V : THE MIGHTY I AM LEGACY\n\nMUSIC\nPart I : Godstar by Psychic TV\nPart II : Nothing To Me by Sanford Clark\nPart III : Brother Love’s Traveling Salvation Show by Neil Diamond\nPart IV : No Money In My Pocket - Bobby Womack\nPart V : I Am What I Am by Gloria Gaynor\nTitle : Moon Is Blue by Colourbox\n\nOTHER STUFF\n📷 Instagram 📷 @weirdreadsemilylouise \n🐦 Twitter 🐦 @weirdreadsemily \n\nP.S I\u0027m sorry I disappeared for two months. This video took a LOT of research and reading to put together, and I actually filmed an entirely different version that I wasn\u0027t happy with. Thank you for watching and remembering I exist xoxo",
      "release": "2022-04-13T20:00:02Z",
      "duration": "01:26:36",
      "explicit": false,
      "youTubeId": "jsKt4edO98w",
      "subjects": [
        "Saint Germain Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jsKt4edO98w"
      }
    },
    {
      "id": "86269ffe-ffdb-4851-9785-b4bfbdbab976",
      "title": "The Cult of the Great Eleven : May Otis Blackburn\u0027s DEADLY Divine Order",
      "description": "There have been so many disturbing cults throughout history, but May Otis Blackburn’s Divine Order of the Royal Arms of the Great Eleven has to be one of the weirdest…and obscure.\n\nMay and her daughter Ruth were trying to make it in Hollywood, but instead they were visited by Archangel Gabriel, who told them that they were the two witnesses from the Book of Revelations. But the story doesn’t stop there, and it gets a whole lot stranger…\n\nWe covered this case on my podcast, Dial Femme for Murder, and we’re hoping to have Samuel Fort on soon to discuss his excellent book, The Cult of the Great Eleven which I highly recommend reading!\n\nLISTEN TO THE PODCAST HERE 📻 \nhttps://open.spotify.com/show/48bpBUCx3c59aLcscDlXhe \n\nSpecial thanks to Triskaidekapho13ic for helping source archive materials \u0026 creating an actual sources document for me\n\nSOURCES 📜 \nhttps://bit.ly/3AT7cVP\n\nEnjoyed the video? You can support me directly via Ko-Fi☕ \nhttps://bit.ly/3ugO5AN \n\nCHAPTERS 🕮 \n00:00 Introduction\n01:34 Origins\n06:51 City of Angels\n11:05 Building a Cult\n18:27 Samuel Rizzio\n22:05 The Body Under The Floorboards\n27:38 The Sacrifice at Simi Valley\n32:54 Things Fall Apart\n39:35 Final Thought\n\nOTHER STUFF\n🎥 TikTok 🎥 @weirdreadsemilylouise \n📷 Instagram 📷 @weirdreadsemilylouise \n🐦 Twitter 🐦 @weirdreadsemily",
      "release": "2022-02-03T21:59:44Z",
      "duration": "00:42:23",
      "explicit": false,
      "youTubeId": "TUyNVg3qQ1A",
      "subjects": [
        "Blackburn Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TUyNVg3qQ1A"
      }
    },
    {
      "id": "efbfd82c-d4d3-4c91-ba42-13a6491eb5a8",
      "title": "Edgar Cayce : Sleeping Prophet or FRAUD?",
      "description": "Edgar Cayce is one of America\u0027s most famous so-called “psychics” of all time, and widely known as one of the architects of the modern New Age movement, as well as being the \u0022sleeping prophet\u0022.\n\nIn this video, we trace the strange story of Edgar Cayce\u0027s life - from his origins in Hopkinsville, Kentucky, to his years tapping into “Source”, his time spent trying to cash in on the Texas oil boom and his later readings on everything from Atlantis to the origin of humanity. \n\nWas Edgar Cayce a fraud, or was he the real deal?\n\nHonestly, I think he was a successful grifter that cashed in on the growing popularity of alternative medicine and trance healing, as well as new age ideas that had been popularized by Helena Blavatsky and other theosophists. \n\nSome of his ideas were incredibly harmful and discriminatory - but I’ll let you watch and form your own opinions! As always, sound off in the comments below. ALSO - did you notice I got a new camera? I hope so otherwise that was a waste of money lol.\n\nSUPPORT THE CHANNEL ON KO-FI ☕ \nhttps://bit.ly/3ugO5AN \n\nSOURCES 📜 \nhttps://bit.ly/3GTaiv4 \n\nLISTEN TO MY PODCAST 📻 \nhttps://open.spotify.com/show/48bpBUCx3c59aLcscDlXhe \n\nOTHER STUFF \n🎥 TikTok 🎥 @weirdreadsemilylouise \n📷 Instagram 📷 @weirdreadsemilylouise \n🐦 Twitter 🐦 @weirdreadsemily \n\nCHAPTERS 🕮 \n00:00:00 Introduction\n00:00:32 Part One : The Early Years\n00:11:38 Part Two : Hello, Source? It’s me, Edgar!\n00:22:02 Part Three : Boom \u0026 Bust\n00:35:30 Part Four : Meeting the Metaphysical\n00:46:45 Part Five : From Virginia to Atlantis\n00:56:42 Part Six : Building the Hospital\n01:04:09 Part Seven : Prophecies \u0026 Revelations\n01:11:34 Part Eight : His Legacy\n01:16:39 Outro\n\nSpecial thanks to Triskaidekapho13ic for helping source materials and being an all-round research God.\n\n#edgarcayce #sleepingprophet",
      "release": "2022-01-24T19:27:57Z",
      "duration": "01:16:55",
      "explicit": false,
      "youTubeId": "aoPvYGtNHlU",
      "subjects": [
        "Association for Research and Enlightenment"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aoPvYGtNHlU"
      }
    },
    {
      "id": "b2c9657e-f173-47fd-ac22-a710c1ef7dc4",
      "title": "Who was Helena Blavatsky? | The Grandmother of the New Age \u0026 Founder of Theosophy",
      "description": "Helena Blavatsky was the founder of the Theosophical Society and widely known as the Grandmother of the New Age. In this video, I dive into her life - from her aristocratic upbringing, to her years of travelling around the world, to controversy, her teachings and her legacy.\n\nThis is the first part in a forthcoming series on the New Age and UFO cults. It’s important to understand Helena Blavatsky first, because she created so much of what we know as “new age”, and almost every group that we’ll be talking about takes something from her. I am so excited to share this new series with you all. I\u0027ve been fascinated by new religious movements and cults for a long time, and I wanted to find a way to talk about them that doesn’t feel exploitative. I think it’s important to remember that inside all of these movements/cults is someone who has a family and people that love them, and often there are victims too.\n\nI know this video was quite historical, so let me know what you think in the comments. Also what do you think of the new filming set up? It feels more…cosy? Idk. Sound off down below.\n\nAlso I feel like my explanation of \u0022Aryan\u0022 was incredibly brief and over simplified and I\u0027d urge you all to go and read this article. It didn\u0027t actually start with H*tler --\nhttps://bit.ly/3GnVYtY\n\nPlease heed the TW at 42:50 - it gets bad!\n\nSOURCES\nhttps://bit.ly/3Iz8AQT\n\nSUPPORT THE CHANNEL ON KO-FI ☕\nhttps://bit.ly/3ugO5AN\n\nLISTEN TO MY PODCAST 📻\nhttps://spoti.fi/3tl9RTF\n\nWRITE ME A LETTER 💌\nweirdreadsemilylouise@gmail.com\n\nOTHER STUFF\n🎥 TikTok 🎥 @weirdreadsemilylouise\n📷 Instagram 📷 @weirdreadsemilylouise\n🐦Twitter 🐦 @weirdreadsemily\n\nCHAPTERS 🕮\n00:00:00 INTRO \n00:00:39 PART 1 : CHILDHOOD\n00:08:46 PART 2: MARRIAGE \u0026 TRAVELS\n00:19:12 PART 3: TIBET\n00:22:51 PART 4: AMERICA\n00:27:47 PART 5: THEOSOPHY\n00:31:12 PART 6: ISIS UNVEILED\n00:35:50 PART 7: INDIA\n00:40:55 PART 8: MAHATMA LETTERS\n00:42:56 PART 9: SECRET DOCTRINE\n00:51:47 PART 10: LATER LIFE\n01:01:13 PART 11: LEGACY\n\nFAIR USE NOTICE\n~ I believe all content used in this video falls under the remit of Fair Use. This video contains copyrighted material the use of which has not always been specifically authorized by the copyright owner. I am including such material in my effort to advance the public understanding of this case, as well as providing legitimate criticism - both of which are included under US fair use and UK fair dealing law in regards to copyright. ~\n\nCSC : 12,737\n\n#helenablavatsky #theosophy #newage",
      "release": "2021-12-10T17:00:23Z",
      "duration": "01:05:17",
      "explicit": false,
      "youTubeId": "gzews0N1Bw8",
      "subjects": [
        "Theosophical Society"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gzews0N1Bw8"
      }
    },
    {
      "id": "7e8f4733-65ba-45b2-90e4-342eb1639757",
      "title": "Where is Shelly Miscavige? MISSING for over 15 years...",
      "description": "Today we\u0027re going to be diving deep into the disappearance of Shelly Miscavige and the Church of Scientology to find out what really happened - is Shelly Miscavige missing, or is she a prisoner of belief?\n\nI\u0027m truly fascinated with cults \u0026 religions and Scientology has been one of my favourite religious organisations to look into for a while now. I think I\u0027ve watched almost every documentary, from John Sweeney on the BBC, to Louis Theroux, Going Clear, Leah Remini\u0027s show and obviously the great journalism from Tony Ortega. I wanted to talk about Shelly Miscavige on here for a while because, from the outside, it seems like a terrifying mystery...the first lady of Scientology that went missing. However, when you dig into it, you find - in my opinion - an even more terrifying story of coercive control and years of religious indoctrination -- ALLEGEDLY.\n\nAnyway, I hope you enjoy this video and I definitely have a lot more videos on cults \u0026 religious organisations coming up. Also, go listen to mine and Martyn\u0027s podcast -- we post every Tuesday and cover true crime, cults and conspiracies!\n\nSUPPORT THE CHANNEL ON KO-FI ☕\nhttps://bit.ly/3ugO5AN\n\nSOURCES \u0026 CLIPS 📜 \nhttps://bit.ly/scientologysources\n\nLISTEN TO MY PODCAST 📻\nhttps://spoti.fi/3tl9RTF\n\nWRITE ME A LETTER 💌\nweirdreadsemilylouise@gmail.com \n\nOTHER STUFF\n🎥 TikTok 🎥 @weirdreadsemilylouise\n📷 Instagram 📷 @weirdreadsemilylouise\n🐦 Twitter  🐦 @weirdreadsemily \n\nCHAPTERS 🕮\n00:00 INTRO\n01:43 WHAT IS SCIENTOLOGY?\n15:33 WHO ARE SHELLY \u0026 DAVID MISCAVIGE?\n18:33 BECOMING A POWER COUPLE\n22:22 A DARK TURN\n25:35 TOM CRUISE\n27:40 THE DISAPPEARANCE\n29:23 THE WEDDING \u0026 LEAH REMINI\n37:35 THE PRISON OF BELIEF\n41:18 OUTRO\n\n~ I believe all content used in this video falls under the remit of Fair Use. Fair use principles under Section 107 of the Copyright Act allow the unlicensed use of copyrighted materials for fair use purposes, such as commentary, criticism, teaching, and news reporting. ~\n\nPlease don\u0027t fair game me. I literally own nothing. All clips and sources used are attributed in the sources document that I\u0027ve linked to.\n\nCSC : 7,535\n\n\n#shellymiscavige #scientology #leahremini",
      "release": "2021-10-21T16:00:27Z",
      "duration": "00:42:12",
      "explicit": false,
      "youTubeId": "yafGp3T8aYo",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yafGp3T8aYo"
      }
    },
    {
      "id": "85e9fd6c-fb07-4f68-b146-df493680cfa2",
      "title": "The INSANE story of the Love Has Won cult \u0026 Amy Carlson | DEEP DIVE",
      "description": "This video is a deep dive into Love Has Won and Amy Carlson/Mother God, their beliefs, the well documented abuse of followers, the allegations of fraud and other criminal connections, Amy’s ill health, and ultimately her death. From the Galactic Free Press, to Love Has Won, I hope this video goes some way to explaining the cult and why they are dangerous. I have no doubt I’ll be making a part two of this video as more information surfaces, now that they are finally being investigated.\n\nMany thanks to Eve, Milo, Sammy, Ryan and all of the teams at Rising Above Love Has Won and Love Has Won Exposed for helping me put this video together.\n\nSUPPORT THE CHANNEL\nhttps://bit.ly/3ugO5AN \n\nFOLLOW ME EVERYWHERE\nhttps://linktr.ee/EmilyLouise1989 \n\nLISTEN TO MY PODCAST\nhttps://spoti.fi/3tl9RTF \n\nWhat makes Love Has Won a cult?\nhttps://bit.ly/3ui4Njg \n\nKD Wells “My History with Amy Carlson” \nhttps://bit.ly/3aSOyl9 \n\nRising Above Love Has Won\nhttps://bit.ly/3u93HX3 \n\nLove Has Won Exposed\nhttps://bit.ly/3vzHodm \n\nLove Has Won Subreddit\nhttps://bit.ly/2SdUL4u\n\n\nTIMESTAMPS\n00:00 : Intro\n01.39 : How I found Love Has Won\n03:00 : Who are Love Has Won?\n10:04 : Origins of Love Has Won : 2009 - 2018\n19:07 : Jason Castillo\n21:12 : Follower Abuse\n28:58 : Leaving a follower for dead in the desert\n31:20 : How do they recruit?\n33:58 : Allegations of fraud\n39:27 : Crime, missing people and corruption\n44:22 : Hawaii and Dr Phil\n46:34 : Amy’s health\n51:19 : Body found, investigation begins\n54:31 : What can you do?\n56:52 : Outro\n\n#lovehaswon #amycarlson #mothergod",
      "release": "2021-05-03T17:00:29Z",
      "duration": "00:57:15",
      "explicit": false,
      "youTubeId": "f81Az_2Fvek",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f81Az_2Fvek"
      }
    }
  ]
}