{
  "_ts": 0,
  "id": "5fcf4aec-7db9-4fab-ad84-36727fbb3e28",
  "name": "Weird Darkness: Stories of the Paranormal, Supernatural, Legends, Lore, Mysterious, Macabre, Unsolved",
  "spotifyId": "37Mt3y93mEngswlPIdl2x8",
  "appleId": 1078714736,
  "youTubeChannelId": "UC4YrsvKZRo_P0PYesZb8aMQ",
  "episodes": [
    {
      "id": "52c06319-dd50-401d-9d25-d8c808318751",
      "title": "“The CULT of COMETS and CASTRATION: Inside HEAVEN’S GATE” #WeirdDarkness",
      "description": "Heaven’s Gate wasn’t just another doomsday cult—it was a chilling fusion of sci-fi, Christian prophecy, and absolute control that led 39 people to their final, otherworldly exit. IN THIS EPISODE: Following an anonymous tip, police enter a mansion in Rancho Santa Fe, an exclusive suburb of San Diego, California, and discover 39 victims of a mass suicide. The deceased–21 women and 18 men of varying ages–were all found lying peaceably in matching dark clothes and Nike sneakers and had no noticeable signs of blood or trauma. It was later revealed that the men and women were members of the “Heaven’s Gate” religious cult, whose leaders preached that suicide would allow them to leave their bodily “containers” and enter an alien spacecraft hidden behind the Hale-Bopp comet. *** PLUS, the creepy true-crime story of two men who were caught trying to steal the body of the 16th President of the United States, Abraham Lincoln. But that is by no means the end of this story full of twists, turns, myths, and conspiracies. CHAPTERS \u0026 TIME STAMPS (All Times Approximate)… 00:00:00.000 = Heaven’s Gate, Part 1 00:01:10.830 = Show Open 00:02:53.580 = Heaven’s Gate, Part 2 00:10:00.270 = Heaven’s Gate, Part 3 00:24:29.552 = Heaven’s Gate, Part 4 00:45:19.851 = Stealing Lincoln’s Bones 00:58:30.720 = Show Close, Verse, and Final Thought SOURCES AND RESOURCES FROM THE EPISODE… Episode Page at WeirdDarkness.com (includes list of sources): https://weirddarkness.com/HeavensGate “Heavens Gate” by Rolling Stone: http://bit.ly/WeirdDarkness2D7tbeZ, Ranker: http://bit.ly/weirddarkness2UIsK4O, and History.com: http://bit.ly/WeirdDarkness2G3uqfN “Stealing Lincoln’s Bones” by Troy Taylor: https://www.americanhauntingsink.com/stealing-lincolns-bones ===== Darkness Syndicate members get the ad-free version. https://weirddarkness.com/syndicate Info on the next LIVE SCREAM event. https://weirddarkness.com/LiveScream Info on the next WEIRDO WATCH PARTY event. https://weirddarkness.com/TV ===== (Over time links seen above may become invalid, disappear, or have different content. I always make sure to give authors credit for the material I use whenever possible. If I somehow overlooked doing so for a story, or if a credit is incorrect, please let me know and I will rectify it in these show notes immediately. Some links included above may benefit me financially through qualifying purchases.) = = = = = \u0022I have come into the world as a light, so that no one who believes in me should stay in darkness.\u0022 — John 12:46 = = = = = WeirdDarkness® is a registered trademark. Copyright ©2025, Weird Darkness. ===== Originally aired: November 28, 2021",
      "release": "2025-03-01T01:00:07Z",
      "duration": "00:59:47.2390000",
      "explicit": false,
      "spotifyId": "5hCqFQyHv8QtlrNVCV70o5",
      "appleId": 1000696906615,
      "youTubeId": "wJ0TQtha3bc",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5hCqFQyHv8QtlrNVCV70o5",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-comets-and-castration-inside/id1078714736?i=1000696906615",
        "youtube": "https://www.youtube.com/watch?v=wJ0TQtha3bc"
      }
    },
    {
      "id": "2fc1f70b-2666-48a1-a324-d12645e738f5",
      "title": "“THE JONESTOWN MASSACRE AND THE PSYCHOLOGICAL ISSUES IT CAUSED TO FIRST RESPONDERS”",
      "description": "We’ll look not only at the horrible events of the Jonestown massacre itself, but what life was like for those in The Peoples Temple cult before the mass suicide took place. Plus, we’ll look through the eyes of first responders who came upon the grizzly scene immediately after, and how they dealt with the horrors they stepped into.\n\nSOURCES AND REFERENCES FROM THE EPISODE…\n“Jonestown: Modern History’s Largest Mass Suicide” by Kellen Perry for AllThat’sInteresting.com: https://tinyurl.com/y3ccb3q5 (Includes links to videos with audio files used in this episode.)\n“Life in the People’s Temple” by Beth Elias for Ranker.com: https://tinyurl.com/yygj5gey\n“The Shock Felt By Jonestown First Responders” by Andy Kopsa for Time.com: https://tinyurl.com/y55coj9u\nWeird Darkness theme by Alibi Music Library. \n= = = = =\n(Over time links seen above may become invalid, disappear, or have different content. I always make sure to give authors credit for the material I use whenever possible. If I somehow overlooked doing so for a story, or if a credit is incorrect, please let me know and I will rectify it in these show notes immediately. Some links included above may benefit me financially through qualifying purchases.)\n= = = = =\n\u0022I have come into the world as a light, so that no one who believes in me should stay in darkness.\u0022 — John 12:46\n= = = = =\nWeirdDarkness® is a registered trademark. Copyright ©2024, Weird Darkness.\n= = = = =\nOriginally aired: September 14, 2020\n\nCUSTOM LANDING PAGE: https://weirddarkness.com/Jonestown",
      "release": "2024-11-01T23:58:32Z",
      "duration": "00:59:37",
      "explicit": false,
      "spotifyId": "4awKD8peQNEywbglEcMUS2",
      "appleId": 1000675403684,
      "youTubeId": "1-DwusnoJW0",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4awKD8peQNEywbglEcMUS2",
        "apple": "https://podcasts.apple.com/podcast/the-jonestown-massacre-and-the-psychological-issues/id1078714736?i=1000675403684",
        "youtube": "https://www.youtube.com/watch?v=1-DwusnoJW0"
      }
    },
    {
      "id": "5a79181d-1c6c-42a6-bdd4-4d15cf80870b",
      "title": "“INSIDE THE FAMILY CULT” and More Darkly Disturbing True Stories!",
      "description": "The Hamilton-Byrne family was anything but typical, rather it was a doomsday cult with a leader who believed herself to be the reincarnation of Jesus Christ. (Inside the Family Cult) *** On this date, October 24, 1953, Evelyn Hartley, a 15-year-old sophomore from La Crosse, Wisconsin, vanished without a trace while on her way to a babysitting job. It was like something out of a Halloween urban legend but in this case, the horror was real. (The Babysitter Who Vanished) *** The odd happening that takes place here and there in a house more than likely can be explained in some rational way. Even quite a few strange occurrences could probably be explained by science. But when the events seem to never stop, perhaps it’s time to think something else is going on. (An Assortment of Experiences) *** Legend tells a centuries-old curse was placed upon Dudleytown in Connecticut. The town turned into a horrible place where people committed suicide or went insane. (Cursed Dudleytown) *** Exactly 92 years ago today – October 24, 1926 - something went wrong during a performance by Harry Houdini. A week later, he would be dead. (Houdini\u0027s Final Performance) *** In the Oakland Cemetery, a bronze monument to tragedy is said to bring death to anyone who touches it. (Black Angel of Death) *** While camping, a man has dreams of a dark-haired woman several nights in a row. Normally it wouldn’t be anything to be all that concerned about, but it’s something to fear if you are near the French Broad river. (Siren of the French Broad) *** Alien visitors, beings from a different dimension, our planet even had tree monsters and sentient pyramids showing up – and all in the year 1965. (The Inter-Dimensional Interlopers of 1965) *** A retired naval officer reports rocks falling through his home’s roof – dozens in a single day – with no explanation of where they came from. (Cappy Ricks and the Stones) *** In 1994 a man has a paranormal experience with a popular song recorded two decades earlier. (The Joker) *** Is there a clandestine space program designed to save the elite from a global catastrophe? (Alternative 3) SOURCES AND REFERENCES FROM THE EPISODE… “The Babysitter Who Vanished” by Troy Taylor: https://weirddarkness.tiny.us/3nzr6k3t “An Assortment of Experiences”: https://weirddarkness.tiny.us/bdfnz8u5 “Inside the Family Cult” by Joel Stice: https://weirddarkness.tiny.us/mtvduhy3 “Cursed Dudleytown”: https://weirddarkness.tiny.us/bf3668np “Houdini’s Final Performance” by Troy Taylor: https://weirddarkness.tiny.us/yrwap7k9 “Alternative 3”: https://weirddarkness.tiny.us/2wnw9jv6 “Black Angel of Death” by Orrin Grey: http://ow.ly/v2m430mkGWs “The Inter-Dimensional Interlopers of 1965” by Brent Swancer: https://weirddarkness.tiny.us/5n7u987t “Siren of the French Broad”: https://weirddarkness.tiny.us/an3ehray “The Joker” by Rory Kavenagh – submitted directly to Weird Darkness.com “Cappy Ricks and the Stones” by Cropster: https://weirddarkness.tiny.us/zsar9cna Weird Darkness theme by Alibi Music Library = = = = = (Over time links seen above may become invalid, disappear, or have different content. I always make sure to give authors credit for the material I use whenever possible. If I somehow overlooked doing so for a story, or if a credit is incorrect, please let me know and I will rectify it in these show notes immediately. Some links included above may benefit me financially through qualifying purchases.) = = = = = \u0022I have come into the world as a light, so that no one who believes in me should stay in darkness.\u0022 — John 12:46 = = = = = WeirdDarkness® is a registered trademark. Copyright ©2024, Weird Darkness. = = = = = Originally aired: October 24, 2018 CUSTOM LANDING PAGE: https://weirddarkness.com/inside-the-family-cult/",
      "release": "2024-07-18T00:00:02Z",
      "duration": "01:42:52.5770000",
      "explicit": false,
      "spotifyId": "5OlEZaIAPE8DLiJ9j6ocUf",
      "appleId": 1000662575455,
      "youTubeId": "PNz6QWqd7vI",
      "subjects": [
        "Santiniketan Park Association"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5OlEZaIAPE8DLiJ9j6ocUf",
        "apple": "https://podcasts.apple.com/podcast/inside-the-family-cult-and-more-darkly-disturbing/id1078714736?i=1000662575455",
        "youtube": "https://www.youtube.com/watch?v=PNz6QWqd7vI"
      }
    }
  ]
}