{
  "id": "1eab0669-c644-4c35-a750-c78580aa6837",
  "name": "Well, That F*cked Me Up! Surviving Life Changing Events.",
  "spotifyId": "3J01fIK02NgGTU0REJQYrJ",
  "appleId": 1552018167,
  "episodes": [
    {
      "id": "245630d6-2f03-4614-a3c7-a539b6e7958a",
      "title": "S5 EP48: Dr Martina\u0027s Story - Childhood Trauma, Cult Survival, and Healing!",
      "description": "Send us a text Dr Martina Zangger\u0027s story is one of extraordinary resilience and recovery after childhood sexual abuse, and her message, that shame must be taken from the victim and placed on the perpetrator. Abused at just four years old in Switzerland by her grandfather, a respected judge, and her uncle, a well-known politician, Martina grew up shrouded in silence. Moving to Australia at 12 years old, In her search for healing, Martina fell in love with an Indian guru at 18 years old, and was invited as a mail order disciple to live in his cult in the U.S, provided she paid $8000 for the privilege. So desperate to get to her guru, and with few skills she was talked into becoming a sex worker in Darlinghurst, Sydney at just 19. She eventually made enough money to go to the Ashram but unfortunately all was not what it seemed in \u0027the brochure!\u0027 She was subjected to exploitation and hard labour. Her journey from trauma to survival is confronting but deeply inspiring. Today, Martina holds a PhD, is an Honorary Lecturer at the University of Newcastle, and has spent over 20 years working on the frontline with women and children impacted by sexual assault and domestic violence. This is an AMAZING episode! Support the show",
      "release": "2025-12-11T23:00:00Z",
      "duration": "00:45:43.5100000",
      "explicit": true,
      "spotifyId": "09buHvrZG2y92TXWSiOWDd",
      "appleId": 1000740920664,
      "subjects": [
        "Bhagwan Shree Rajneesh",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09buHvrZG2y92TXWSiOWDd",
        "apple": "https://podcasts.apple.com/podcast/s5-ep48-dr-martinas-story-childhood-trauma-cult-survival/id1552018167?i=1000740920664"
      }
    }
  ]
}