{
  "id": "fc31c030-2234-4958-ac1f-f152abdbc9a2",
  "name": "WELT Nachrichtensender",
  "youTubeChannelId": "UCZMsvbAhhRblVGXmEXW8TSA",
  "episodes": [
    {
      "id": "687ae72f-02a3-454f-acdb-1b34b772361b",
      "title": "EPSTEIN-SKANDAL: „Absolut wild diese Geschichte“ – Zweifel am Suizid und mysteriöse Schatten",
      "description": "Der Skandal um Jeffrey Epstein zieht weitere Kreise. In Europa folgten Rücktritte. In den USA blieb es still. Opfer kritisieren fehlende Transparenz. Trotz drei Millionen veröffentlichter Akten bleiben ebenso viele unter Verschluss. Behörden verweisen auf Dopplungen und Opferschutz. Vertreter der Opfer zweifeln.\nNeue Akten und Videos nähren Zweifel am Suizid. Überwachungskameras zeigen in der Todesnacht Auffälligkeiten. Ein orangefarbener Schatten erscheint. Später geht ein Wärter zu seinem Platz. Die vorgeschriebenen halbstündigen Kontrollen der Zelle fanden nicht statt.\nUnklar bleibt auch der Strick. Forensiker konnten nicht sicher sagen, ob er die Todesursache war. Zeugen erinnern sich nicht eindeutig. Das Zungenbein war gebrochen. Das gilt als selten beim Erhängen.\nEin Dokument der Staatsanwaltschaft datiert die Todesmeldung auf den 9. August 2019. Gefunden wurde Epstein erst am Morgen des 10. August. Auch die Einzelhaft wirft Fragen auf. Ein Mitgefangener hätte anwesend sein müssen.\nIn den Akten steht zudem eine Aussage, wonach Epstein Melania Trump Donald Trump vorgestellt haben soll. Beide bestreiten das. Die Zweifel bleiben. Antworten fehlen.\n\n#epstein #skandal #akten #suizid #zweifel #transparenz #gefängnis #usa #weltnachrichtensender\n\nAbonniere den WELT YouTube Channel https://www.youtube.com/WELTVideoTV\nWELT DOKU Channel https://www.youtube.com/c/WELTDoku\nWELT Podcast Channel https://www.youtube.com/c/WELTPodcast\nWELT Netzreporter Channel https://www.youtube.com/c/DieNetzreporter\nDer WELT Nachrichten-Livestream http://bit.ly/2fwuMPg\nDie Top-Nachrichten auf WELT.de http://bit.ly/2rQQD9Q\nDie Mediathek auf WELT.de http://bit.ly/2Iydxv8\nWELT Nachrichtensender auf Instagram https://www.instagram.com/welt.nachrichtensender/\nWELT auf Instagram https://www.instagram.com/welt/\n\nIn eigener Sache: Wegen des hohen Aufkommens unsachlicher und beleidigender Beiträge können wir zurzeit keine Kommentare mehr zulassen. \n\nDanke für euer Verständnis – das WELT-Team\n\nVideo 2026 erstellt",
      "release": "2026-02-09T17:00:05Z",
      "duration": "00:06:14",
      "explicit": false,
      "youTubeId": "awYr0Sb2GfM",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=awYr0Sb2GfM"
      }
    },
    {
      "id": "0c0543fe-2d7e-4056-a4bb-ce8b5ca10fd3",
      "title": "USA: Hillary und Bill Clinton wollen im Fall Epstein nicht vor US-Kongress aussagen",
      "description": "In der Affäre um den verstorbenen Sexualstraftäter Jeffrey Epstein verweigern der frühere US-Präsident Bill Clinton und seine Ehefrau Hillary Clinton eine Aussage vor dem US-Kongress. Beide folgten einer Vorladung eines von Republikanern dominierten Kongressausschusses nicht. Das geht aus einem Schreiben der Anwälte des Ehepaars hervor.\n\nZur Begründung heißt es, Bill und Hillary Clinton hätten den Abgeordneten bereits vorsorglich und freiwillig alle ihnen vorliegenden Informationen zur Verfügung gestellt. Eine weitere Aussage sei daher nicht erforderlich.\n\nClintons Name sowie mehrere Fotos tauchen in den bislang veröffentlichten Akten zur Epstein-Affäre wiederholt auf. Ein strafrechtlich relevantes Fehlverhalten konnte ihm bislang jedoch nicht nachgewiesen werden. Die Ermittlungen und politischen Auseinandersetzungen rund um die Verbindungen prominenter Persönlichkeiten zu Epstein dauern weiter an.\n\n#weltnachrichtensender #usa #epsteinfiles #epstein\n\nAbonniere den WELT YouTube Channel https://www.youtube.com/WELTVideoTV\nWELT DOKU Channel https://www.youtube.com/c/WELTDoku\nWELT Podcast Channel https://www.youtube.com/c/WELTPodcast\nWELT Netzreporter Channel https://www.youtube.com/c/DieNetzreporter\nDer WELT Nachrichten-Livestream http://bit.ly/2fwuMPg\nDie Top-Nachrichten auf WELT.de http://bit.ly/2rQQD9Q\nDie Mediathek auf WELT.de http://bit.ly/2Iydxv8\nWELT Nachrichtensender auf Instagram https://www.instagram.com/welt.nachrichtensender/\nWELT auf Instagram https://www.instagram.com/welt/\n\nIn eigener Sache: Wegen des hohen Aufkommens unsachlicher und beleidigender Beiträge können wir zurzeit keine Kommentare mehr zulassen. \n\nDanke für euer Verständnis – das WELT-Team\n\nVideo 2026 erstellt",
      "release": "2026-01-14T16:00:16Z",
      "duration": "00:00:59",
      "explicit": false,
      "youTubeId": "9_n-tuyDCmQ",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9_n-tuyDCmQ"
      }
    }
  ]
}