{
  "id": "12400c60-616b-451f-91ee-216c6346adf2",
  "name": "Weston Media Center, Inc.",
  "youTubeChannelId": "UCJHXImiRbjDNTKFL6igMs7g",
  "episodes": [
    {
      "id": "f668f347-09df-46c2-bceb-a0fa4840d0a5",
      "title": "Weston Public Library Author Talk with Andrew LeCompte - Finding Miracles: Escape From a Cult",
      "description": "Andrew LeCompte is an empathic communication skills teacher and master memoirist.  He  recently published two books, \u0027Finding Miracles: Escape from a Cult\u0027 and Creating Harmonious Relationships\n\nDuring this presentation he shares his extraordinary journey from joining, recognizing and escaping a manipulative cult. He delves into his past, including teaching empathic communication and his intense spiritual search that led him to leave his family and move 2000 miles away. Over six years, he became deeply involved in the community, only to discover its cultish underpinnings and suffer significant personal and financial losses. His story culminates in his eventual recovery with the help of his son and new wife, his return to life, and his determination to share his experiences to warn others. This talk is essential for anyone interested in understanding cult dynamics, the importance of genuine interpersonal connections, and personal resilience.\n\n00:00 Introduction to Andrew Laconte\n00:43 Andrew\u0027s Journey into Spirituality\n02:40 The Influence of A Course in Miracles\n04:33 Meeting David Hoffmeister\n07:19 Joining the Community\n10:24 Disillusionment and Departure\n17:01 Recovery and New Beginnings\n27:21 Daily Routine in the Cult\n28:13 Food and Living Conditions\n28:54 Experiences and Threats After Leaving\n32:24 Grooming and Manipulation Tactics\n34:43 Spiritual Experiences and Disillusionment\n36:25 Financial Exploitation\n37:41 Mental Health and Recovery\n39:34 Current State of the Cult\n40:32 Final Thoughts and Reflections",
      "release": "2025-05-20T20:22:57Z",
      "duration": "00:46:51",
      "explicit": false,
      "youTubeId": "dW7tg0WxMl8",
      "subjects": [
        "A Course in Miracles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dW7tg0WxMl8"
      }
    }
  ]
}