{
  "_ts": 0,
  "id": "9f11886a-ae9d-44e8-b597-61fdb0e1d12b",
  "name": "What the Food?",
  "spotifyId": "1H0qGDf0UseZIStG8wK0i8",
  "appleId": 1574158913,
  "youTubeChannelId": "UCgBhJzWAyZM_n1X59EiRFVw",
  "episodes": [
    {
      "id": "c4166894-50ef-41a2-b4d0-ed5b1c669b76",
      "title": "Eat Pray Obey: The Worst Cult Diets in History (Part 2)",
      "description": "Part 2 is here! In this week’s episode of What the Food?, we tuck back into history’s most deranged cult diets... We\u0027re talking Aum Shinrikyo and the Mormons!\n\n\nJoin us as we rank the worst of the worst in a roundtable food fight no one asked for, and uncover why the road to salvation is often paved with beige, boiled suffering.\n\n\nTrigger warning: This episode contains dark themes including starvation, coercion, and mass death,  but we’ll hold your hand through it with our usual dose of British humour and sarcasm.\n\n\nIf you enjoyed this episode, don’t forget to subscribe in your favourite app, leave us a rating, and share it with your mates.\n\n\nFollow our socials at: https://linktr.ee/WhatTheFoodPodcast or if you fancy treating us to a one-off cuppa: www.buymeacoffee.com/whatthefood (http://www.buymeacoffee.com/whatthefood) \n\n\n\nThanks for listening, and we’ll catch you on the next one!\n\n\n\nTheme music: “Celebration” by Alexander Nakarada. Available for use under the CC BY 4.0 license (www.creativecommons.org/licenses/by/4.0/)",
      "release": "2025-05-20T04:14:32Z",
      "duration": "00:52:02",
      "explicit": false,
      "spotifyId": "4TwbVFIkeaptJYzX43eg2C",
      "appleId": 1000709087088,
      "youTubeId": "7qDwwChp4P0",
      "subjects": [
        "Aum Shinrikyo",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4TwbVFIkeaptJYzX43eg2C",
        "apple": "https://podcasts.apple.com/podcast/eat-pray-obey-the-worst-cult-diets-in-history-part-2/id1574158913?i=1000709087088",
        "youtube": "https://www.youtube.com/watch?v=7qDwwChp4P0"
      }
    },
    {
      "id": "04c650df-056c-499e-a2e0-67031b98a480",
      "title": "Eat Pray Obey: The Worst Cult Diets in History (Part 1)",
      "description": "Get part two of this episode right now and unlock exclusive content by becoming a Knight of the Kitchen Table: https://www.buzzsprout.com/1807134/subscribe Ever fancied a spiritual journey that involves applesauce, powdered milk, and starvation so severe you hallucinate a raisin? In this week’s episode of What The Food, we tuck into history’s most deranged cult diets, from the jungle gruel of Jonestown, to Heaven’s Gate’s death-by-pudding, to the one-grain-a-day enlightenment plan of Aum Shinrikyo. How do cults use food to control people? Why are so many of them obsessed with purification? And can you really find God on a 500-calorie salad? Join us as we rank the worst of the worst in a roundtable food fight no one asked for, and uncover why the road to salvation is often paved with beige, boiled suffering. Trigger warning: This episode contains dark themes including starvation, coercion, and mass death, but we’ll hold your hand through it with our usual dose of British humour and sarcasm. Support the show Get both parts of every episode at the same time and access exclusive content by becoming a Knight of the Kitchen Table: https://www.buzzsprout.com/1807134/subscribe If you enjoyed this episode, don’t forget to subscribe in your favourite app, leave us a rating, and share it with your mates. Follow our socials at: https://linktr.ee/WhatTheFoodPodcast or if you fancy treating us to a one-off cuppa: www.buymeacoffee.com/whatthefood Thanks for listening, and we’ll catch you on the next one! Theme music: “Celebration” by Alexander Nakarada. Available for use under the CC BY 4.0 license (www.creativecommons.org/licenses/by/4.0/)",
      "release": "2025-05-13T04:00:00Z",
      "duration": "00:51:39.0880000",
      "explicit": true,
      "spotifyId": "3ZrbGAIpCQBQopUesS3GiN",
      "appleId": 1000708227867,
      "youTubeId": "6mBRzcmCW7U",
      "subjects": [
        "Aum Shinrikyo",
        "Heaven\u0027s Gate",
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ZrbGAIpCQBQopUesS3GiN",
        "apple": "https://podcasts.apple.com/podcast/eat-pray-obey-the-worst-cult-diets-in-history-part-1/id1574158913?i=1000708227867",
        "youtube": "https://www.youtube.com/watch?v=6mBRzcmCW7U"
      }
    }
  ]
}