{
  "id": "8708746d-ec02-4d36-9601-72f59ad8b1ad",
  "name": "What Lingers",
  "spotifyId": "3uve9BFufE5QXja1NDk78V",
  "appleId": 1776468683,
  "episodes": [
    {
      "id": "c8b05eab-cae7-4de3-9845-dd70783cbcfd",
      "title": "Escaping Synanon: From Cult Manipulation to Inner Freedom",
      "description": "We’re back! What Lingers returns for its third season, and we’re thrilled to kick it off with a powerful story of resilience, liberation, and self-discovery.In this episode of What Lingers, Robert shares his extraordinary journey from growing up inside Synanon, one of America’s most infamous rehabilitation communities turned cult, to rebuilding a life of freedom, healing, and purpose in Spain.\nA ninth-degree black belt in Shaolin Kung Fu, Robert reflects on his childhood marked by family dysfunction, time in foster homes, and the psychological control of Synanon’s notorious “Game” — a confrontational group therapy method that crossed into emotional abuse.\nAt just sixteen, Robert made the courageous choice to walk away from the only world he’d ever known. His story reveals the resilience of the human spirit, the dangers of unchecked power, and the path toward authenticity and spiritual liberation.\nToday, Robert lives in Spain with his beloved wife, sharing his wisdom as a writer, messenger, and spiritual teacher.\nFollow us on Instagram: Storytelling Lisboa \u0026 What Lingers Pod Hosted by Cristian Figueroa \u0026 Liz MelchorEdited by Liz Melchor\n \n\nThis is a public episode. If you would like to discuss this with other subscribers or get access to bonus episodes, visit whatlingerspod.substack.com",
      "release": "2025-11-10T13:50:50Z",
      "duration": "01:03:50",
      "explicit": false,
      "spotifyId": "0yPNMxTESziG2d9DpISavC",
      "appleId": 1000736109918,
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0yPNMxTESziG2d9DpISavC",
        "apple": "https://podcasts.apple.com/podcast/escaping-synanon-from-cult-manipulation-to-inner-freedom/id1776468683?i=1000736109918"
      }
    }
  ]
}