{
  "_ts": 0,
  "id": "23c0650b-4683-49d1-ba4e-49e240aac499",
  "name": "What do we do next?",
  "spotifyId": "4Q6XLWgS51ZsO2FQd4yHNA",
  "appleId": 1813992945,
  "youTubeChannelId": "UCcCfuiqNu9ZqWMGjMEV8ySA",
  "episodes": [
    {
      "id": "4c583337-87c8-4067-8c3d-12d028b4e9b8",
      "title": "Why People Join Cults with Dr. Margaret Cochran",
      "description": "I had the chance to speak with Dr. Margaret Cochran , a transpersonal psychologist, clinical social worker, life coach, educator, hypnotherapist, and author (yes, all of that!) with over 25 years of experience helping people navigate some of the most complex parts of the human mind. In this conversation, we dig into something that’s often whispered about but rarely unpacked properly: cults. We talk about what actually pulls people into cult-like groups, and spoiler: it has nothing to do with how smart or educated you are. Dr. Cochran breaks down the psychological patterns, emotional needs, and deep human longings that make us vulnerable: the need for safety, control, purpose, and belonging. And while it’s easy to keep the word “cult” at a distance, the truth is these same patterns show up in political extremism, toxic relationships, and even everyday communities that manipulate more than they nurture. We also get into how to support someone who may be caught up in a group like this, what helps, what doesn’t, and why kindness and connection are often more powerful than confrontation. Dr. Cochran shares practical tools for fostering critical thinking, emotional resilience, and empathy, especially in a world that feels more divided than ever. If you’re trying to understand a loved one’s choices, or just want to learn how to recognize and resist manipulation in all its forms, this episode offers clarity, hope, and some powerful tools for healing and helping. Chapters:00:00 - Introduction01:19 - Holistic Mental Health Expert04:32 - The Allure of Absolute Belief09:07 - Religions, Cults, and Power Dynamics12:18 - Addressing the \u0022Trump Cult\u0022 Divide14:14 - Critical Thinking and Sovereignty Struggle19:41 - Navigating Political Differences22:25 - Positive Memories Aid in Persuasion25:46 - Contrasting Responses: Empathy vs. Dismissal30:31 - \u0022Fear, Control, and Behavior\u002232:56 - Compassion Over Condemnation Online37:16 - Seeking Solutions Amid Uncertainty38:01 - QAnon, Frustration, and Misguided Beliefs40:31 - Outro Quotes:“Let’s extend empathy to those caught up, welcoming them back instead of succumbing to anger.”- Molly Ruland “You have the ultimate control over your life through your reactions. Embrace this power, and you hold the key to your own strength.”- Dr. Margaret Cochran Key Takeaways:Cult Members: Not Who You ThinkWhy People Join Cults: Salvation \u0026 ControlBrains Are Wired for Fear and ConnectionIsolation Fuels IndoctrinationIt’s Not Just Religion—Politics, Domestic Abuse, and MoreCritical Thinking is Our Best ArmorBreaking Through: Small Windows of DoubtKindness is RevolutionaryYour Mississippi MomentWe All Want Belonging and SafetyChange Happens Through Community, Not Shame Connect with Dr. Margaret CochranWebsite: www.drcochran.com Call To ActionPlease consider joining our Substack to help us get this message to as many people as possible. Podcast on News and Politics – What We Do We Do Next Produced by Heartcast Media To hear more, visit whatdowedonext.substack.com",
      "release": "2025-07-07T21:28:28Z",
      "duration": "00:39:48.7530000",
      "explicit": false,
      "spotifyId": "60jEfLeGfIeUeA0cjXPmXQ",
      "appleId": 1000716234648,
      "youTubeId": "FZxf8JOCcvI",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/60jEfLeGfIeUeA0cjXPmXQ",
        "apple": "https://podcasts.apple.com/podcast/why-people-join-cults-with-dr-margaret-cochran/id1813992945?i=1000716234648",
        "youtube": "https://www.youtube.com/watch?v=FZxf8JOCcvI"
      }
    }
  ]
}