{
  "id": "688ba742-dee7-4ac5-9f57-c46f9da523da",
  "name": "Whatever Is Excellent with Leanne Tuggle",
  "spotifyId": "4oFzmbI0IOcWjRROP3gvH6",
  "appleId": 1768816591,
  "episodes": [
    {
      "id": "b4d1cab5-10cb-43a4-830f-7e98632c6f96",
      "title": "56: A Calling To End Trafficking with Brittany Dunn",
      "description": "A friend’s kitchen-table Bible study turned into a national movement. Brittany Dunn joins us to share how Safe House Project is confronting child trafficking in America with a strategy built on training, survivor support, and evidence-based safe house certification—and why proximity, not sensational headlines, should reshape how we see this crisis. The numbers are sobering, but the path forward is clear, practical, and hopeful.\n\nWe talk through the real shockers—like how many victims are first trafficked by family members—and the tools anyone can use to help, including the Simply Report app for learning and reporting, and On-Watch training designed for short, focused learning. Brittany opens up about excellence as stewardship: transparent finances, measurable outcomes, and programs that stand up to scrutiny. Her leadership philosophy is simple and demanding—excellence without perfection, compassion without naivety, and prayer before plans.\n\nIf you’ve ever felt torn between meaningful work and being present at home, you’ll find a blueprint here. Brittany rejects the myth of balance and leans into managing energy and seasons, setting clear expectations at work and with her kids, and integrating family into mission so purpose becomes shared, not siloed. She also shares the spiritual rhythms that hold everything together: a 5:30 a.m. prayer call, Scripture, the “full armor” mindset, and physical training to metabolize stress and stay grounded.\n\nReady to engage? Become a Safe House ambassador, take On-Watch training, share the Simply Report app, or give to fund emergency housing, transportation, and case management for survivors. Subscribe, share this conversation with a friend, and leave a review to help more people learn how to spot, report, and support—because awareness paired with action can save a life.\nRecommended Resources:\nSimply Report \nOnWatch Training \nEradicating Human Trafficking by Bill Woolf \u0026 Brittany C. Dunn\nSafe House Project\u0027s Survivor Support Team serves hundreds of survivors every month exiting a trafficking situation and helping them get the services they need. To connect with our Survivor Support Team, please call (507) 769-0819 and select option 1 or start the process here.\nDonate to The Safe House Project\n\n\n  Connect with me! \nYou can find me on Instagram @mrs.leannetuggle or you can email me at leanne.tuggle@gmail.com. I love hearing from you!\n\nWould you like more weekly encouragement? Subscribe to my newsletter Whatever is Lovely and be inspired to open your inbox again.\nhttps://leannetuggle.myflodesk.com/v3r2zwdaik\n\nIf this is your first time here and this episode resonated, hit “subscribe” and submit a 5-star rating if you feel genuinely inspired to. Your positive feedback means the world to me!\n\nEpisode Sponsors:\nRodan \u002B Fields - Take this brief quiz to find your customized skincare routine!\n\nRed Aspen - Skip the salon appointment and shop here for hands that are hardworking AND elegant. \n\nWhatever is Lovely - Subscribe here to the weekly newsletter designed to encourage you with words of wisdom and relatable content. Be inspired to open your inbox again.",
      "release": "2025-11-11T12:00:00Z",
      "duration": "00:29:15",
      "explicit": false,
      "spotifyId": "28O8BPxx3YGfiJwoIlLo0B",
      "appleId": 1000736257298,
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28O8BPxx3YGfiJwoIlLo0B",
        "apple": "https://podcasts.apple.com/podcast/56-a-calling-to-end-trafficking-with-brittany-dunn/id1768816591?i=1000736257298"
      }
    }
  ]
}