{
  "id": "ad9e73d7-9b36-4253-9143-613e302d53f5",
  "name": "What Came Next",
  "spotifyId": "3amRVnSbdrioaBoaHcNRiq",
  "appleId": 1674051643,
  "youTubeChannelId": "",
  "episodes": [
    {
      "id": "ddfeacaa-c58f-4b7d-9a5a-e68065acb70f",
      "title": "9: [Sarah Edmondson - MAX\u0027s The Vow] I Got Out",
      "description": " *Content warning: This episode includes discussion of coercive control, cults, cultic abuse, branding, emotional, physical, and sexual abuse, rape, \u0026 sex slavery.  Sarah Edmondson is an actor, author, podcaster, victim advocate, \u0026 mother who has appeared in many publications and productions, including HBO’s The Vow. She found her passion for the performing arts at a young age, and has seen great success in front of the camera. Her roles in front of them have drastically shifted over the last decade though; she now uses the spotlight to share her experiences in NXIVM. Sarah was tested to her limits by her journey within the multi-level marketing sex cult, and we are so grateful she was willing to talk to us about how she’s turned what came next for her into education for the masses.  Sponsors: Thank you, BetterHelp, for sponsoring this episode. Don\u0027t forget to visit http://www.betterhelp.com/wcn for 10% off your first month of services.  Sources: Sarah’s Cultic Abuse \u0026 Coercive Control Resources: https://www.sarahedmondson.com/resources  Sarah’s Instagram:  http://www.instagram.com/sarahedmondson  A Little But Culty on Instagram: https://instagram.com/alittlebitculty  Sarah’s podcast, A Little Bit Culty: https://alittlebitculty.com/  Sarah’s Book, Scarred: The True Story of How I Escaped NXIVM, the Cult That Bound My Life https://amzn.to/3RwmmY2  NY Times on NXIVM 10/17/17 https://www.nytimes.com/2017/10/17/nyregion/nxivm-women-branded-albany.html  HBO’s The Vow https://www.hbo.com/the-vow  Psychology Today, Understanding the Basics of Cults: https://www.psychologytoday.com/us/blog/freedom-mind/202106/understanding-cults-the-basics  Combatting Cult Mind Control by Steven Hassan https://amzn.to/3BaCQz  Insider.com on the Legal Progression of the NXIVM trials: https://www.insider.com/what-is-nxivm-keith-raniere-explainer-2019-4#june-30-2021-allison-mack-was-sentenced-to-3-years-in-prison-27  I Got Out Movement http://igotout.org  Cult Info Since 1979 via International Cultic Studies Association https://www.icsahome.com/articles/prevalence   For free and confidential resources, please visit: somethingwaswrong.com/resources     ",
      "release": "2023-04-14T00:00:00",
      "duration": "00:36:24.3110000",
      "explicit": true,
      "spotifyId": "1810I30LJmieeSpUsiSzC2",
      "appleId": 1000608916504,
      "youTubeId": "",
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1810I30LJmieeSpUsiSzC2",
        "apple": "https://podcasts.apple.com/podcast/sarah-edmondson-maxs-the-vow-i-got-out/id1674051643?i=1000608916504",
        "youtube": null
      }
    }
  ]
}