{
  "id": "67fa8a45-4fb0-48bb-853b-4804281f1610",
  "name": "WhaTheFlok?! “Cult Survival Stories” ",
  "spotifyId": "6bqageyG6a8pxHqcXYXJsW",
  "appleId": 1591852682,
  "episodes": [
    {
      "id": "439e8349-94ec-41a7-831f-b07e6501cdc4",
      "title": "After Hours Edition | What About the Leprechauns?!",
      "description": "Whaaat?…Did the ICOC even claim to be saving leprechauns in India?!! Well, listen in to find out!! ☘️ Welcome to the second part of the conversation about the ICOC pyramid and how it was used to control and micromanage every single thought and action of its members. But here in part 2, Chele \u0026 Nixie discuss how the leadership structure was weaponized \u0026 mobilized to deploy the rules and regulations of the ICOC cult—Which masqueraded as the only true church of disciples on the planet. Yep, if you don’t go to the ICOC, sorry to tell you—according to them, you are Hell bound. So, just how did this cult convince its over 150,000 die-hard members that their only job on earth was to go out and make other disciples and bring them into the ICOC so that they could be saved and go to heaven?! Well, the short answer is through the leadership—who claimed that the Bible was their rulebook—but in reality, it was the leaders functioning as Wizard of Oz type characters, hiding behind a curtain of ego, fear, and manipulation. Which was deeply damaging because we never knew who the “enemy” was. The people we were supposed to trust the most, were actually the ones carrying out or fostering the abuse. And a special shout out to Dr. Edith Eger’s podcast on Super Soul called ”The Choice,” as she shares about her experience in the Auschwitz concentration camp. Dr. Eger says the only workable thing about the type of abuse she endured in the concentration camp is that she always knew who the enemy was. She knew who she was fighting. We thought that was a profound comment, as most of the ICOC defectors struggled with identifying all the insidious ways that they were spiritually, mentally, emotionally, physically, (and some sexually) abused, until many years later. I highly recommend Dr. Edith Eger’s podcast on Super Soul titled The Choice, listening to it humbled me and changed me! Thank you Dr. Eger! #IGotOut #FreeFromICOC Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-11-03T15:11:14Z",
      "duration": "00:51:06.8360000",
      "explicit": false,
      "spotifyId": "5Ja2n6lxqzOdwC1Q3FDvW3",
      "appleId": 1000584987664,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Ja2n6lxqzOdwC1Q3FDvW3",
        "apple": "https://podcasts.apple.com/podcast/after-hours-edition-what-about-the-leprechauns/id1591852682?i=1000584987664"
      }
    },
    {
      "id": "f03164d2-f863-431b-b291-51767c4737f7",
      "title": "After Hours Edition |The ICOC Pyramid$",
      "description": "In the next several After Hours episodes, Chele and Nixie are focusing on the group they escaped from, the ICOC. Chele felt it was important to take a deep dive into the control \u0026 mobilization structure of the cult, which the ICOC called a “discipleship tree.” It’s not by accident that even religious statisticians labeled the ICOC as the ‘fastest growing church in the world’ for three years in a row. There is a reason the ICOC, which masqueraded as a church, was able to accomplish this: Looking back, it’s easy to now identify this structure as an insidious pyramid scheme, designed to micromanage and manipulate every thought and move (and finances) of its members. This pyramid helps to explain how the ICOC was so effective at controlling every single member. You see, in becoming a member of this group, EVERYONE was assigned a handler, which they called a “discipler.” The discipler was initially explained as a spiritual mentor and helper, but nothing could be further from the truth. And it didn’t end there, as you went up the discipleship tree (pyramid), the groups were divided, and then subdivided, and then subdivided more. To a point where everybody always knew what everybody else was doing, and would report each other, if anyone thought there was sin or dissent. The members also had to get permission and ask advice on even the smallest aspects of their lives, and weren’t able to make any personal decisions on their own. Supposedly, the Bible was the rule book—but it was simply a game of “Fear \u0026 Consequence,” and the leaders of the ICOC played it masterfully. Chele breaks down the disturbing ecosystem of this cult, and we think this is a fascinating episode. #IGotOut #FreeFromICOC  Visit our website at https://whatheflok.com  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan  *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-10-26T13:00:03Z",
      "duration": "00:54:14.4830000",
      "explicit": false,
      "spotifyId": "3wtR6496uhJcg5X5dkynQm",
      "appleId": 1000583962927,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3wtR6496uhJcg5X5dkynQm",
        "apple": "https://podcasts.apple.com/podcast/after-hours-edition-the-icoc-pyramid%24/id1591852682?i=1000583962927"
      }
    },
    {
      "id": "2f9c4b4c-0ef7-4f88-80fd-c142022cd222",
      "title": "Wear It Like A Badge",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland   Wow, we are at episode 20 already, so Hoyt and Chele wanted to spend the time to discuss some of their own take-aways from the WTF podcast thus far, as they have interacted with our amazing guests! And this episode’s quote, once again, sums things up perfectly:   “To live in the body of a survivor is to never be able to leave the scene of a crime. I cannot ignore the fact that I live here.” By Blythe Baird.   Anyone who has suffered trauma, and in our case trauma from any sort of cultic relationship, will understand this quote perfectly well— because trauma leaves a sort of imprint on our minds and in our bodies, synonymous to a crime scene that we endured. It becomes a part of us—And although we will never forget it or “get over it”— There are ways that we can “get through it.”   But it’s also important to insert here, that there is no blueprint to getting through it, no one size fits all approach, no cookie-cutter solutions. We are all individuals, with individual experiences—resulting in a spectrum of traumas and pathways to recovery. We will all process our traumas and recovery journeys differently, and that is not only OK—it is expected and healthy!   Some people find it healing and helpful to talk about their experience, but some find it triggering and feel it adds to their trauma—And that’s OK too. Everyone heals on a different time frame. Hoyt and Chele truly hope that everyone who has survived any sort of cultic relationship and trauma will someday arrive at the point of being able to share or express their trauma, and “wear it like a badge”—but that badge will look different for everyone.   I think a perfect example of this is our friend Lisa who is one of the creators of the #IGotOut hashtag and platform. Lisa works passionately and tirelessly for the #IGotOut platform, and is helping countless people in their recovery, but she’s just not ready to publicly tell her own personal story yet… But she helps so many others in so many ways! I think that no matter where we are at in the spectrum of trauma and recovery, we are all an important “cog in the wheel,” so to speak, creating forward progress together!   No matter where you are at in your road to recovery, you are all a part of our collective vehicle, driving us all to clarity, validation \u0026 continued freedom! 💓  #IGotOut #WearItLikeaBadge #TellYourStories #CultShit #TakeYourPowerBack  Visit our website at https://whatheflok.com  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Joseph Russo Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-09-15T19:51:45Z",
      "duration": "00:41:05.8760000",
      "explicit": false,
      "spotifyId": "4SFLBskWmj51IObazZhSXo",
      "appleId": 1000579616470,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4SFLBskWmj51IObazZhSXo",
        "apple": "https://podcasts.apple.com/podcast/wear-it-like-a-badge/id1591852682?i=1000579616470"
      }
    },
    {
      "id": "d7770a02-5573-4dfe-8d6b-871dd14567e1",
      "title": " Holy Heaven | Guest Will Allen",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland Our quote for Part 2 of of the conversation with the delightful Will Allen perfectly sums up one of the key resources that Will has brought to the table for all of us to partake in— “Rarely, if ever, are any of us healed in isolation. Healing is in itself, an act of communion.” By Bell Hooks Will’s documentary Holy Hell has been just such a tool for healing, for so many—Which in itself, and collectively, has functioned as an ‘act of communion.’ This film has allowed an endless number of trauma survivors to feel validation and clarity, by exposing the powerfully insidious nature of manipulative/indoctrinational and abusive relationships. But this episode is named Holy HEAVEN, as Will is also a powerful example of making it to the other side of his cultic experience with his compassion, brilliance, creativity, and humanity not only intact, but wearing it like a badge of honor…as we all should! People like Will are helping to “normalize trauma recovery,” and strengthening the ever-growing community of survivors! Conversing \u0026 communing with him was pure joy. Thank you Will Allen for providing all of us a timeless piece of your heart through your Holy Hell film—But equally as important, for sharing with us how you reclaimed your life and reinvented your passions! You truly are a beacon of hope, and a slice of Holy Heaven! So thrilled to have you as part of the #WhaTheFlok family! 😍 #HolyHell #IGotOut #TellYourStories #TakeYourPowerBack  Visit our website at https://whatheflok.com  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Joseph Russo Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-09-15T19:27:44Z",
      "duration": "00:47:25.4810000",
      "explicit": true,
      "spotifyId": "6YwXIC1vw74ZvxG7FiiR6C",
      "appleId": 1000577234534,
      "subjects": [
        "Buddhafield",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YwXIC1vw74ZvxG7FiiR6C",
        "apple": "https://podcasts.apple.com/podcast/holy-heaven-guest-will-allen/id1591852682?i=1000577234534"
      }
    },
    {
      "id": "db1f395d-6947-4bff-b929-72b2f17a011c",
      "title": "Holy Hell | Guest Will Allen",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland We think you’re really going to enjoy the treat in store for you with Ep 18—the first part of our two episodes with the incomparable Will Allen—Creator, Producer, Director (“everythinger”) of one of our favorite documentaries about indoctrination and cultic relationships, titled Holy Hell. If you have not seen this documentary, we strongly recommend it to be on your ‘must watch’ list! Chele remembers watching Holy Hell, and it being one of the crystallizing moments when she realized that the indoctrination process has distinct markers, or a formula to it. It doesn’t matter what cult or abusive relationship you’ve been in—the mind control, centered in coercion and suppressed critical thinking is shockingly similar!  “Same party, different costume.” Will does such a spectacular job of highlighting this, with all of the original video footage that he had filmed and archived during his decades inside of the Buddahfield cult. Because of all of this footage, we get to peer into the very soul of this cult, and the cult leader—The way Will put this film together was compelling and groundbreaking—Seeing all the real time faces of the innocent members of the group was heartwarming and heartbreaking all at the same time! We’ve talked to so many people who said that this particular documentary was an ‘Aha’ moment for them! Bravo Will! Can’t wait to see what Will Allen has in store for us next! #HolyHell #IGotOut #TellYourStories #TakeYourPowerBack  Visit our website at https://whatheflok.com  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Joseph Russo Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-08-16T13:00:03Z",
      "duration": "00:46:00.6810000",
      "explicit": true,
      "spotifyId": "7fteGZKf7YL0kqUUzTC6LU",
      "appleId": 1000576253888,
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7fteGZKf7YL0kqUUzTC6LU",
        "apple": "https://podcasts.apple.com/podcast/holy-hell-guest-will-allen/id1591852682?i=1000576253888"
      }
    },
    {
      "id": "961bd8fc-f843-46bc-bda2-bd48ad2fcaa0",
      "title": "Girl Uninterrupted | Guest Ashleigh Freckleton",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland Welcome to part two of our discussion with the exceptional Ashleigh Freckleton, all the way from Australia! In last week’s episode, Ashleigh sets the stage for what happened with a narcissistic and mentally disturbed “yogi guru,” whose main goal was manipulating and controlling women, for his own disturbed sexual desires and needs. So in this episode she eloquently brings us full circle, as to what broke things open for her, and how she escaped him and this group. But maybe more importantly, Ashleigh carefully lays the groundwork of why and how this type of indoctrination happens in the first place—And why people like this, who claim to be “gurus” and inspired or prophetic thought leaders, are effective at this type of dangerous coercion, and such intimate manipulation. It also became clear during our conversation, that being self-aware and in touch with her emotions, like Ashleigh was, allowed her to ultimately stand up to this depraved man, and escape relatively quickly, in the grand scheme of things. But I think it’s also important to note that it doesn’t matter if you’re in a destructive cult or cultic relationship for 2 years or 20 years…the damage and destruction can be equally as traumatic, regardless of the amount of years that you suffered. Ashleigh is such an inspiring example of taking challenging circumstances and allowing them to evolve into an experience that can ultimately serve yourself, but also serve those around you. She truly is a lighthouse and beacon of hope, willing to share her experiences, in an effort to warn and teach others about being exposed to any type of indoctrination or coercive control! Stay tuned, as we have no doubt that the world will be hearing a lot more from the wonderful Miss Ashleigh Freckleton! #IGotOut #TellYourStories #TakeYourPowerBack  Visit our website at https://whatheflok.com  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Joseph Russo Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-07-12T16:25:49Z",
      "duration": "00:49:17.9710000",
      "explicit": true,
      "spotifyId": "0JzYerhJyvSCkYoVn69VRX",
      "appleId": 1000569690939,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0JzYerhJyvSCkYoVn69VRX",
        "apple": "https://podcasts.apple.com/podcast/girl-uninterrupted-guest-ashleigh-freckleton/id1591852682?i=1000569690939"
      }
    },
    {
      "id": "bd999954-a42c-4e56-9d66-71695551e0ba",
      "title": " Gangster Guru | Guest Ashleigh Freckleton",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland What a treat to introduce you to Part One with the lovely and impressive Ashleigh Freckleton, all the way from beautiful Australia! We instantly fell in love with Ashleigh, and not just because of her bubbly \u0026 adorable qualities—But because she so eloquently and precisely painted the picture of how someone as dynamic as herself could be duped into a yoga cult, led by a maniacal supposed guru. Yes her story contains all of the salacious and juicy details of a man grooming women to be his own devoted sexual slaves, intended to be trafficked across Europe, but it is much much deeper and more complex than even that. Like so many cult survivors, Ashleigh set out to do amazing things; she wanted to devote herself to something meaningful, and to lead an impactful and compassionate life. This man and this group took those innocent intentions, and exploited them brutally. And on top of that, she is still receiving legal and litigious threats from the guru and his devoted cult. Even so, Ashleigh marches on courageously, fiercely, and does not waver. The legal threats are also why Ashleigh can’t specifically name the group or the cult leader—YET! But his day is coming. *Oh ya, Spoiler Alert: Ashleigh was also a contestant on Australia’s “The Bachelor.” This girl is such a joy and a multi-faceted human being! I guess you’ll just have to take a listen/watch to see for yourself how this could happen to someone like her. Ashleigh is another prime example illustrating the fact that cultic relationships can literally happen to anyone!—She is powerful, intelligent, strong, passionate and driven! Ashleigh has many exciting projects in the pipeline that will help tell her story on a global scale. We cannot wait to hear more from her, and to see how this all unfolds! Thanks for inspiring us Ashleigh and for not backing down! 💪🏼🤩 #IGotOut #TellYourStories #TakeYourPowerBack  Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Joseph Russo Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-07-06T16:39:15Z",
      "duration": "00:45:21.8110000",
      "explicit": false,
      "spotifyId": "7gNXGEPzy7CsPLtqKPuNcE",
      "appleId": 1000569032665,
      "subjects": [
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7gNXGEPzy7CsPLtqKPuNcE",
        "apple": "https://podcasts.apple.com/podcast/gangster-guru-guest-ashleigh-freckleton/id1591852682?i=1000569032665"
      }
    },
    {
      "id": "169d1f1d-cefe-40ad-a5c2-1e6f5758f0ed",
      "title": "After Hours Edition | Better Not Bitter | Guest Tracy Nusbaum",
      "description": "So happy to share Part Two of our conversation with the unforgettable Tracy Nusbaum. It’s Chele here, personally writing this blurb of Episode 15, as I felt the need to share about how deeply touched I was by our intimate discussion with Tracy. I was so enthralled with our conversation, that it’s the very first episode where I literally forgot to read the quote of the day. Being reminded of what happened to Tracy and all of us that have escaped from the ICOC‘s prison bars that incarcerated our minds moved me, and spoke to me in ways that words cannot encompass. As I re-listened to the episode before it was uploaded for the rest of you to hear, I went on a long walk through my neighborhood and I just wept—I wept tears of loss, tears of regret, tears of sadness, tears of anger, and tears of painful memories. But these tears eventually evolved into feelings of resolve and strength and empowerment. This is what happens when we can acknowledge what we have been through, where we are now, and ultimately where we are headed. Tracy, your willingness to be so vulnerable and share so specifically about what you experienced inside of the ICOC underscores the fact that we were mentally, spiritually, emotionally, physically and financially violated on a daily basis in that group. But yet here we are, broken out of our cocoons with big butterfly wings that carry us and our voices to places we probably could have never even imagined! Thank you Tracy for using your voice to share your story, as it’s already having great impact, and validating the complexity and pain of surviving any type of cultic experience. We also appreciate the way you peppered in some organic humor—it helps us to laugh at the ridiculousness of what ICOC survivors have been through. You are wonderfully and perfectly made, and the world is enriched by your experiences and perspective! #IGotOut #FreeFromICOC  Visit our website at https://whatheflok.com  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-06-28T13:00:49Z",
      "duration": "01:19:08.0090000",
      "explicit": true,
      "spotifyId": "0dgADCbusZ00phb1ioikyi",
      "appleId": 1000567988198,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dgADCbusZ00phb1ioikyi",
        "apple": "https://podcasts.apple.com/podcast/after-hours-edition-better-not-bitter-guest-tracy-nusbaum/id1591852682?i=1000567988198"
      }
    },
    {
      "id": "f66858bd-023a-45ea-ac8b-65295abaf2b6",
      "title": "After Hours Edition | Free Therapy | Guest Tracy Nusbaum",
      "description": "So excited to introduce Tracy Nusbaum to you in Part One of a two-parter “After Hours” episode. Of course, our “After Hours” episodes are more informal, and usually involve ‘no holds barred’ dialogue AND several glasses of wine! And good Lordy, there was no holding back in this conversation! Chele, Nixie, and Tracy hadn’t all been together for over 20 years from their old ICOC (cult) days, so the memories, stories, outrage, (and wine) was flowing generously! The types of mentally, emotionally, physically, and spiritually damaging experiences that Tracy lived through in the ICOC are shocking and traumatizing. But more importantly, Tracy is such an amazing example of someone who has come out on the other side—stronger, clearer, and entirely whole. She is nothing short of an inspiration, and she has always been a touchstone and true friend to Chele. Tracy is such an incredible example of taking your circumstances and turning it into something beautiful, and is now remarried to a wonderful man with four amazing children! Tracy has the best memory of the bunch and was able to remind Chele about so many disturbing things that she had blocked out. And they get into more of that in Part Two, the next episode, so be sure to tune in to next week’s episode as well! Thank you Tracy for being the feisty Latina that you are! One disclaimer: Chele mispronounces Matthew Wolpert‘s last name several times in this episode. His last name is Wolpert and not Wolten. Sorry Matthew, let’s blame it on the wine! Haha #IGotOut #FreeFromICOC  Visit our website at https://whatheflok.com  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-06-21T18:15:38Z",
      "duration": "01:03:24.3710000",
      "explicit": false,
      "spotifyId": "4F71M669DosSfSeiwNzkwX",
      "appleId": 1000567303227,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4F71M669DosSfSeiwNzkwX",
        "apple": "https://podcasts.apple.com/podcast/after-hours-edition-free-therapy-guest-tracy-nusbaum/id1591852682?i=1000567303227"
      }
    },
    {
      "id": "4f82da9e-b9ec-47db-8cf4-aa460d61c929",
      "title": "#FreeFromICOC | Guest Matthew Wolpert",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland Welcome back to Part Two of Matthew Wolpert’s conversation with us about his experience in the ICOC cult. As we learned in part one, Matthew bravely leaked the whistle-blowing letter from inside the London group.  After one of Matthew’s best friends in the group committed suicide, it was the last awakening he needed.  One of our favorite parts of this episode is near the very end where Matthew helps isolate the fact that the ICOC claims that they “have changed” and aren’t cult-like anymore—But if that was the case, they would truly own up to what they have done, and offer a different narrative and apologize at every opportunity they got. But yet they continue to gaslight and defend themselves with comments like: “It’s not the ICOC that you have problems with, it’s the Bible you have problems with, as God does demand we surrender our whole lives, and you simply aren’t strong enough to follow!” Yep…their overall arrogance and judgment remains the same, very clearly showing that the ICOC is still an indoctrinated and destructive group.  Thank you Matthew Wolpert for building a bridge that helped so many cross over to the truth—by revealing what this group was, and still is, doing!  #FreeFromICOC #IGotOut  Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Sarah Scheiman Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-06-16T13:00:31Z",
      "duration": "00:54:14.8680000",
      "explicit": false,
      "spotifyId": "6ul5ZW4ZDw4G5fySYdLiZo",
      "appleId": 1000566637633,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ul5ZW4ZDw4G5fySYdLiZo",
        "apple": "https://podcasts.apple.com/podcast/freefromicoc-guest-matthew-wolpert/id1591852682?i=1000566637633"
      }
    },
    {
      "id": "8d9170bf-a95d-41fa-b657-54841059a1a8",
      "title": "ICOC Whistleblower | Guest Matthew Wolpert",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland We are so thrilled to share Part One of our two episodes with Matthew Wolpert! Matthew joined us from across the pond, from a lovely town outside of London. Matthew was a part of the ICOC in England for 15 years, the same cult Chele was in, here in LA. The ICOC still boasts an international membership of over 120,000 people. Matthew’s story is illuminating for many reasons, but maybe most notably because he spurred the whistleblowing op-Ed type of letter that blew the doors off this cult’s questionable, abusive, and hidden practices \u0026 beliefs. The letter he helped to leak ultimately led to the awakening of a large portion of the cult’s membership, and a mass exodus occurred. Matthew “tees up” the scenario in this ‘part one’ episode, and is nothing short of a hero, creating a pathway of freedom for many thousands of people!  #FreeFromICOC #IGotOut  Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Sarah Scheiman Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-06-07T15:01:44Z",
      "duration": "00:46:39.3370000",
      "explicit": false,
      "spotifyId": "67fhmERc2UlVZHLOorFVod",
      "appleId": 1000565533516,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/67fhmERc2UlVZHLOorFVod",
        "apple": "https://podcasts.apple.com/podcast/icoc-whistleblower-guest-matthew-wolpert/id1591852682?i=1000565533516"
      }
    },
    {
      "id": "fabf5198-ed20-4166-b652-5f48582706ce",
      "title": "After Hours Edition | Season 1 Recap",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland Welcome to our Season One Recap! Hoyt and Chele answer questions and comments from Season One, and talk about what they have learned about their evolving understanding and appreciation for creating a safe space for all types of survivors of cultic relationships.  They highlight questions such as:  How do you know when you’re ready to talk about your survival story publicly?  Answer: You know that you’re ready to share your story, when you’re able to “wear your experience like a badge,” and are proud of the fact that you’ve made it to the other side...without feeling the need to defend yourself or “fix your reputation.” The bottom line is that you’re ready when you no longer care what anyone thinks of you. #IGotOut Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-05-03T18:47:05Z",
      "duration": "01:06:26.1100000",
      "explicit": true,
      "spotifyId": "2UG2dr2xIBJltuIAuQOLi1",
      "appleId": 1000559502375,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2UG2dr2xIBJltuIAuQOLi1",
        "apple": "https://podcasts.apple.com/podcast/after-hours-edition-season-1-recap/id1591852682?i=1000559502375"
      }
    },
    {
      "id": "3f81c2d4-8603-4876-9ef6-6320488e62d0",
      "title": "Scientology: Clearly Destructive | Guests Spanky Taylor and Tory Christman",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland Our episode 10 is Part 2 with the inspiring and courageous Spanky Taylor and Tory Christman! Two of the earliest whistle blowers and escapees from the Scientology cult. The events they share while inside of, and during their escape process, sound stranger than fiction, but are painfully true. The types of things that Scientology has gotten away with for almost 6 decades is nothing short of criminal—and riddled with hideous human rights violations, unlawful imprisonments, child labor \u0026 abuse, financial fraud, intimidation \u0026 coercion, violence, and despicable acts of human trafficking. Not to mention, this cult siphoned every penny from all its members. Scientology is nothing more than a vicious \u0026 illegal pyramid scheme that has built itself into a billion dollar business, investing in real estate, while capitalizing on its IRS tax exempt status. How this is still happening boggles the brain beyond comprehension. Yep, makes us angry! We can only hope that the proper authorities continue to take notice, and finally have the courage to stand up to Scientology and all of their threats! The world is watching. #IGotOut Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Sarah Scheiman Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-02-01T14:00:00Z",
      "duration": "01:05:18.8030000",
      "explicit": false,
      "spotifyId": "32des6xvvEYN1BAI3Zt1Sl",
      "appleId": 1000549662110,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/32des6xvvEYN1BAI3Zt1Sl",
        "apple": "https://podcasts.apple.com/podcast/scientology-clearly-destructive-guests-spanky-taylor/id1591852682?i=1000549662110"
      }
    },
    {
      "id": "543bba28-b323-41a6-afb5-8a556b69cfee",
      "title": "It’s All Clear Now | Guests Spanky Taylor and Tory Christman",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland We were thrilled to have the incredible Spanky Taylor and Tory Christman on to talk about their many decades in Scientology—Spanky was also a key figure in the successful whistleblowing documentary on HBO titled “Going Clear: Scientology and the Prison of Belief.” She was indoctrinated into the group around age 13, and Tory entered in her teens as well. It was hard listening to their stories, as Spanky shared about the group’s version of prison camps, detention centers, and child labor camps, and countless other unbelievable human rights violations—Resulting in her having to kidnap her OWN baby to escape the cult! While Tory (who has a great YouTube channel: ToryMagoo44) shared about the physical trauma of being denied her epilepsy medicine, working 30 hour shifts for Scientology non-stop, and giving every last cent to this cult to “work her way up the bridge,” to ‘clear’ her physical issues. Culminating in Tory being threatened and literally chased across the country as she attempted to escape! Again, this was a tough episode to hear, without feeling angry and frustrated that Scientology is still getting away with all this abuse! You will absolutely fall in love with Spanky \u0026 Tory, and our conversation with them definitely underscored the importance for all of us to speak out! Thank you Spanky \u0026 Tory for your unwavering bravery and for inspiring us with your strength and vulnerability! #IGotOut  Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Sarah Scheiman Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-01-25T14:00:00Z",
      "duration": "00:46:56.8090000",
      "explicit": false,
      "spotifyId": "3ebzsbW1ympeYNkprOzLMr",
      "appleId": 1000548946398,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ebzsbW1ympeYNkprOzLMr",
        "apple": "https://podcasts.apple.com/podcast/its-all-clear-now-guests-spanky-taylor-and-tory-christman/id1591852682?i=1000548946398"
      }
    },
    {
      "id": "e8b3b174-e0fb-4435-933f-daabc01fafc5",
      "title": "After Hours Edition | Deep Thoughts With Chele \u0026 Nixie",
      "description": "Join Chele and Nixie as we introduce our new “After Hours” bonus segment titled Deep Thoughts. In this more intimate format (usually accompanied with some good red wine), outside of the normal podcast studio, we create the space for an even deeper dive into the more sensitive and difficult topics to discuss. Especially concerning painful experiences and memories, and how they now play into the trauma recovery process. What most cult and abuse survivors find, is that you truly do have to “get it all out,” in order to neutralize the power others took from you, so that you can take your life back in all areas. And boy do Chele and Nixie practice this in our first After Hours episode! Chele likes to jokingly describe this process as being like a horrible pimple—You have to get all of the infection out first, in order for it to heal—And sometimes that’s not pretty, but it’s a necessary undertaking. We hope you find this special segment as therapeutic as we did! #IGotOut Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-01-18T14:00:00Z",
      "duration": "00:59:19.8060000",
      "explicit": true,
      "spotifyId": "7KeyyzMzpV850zgbqWmFJg",
      "appleId": 1000548238496,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KeyyzMzpV850zgbqWmFJg",
        "apple": "https://podcasts.apple.com/podcast/after-hours-edition-deep-thoughts-with-chele-nixie/id1591852682?i=1000548238496"
      }
    },
    {
      "id": "d05d79a5-14e5-4e5d-a1bb-1e94f5ff8c5d",
      "title": "From Seduced To Survived | Guest Debora Giannone",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland We are excited to have Debora Giannone as our episode 7 guest! Debora was featured in the Starz docu-series titled Seduced, with India and Catherine Oxenberg. Seduced was a short series highlighting some more in-depth info and accounts of what happened inside of the NXIVM cult. Debora was one of the original whistle blowers and bravely shares parts of her experience and trauma inside of this group. She shares some great and fresh insights, that will be helpful to anyone listening in, or curious about what truly happened inside of the NXIVM cult. We all fell in love with Debora during her time with us, and are so happy for her to have a new lease on life! #IGotOut Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Tatiana Sitnikova Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2022-01-11T14:00:00Z",
      "duration": "00:58:06.5050000",
      "explicit": true,
      "spotifyId": "7euY8NLh8BeM7duyS1ILZT",
      "appleId": 1000547556330,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7euY8NLh8BeM7duyS1ILZT",
        "apple": "https://podcasts.apple.com/podcast/from-seduced-to-survived-guest-debora-giannone/id1591852682?i=1000547556330"
      }
    },
    {
      "id": "dd7be292-6f45-4480-8f87-4496fef4612b",
      "title": "Cults Bite | Guest Dr. Steve Hassan",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland Our guest on this episode is Dr. Steve Hassan Phd, who is not only highly educated, but also a pioneer of sounding the alarm to the epidemic rates of indoctrination around our world! He’s a sought after cult expert and has made endless media appearances on programs like CNN, making him a trusted source of information and advice on anything and everything to do with cultic activity and authoritarian control. Including undue influence, coercive control and all other types of indoctrination. Steve is also personal friends with Hoyt and Chele, and has been vital in helping both of them over the years, with their own trauma recovery process. And maybe most importantly, Steve is himself a brave cult survivor, and highlights his own escape from The Moonies. You don’t want to miss this episode, as Dr. Hassan explains his BITE model: (Behavior, Information, Thoughts, \u0026 Emotional) control, and the things to watch out for in all of our relationships. We give a big heartfelt thank you to Dr. Hassan for his wise words of wisdom and compassionate heart to help humanity! You can find loads of information and his books on his comprehensive website at: https://freedomofmind.com/ #IGotOut  Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Tatiana Sitnikova Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2021-12-21T14:00:00Z",
      "duration": "00:57:59.9770000",
      "explicit": false,
      "spotifyId": "6iC2CgwBQYQeWte4F6Pv1j",
      "appleId": 1000545640894,
      "subjects": [
        "Unification Church",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6iC2CgwBQYQeWte4F6Pv1j",
        "apple": "https://podcasts.apple.com/podcast/cults-bite-guest-dr-steve-hassan/id1591852682?i=1000545640894"
      }
    },
    {
      "id": "265d8d9a-782d-4b3b-b00b-1425eb239262",
      "title": "Can of Worms",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland After 12 years of not publicly speaking about what she went through inside of, and after escaping the ICOC cult, Chele realized it was a giant can of worms. But it was also a bottomless pit of worms, and the more she spoke about it, the more she embraced what still needed to be said. That’s the thing with trauma recovery, once you peel back one layer, there are many layers underneath that still need to be dealt with. Trauma recovery takes a lifetime, and in this impromptu episode, Chele talks about how speaking publicly has revealed to her how challenging it is to share about what has happened to her, in order to truly get to the bottom of things, in the attempt to authentically and fully heal. In most cases, healing means being willing to “go there” and be split open. It’s definitely not easy. But in Chele and Hoyt’s case, this is the most empowering part of the journey—because talking about any kind of abuse or coercive control truly does allow us to acknowledge and validate what happened, which also allows us survivors to take our power back, and begin again. #IGotOut Visit our website at https://whatheflok.com Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com Filmed, Recorded and Mixed: Pink Clouds Studio Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com Director \u0026 Editor: Katheryne KTEE Thomas Camera: Vishvak Prakkruth Production Assistant: Tatiana Sitnikova Sound Recording: Gerardo Serrano; Additional Sound Editing and Re-Recording Mixer: Tom Fritze Website and Graphics: Melissa McKeehan and Mike McKeehan Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2021-12-14T14:00:00Z",
      "duration": "00:30:43.3050000",
      "explicit": true,
      "spotifyId": "4N9gBJcRGOXvt8XpLxpkvk",
      "appleId": 1000544935537,
      "subjects": [
        "Cult Recovery",
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4N9gBJcRGOXvt8XpLxpkvk",
        "apple": "https://podcasts.apple.com/podcast/can-of-worms/id1591852682?i=1000544935537"
      }
    },
    {
      "id": "3a0f88d8-2c65-4d6d-b288-c81a4e25df84",
      "title": "Butterfly Makers| Guest Nixie",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland  In this episode, Chele brings in her best friend Nixie (which is a fictitious name to protect her identity). Nixie didn’t want to be filmed and wears a hat and glasses. And you’ll have to listen in, to understand the butterfly references. Together, they begin the first of many discussions about their indoctrination into the cult they were in together called the ICOC. Their ultimate goal is to make sure people don’t feel alone, and that others have a safe space to talk through and process their own experiences with cultic relationships! But in Chele’s own words, one of the best things about this cult was that it gave her a lifelong friend like Nixie! When you’ve been through something as traumatic as this together, it bonds you for life. #IGotOut  Visit our website at https://whatheflok.com  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas  Production Partners: In Ohm Entertainment and Floating Downstream Inc. http://inohment.com  Filmed, Recorded and Mixed: Pink Clouds Studio  Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records http://OfficialJES.com and http://intonenationrecords.com  Director \u0026 Editor: Katheryne KTEE Thomas  Camera: Vishvak Prakkruth  Production Assistant: Tatiana Sitnikova  Sound Recording: Gerardo Serrano;  Additional Sound Editing and Re-Recording Mixer: Tom Fritze  Website and Graphics: Melissa McKeehan and Mike McKeehan  Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland  *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2021-11-16T14:00:00Z",
      "duration": "01:00:09.4250000",
      "explicit": true,
      "spotifyId": "6M4kQr9xJvNXSAkTfjSvTA",
      "appleId": 1000542102947,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6M4kQr9xJvNXSAkTfjSvTA",
        "apple": "https://podcasts.apple.com/podcast/butterfly-makers-guest-nixie/id1591852682?i=1000542102947"
      }
    },
    {
      "id": "7e8e3062-69f9-44e3-a571-fdc2eabb63bd",
      "title": "The Model, the Liar, \u0026 CinDarFella | Guest Dar Dixon ",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland Join Dar Dixon, as he and Hoyt dig deeper into the Doomsday cult they escaped from called Eternal Values. They awakened together, to the fact that the Doomsday group they were in, was actually a dangerous cult! Dar’s vivid storytelling illuminates the fact that these cult leaders are calculated, manipulative, and relentless. The only thing that we didn’t like about this episode is that we ran out of time. So many more stories and nuances to tell, so we will definitely be having Dar back on for another episode! #IGotOut  Visit our website at https://whatheflok.com  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok  Instagram - https://www.instagram.com/whatheflok  Facebook - https://www.facebook.com/whatheflok  Twitter - https://twitter.com/WhaTheFlok  Youtube - http://hyperurl.co/a1615r   Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas  Production Partners: In Ohm Entertainment and Floating Downstream Inc. https://inohment.com  Filmed, Recorded and Mixed: Pink Clouds Studio  Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records https://OfficialJES.com and https://intonenationrecords.com  Director \u0026 Editor: Katheryne KTEE Thomas  Camera: Justin Knodel  Production Assistant: Tatiana Sitnikova  Sound Recording: Gerardo Serrano  Additional Sound Editing and Re-Recording Mixer: Tom Fritze  Website and Graphics: Melissa McKeehan and Mike McKeehan  Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland  *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2021-11-09T14:00:00Z",
      "duration": "01:02:52.1280000",
      "explicit": true,
      "spotifyId": "4YpN04kHT3QSL2ufJlgrxj",
      "appleId": 1000541235679,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4YpN04kHT3QSL2ufJlgrxj",
        "apple": "https://podcasts.apple.com/podcast/the-model-the-liar-cindarfella-guest-dar-dixon/id1591852682?i=1000541235679"
      }
    },
    {
      "id": "f9922c94-86bf-4106-8698-5b9aad7d74e6",
      "title": "What The Bleep!? | Guest Betsy Chasse",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland  We interview the no holds barred Betsy Chasse, who is the writer, director, and producer of What The Bleep. (And keen cult sniffer-outter). #IGotOut Visit our website at https://whatheflok.com  Find out more about Betsy at https://betsychasse.net  Follow us on Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas  Production Partners: In Ohm Entertainment and Floating Downstream Inc. https://inohment.com  Filmed, Recorded and Mixed: Pink Clouds Studio  Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records  https://OfficialJES.com and https://intonenationrecords.com  Director \u0026 Editor: Katheryne KTEE Thomas  Camera: Vishvak Prakkruth  Production Assistant: Tatiana Sitnikova  Sound Recording: Gerardo Serrano  Additional Sound Editing and Re-Recording Mixer: Tom Fritze  Website and Graphics: Melissa McKeehan and Mike McKeehan  Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland  The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2021-11-02T13:00:00Z",
      "duration": "00:54:36.2650000",
      "explicit": true,
      "spotifyId": "7GyCxBRGyBO4ssMxt1IQun",
      "appleId": 1000540508418,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7GyCxBRGyBO4ssMxt1IQun",
        "apple": "https://podcasts.apple.com/podcast/what-the-bleep-guest-betsy-chasse/id1591852682?i=1000540508418"
      }
    },
    {
      "id": "ec4b0db4-2400-4056-8c9e-189b0e24b13f",
      "title": "Origin Stories",
      "description": "Hosted By Hoyt Richards \u0026 Chele Roland Welcome to our inaugural episode! \u2028 Nobody ever sets out to join a cult, but cultic relationships are lurking everywhere! You might think that this could never happen to you, but we’ve all been affected at some point by a controlling or abusive group or person. Our hosts, Hoyt Richards and Chele Roland, are perfect examples of what it means to go from “victim to survivor to thriver!”\u2028 In this first episode we get to know our hosts: \u2028During his time as the world’s first male supermodel, and a Princeton football player, Hoyt was also entrenched in a dangerous doomsday cult for 20 years, that he ended up giving multi-millions of dollars to. While Chele was in a destructive religious cult for 17 years, married to a stranger, with every aspect of her life on the line— also being forced to give massive amounts of money. \u2028They were both leaders in their cults, and between them, have 37 years of experience and harrowing tales, from two entirely different vantage points. \u2028Their goal in sharing their own stories first— is not to normalize trauma, but to normalize trauma “recovery,” and raise people’s awareness and comfort level in talking about abusive relationships of all kinds. #IGotOut  Visit Our Website At https://whatheflok.com  Follow Us On Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers: Chele Roland, Hoyt Richards and Katheryne KTEE Thomas  Production Partners: In Ohm Entertainment and Floating Downstream Inc.  Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records  Website and Graphics: Melissa McKeehan and Mike McKeehan  Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland  *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2021-10-26T12:00:00Z",
      "duration": "01:02:49.8520000",
      "explicit": true,
      "spotifyId": "5n4J2rInLcGpGPNdTdvJaY",
      "appleId": 1000539760329,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5n4J2rInLcGpGPNdTdvJaY",
        "apple": "https://podcasts.apple.com/podcast/origin-stories/id1591852682?i=1000539760329"
      }
    },
    {
      "id": "d40a87c6-c753-4eb8-84a9-a75214ba6b28",
      "title": "WhaTheFlok?! “Cult Survival Stories” Trailer",
      "description": "Hosted by Hoyt Richards \u0026 Chele Roland RAW | DISTURBING | INSPIRING Cultic relationships are EVERYWHERE! We’ve all been affected at some point by a controlling or abusive group or person, and Hoyt and Chele are the perfect examples of what it means to go from “victim to survivor to thriver.” Our hosts were both leaders in their different, but equally destructive cults, and between them, they have 37 years worth of harrowing tales and vantage points. Not only will they bring on experts and courageous guests to share their own cult survival stories, but they will be peeling back all the messy layers, to expose the underbelly of how cults use indoctrination to kidnap the mind and hijack the soul. Join us as we reveal the terrifying truths about cultic relationships, how to avoid them, and how to heal from them—and you’ll probably find yourself saying WhaTheFlok?! #IGotOut Visit Our Website: https://whatheflok.com  Follow Us On Social: Tik Tok - https://www.tiktok.com/@whatheflok Instagram - https://www.instagram.com/whatheflok Facebook - https://www.facebook.com/whatheflok Twitter - https://twitter.com/WhaTheFlok Youtube - http://hyperurl.co/a1615r  Executive Producers:  Chele Roland, Hoyt Richards and Katheryne KTEE Thomas  Production Partners:  In Ohm Entertainment and Floating Downstream Inc.  Theme song: “Get Me Through the Night,” provided by JES and Intonenation Records  Website and Graphics:  Melissa McKeehan and Mike McKeehan  Social Media Team: Melody Joy Conte, Krystal Nunez and Kira Sutherland  *The opinions and observations expressed on any WhaTheFlok recordings, channels, social media platforms and website do not reflect any official position or viewpoint of the podcast. Our guests and experts are simply exercising their right to freedom of speech and sharing personal opinions, based on their own individual experiences and/or formal training. None of the opinions or experiences shared are meant to offend or malign any individuals, organizations, businesses, or religions.  ---   Support this podcast: https://podcasters.spotify.com/pod/show/whatheflok/support",
      "release": "2021-10-24T23:23:24Z",
      "duration": "00:01:23.4520000",
      "explicit": false,
      "spotifyId": "4nYxOkiPKO1YXemJgWbvG2",
      "appleId": 1000539578286,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4nYxOkiPKO1YXemJgWbvG2",
        "apple": "https://podcasts.apple.com/podcast/whatheflok-cult-survival-stories-trailer/id1591852682?i=1000539578286"
      }
    }
  ]
}