{
  "id": "1f4e720b-8afa-4b27-9931-8406d119fc18",
  "name": "What Fresh Hell: Laughing in the Face of Motherhood | Parenting Tips From Funny Moms",
  "spotifyId": "2qOAw00rHMChZERv1x9x0P",
  "appleId": 1170073178,
  "episodes": [
    {
      "id": "017417a5-beab-4a03-afc8-c559215b7ef8",
      "title": "BEST OF: Fresh Take: Amanda Montell and the Age of Magical Overthinking",
      "description": "Cognitive biases are self-deceptive thought patterns we all use to make sense of the world. In a world that makes less and less sense, Amanda Montell argues, humans have become more irrational than ever. In her new book THE AGE OF MAGICAL OVERTHINKING , Montell explains how our brains\u0027 coping mechanisms have become overloaded—and how to slow down our panic responses when the world becomes too overwhelming. Amanda, Amy, and Margaret discuss: How magical overthinking has manifested from the modern age of mass information overload and an epidemic of loneliness The types of cognitive biases that comprise magical overthinking, such as the sunk cost fallacy, the halo effect, and proportionality bias Strategies to combat the negative effects of magical overthinking Here\u0027s where you can find Amanda: https://amandamontell.com/ @amanda_montell on IG Buy THE AGE OF MAGICAL OVERTHINKING: https://bookshop.org/a/12099/9781668007976 Listen to the \u0022Sounds Like a Cult\u0022 podcast We love the sponsors that make this show possible! You can always find all the special deals and codes for all our current sponsors on our website: https://www.whatfreshhellpodcast.com/p/promo-codes/ What Fresh Hell is co-hosted by Margaret Ables and Amy Wilson. manifest reality, positive thinking, toxic positivity, magical thinking, mom friends, funny moms, parenting advice, parenting experts, parenting tips, mothers, families, parenting skills, parenting strategies, parenting styles, busy moms, self-help for moms, manage kid’s behavior, teenager, tween, child development, family activities,",
      "release": "2025-01-03T05:30:00Z",
      "duration": "00:42:24.3520000",
      "explicit": false,
      "spotifyId": "35hvdJ4XWbLAsT3VajXLcW",
      "appleId": 1000682492637,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/35hvdJ4XWbLAsT3VajXLcW",
        "apple": "https://podcasts.apple.com/podcast/best-of-fresh-take-amanda-montell-and-the/id1170073178?i=1000682492637"
      }
    }
  ]
}