{
  "id": "48047c10-fa8e-486a-a588-c8e5f5ef30c9",
  "name": "What would we know?",
  "spotifyId": "0J2WtQZ18GR9HMybK5pBwR",
  "appleId": 1700806160,
  "episodes": [
    {
      "id": "a0aea262-3de4-455b-934d-435810159dc6",
      "title": "Ep 8: Cults Part 2",
      "description": "What was originally an episode exploring all the different cults, this episode is somewhat of a deep dive into LDS and FLDS. Follow us down the rabbit hole, as we try to understand the human experience Join us if you would like to listen to four friends talk shit about cults. Everyone one of us brings a different take to a topic, so if you enjoy hearing things dissected this is FOR YOU. If there is anything you want to hear us dissect, with a distinctly leftist vibe we want to hear about it! EXPLICIT WARNING for swearing.",
      "release": "2024-02-19T04:58:30Z",
      "duration": "00:58:04.9660000",
      "explicit": false,
      "spotifyId": "0QZaUwDpqsuZhy25fkslji",
      "appleId": 1000645823021,
      "subjects": [
        "FLDS Church",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0QZaUwDpqsuZhy25fkslji",
        "apple": "https://podcasts.apple.com/podcast/ep-8-cults-part-2/id1700806160?i=1000645823021"
      }
    },
    {
      "id": "fa4ea273-cbdc-41af-8d77-c5171701fa38",
      "title": "Ep 7: Cults",
      "description": "Follow us down this rabbit hole... In this episode we talk a little bit about the psychology of why people join cults, we begin to talk about specific cults and our personal experiences with cults! Join us if you would like to listen to four friends talk shit about cults. Everyone one of us brings a different take to a topic, so if you enjoy hearing things dissected this is FOR YOU. If there is anything you want to hear us dissect, with a distinctly leftist vibe we want to hear about it! EXPLICIT WARNING for swearing.",
      "release": "2023-12-21T14:00:00Z",
      "duration": "00:52:48.8730000",
      "explicit": true,
      "spotifyId": "194FnwlzRZmspH0mdnhg7y",
      "appleId": 1000639344272,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/194FnwlzRZmspH0mdnhg7y",
        "apple": "https://podcasts.apple.com/podcast/ep-7-cults/id1700806160?i=1000639344272"
      }
    }
  ]
}