{
  "id": "b1463410-fa62-4fbc-a38e-459785a36dac",
  "name": "WheelerCentre",
  "youTubeChannelId": "UCM_4Xs6WJsDMG_npobEAn7g",
  "episodes": [
    {
      "id": "388c649d-6f92-4193-a0b0-94f450f65f74",
      "title": "Scientology: Fair Game?",
      "description": "Scientology’s founder, L. Ron Hubbard, once defined the religion as being in service of ‘a civilisation without insanity, without criminals and without war, where the able can prosper and honest beings can have rights, and where man is free to rise to greater heights’.\n\nAlmost 60 years since its foundation, though, Scientology has become a uniquely contentious phenomenon – with many questioning its status as a religion, cult or business, and with a reputation for fiercely defensive, litigious and coercive reactions to criticism. One of the first to feel the Church’s wrath was Paulette Cooper – whose 1971 book, The Scandal of Scientology, saw her become the target of an elaborate plot which set out to destroy her credibility, frame her and land her with a 15 year prison sentence. Codenamed ‘Miss Lovely’ by Church operatives, Cooper is now the subject of investigative journalist Tony Ortega’s book, The Unbreakable Miss Lovely.\n\nOrtega is a long-time chronicler of Scientology, and one of its leading scrutineers. Featured in Alex Gibney’s HBO documentary Going Clear, he’s the executive editor of TheLipTV and former editor-in-chief of The Village Voice. He visits Melbourne – where the world’s first inquiry into Scientology was held in 1963, and Scientology was first banned in 1965 – for a chat with Steve Cannane, who’s currently writing a book on Scientology’s history in Australia.\n\n—\n\nSupport the Wheeler Centre\nIn an uncertain time for everybody, we\u0027re working hard to bring you conversations and ideas through podcasts, live-streams and publishing – all freely accessible. If you’re in a position to support our efforts to bring you books, writing and ideas from a safe distance, you can make a contribution here: https://www.wheelercentre.com/support-us/donate. Thank you for your generosity.",
      "release": "2015-11-26T06:44:34Z",
      "duration": "01:06:01",
      "explicit": false,
      "youTubeId": "jBmwZ_OmTdI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jBmwZ_OmTdI"
      }
    }
  ]
}