{
  "_ts": 0,
  "id": "413a657a-c2c2-412f-8b83-204ff5440a03",
  "name": "Whereabouts Tales",
  "spotifyId": "3DQelHdsSLJHWpPFk1ZkJP",
  "appleId": 1786452436,
  "youTubeChannelId": "UCgFHL9h6ANFrl4FpY6khf8A",
  "episodes": [
    {
      "id": "388d1305-889c-410e-be36-f21c83eec449",
      "title": "From Cult to Neuroscientist: How Dr. Leah Zitter Escaped \u0026 Rewired Her Brain",
      "description": "🌍🎙️ Dr. Leah Zitter spent over 20 years in an extremist religious cult before breaking free, earning a PhD in behavioral neuroscience, and developing the \u0022as-is method\u0022 to rewire the brain.\nIn this powerful episode of Whereabouts Tales, Dr. Zitter shares her extraordinary journey of escape and transformation. She explains how our minds are programmed from birth by our environments, and how we can break free from harmful conditioning to reclaim our authentic selves.\n\u0022Each and every one of us are literally programmed by the rules, the methodology, the lifestyle of the group that we\u0027re brought up in.\u0022\n\n🎙️ Whereabouts Tales explores expat experiences, personal growth, and inspiring life stories from around the world.\n\n🔔 Subscribe for new episodes every Friday at 17:09!\n🌐 Find us on Spotify, Apple Podcasts, and Amazon Podcasts\n▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️\nEnjoyed this story? Hit that subscribe button - it\u0027s free, and it means you won\u0027t miss any of our future Whereabouts Tales. We\u0027ve got some amazing stories coming up!\n▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️\nWant to start your own podcast? We record our interviews using Riverside.fm - the best platform for high-quality remote recordings. Get 15% off your first three months by using our link: https://www.riverside.fm/?via=whereaboutstales. What we love about Riverside is their local recording feature that ensures crystal-clear audio quality even with unstable internet connections, perfect for international interviews like this one. Plus, their separate audio and video tracks make editing a breeze.\n▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️\nif you are interested in sharing your story in our show please go to https://www.whereaboutstales.com/book and book a 15 min slot to discuss the details\n▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️▪️\nChapters\n\n00:00 Introduction to Leah Zitter\u0027s Journey\n03:53 Life in a Closed Cult\n06:40 Questioning the Norms\n09:50 The Process of Leaving\n13:00 Facing the Outside World\n15:46 The Struggles of Independence\n18:40 Reactions from Society\n21:42 The Aftermath of Leaving\n24:52 Pursuing Neuroscience\n27:41 Developing the As-Is Method\n38:51 Deep Cultural Imprints and Neuroplasticity\n42:29 Rewiring the Brain: New Environments and Perspectives\n47:03 Overcoming Emotional Triggers and Cognitive Dissonance\n50:13 The Importance of Environment in Personal Growth\n52:38 Cultural Adaptation and Understanding Different Perspectives\n58:41 Traveling vs. Living Abroad: The True Experience\n01:02:09 The Role of Storytelling in Cultural Perception\n01:05:10 Maximizing Potential Through Cultural Understanding\n01:10:09 Rapid Fire Insights: Unlearning and Growth",
      "release": "2025-04-11T15:09:00Z",
      "duration": "01:15:01",
      "explicit": false,
      "spotifyId": "0PYblEIqdSouwWMX7oj7wB",
      "appleId": 1000703168177,
      "youTubeId": "y3708dGb1qM",
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PYblEIqdSouwWMX7oj7wB",
        "apple": "https://podcasts.apple.com/podcast/from-cult-to-neuroscientist-dr-leah-zitters-journey/id1786452436?i=1000703168177",
        "youtube": "https://www.youtube.com/watch?v=y3708dGb1qM"
      }
    }
  ]
}