{
  "_ts": 0,
  "id": "d5437055-3ed1-4708-bd8c-1346c6f4eb2e",
  "name": "Who Gave Jeff Allen A Podcast?",
  "spotifyId": "5jtN3Krxc7gPMd6z2XQ3Ns",
  "appleId": 1803249037,
  "youTubeChannelId": "UCb_mI80Revm1kBq8WG4dBLA",
  "episodes": [
    {
      "id": "d9a19f0a-9fa4-43db-82e4-20977b17d28c",
      "title": "Inside the Fight: Human Trafficking, Rescue Ops \u0026 Real Hope with Trent Steele",
      "description": "Jeff and Carollynn welcome investigator and Anti-Predator Project co-founder Trent Steele for a powerful conversation about human trafficking in America. With deep insight from years of frontline experience, Trent shares how trafficking really happens, the surprising ways victims are lured, and what law enforcement and nonprofits are doing to rescue and restore lives. From gut-wrenching rescue stories to the invisible chains that keep people trapped, this episode is emotional, eye-opening, and deeply hopeful. You\u0027ll also hear how Jeff and Trent first connected—and why this mission matters so much to Jeff’s comedy tour. Warning: This episode discusses topics that may be emotionally intense, including human trafficking and exploitation. Listener discretion is advised. Learn more or donate at antipredatorproject.org https://www.instagram.com/anti_predator_org/ https://www.facebook.com/APPInvestigations/ Join us for Jeff Allen’s Celebrity Golf Classic, a two-day event packed with comedy, camaraderie, and a whole lot of competition, all for a great cause. June 29th - 30th at Westhaven Golf Club Your ticket includes: Dinner reception \u0026#43; comedy show and full tournament play. Open to golfers of all skill levels and ages. Bring your swing, your sense of humor, and your heart for a good cause. To find out more, head over to jeffallencomedy.com Support the show If you love Who Gave Jeff Allen a Podcast?, consider supporting the show! Your contributions help us keep the mics on, the jokes rolling, and the guests coming. With your support, we can: ✅ Bring on more amazing guests ✅ Improve production quality (so Jeff stops blaming the tech guy) ✅ Keep delivering the humor, insight, and occasional deep thoughts you love Every little bit helps, and we truly appreciate our listeners who partner with us to make this podcast possible. \u0026#x1f4a1; Want to chip in? Click below to support the show! \u0026#x1f449; https://www.buzzsprout.com/2448062/support",
      "release": "2025-05-05T12:00:00Z",
      "duration": "01:20:20.4010000",
      "explicit": false,
      "spotifyId": "32JVmOIYSNwTxcJJcWa46a",
      "appleId": 1000706353082,
      "youTubeId": "H9UA83Be6Is",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/32JVmOIYSNwTxcJJcWa46a",
        "apple": "https://podcasts.apple.com/podcast/inside-the-fight-human-trafficking-rescue-ops-real/id1803249037?i=1000706353082",
        "youtube": "https://www.youtube.com/watch?v=H9UA83Be6Is"
      }
    }
  ]
}