{
  "_ts": 0,
  "id": "e8604201-978c-40d4-896e-e48f8dea6f9f",
  "name": "Who Ya Know Show by ClearPath Wealth Strategies",
  "youTubeChannelId": "UCkv3OI28WMowelKKsZG1qcA",
  "episodes": [
    {
      "id": "ff92a857-c66d-4368-90b0-f4659e9d0ba0",
      "title": "Escaping a Cult: One Woman\u0027s Story of Survival and Love | Porsché Mysticque Steele",
      "description": "*About the Guest(s):*\nPorsché Mysticque Steele is a freelance editor and writer, with a unique journey into the world of book production. Her professional career began in unconventional circumstances, where she honed her skills while overcoming significant personal challenges. Steele\u0027s background in editing spans numerous unpublished works on platforms like Goodreads and Wattpad, gradually transitioning her skills into a sustainable career through freelancing platforms like Upwork. Today, she continues to thrive in the literary world while balancing her personal life with her husband, whom she met via a language exchange platform.\n\n*Summary:*\nPorsché Mysticque Steele shares a powerful narrative of resilience and creativity. Coming from a tumultuous family environment, Porsché found solace in literature, which became her gateway to freedom. Through clandestine late-night reading on platforms like Goodreads and Wattpad, Steele not only escaped her reality but also paved the way for a career in book editing. Her story takes listeners from her constrained upbringing to a five-year secretive romantic relationship with a man from Nigeria, emphasizing the power of literary pursuits as acts of rebellion and self-discovery.\nPorsché delves deeply into the impact that reading—and subsequently editing—unpublished works had on her life, comparing it to an act of liberation. These activities allowed her to break free from her father\u0027s oppressive hold and to foster a clandestine relationship with a man she\u0027d eventually marry. Notably, Steele’s journey was financially powered by her freelance editing work on Upwork, where she transformed her grammatical precision into a viable career that ultimately enabled her sister and herself to escape their circumstances. Her narrative is one of perseverance, creativity, and the transformative power of books as both a professional and personal liberation tool.\n\n*Resources:*\nPorsché Mysticque Steele LinkedIn: https://www.linkedin.com/in/porschemysticquesteele/\nCareer Transition Summit: https://event.webinarjam.com/register/67/04404igv \nLinkedIn e-book: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://online.flippingbook.com/view/714118097/⁠⁠⁠⁠⁠⁠⁠  ⁠⁠⁠⁠⁠⁠⁠\nSubscribe: ⁠⁠⁠⁠⁠⁠⁠⁠https://podcasters.spotify.com/pod/show/who-ya-know-show ⁠⁠⁠⁠⁠⁠⁠⁠\nTrevor Houston is a licensed financial professional offering insurance/financial products through various carriers. For more info visit ⁠⁠⁠⁠⁠⁠⁠⁠http://cpwstrategies.com \n\n*Chapters:*\n(0:00) Introduction to Porsché\u0027s Book Journey\n(0:31) Living in a Cult-Like Household\n(1:21) Books as an Escape\n(2:21) Becoming a Freelance Editor\n(3:45) Secret Online Relationship\n(4:45) Life-Changing Decision\n(6:47) Beginning a New Life in Nigeria",
      "release": "2025-01-22T00:00:41Z",
      "duration": "00:07:45",
      "explicit": false,
      "youTubeId": "qeZg6JHpc3c",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qeZg6JHpc3c"
      }
    }
  ]
}