{
  "id": "c87c9d8c-ad21-4d5f-9f86-17b14b50a9ee",
  "name": "Why? with Emma Kennedy",
  "spotifyId": "0KxBRHsJII5aFomn2fSQur",
  "appleId": 1714444995,
  "episodes": [
    {
      "id": "f496e3a5-b182-4008-8821-d066ed92a954",
      "title": "Why do people join cults?",
      "description": "Most of us think we’re too smart, stable and strong-willed to join a religious cult, or to cut ourselves off from our families to join a group devoted to a charismatic leader. But clearly somebody’s joining them. So why do people willingly give up their free will and independence to join cults? Do they realise what they’re getting themselves into? And how do they get out? Emma Kennedy is joined by world-leading cult deprogrammer Rick Alan Ross and NXIVM cult survivor Sarah Edmondson to explore the strange allure of the cult mindset. Buy Sarah Edmondson’s book Scarred: The True Story of How I Escaped NXIVM, the Cult That Bound My Life through our affiliate bookshop and you’ll help fund WHY? by earning us a small commission for every sale. Bookshop.org’s fees help support independent bookshops too. You can watch Sarah’s fantastic Ted Talk here . WHY? is presented by Emma Kennedy. Produced by Eliza Davis Beard. Audio production and theme music by Jade Bailey. Managing editor: Jacob Jarvis. Group Editor: Andrew Harrison. Artwork by James Parrett. Additional music is from Artlist.io . WHY? is a Podmasters Production. Instagram | Twitter | Threads Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2024-10-24T03:00:00Z",
      "duration": "00:34:37.8040000",
      "explicit": false,
      "spotifyId": "78GAVtUDEknEGwBhscNt6x",
      "appleId": 1000674177632,
      "subjects": [
        "NXIVM",
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/78GAVtUDEknEGwBhscNt6x",
        "apple": "https://podcasts.apple.com/podcast/why-do-people-join-cults/id1714444995?i=1000674177632"
      }
    }
  ]
}