{
  "_ts": 0,
  "id": "e5e065e5-5f9f-4bab-8139-6714161f8f18",
  "name": "Why is Everyone Yelling?",
  "spotifyId": "1C8kdZBQix63BgEdlb4b7r",
  "appleId": 1533854578,
  "episodes": [
    {
      "id": "81cf83f2-8a54-41e3-8a76-367947c143a1",
      "title": "Episode 178: Sarah Edmondson – A Little Bit Culty",
      "description": "Sarah Edmondson is on the podcast today! And wow, she has a story! She is a former member of NXIVM. She ended up leaving the group and came forward about things that were happening behind the scenes there. Sarah’s full story as a whistleblower is featured in the CBC podcast “Uncover: Escaping NXIVM” (downloaded over 25 million times) and “The Vow”, the critically acclaimed HBO documentary series on NXIVM. In 2019, Sarah published Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life, with Kristine Gasbarre. In this tell-all memoir, she shares her story from the moment she takes her first seminar to her harrowing fight to get out of NXIVM, collaborate with the FBI, help others, and heal. She has a podcast called “A Little Bit Culty” where she helps people understand, heal from, and avoid abusive situations, one little red flag at a time. Sarah is also the mom of two and we talk in this conversation a bit about how she parents with this knowledge that she has and protecting your kids from people with bad intentions. I loved this conversation and I hope that you do too! What we talked about: 3:45- Her work in film and television 4:55- Finding herself in a cult 19:00- MLMs 43:00- Parenting with the knowledge that she has 47:00- End of podcast questions Show notes: Sarah’s Website Sarah’s Ted Talk It’s Not You Ooko Connect with Lindsey: Lindsey on Instagram Lindsey on Twitter Lindsey on Facebook Support the I’ll Have Another Podcast on Patreon Follow SandyBoy Productions: Sandyboy Productions on Twitter Sandyboy Productions on Instagra m SandyBoy Productions Shows: Why is Everyone Yelling? The Illuminate Podcast The Herban Farmacy Podcast The Ready to Run Podcast Sponsors: Previnex Use the code “another” for 15% off OR use code “LindseyStrength” for 15% off if you purchase their new Muscle Health Plus Mic Drop Workshop",
      "release": "2024-04-16T00:00:00",
      "duration": "00:54:11.3840000",
      "explicit": false,
      "spotifyId": "0nnc5L8j5Yi0JZJthnW0UY",
      "appleId": 1000652572634,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nnc5L8j5Yi0JZJthnW0UY",
        "apple": "https://podcasts.apple.com/podcast/episode-178-sarah-edmondson-a-little-bit-culty/id1533854578?i=1000652572634"
      }
    }
  ]
}