{
  "_ts": 0,
  "id": "4434dc18-84fa-43ff-bbae-ee288bec88bb",
  "name": "Wicked Psychotherapists",
  "spotifyId": "01DKa1AYJv7f7EVuGNU5Wr",
  "appleId": 1694778951,
  "episodes": [
    {
      "id": "959f4f5a-9694-446f-8f00-c64350d08ea7",
      "title": "Understanding the Allure of Cults: A Psychological Perspective",
      "description": "Send us a Text Message we would love to hear what you thought of the show. In this episode of Wicked Psychotherapists, hosts Tanya and Erin delve into the intriguing world of cults. They explore the reasons behind people\u0027s attraction to cults, both from an external viewer\u0027s perspective and from the viewpoint of those within. The discussion covers famous cults like those led by Charles Manson and the Heaven’s Gate group, examining the psychological factors and societal needs that drive individuals to join such groups. Throughout the conversation, Tanya and Erin reflect on elements like manipulation, vulnerability, societal detachment, and the roles of charismatic leaders. The episode seeks to understand the fine line between cults and other social groups, questioning what defines harmful group dynamics and how therapy can play a role in recovery for former members. * This episode is a re-release* Connect with us! Instagram: https://www.instagram.com/wickedpsychotherapists/ Facebook: https://www.facebook.com/Wickedpodcasts/ Linktre.ee : https://linktr.ee/thewickedpsychotherapists Website : https://www.wickedpsychotherapists.com",
      "release": "2024-08-06T09:00:00Z",
      "duration": "00:47:56.1330000",
      "explicit": false,
      "spotifyId": "4bKf7SmX7iuVrY61clAb3n",
      "appleId": 1000664464139,
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Manson Family",
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4bKf7SmX7iuVrY61clAb3n",
        "apple": "https://podcasts.apple.com/podcast/understanding-the-allure-of-cults/id1694778951?i=1000664464139"
      }
    },
    {
      "id": "4c6541d5-0845-47c3-b1ee-1471f014e554",
      "title": "Discussing and Understanding: Dancing for the Devil - A Netflix Documentary",
      "description": "Send us a Text Message we would love to hear what you thought of the show. In this episode of Wicked Psychotherapists, hosts Tanya and Erin dive into the Netflix documentary \u0027Dancing for the Devil.\u0027 They explore the troubling aspects of 7M, the management group overseeing dancers featured in the documentary, and discuss the potential cult-like elements of the group under pastor Robert Shin\u0027s leadership. The discussion navigates through the complexities of mental health, control, and exploitation, reflecting on different viewpoints, including family dynamics and the search for identity and spirituality. The hosts also engage in a thought-provoking conversation about the ramifications for those involved and the possibility for family reconciliation. Connect with us! Instagram: https://www.instagram.com/wickedpsychotherapists/ Facebook: https://www.facebook.com/Wickedpodcasts/ Linktre.ee : https://linktr.ee/thewickedpsychotherapists Website : https://www.wickedpsychotherapists.com",
      "release": "2024-07-31T00:00:00Z",
      "duration": "00:43:23.6240000",
      "explicit": false,
      "spotifyId": "5q0gQJPR41phpoWMggf8Qo",
      "appleId": 1000663864721,
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5q0gQJPR41phpoWMggf8Qo",
        "apple": "https://podcasts.apple.com/podcast/discussing-and-understanding-dancing-for-the/id1694778951?i=1000663864721"
      }
    }
  ]
}