{
  "id": "fcb1e4d9-beaf-4318-9657-dd77c6ec52e8",
  "name": "Wicked Confessions Uncensored",
  "spotifyId": "1unJpIRVxVVSkBhf7yR3sO",
  "appleId": 1798937384,
  "youTubeChannelId": "UCWV8x8iWaYTsUU4MqJNZ6FA",
  "episodes": [
    {
      "id": "55837543-2660-404c-be99-158585ac4903",
      "title": "Wicked Confessions Uncensored Episode 23 : What Happens When Sister Wives Turn into a Polygamous Mean Girl Gang?",
      "description": "Forget “sister wife solidarity”. This is the real story behind the group of seven women who became a living nightmare for dozens of innocent co-wives.\nIn this explosive episode, Vera and Pamela expose the unfiltered truth of a vicious polygamist “friend group” who plotted to humiliate, emotionally destroy, and control their sister wives… all while sipping wine and quoting scripture.\nFrom cutting power during intimate nights, to chili-rubbed underwear pranks, fake hickeys, public humiliation, spying through windows, gossip warfare, and even sabotaging birthdays and funerals, this was more than jealousy. It was a cult inside a cult.\nThey called them “The Thugs”, a sisterhood of butch-cut ring leaders and wannabe queens who weaponized friendship to gain clout and crush anyone who dared look happy.\nThis is polygamy like you’ve never heard it. Raw. Hilarious. Disturbing. And yes, somehow… still healing.\n⚠️ Listener discretion advised: you will laugh, cringe, and maybe want to throw hands on behalf of these women.\n🎙️ As always, no polygamists were harmed, or denied their celestial kingdom, in the making of this podcast… at least we hope not. 😉\nWicked Confessions Uncensored \nWebsite | Tiktok | Facebook | Instagram | Email",
      "release": "2025-08-20T14:00:00Z",
      "duration": "00:26:26",
      "explicit": false,
      "spotifyId": "2luuFIf93Gq4TLmlkZOEYY",
      "appleId": 1000722812969,
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2luuFIf93Gq4TLmlkZOEYY",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-23-what-happens/id1798937384?i=1000722812969"
      }
    },
    {
      "id": "0b1361e1-10bc-4497-9b48-52b32c1b7bf9",
      "title": "Wicked Confessions Uncensored Episode 22: A Day in the Life of a Polygamous Wife 👀 (It’s Not What You Think)",
      "description": "What does a day in the life of a polygamous wife really look like? In this raw, hilarious, and totally unfiltered episode, we dive into the absurdity, routine, and emotional exhaustion of plural marriage: goat milking, nap-hopping husbands, weird food rules, and all. 🎭 From tracking your husband’s whereabouts by curtain positions to baking cakes from animal-grade sugar, this episode serves you the chaos of cult life with laughter and truth.\nPlus, we talk about the not-so-secret \u0022Telescope Club,\u0022 wife-swapping in the colony, and how we’ve healed (and laughed) our way out of the madness. If you’ve ever wondered what it’s really like behind the veil of sister wife life, this one’s for you.\n💥 Buckle up. It’s juicy, funny, heartbreaking, and liberating all at once. And no, no polygamists were harmed in the making of this podcast, at least we hope not. 😉\nWicked Confessions Uncensored \nWebsite | Tiktok | Facebook | Instagram | Email",
      "release": "2025-08-06T14:00:00Z",
      "duration": "00:31:14",
      "explicit": false,
      "spotifyId": "181sMErJp3ztQaO27676cz",
      "appleId": 1000720903352,
      "youTubeId": "u_yEQdfK9M4",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/181sMErJp3ztQaO27676cz",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-22-a-day-in/id1798937384?i=1000720903352",
        "youtube": "https://www.youtube.com/watch?v=u_yEQdfK9M4"
      }
    },
    {
      "id": "6f7b768e-b996-4c49-b20e-67a2b9f59f87",
      "title": "Wicked Confessions Uncensored Episode 21: Can I Return My Husband? Asking for a Sister Wife.",
      "description": "If Costco has a return policy… why didn’t we? In this raw and ridiculously funny episode, Vera and Pamela take a wild ride through what it would’ve looked like if polygamy came with a refund policy. From “original parts only” to emotional wear and tear, they imagine what women could have claimed back after escaping a life of arranged marriages, control, and secondhand love. But behind the laughs are real stories of survival: \u0026#x1f494; Why they really left their marriages (hint: it wasn’t just the other wives) \u0026#x1f501; How women were “returned” to their families like broken goods \u0026#x1f9e0; The moment they realized they had lost their voices—and how they took them back \u0026#x1f469;‍\u0026#x1f467;‍\u0026#x1f466; And why the ultimate “return” was taking their kids and walking into freedom If you’ve ever felt like life didn’t come with a receipt, this one’s for you. Come for the jokes, stay for the healing. \u0026#x1f44a; Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-07-30T14:00:00Z",
      "duration": "00:24:33.4880000",
      "explicit": true,
      "spotifyId": "0KS9CDoZcFxpJQMCtnUBY3",
      "appleId": 1000719797472,
      "youTubeId": "ak22dN4TWdc",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0KS9CDoZcFxpJQMCtnUBY3",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-21-can-i-return/id1798937384?i=1000719797472",
        "youtube": "https://www.youtube.com/watch?v=ak22dN4TWdc"
      }
    },
    {
      "id": "2da2cfba-d873-4b95-8fa7-bd51a028ad91",
      "title": "Wicked Confessions Uncensored Episode 20 - We Weren’t Supposed to Be Smart: Why Polygamy Fears Educated Women",
      "description": "From corn dog chaos in Cancun to reading National Geographic on the toilet just to feel educated… this episode is a wild ride through laughter, loss, sisterhood, and the sacred power of self-education. Vera and Pamela dive into what it was like growing up in a cult that discouraged education, valued obedience over knowledge, and saw smart women as a threat. They share raw stories of raising kids at 10, writing vocabulary lists by candlelight, and learning algebra with zero support, just determination. And it wouldn’t be Wicked Confessions without a little chaos: \u0026#x1f32d; A polygamist “tips” a wrestler with a corn dog in Mexico \u0026#x1f4da; Teaching themselves to read, write, and spell without school \u0026#x1f494; Wondering if their mom would’ve judged them or cheered them on \u0026#x1f3ad; Reclaiming power through humor, writing, and finally… freedom This episode is for every woman who was told to sit down, shut up, and stay sweet, but chose to rise instead. Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-07-23T14:00:00Z",
      "duration": "00:29:20.4440000",
      "explicit": true,
      "spotifyId": "7w5YlgITRQXowFBiJYam0w",
      "appleId": 1000718685304,
      "youTubeId": "5r3YeoBWaYs",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7w5YlgITRQXowFBiJYam0w",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-20-we-werent/id1798937384?i=1000718685304",
        "youtube": "https://www.youtube.com/watch?v=5r3YeoBWaYs"
      }
    },
    {
      "id": "d387ffab-ba87-45ec-b163-07f6cedf777b",
      "title": "Wicked Confessions Uncensored Episode 19 - God’s Chosen… Thieves? The Shocking Secrets Behind Polygamy\u0027s Mansions \u0026 Mind Games",
      "description": "This episode is a full-on rollercoaster: hilarious childhood memories, shady construction site heists, cousin marriages, cult gossip, and a whole lot of “WTF?” From stolen drywall and hot water heaters to bulldozers, disability fraud, and tax evasion—Vera and Pamela expose the dark side of what some called “God’s work.” We’re talking about how a polygamous cult justified stealing, hoarding food during shortages, ignoring quarantine orders during a measles outbreak, and marrying their cousins… all while judging the ones who walked away. And then there’s the flip side—how two little girls dared to leave that world behind, built empires, and found freedom without ever becoming bitter or broken. \u0026#x1f4a5; You’ll laugh. You’ll gasp. You’ll probably rewind. \u0026#x1f3a7; Buckle up, babe. This one’s wild. Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-07-16T14:00:00Z",
      "duration": "00:32:03.6310000",
      "explicit": true,
      "spotifyId": "3U3eYnhlM6OyQhXKYsSSu3",
      "appleId": 1000717530034,
      "youTubeId": "DCe-6Eykxgk",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3U3eYnhlM6OyQhXKYsSSu3",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-19-gods-chosen/id1798937384?i=1000717530034",
        "youtube": "https://www.youtube.com/watch?v=DCe-6Eykxgk"
      }
    },
    {
      "id": "75d66a8f-9897-40ae-bcfe-b7ec271b40c1",
      "title": "Wicked Confessions Uncensored Episode 18 - The Inner Circle: Panties, Pranks \u0026 Pain Inside Polygamy",
      "description": "What happens when jealousy, religion, and 13 wives mix in one house? You get stories you’ll never forget—and probably shouldn’t repeat in church. This episode of Wicked Confessions Uncensored dives into the raw, real, and sometimes ridiculous moments that shaped our lives inside a polygamous cult. From prank wars involving lingerie and titty twists (yes, seriously), to silent rivalries, lost babies in jars, and cousin-married-to-cousin drama—this is the messy, emotional, and painfully human reality behind the “sacred order.” But it’s not just about shock value. We’re talking about the emotional gymnastics women did to survive, the mental cost of being “the chosen ones,” and the long road to freedom—away from control, shame, and the voices that kept us quiet. \u0026#x1f3a7; Warning: It’s raw. It’s funny. It’s real. And if you’ve ever felt like the “crazy one” for speaking up, this one’s for you. Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-07-09T14:00:00Z",
      "duration": "00:41:16.0940000",
      "explicit": true,
      "spotifyId": "57aXfX3ZOFRXmOhqcn83dR",
      "appleId": 1000716497002,
      "youTubeId": "W-nM_y77X2Y",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/57aXfX3ZOFRXmOhqcn83dR",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-18-the-inner/id1798937384?i=1000716497002",
        "youtube": "https://www.youtube.com/watch?v=W-nM_y77X2Y"
      }
    },
    {
      "id": "182d8ffc-053d-4f78-8c71-f85d888655b0",
      "title": "Wicked Confessions Uncensored Episode 17 - Twisters, Stolen Panties \u0026 the Real Sister Wives of Polygamy",
      "description": "Forget everything you’ve seen on reality TV. These are the uncensored confessions from women who actually lived the chaos of polygamy—and we’re not holding back.\nIn this jaw-dropping episode, we spill stories too wild for prime time:\n 👙 A literal fight ends in a “boob twist” revenge move.\n 🩲 Lingerie gets stolen and displayed like trophies.\n 🚗 One wife rams her husband’s truck over a stolen “date day.”\n 🍼 A miscarried baby ends up in a jar... and the mother finds it.\n 👨‍👩‍👧 Cousins marry cousins until nobody can tell who’s related anymore.\n And don’t even get us started on the “genie in a bottle.”\nBetween the jokes and jaw drops, we also ask the hard questions: Why did we stay? What did we believe? How did we finally break free?\nBecause this isn’t just about the drama—it’s about freedom, self-trust, and silencing the inner bitch that told us to keep sweet and stay small.\n🎧 Hit play. You won’t believe what you hear.\nWicked Confessions Uncensored \nWebsite | Tiktok | Facebook | Instagram | Email",
      "release": "2025-07-02T14:00:00Z",
      "duration": "00:39:45",
      "explicit": false,
      "spotifyId": "65YpOAu65fb28OOGpj72tg",
      "appleId": 1000715452501,
      "youTubeId": "RhdQZXZGq1Q",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65YpOAu65fb28OOGpj72tg",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-17-twisters-stolen/id1798937384?i=1000715452501",
        "youtube": "https://www.youtube.com/watch?v=RhdQZXZGq1Q"
      }
    },
    {
      "id": "e6c975ce-5283-4720-b297-e5902c99ecc6",
      "title": "Wicked Confessions Uncensored Episode 16 - The Mystery Box, the Lesbian Marine \u0026 the Celestial Plot Twist",
      "description": "What do you get when you mix a box of secrets, a Marine-turned-polygamist, and a dildo that sparks way too many questions?\nIn this wild ride of an episode, we share the untold story of Betty—once a bold, lesbian Marine who traded her love, freedom, and identity for a life of celestial marriage in a polygamous cult. From playing strip poker in the military to burning tortillas in a communal kitchen, to unexpectedly raising five sister wives’ kids, her story is one of sacrifice, survival, and secretly holding on to the love of her life.\nBut it doesn’t stop there. After her husband—a man of “God” and strict morals—passes away, a mysterious box is found. And let’s just say… it raises more questions than answers. What was it for? Who did it belong to? And how many other secrets get buried in the name of righteousness?\nThis episode is hilarious, heartbreaking, and deeply human. Because behind every “righteous” rule is a real person with real feelings, secrets, and choices no one ever dared to ask about.\n🎧 Listen in as we unpack the myths, the mess, and the mystery.\nWicked Confessions Uncensored \nWebsite | Tiktok | Facebook | Instagram | Email",
      "release": "2025-06-25T14:00:00Z",
      "duration": "00:25:36",
      "explicit": false,
      "spotifyId": "3Wap2lTKQmWZyjrhgNmcOl",
      "appleId": 1000714514196,
      "youTubeId": "TDQDHcCziUM",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Wap2lTKQmWZyjrhgNmcOl",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-16-the-mystery/id1798937384?i=1000714514196",
        "youtube": "https://www.youtube.com/watch?v=TDQDHcCziUM"
      }
    },
    {
      "id": "4e4cfb6f-70ab-48af-b22f-3cb2744bbb23",
      "title": "Wicked Confessions Uncensored Episode 15 - The STD, the Secrets, and the Six-Month Rule: How Polygamy Broke Her Heart",
      "description": "This story is one for the books—scandal, betrayal, double standards, and a whole lot of “WTF?!” When a faithful wife ends up with an STD, her world shatters. The worst part? She got it from the one man she trusted—the husband she married as a virgin. In this unfiltered episode, we dive deep into what really happens behind closed doors in polygamous marriages, and how cult loyalty often forces women to stay… even when their health, dignity, and hearts are on the line. We talk about: STDs being quietly spread in “God’s name” The six-month “divorce rule” the church uses Why women get shamed for doing what men get forgiven for Midwives, marriage contracts, family “counseling,” and the shame cycle How abuse is repackaged as “spiritual growth” And yes, we even unpack the infamous tea-drugging story \u0026#x1f92f; \u0026#x1f494; If you’ve ever wondered how women are kept silent, submissive, and stuck—this episode is the uncomfortable, honest truth they never want told. Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-06-19T17:00:00Z",
      "duration": "00:36:36.0350000",
      "explicit": true,
      "spotifyId": "7vgqpPxlf8ZwxMZa3ilScO",
      "appleId": 1000713636538,
      "youTubeId": "pzThxnpP_3Y",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vgqpPxlf8ZwxMZa3ilScO",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-15-the-std/id1798937384?i=1000713636538",
        "youtube": "https://www.youtube.com/watch?v=pzThxnpP_3Y"
      }
    },
    {
      "id": "0bc0af0f-a78c-449c-b3c9-5ddd0a77a5d4",
      "title": "Wicked Confessions Uncensored Episode 14 - The Prophet, the Prank, and the Power Trip: Why We Stopped Believing",
      "description": "What happens when your childhood “prophet” is treated as more powerful than Jesus—and his grandson thinks he’s the next chosen one… because of a prank? In this episode, we dig into the absurdity and intensity of cult-level religious belief. We talk about growing up hearing that the prophet’s word was God’s word, how people still wait for him to return from the dead, and how this false authority created a culture of control, fear, and entitlement. Then we lighten it up with the infamous “Peter Please” story—a prank that convinced the prophet’s grandson he was the next holy leader. It’s a wild, hilarious ride through how belief systems shape (and sometimes warp) people’s identities, even generations later. We also reflect on the real price of leaving a system built on fear—losing friends, community, and sometimes family—but gaining something priceless: freedom and self-worth. \u0026#x1f3a7; If you\u0027ve ever been told to never question authority… this one’s for you. Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-06-11T14:00:00Z",
      "duration": "00:43:53.3770000",
      "explicit": true,
      "spotifyId": "0BCwqkVLqaIPtjZFMKRTVz",
      "appleId": 1000712441273,
      "youTubeId": "5MqpztwjxN0",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0BCwqkVLqaIPtjZFMKRTVz",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-14-the-prophet/id1798937384?i=1000712441273",
        "youtube": "https://www.youtube.com/watch?v=5MqpztwjxN0"
      }
    },
    {
      "id": "855b0fb5-fb46-4979-b621-10f746c6f820",
      "title": "Wicked Confessions Uncensored Episode 13 : The Underwear, the Dress Dye, and the Sister Wives: My Wildest Polygamy Confessions Yet",
      "description": "This episode might be one of our most unfiltered yet.\nFrom watching my sister wife hang my husband\u0027s underwear on her fence...\n To dyeing her wedding dress purple out of pure emotional chaos (thanks, inner critic)...\n To witnessing heartbreaking violence years later shared in cult gossip chats…\nWe take you through the jealousy, the trauma, the guilt, the laughter—and the honest-to-God absurdity of polygamous life. It wasn’t just weddings and baby blessings—it was hierarchy, rivalry, emotional gymnastics, and pretending everything was “God’s will” while your soul was screaming hell no.\nAnd yes, we’re naming the voice in our heads—the inner bitch—that told us we were being “worldly” or “jealous” for having normal human reactions to a deeply abnormal situation.\n🎧 Grab your tea. This one’s a rollercoaster.\nWicked Confessions Uncensored \nWebsite | Tiktok | Facebook | Instagram | Email",
      "release": "2025-06-04T14:00:00Z",
      "duration": "00:34:04",
      "explicit": false,
      "spotifyId": "7rIX4zAk2QrXQQDALesk4z",
      "appleId": 1000711165151,
      "youTubeId": "3oMBCZc2xWk",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7rIX4zAk2QrXQQDALesk4z",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-13-the/id1798937384?i=1000711165151",
        "youtube": "https://www.youtube.com/watch?v=3oMBCZc2xWk"
      }
    },
    {
      "id": "581c5424-20af-42c7-a37f-e41f084ddf7f",
      "title": "Wicked Confessions Uncensored Episode 12 : Dancing with a 16-Year-Old While His Wife Died: The Night Everything Changed",
      "description": "It was supposed to be a joyful wedding night—until a devastating accident changed everything. In this raw and emotional episode, we recount the tragic story of our sister Donna’s final night, the devastating polygamous dynamics leading up to it, and the silent suffering so many women endure in the name of “God’s law.”\nWe talk about sister wives, jealousy, emotional abuse, child grooming, and how devastatingly normalized it all was inside the cult. From 16-year-old girls being “courted” by married men, to the total lack of support for women trying to leave, this episode exposes how deeply embedded the dysfunction ran—and still runs.\n💔 We lost Donna. But we didn’t lose our voice. This is for every woman who was told to stay quiet and obey.\nWicked Confessions Uncensored \nWebsite | Tiktok | Facebook | Instagram | Email",
      "release": "2025-05-21T14:00:00Z",
      "duration": "00:26:21",
      "explicit": false,
      "spotifyId": "5zBFD3XQs1Rl306yKY7BeC",
      "appleId": 1000709275910,
      "youTubeId": "gXKMZBqJzgo",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5zBFD3XQs1Rl306yKY7BeC",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-12-dancing-with/id1798937384?i=1000709275910",
        "youtube": "https://www.youtube.com/watch?v=gXKMZBqJzgo"
      }
    },
    {
      "id": "48224860-652c-4ee9-9860-60a7725c1f1c",
      "title": "Wicked Confessions Uncensored Episode 11 - Pubes, Pettiness \u0026 Polygamy: The Real Sister Wives Tea They Don’t Show on TV",
      "description": "Forget the polished drama of reality TV—this is the raw, unfiltered truth about sister wife life in a real polygamous cult. From petty pranks to outrageous jealousy tactics (yes, pubes and egg whites were involved), we spill stories that will have you gasping, laughing, and questioning everything you thought you knew about “celestial marriage.”\nThis episode dives deep into the absurd rivalries, emotional abuse, and Mean Girls energy behind closed cult doors—where love, faith, and freedom were traded for power plays and a seat at a husband’s dinner table. But more than that, it’s about how we broke free from the system that raised us and reclaimed our worth one confession at a time.\n👑 Real talk. Real scars. Real sister wives.\nWicked Confessions Uncensored \nWebsite | Tiktok | Facebook | Instagram | Email",
      "release": "2025-05-14T14:00:00Z",
      "duration": "00:28:45",
      "explicit": false,
      "spotifyId": "7nE84vzoqD07PIJYDywPsI",
      "appleId": 1000708460699,
      "youTubeId": "NojvvE0Fj2Q",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7nE84vzoqD07PIJYDywPsI",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-11-pubes-pettiness/id1798937384?i=1000708460699",
        "youtube": "https://www.youtube.com/watch?v=NojvvE0Fj2Q"
      }
    },
    {
      "id": "e5648eb1-8863-4962-ab48-d9dc16be7d5f",
      "title": "Wicked Confessions Uncensored Episode 10 - Secrets, Sex, and Sacred Lies: Exposing Pornography \u0026 Hypocrisy in Polygamy",
      "description": "What happens when the people preaching purity are hiding porn behind closed doors? In this explosive episode, we expose the hypocrisy, shame cycles, and double standards that haunted the polygamous cult we grew up in. From hidden dildos found after a patriarch’s death, to young women disowned for porn addictions while male relatives watched in silence—we\u0027re naming what others won’t.\nWe dig deep into the twisted intersection of religion and pornography, talk about how trauma warps self-worth, and how our inner critic—the \u0022bitch in your head\u0022—keeps women small, submissive, and scared. This isn’t about judgment. It’s about freedom. Real, hard-won, speak-your-truth freedom.\n⚠️ Trigger Warning: Contains discussion of pornography, religious extremism, emotional and sexual abuse, and cult grooming.\nWicked Confessions Uncensored \nWebsite | Tiktok | Facebook | Instagram | Email",
      "release": "2025-05-07T14:00:00Z",
      "duration": "00:45:27",
      "explicit": false,
      "spotifyId": "3sX0EzQ0Ka1RqlqNzC4VjB",
      "appleId": 1000706676664,
      "youTubeId": "KAsLPy9VRf8",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sX0EzQ0Ka1RqlqNzC4VjB",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-10-secrets-sex/id1798937384?i=1000706676664",
        "youtube": "https://www.youtube.com/watch?v=KAsLPy9VRf8"
      }
    },
    {
      "id": "763fbf12-0e8d-4d0f-a31c-dbba352db612",
      "title": "Wicked Confessions Uncensored Episode 9 - When Faith Fails the Innocent: Sex, Secrets, and Hypocrisy in the Cult",
      "description": "In one of our most unfiltered episodes yet, we peel back the layers of sexual hypocrisy in the cult we escaped—and expose how silence protects predators. From the chilling story of Amy, a young girl abused by her own father, to the outrageous deception involving a traveling Christian ministry and “sperm therapy,” we reveal how easily immorality gets swept under the rug when it’s done in the name of God. Join us as we share not just the trauma, but the power that comes from finally telling the truth. If you’ve ever struggled to speak up, felt silenced by religion, or questioned the systems meant to protect you—this is for you. And if you\u0027re still healing, just know: you’re not alone. ⚠️ Trigger warning: This episode discusses sexual abuse, religious manipulation, and child grooming. Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-04-30T13:00:00Z",
      "duration": "00:36:59.5980000",
      "explicit": true,
      "spotifyId": "0r6eM1utvSO4brSqb3YwXe",
      "appleId": 1000705554034,
      "youTubeId": "o665I0RuTbw",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0r6eM1utvSO4brSqb3YwXe",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-9-when-faith/id1798937384?i=1000705554034",
        "youtube": "https://www.youtube.com/watch?v=o665I0RuTbw"
      }
    },
    {
      "id": "3719acd9-9688-4137-993f-2c56ba48069c",
      "title": "Wicked Confessions Uncensored Episode 8 - He Died… and So Did My Marriage: The Truth About Polygamy After Death",
      "description": "When a man in a polygamous cult dies, what really happens to the women he leaves behind? In this episode of Wicked Confessions Uncensored, Vera and Pamela break down the hidden aftermath of death in the colony—and how “religious duty” was often used to justify predatory behavior, spiritual manipulation, and power plays within sister wife families. This episode dives into what really went down at Horace’s funeral, how a so-called “meek and mild” widow reshaped the entire family dynamic, and how Vera discovered that everything she believed in was built on blurred lines and betrayal. ⚠️ Warning: This episode includes themes of manipulation, spiritual hypocrisy, and emotional trauma—told with raw honesty and a hint of gallows humor. Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-04-23T14:00:00Z",
      "duration": "00:33:39.6310000",
      "explicit": true,
      "spotifyId": "4UaEyi788oJJPmuB7G20mz",
      "appleId": 1000704606415,
      "youTubeId": "9YAyX8F5Irs",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4UaEyi788oJJPmuB7G20mz",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-8-he-died-and/id1798937384?i=1000704606415",
        "youtube": "https://www.youtube.com/watch?v=9YAyX8F5Irs"
      }
    },
    {
      "id": "bd052d10-ebd8-4323-8028-26cff798a803",
      "title": "Wicked Confessions Uncensored Episode 7 - The Dark Side of Polygamy: When “God’s Will” Becomes Control",
      "description": "This episode of Wicked Confessions Uncensored dives into one of the hardest stories we’ve ever shared. We’re shedding light on how spiritual manipulation and cult dynamics can enable deeply damaging behavior—especially when it comes to young girls being conditioned under the guise of “celestial marriage.” This isn’t just a story about polygamy. It’s about silence, brainwashing, power, and the fight to reclaim your worth. Vera and Pamela discuss how the inner critic (aka the “Head Bitch”) shows up during these traumatic experiences—and how to break free from it. Trigger warning: This episode involves topics surrounding control, manipulation, and underage marriage. Listen with care—and as always, listen to your heart, not the bitch in your head. ❤️ Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-04-16T14:00:00Z",
      "duration": "00:36:50.7160000",
      "explicit": true,
      "spotifyId": "3zFnAQ5FexfBDlTxwEU8D8",
      "appleId": 1000703744700,
      "youTubeId": "1dK9FGu3AUo",
      "subjects": [
        "Cult Psychology",
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zFnAQ5FexfBDlTxwEU8D8",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-7-the-dark-side/id1798937384?i=1000703744700",
        "youtube": "https://www.youtube.com/watch?v=1dK9FGu3AUo"
      }
    },
    {
      "id": "34f1ddc8-d1f0-4d16-b085-9cf9e0429942",
      "title": "Wicked Confessions Uncensored Episode 6 - When Loyalty Gets Twisted: A Widow’s Wild Ride in Polygamy Beliefs, Sister Wives, and the Lies We’re Taught",
      "description": "In this jaw-dropping episode of Wicked Confessions Uncensored, we share the unbelievable true story of one woman, several husbands, and how cult beliefs blurred every line between loyalty, survival, and scandal. This one’s got it all: forbidden relationships, blurred sisterhood boundaries, and the deep programming that convinced women their worth—and even their salvation—depended on a man. \u0026#x1f494; We break it all down, reflect on how our inner critic (aka the head voice we call “the inner bully”) shows up in moments of betrayal, shame, and survival mode, and remind you: you’re allowed to question everything you were taught. \u0026#x1f3a7; Tune in for truth, healing, and a whole lot of “wait… WHAT?!” moments. Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-04-09T14:00:00Z",
      "duration": "00:33:24.0350000",
      "explicit": true,
      "spotifyId": "5DfDUCKQ2isMhYoOl7lvjV",
      "appleId": 1000702872769,
      "youTubeId": "kLqBnRljdIo",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5DfDUCKQ2isMhYoOl7lvjV",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-6-when-loyalty/id1798937384?i=1000702872769",
        "youtube": "https://www.youtube.com/watch?v=kLqBnRljdIo"
      }
    },
    {
      "id": "f5ccefaa-1372-4dfc-bfc8-860c41b0381c",
      "title": "Wicked Confessions Uncensored Episode 5 - Me, My Husband, and the Sex Miracle: Finding Two New Brides",
      "description": "This week, we dive into the twisted tale of Lola, the prophet’s widow who became a matchmaker to reignite her own marriage. You heard that right – Lola thought the key to keeping her husband interested was to find him not one but two new brides! From matchmaking to midlife crises, darkened rooms to council meetings about hickeys, beyond the chaos and comedy, we dig deep into how the inner bitch played a role in Lola’s relentless pursuit of validation through men. Tune in for a raw, real, and hilarious look at how misguided beliefs can shape a person’s life and the hard lessons that come when trying to silence that critical inner voice. And don’t miss next week’s episode – \u0022Death Can’t Come Fast Enough for a Woman in Heat\u0022 – where things get even juicier! Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-04-02T14:00:00Z",
      "duration": "00:28:43.2450000",
      "explicit": true,
      "spotifyId": "2aTZJKc7eiDBbbJHFSSo3q",
      "appleId": 1000701903260,
      "youTubeId": "Tqn54pZygSk",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2aTZJKc7eiDBbbJHFSSo3q",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-5-me-my-husband/id1798937384?i=1000701903260",
        "youtube": "https://www.youtube.com/watch?v=Tqn54pZygSk"
      }
    },
    {
      "id": "965a7b7c-4ade-43c6-b19d-657da56dd8d9",
      "title": "Wicked Confessions Uncensored Episode 4 - Artificial Insemination: Polygamy Style",
      "description": "Ever wonder what happens when religious zealotry, sexual manipulation, and a desperate desire for motherhood collide in a cult? This week on Wicked Confessions Uncensored, Pamela and Vera dive deep into the jaw-dropping true story of Brother Parker, a self-proclaimed man of God who \u0022generously\u0022 offered to help a fellow convert by impregnating his wife — all in the name of righteousness, of course. \u0026#x1f644; In this wild ride through 1960s polygamous Mexico, we unravel the twisted logic, sexual hypocrisy, and emotional manipulation that kept women stuck—and men playing gods. As always, we check in with the head bitch (aka your inner critic) to uncover how these stories reflect deeper patterns of control, fear, and self-doubt that still show up in our lives today. \u0026#x1f4ac; If you\u0027ve ever battled with the voice in your head that whispers “you don’t deserve it” or “you have to be perfect”, this episode will have you laughing, gasping, and thinking deeper about the BS that holds us back. We expose the truth, drop the shame, and remind you that you’re not crazy—you were just programmed. Let’s deconstruct that programming together. \u0026#x1f4aa; Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-03-26T10:00:00Z",
      "duration": "00:26:04.6560000",
      "explicit": true,
      "spotifyId": "5wiGxVLcev5R7i33tBkNRB",
      "appleId": 1000700897699,
      "youTubeId": "BOl8uSXpa6A",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wiGxVLcev5R7i33tBkNRB",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-4-artificial/id1798937384?i=1000700897699",
        "youtube": "https://www.youtube.com/watch?v=BOl8uSXpa6A"
      }
    },
    {
      "id": "0ee5547b-0f69-4eac-9028-11db88db6221",
      "title": "Wicked Confessions Uncensored Episode 3 - Breaking the Chains: Love, Lies, and the Inner Critic",
      "description": "Welcome back to Wicked Confessions Uncensored! In this episode, Vera and Pamela dive into the twisted realities of love and control inside the cult. From being married off young and completely clueless about sex to witnessing the bizarre rules of widowhood, this conversation gets raw and real. What happens when you\u0027re told you\u0027re never enough? That you don’t deserve love unless you play by their rules? We break down how the inner critic thrives in environments of shame and control—keeping women stuck, silenced, and believing they aren’t worthy of more. It\u0027s time to break free, reclaim your voice, and stop letting that voice in your head run the show. Buckle up, because this one\u0027s a wild ride. Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-03-19T14:00:00Z",
      "duration": "00:27:41.4400000",
      "explicit": true,
      "spotifyId": "1sHVCpGcy0CtSARzJEkFnv",
      "appleId": 1000699958765,
      "youTubeId": "zhlS2VbrMNg",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1sHVCpGcy0CtSARzJEkFnv",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-3-breaking-the/id1798937384?i=1000699958765",
        "youtube": "https://www.youtube.com/watch?v=zhlS2VbrMNg"
      }
    },
    {
      "id": "1eb3982f-9eeb-440b-8055-d1faa0a9f24a",
      "title": "Wicked Confessions Uncensored Episode 2 - Polygamy Exposed: The Wife, The Husband \u0026 The Lie",
      "description": "Ever heard of holy sex? In this wild episode of Wicked Confessions Uncensored, we dive into one of the most bizarre, hypocritical, and yes—darkly hilarious—stories from our time in a polygamous cult. A devoted wife, a righteous husband, and a new sister wife take \u0022missionary style\u0022 to a whole new level… but not in the way you\u0027d expect. This story exposes the cracks in the cult’s rules, the lies women were forced to believe, and how the bitch in your head (your inner critic) convinces you to accept the unacceptable. It’s messy, it’s raw, and it’s real. \u0026#x1f6a8; Buckle up for jaw-dropping twists, unexpected humor, and a reality check on how these belief systems break women down. Oh, and don’t forget to stay tuned for next week’s Sex Academy for Widows and Righteous Women—because, yes, that was a real thing. \u0026#x1f633;\u0026#x1f525; Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-03-12T14:00:00Z",
      "duration": "00:29:49.2310000",
      "explicit": true,
      "spotifyId": "3QQ5y4pImOodHqUR1uk4DK",
      "appleId": 1000698896171,
      "youTubeId": "A1aP6gxg0Xo",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QQ5y4pImOodHqUR1uk4DK",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-2-polygamy-exposed/id1798937384?i=1000698896171",
        "youtube": "https://www.youtube.com/watch?v=A1aP6gxg0Xo"
      }
    },
    {
      "id": "9b9b92fc-884b-4a64-b790-acc450892471",
      "title": "Wicked Confessions Uncensored Episode 1 - Sacred Lies \u0026 Silent Pain: Exposing the Double Standards",
      "description": "In this raw and unfiltered episode of Wicked Confessions Uncensored, we roll up our sleeves and dive deep into one of the most controversial and painful realities of life inside the cult. What happens when purity and piety are weaponized against women? When sacred laws are used to control, suppress, and inflict shame? Today, we’re exposing the hypocrisy of religious conditioning, the untold struggles of women forced into submission, and how the ‘inner bitch’—that self-critical voice—keeps so many trapped in silence. \u0026#x1f6a8; Trigger warning: This episode discusses mature topics, including religious sexual hypocrisy and emotional trauma. If you have little ones around, this might be the time to put in your headphones. \u0026#x1f4a5; We’re breaking the cycle. We’re calling out the lies. And we’re doing it all with our signature mix of brutal honesty, humor, and raw storytelling. \u0026#x1f449; Stay tuned for next week’s episode! \u0026#x1f50a; Listen now and remember: Trust your heart, not the bitch in your head. #WickedConfessionsUncensored #CultSurvivor #ExposeTheTruth #BreakingTheSilence Wicked Confessions Uncensored Website | Tiktok | Facebook | Instagram | Email",
      "release": "2025-03-05T15:00:00Z",
      "duration": "00:39:27.8690000",
      "explicit": true,
      "spotifyId": "44MEhFjhjkJOBkGDWLHEoh",
      "appleId": 1000697888649,
      "youTubeId": "Q9zRRipbFeI",
      "subjects": [
        "Church of the Firstborn (LeBaron family)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/44MEhFjhjkJOBkGDWLHEoh",
        "apple": "https://podcasts.apple.com/podcast/wicked-confessions-uncensored-episode-1-sacred-lies/id1798937384?i=1000697888649",
        "youtube": "https://www.youtube.com/watch?v=Q9zRRipbFeI"
      }
    }
  ]
}