{
  "id": "6d264595-4964-49ca-8e7c-238d9f7b26af",
  "name": "Wild and Worthy with Kellie Rhea",
  "spotifyId": "33WxHaV5VMEs1ZtPXnaMTz",
  "appleId": 1836899713,
  "youTubeChannelId": "UCrEI26ezHi05J7uXZKK6Fzw",
  "episodes": [
    {
      "id": "982e25b1-8dac-4e25-891e-d931111fd1f4",
      "title": "The Dopamine Trap with Dr John Hunter",
      "description": "The Dopamine Trap: Why Breakthrough Culture Hooks the Nervous System Episode Summary: This conversation explores the neuroscience and psychology behind high-intensity personal development environments and why certain seminars create powerful emotional states. Dr John Hunter shares research on the dopamine dynamics involved in stress, sleep disruption, and sudden goal attainment, and how these conditions shape experiences that are often interpreted as breakthroughs or spiritual insight. We discuss how these cycles influence motivation, identity, decision making and emotional regulation, along with the psychological mechanisms that make these states feel transcendent. The episode offers a grounded, psychoeducational look at why these experiences are so compelling and how the nervous system responds during periods of high arousal and rapid change. Key Takeaways • Experiential learning plays a central role in high-intensity personal development settings. • Transformation often arises from emotional and physiological shifts rather than cognitive insight alone. • Stress, disrupted sleep and rapid goal attainment are known triggers for intense emotional states. • Seminars can evoke euphoria, empowerment and heightened confidence. • A significant percentage of participants report breakthrough-like experiences. • These experiences can increase motivation, energy and a sense of clarity. • Changes in perception and identity often emerge quickly. • Understanding the underlying physiological processes provides context for these experiences. • Personal growth is influenced by both emotional learning and neurochemical responses. • Recognising the conditions that create these states supports informed participation in high-demand environments. Connect With the Guests Dr John Hunter, PhD Here is a refined, accurate and respectful bio for your show notes, drawn directly from what appears on the back of his book. It stays fully within legal-safe boundaries and simply presents his credentials and research focus. Dr John Hunter, PhD Dr John Hunter is a South African lecturer and researcher whose work focuses on psychological suffering, social reward, and elevated affective states. His research provides vital insights into the international personal development industry and the mechanisms that shape intense emotional and transcendent experiences. He has testified as an expert witness in a United States federal court on cases involving abuse in the Troubled Teen Industry, and his work bridges neuroscience, psychology, and affective science to explain how heightened emotional states arise and why they are often interpreted as breakthroughs or spiritual experiences. Dr Hunter’s book, Manufacturing Mania: The Dopamine Hypothesis of Religious Experience, brings together evidence from neuroscience, psychopathology, and pharmacology to examine how particular emotional states can be induced, amplified, or misinterpreted. The book explores how naturally occurring brain processes, when combined with specific forms of priming and context, can produce experiences that feel transcendent, spiritual, or revelatory. For more information on Dr Hunter’s work: www.johnhunterphd.com Author of Manufacturing Mania: The Dopamine Hypothesis of Religious Experience Book link: https://www.amazon.com/ Dave Hompes Instagram: @davehompes",
      "release": "2025-12-02T08:00:00Z",
      "duration": "01:21:54.5500000",
      "explicit": false,
      "spotifyId": "1lDnFx4R7E5Y0m8QfpqcuL",
      "appleId": 1000739252889,
      "youTubeId": "_TawNmmD9s8",
      "subjects": [
        "Large Group Awareness Trainings",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1lDnFx4R7E5Y0m8QfpqcuL",
        "apple": "https://podcasts.apple.com/podcast/the-dopamine-trap-with-dr-john-hunter/id1836899713?i=1000739252889",
        "youtube": "https://www.youtube.com/watch?v=_TawNmmD9s8"
      }
    },
    {
      "id": "b848c6e1-1279-4cab-b54a-43bcfcb6cb90",
      "title": "Confronting the Line on Transformation and Exploitation with Anne Peterson",
      "description": "Anne Peterson’s story begins in a difficult marriage that led her to seek change through the personal development world. Her search for meaning brought her to *Landmark*, one of the most well-known large group awareness trainings promising empowerment and transformation.\n\nAnne quickly became immersed in its leadership programs, dedicating long hours while her health and family life began to erode. She eventually helped organise a comeback tour for Werner Erhard, the founder of Landmark, and during that experience, she witnessed coercive practices and abusive behaviour within the organisation.\n\nIn this episode, Anne and Kellie examine how the idea of “transformation” can become a mechanism of control when it is used to override intuition and conscience. Together, they unpack the subtle ways that self-help systems can exploit human sincerity, including:\n\n* The social pressure within group environments that leads to conformity.\n* Language manipulation and confusing “word salad” that distort reality.\n* The illusion of instant enlightenment as a distraction from authentic growth.\n* The weaponisation of victimhood and the silencing of genuine distress.\n* The absence of informed consent and mental health awareness in these spaces.\n\nAnne speaks candidly about the psychological cost of chasing transformation and the importance of recognising red flags early. She highlights that authentic change requires time, grounded community, and the capacity to feel and process emotions, not suppress them.\n\nThis conversation calls attention to the need for *industry regulation*, *ethical screening*, and *consumer protection laws* within the self-help sector. It also encourages practitioners to understand the potential dangers of their work and the responsibility they hold toward participants who may be vulnerable.\n\nAnne’s message is ultimately one of empowerment: trust your inner sense of truth, question authority presented as enlightenment and remember that real transformation honours the whole human experience rather than bypassing it.\n\n----------------------------------------\n\n*About Anne Peterson*\n\nAnne Peterson is a writer, speaker, and advocate for ethics and safety within the human potential and self-help industries. Drawing from her lived experience inside Landmark and her recovery from its effects, she works to bring awareness to coercive influence, psychological manipulation, and the need for reform in unregulated transformational programs.\n\n* *Website:*http://www.ilumn8.life\n* *Book:* _Is This a Cult?_ – available on https://www.amazon.com/\n\n_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _\n\n·      Seek Safely – http://seeksafely.org\n\n·      Kellie Rhea - @iamkellierhea\n\n \n\n----------------------------------------",
      "release": "2025-10-22T01:15:00Z",
      "duration": "01:22:52.1810000",
      "explicit": true,
      "spotifyId": "4nl04mQ0E0R6BYDd0v234U",
      "appleId": 1000732900250,
      "youTubeId": "t4pgCJeHge8",
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings",
        "Cult Psychology",
        "Erhard Seminars Training"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4nl04mQ0E0R6BYDd0v234U",
        "apple": "https://podcasts.apple.com/podcast/confronting-the-line-on-transformation-and/id1836899713?i=1000732900250",
        "youtube": "https://www.youtube.com/watch?v=t4pgCJeHge8"
      }
    },
    {
      "id": "ea5b9cad-866b-41ad-8afc-c05082d115ac",
      "title": "\u0022Inside Cult Minds\u0022—Mark Vincente",
      "description": "Inside Cult Minds\nIn this episode of Inside Cult Minds, Kellie Rhea sits down with filmmaker and whistleblower Mark Vicente (What the Bleep Do We Know?!, The Vow) to explore the inner mechanics of high-control groups, coercive systems, and the psychological patterns that keep people trapped. Together they discuss love bombing, data mining, infantilization, self-sealing belief systems, and the difficult road of recovery.\nMark also shares insights from his upcoming documentary The Narcissist’s Playbook, which investigates narcissistic abuse through the voices of survivors, clinicians, neuroscientists, and self-confessed narcissists.\nDisclaimer\nThis conversation is based on our personal experiences and perspectives. We talk about high-control groups and coercive systems in general terms, and nothing here should be taken as a statement of fact about any named individual or organisation. Nothing in this episode should be considered legal, medical, or psychological advice.\nConnect with Mark\nWebsite: markvicente.comInstagram: @markvicenteConnect with Kellie\nInstagram: @iamkellierheaPodcast Instagram: @wildandworthypodListener Note\nWhen seeking personal development or any form of mental health care, please ask many questions. Informed choice and careful discernment are vital. For additional guidance, visit Seek Safely.",
      "release": "2025-09-19T08:30:00Z",
      "duration": "00:54:16",
      "explicit": false,
      "spotifyId": "2H5nfdiLlQGS7CUi9VL7Xz",
      "appleId": 1000727475512,
      "youTubeId": "lmLfmvQpGXw",
      "subjects": [
        "NXIVM",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2H5nfdiLlQGS7CUi9VL7Xz",
        "apple": "https://podcasts.apple.com/podcast/inside-cult-minds-mark-vincente/id1836899713?i=1000727475512",
        "youtube": "https://www.youtube.com/watch?v=lmLfmvQpGXw"
      }
    }
  ]
}