{
  "id": "6d264595-4964-49ca-8e7c-238d9f7b26af",
  "name": "Wild and Worthy with Kellie Rhea",
  "spotifyId": "33WxHaV5VMEs1ZtPXnaMTz",
  "appleId": 1836899713,
  "youTubeChannelId": "UCrEI26ezHi05J7uXZKK6Fzw",
  "episodes": [
    {
      "id": "ea5b9cad-866b-41ad-8afc-c05082d115ac",
      "title": "\u0022Inside Cult Minds\u0022—Mark Vincente",
      "description": "Inside Cult Minds\nIn this episode of Inside Cult Minds, Kellie Rhea sits down with filmmaker and whistleblower Mark Vicente (What the Bleep Do We Know?!, The Vow) to explore the inner mechanics of high-control groups, coercive systems, and the psychological patterns that keep people trapped. Together they discuss love bombing, data mining, infantilization, self-sealing belief systems, and the difficult road of recovery.\nMark also shares insights from his upcoming documentary The Narcissist’s Playbook, which investigates narcissistic abuse through the voices of survivors, clinicians, neuroscientists, and self-confessed narcissists.\nDisclaimer\nThis conversation is based on our personal experiences and perspectives. We talk about high-control groups and coercive systems in general terms, and nothing here should be taken as a statement of fact about any named individual or organisation. Nothing in this episode should be considered legal, medical, or psychological advice.\nConnect with Mark\nWebsite: markvicente.comInstagram: @markvicenteConnect with Kellie\nInstagram: @iamkellierheaPodcast Instagram: @wildandworthypodListener Note\nWhen seeking personal development or any form of mental health care, please ask many questions. Informed choice and careful discernment are vital. For additional guidance, visit Seek Safely.",
      "release": "2025-09-19T08:30:00Z",
      "duration": "00:54:16",
      "explicit": false,
      "spotifyId": "2H5nfdiLlQGS7CUi9VL7Xz",
      "appleId": 1000727475512,
      "youTubeId": "lmLfmvQpGXw",
      "subjects": [
        "NXIVM",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2H5nfdiLlQGS7CUi9VL7Xz",
        "apple": "https://podcasts.apple.com/podcast/inside-cult-minds-mark-vincente/id1836899713?i=1000727475512",
        "youtube": "https://www.youtube.com/watch?v=lmLfmvQpGXw"
      }
    }
  ]
}