{
  "_ts": 0,
  "id": "8f9033fc-0823-4567-8770-682bab5ccad7",
  "name": "WILDCIDE",
  "spotifyId": "2tkb8p52CuUtxkNLypeu7K",
  "appleId": 1721815484,
  "episodes": [
    {
      "id": "9dcbdb9e-3db4-4cb8-86e1-262995a78cfb",
      "title": "Cults: Interview with Expert Rick Alan Ross",
      "description": "Rick Alan Ross is the founder and Executive Director of The Cult Education Institute. He is an internationally known expert regarding destructive cults, controversial groups and movements and author of the book \u0022Cults Inside Out: How People Get In and Can Get Out.\u0022 Ross is one of the most readily recognized experts offering analysis about destructive cults, controversial groups and movements in the world today. Since 1982 he has been studying, researching and responding to the problems often posed by controversial authoritarian groups and movements. Ross has been qualified and accepted and testified as an expert witness in court proceedings across the United States including US Federal Court. He has also frequently assisted local and national law enforcement and government agencies. He has personally assisted thousands of families in an effort to help the victims of destructive cults, groups and movements. GQ Magazine identified \u0022Rick Alan Ross [as] America’s leading cult expert.\u0022 And Britain\u0027s FHM Magazine named him \u0022America\u0027s number one cult buster.\u0022 He has been a paid consultant and technical consultant with prestigious film networks such as Mirimax/Disney and CBS. Ross has also been quoted within numerous publications such as Time Magazine and has extensive experience lecturing internationally. Ross has also made multiple appearances on television shows such as “Dr. Phil” and “Ophrah”. Ross\u0027 analysis has been sought on virtually every major cult story for decades.     Thanks for listening! If you want to support us, you can follow/subscribe to “WILDCIDE” on your favorite podcast listening app. While you’re there, please rate and leave us a review – we would really appreciate it! You can also visit our website at www.wildcidepodcast.com (merch coming soon!)   Make sure to get updates by following us on Instagram (@wildcidepodcast) and Facebook (Wildcide Podcast). Don’t forget Wildcide Wednesdays- new episodes drops every Wednesday at 6am EST.    Art for the podcast was created by Kelly Steen. Editing/Production for the podcast by Bltzwolff (bltzwolff@gmail.com).   WILDCIDE Podcast and any content posted is presented solely for general informational, educational, and entertainment purposes. The use of information on this podcast or materials linked from this podcast or website is at the user’s own risk. It is not intended as a substitute for the advice of a physician, professional coach, psychotherapist, or other qualified professional, diagnosis, or treatment. Users should not disregard or delay in obtaining medical advice for any medical or mental health condition they may have and should seek the assistance of their healthcare professionals for any such conditions.    Resources: Getting Help (culteducation.com) Book: https://cultsinsideout.com   National Domestic Violence Hotline (24/7). Languages: English, Spanish and 200\u002B through interpretation service. Call 800-799-7233 or chat SMS: Text START to 88788",
      "release": "2024-02-02T11:00:00Z",
      "duration": "01:17:19.6300000",
      "explicit": true,
      "spotifyId": "3KwlUd5I8ChutJe89uVh5Q",
      "appleId": 1000643923764,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3KwlUd5I8ChutJe89uVh5Q",
        "apple": "https://podcasts.apple.com/podcast/cults-interview-with-expert-rick-alan-ross/id1721815484?i=1000643923764"
      }
    },
    {
      "id": "d2f6b1cd-6bea-4079-8cfe-4d571e0ba482",
      "title": "Alleged Cult: Rashad Jamal and the University of Cosmic Intelligence",
      "description": "In a digital age it would make sense to have a digital cult. Rashad Jamal White uses multiple social media platforms to promote his school, The University of Cosmic Intelligence and enlighten his followers who he refers to as “gods and goddesses”. Rashad Jamal claims to have a deep understanding in subjects from metaphysics to marine biology to world history. He is happy to share his thoughts, passions, and opinions…for a price. Hundreds of thousands are tuning in, liking, subscribing, and paying for this knowledge that he frequently uploads from the Barrow County Detainment Center. That’s right, this convicted sex offender is still largely influencing his followers and recently 6 of those confirmed followers have gone missing (including two children).  That is in addition to 2 followers who have been linked to brutal homicides. Let’s dive into the bizarre world of Rashad Jamal and his ‘culty’ University of Cosmic Intelligence and discuss the character parallels between this alleged cult leader and others. More importantly, let’s spread the word and bring these 6 missing people back home. Make sure to tune in on Friday 2/2/2024 to listen to our interview with cult expert Rick Alan Ross. Thanks for listening! If you want to support us, you can follow/subscribe to “WILDCIDE” on your favorite podcast listening app. While you’re there, please rate and leave us a review – we would really appreciate it! You can also visit our website at www.wildcidepodcast.com (merch coming soon!) Make sure to get updates by following us on Instagram (@wildcidepodcast) and Facebook (Wildcide Podcast). Don’t forget Wildcide Wednesdays- new episodes drop every Wednesday at 6am EST.  ​​Art for the podcast was created by Kelly Steen. Editing/Production for the podcast by Bltzwolff (bltzwolff@gmail.com). ​WILDCIDE Podcast and any content posted is presented solely for general informational, educational, and entertainment purposes. The use of information on this podcast or materials linked from this podcast or website is at the user’s own risk. It is not intended as a substitute for the advice of a physician, professional coach, psychotherapist, or other qualified professional, diagnosis, or treatment. Users should not disregard or delay in obtaining medical advice for any medical or mental health condition they may have and should seek the assistance of their healthcare professionals for any such conditions.    Resources: Getting Help (culteducation.com)   National Domestic Violence Hotline (24/7). Languages: English, Spanish and 200\u002B through interpretation service. Call 800-799-7233 or chat SMS: Text START to 88788    References: Today, U. (2024, January 19). YouTube cult, naked meditation, and a convicted child molester linked to 6 disappearances. USA TODAY. https://www.usatoday.com/story/news/nation/2024/01/18/university-of-cosmic-intelligence-cult-disappearances-police-say/72257648007/ Rihan, M. (2022, May 12). Rashad White. The Georgia Gazette. https://thegeorgiagazette.com/barrow/rashad-white-4/ York, M. Z. (1990). The Holy Tablets. United States: (n.p.). Kull, K. (2024, January 11). Take a look back at December 2023 [Video]. STLtoday.com. https://www.stltoday.com/news/local/crime-courts/guru-denies-being-cult-leader-says-he-doesn-t-know-people-missing-from-st-louis/article_1f116254-b00a-11ee-b256-07e0a4170d16.html Conklin, A. (2022, September 3). Followers of social media spirituality influencer accused of 2 murders in Alabama: “I am a god.” Fox News. https://www.foxnews.com/us/followers-social-media-spirituality-influencer-accused-3-murders-alabaama-i-am-god Rosenberg, R. (2023, September 13). Woman admits to faking car trouble, killing Florida college student who stopped to help her. Fox News. https://www.foxnews.com/us/woman-admits-faking-car-trouble-killing-florida-college-student-stopped-help-her?dicbo=v2-VhJCIVs Geiger, D. (2024, January 2). Alabama man drawn to ’Cult’-Like Egyptian videos attacks family, kills mom with sword. Oxygen Official Site. https://www.oxygen.com/crime-news/damien-washam-arrested-in-murder-of-mom-helen-nettles-washam Mallory, A. (2023, September 25). Eight Mile man accused of brutally killing mother with sword, found not guilty by reason of insanity. https://www.fox10tv.com. https://www.fox10tv.com/2023/09/25/eight-mile-man-accused-brutally-killing-mother-with-sword-found-not-guilty-by-reason-insanity/ Staff, T. C. D. (2024, January 16). Missouri police believe 6 people who have been missing since August could be in cult | Truecrimedaily.com. True Crime Daily. https://truecrimedaily.com/2024/01/16/st-louis-berkeley-missouri-rashad-jamal-cult-six-people-missing/",
      "release": "2024-01-31T11:00:00Z",
      "duration": "01:18:35.8600000",
      "explicit": true,
      "spotifyId": "0o05B58GfIR0HJ1bbrsuri",
      "appleId": 1000643649100,
      "subjects": [
        "University of Cosmic Intelligence"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0o05B58GfIR0HJ1bbrsuri",
        "apple": "https://podcasts.apple.com/podcast/alleged-cult-rashad-jamal-and-the-university/id1721815484?i=1000643649100"
      }
    }
  ]
}