{
  "_ts": 0,
  "id": "8f9033fc-0823-4567-8770-682bab5ccad7",
  "name": "WILDCIDE",
  "spotifyId": "2tkb8p52CuUtxkNLypeu7K",
  "appleId": 1721815484,
  "youTubeChannelId": "UC0SmSZn6Xh2M79qa2bISYRg",
  "episodes": [
    {
      "id": "6d4442c8-cb04-456d-8ab8-67dbfe556342",
      "title": "The Zizians: A Murderous Transgender Vegan Cult?",
      "description": "Content Warning: This episode discusses murder, suicide, and other sensitive or controversial topics. Ooof. This one is a full-blown inferno, and it is STILL DEVELOPING. Meet the Zizians—who refer to themselves as—wait for it—the Vegan Siths. *Cue \u0022The Imperial March\u0022* This case unravels the shocking layers of a radical faction of rationalists who, despite preaching altruism, have left a trail of brutality in their wake. With at least four brutal murders and two additional deaths linked to the group, their ideology has mutated from intellectual posturing into a twisted labyrinth of suicide, faked deaths, crime, deception, and murder. This culty group, led by the enigmatic Jack Amadeus “Ziz” LaSota, the Zizians believe they are the masterminds of a better world—until their so-called rationalism turned into something totally irrational, super warped, and very, very dangerous. Murders, fugitives, and a tangled mess of legal chaos later, the question remains: Were these people already broken before they found rationalism, or did rationalism break them? And with some members still at large, is the story really over? Buckle up—because this isn’t just another cult story. This is a real-time unraveling of a belief system gone deadly. Thanks for listening! If you want to support us, you can follow/subscribe to WILDCIDE on your favorite podcast listening app. While you’re there, please rate and leave us a review – we would really appreciate it! You can also visit our website at www.wildcidepodcast.com (merch now available!) Make sure to get updates by following us on Instagram (@wildcidepodcast) and Facebook (Wildcide Podcast). Don’t forget Wildcide Wednesdays- new episodes drop every Wednesday at 6am EST. Interviews will drop every other Friday at 6am EST. Art for the podcast was created by Kelly Steen. Editing/Production for the podcast by Bltzwolff (bltzwolff@gmail.com). ​WILDCIDE Podcast and any content posted is presented solely for general informational, educational, and entertainment purposes. The use of information on this podcast or materials linked from this podcast or website is at the user’s own risk. It is not intended as a substitute for the advice of a physician, professional coach, psychotherapist, or other qualified professional, diagnosis, or treatment. Users should not disregard or delay in obtaining medical advice for any medical or mental health condition they may have and should seek the assistance of their healthcare professionals for any such conditions. More Rationalist Insights: LessWrong References: Associated Press. (2025, February 18). A timeline of cultlike \u0027Zizian\u0027 group tied to killing of a Border Patrol agent in Vermont. PBS NewsHour. https://www.pbs.org/newshour/nation/a-timeline-of-cultlike-zizian-group-tied-to-killing-of-a-border-patrol-agent-in-vermont Ratliff, E. (2025, February 21). The delirious, violent, impossible true story of the Zizians. WIRED. https://www.wired.com/story/delirious-violent-impossible-true-story-zizians/ LessWrong. (n.d.). J. LaSota (Ziz). https://www.lesswrong.com/w/j-lasota-ziz Romano, A. (2025, February 25). The post-rationalist murder spree’s so-called “cult” leader has finally been arrested. What? Vox. https://www.vox.com/culture/400722/zizians-ziz-murders-cult-what-happened Cavallier, A. (2025, February 23). Zizians crime rampage: How six deaths in three states came to be linked to a cult-like group. The Independent. https://www.the-independent.com/news/world/americas/crime/zizian-cult-murders-jack-lasota-b2701886.html USA Today. (2025, February 19). Inside the Zizian movement: A cult-like group’s rise and unraveling. https://www.usatoday.com/story/news/nation/2025/02/19/zizian-cult-like-group-details/79108035007/ Chamings, A., \u0026 Dowd, K. (2025, February 27). \u0027Show her the body\u0027: Alleged kill orders, cult behavior inside the Bay Area Zizians. SFGate. https://www.sfgate.com/bayarea/article/alleged-kill-orders-cult-zizians-bay-area-20184964.php Associated Press. (2025, February 17). Cult leader arrest | Cultlike \u0027Zizian\u0027 group leader linked to multiple killings in the US arrested, police say. ABC11 Raleigh-Durham. Police say they\u0027ve arrested apparent Zizian group leader | AP News Start Insight. (n.d.). Zizians: The rise of the vegan cult – From philosophy to violence. https://www.startinsight.eu/en/zizians-the-rise-of-the-vegan-cult-from-philosophy-to-violence/",
      "release": "2025-03-05T08:30:00Z",
      "duration": "01:25:38.4710000",
      "explicit": true,
      "spotifyId": "0igYGelXQKnBWkTVyM9chA",
      "appleId": 1000697823787,
      "youTubeId": "6cH0Y_iBMv8",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0igYGelXQKnBWkTVyM9chA",
        "apple": "https://podcasts.apple.com/podcast/the-zizians-a-murderous-transgender-vegan-cult/id1721815484?i=1000697823787",
        "youtube": "https://www.youtube.com/watch?v=6cH0Y_iBMv8"
      }
    },
    {
      "id": "24ed906f-b4f2-41bb-9193-b62fa87c12c3",
      "title": "The Angel\u0027s Landing Cult (Part 2)",
      "description": "In part two of this two-part case, we are back to the manipulation, crime, and charisma of Daniel Perez, AKA Lou Castro. In part one, we explored Perez’s control over his followers led to a series of suspicious deaths, each conveniently linked to large life insurance payouts that supported the cult\u0027s luxurious lifestyle. For part two, we begin to really dig into how Perez\u0027s control extended beyond financial exploitation. In the spring of 2011, the \u0027nail in the coffin\u0027 for bringing down Daniel Perez was a recovered hard drive full of incriminating information. We begin to get into the testimonies of three former cult members that would be the catalyst to Perez\u0027s arrest and witness testimonies of unimaginable horror that was going on at behind the \u0027kumbaya\u0027 facade of Angel\u0027s Landing. We will explore how Daniel Perez convinced his followers that he was a centuries-old supernatural being or angel with special powers, and how he needed to have sex with young girls to stay alive and maintain his power. Hang out with us as we tie up this intense two-part episode about this \u0027supernatural\u0027 cult leader (who was just a gross old dude, tbh) that left a trail of devastation from his manipulation and deceit. ",
      "release": "2024-12-06T08:30:00Z",
      "duration": "01:01:51",
      "explicit": true,
      "spotifyId": "6nXWiRxvX34D9jPOCX9nMn",
      "appleId": 1000679452560,
      "youTubeId": "-bDM0____n4",
      "subjects": [
        "Angel\u0027s Landing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nXWiRxvX34D9jPOCX9nMn",
        "apple": "https://podcasts.apple.com/podcast/the-angels-landing-cult-part-2/id1721815484?i=1000679452560",
        "youtube": "https://www.youtube.com/watch?v=-bDM0____n4"
      }
    },
    {
      "id": "e1844911-912a-4c0b-a1ba-9f83b465056f",
      "title": "The Angel\u0027s Landing Cult (Part 1)",
      "description": "In part one of this two-part case, Bailey takes us through the investigation into the Angel’s Landing cult. It is a chilling tale of manipulation, crime, and a charismatic leader who preyed on the vulnerable. At the heart of the case is Daniel Perez, also known as Lou Castro, who presented himself as a clairvoyant and prophet. Claiming to have supernatural powers and the ability to foresee the future, Perez lured followers to a secluded compound in Kansas, promising them protection and prosperity. However, behind the façade of spiritual guidance lay a sinister operation. The group was financially supported by the life insurance policies of its members, many of whom met untimely and suspicious deaths. Authorities became suspicious after the death of Patricia (Gomez) Hughes in 2003, officially ruled an accident. The trail led investigators to uncover a web of deceit, coercion, and exploitation spanning years. The Angel’s Landing Cult remains a harrowing reminder of the dangers of an absolute predator manipulating a group of followers with blind devotion. Thanks for listening! If you want to support us, you can follow/subscribe to WILDCIDE on your favorite podcast listening app. While you’re there, please rate and leave us a review – we would really appreciate it! You can also visit our website at www.wildcidepodcast.com (merch now available!) Make sure to get updates by following us on Instagram (@wildcidepodcast) and Facebook (Wildcide Podcast). Don’t forget Wildcide Wednesdays- new episodes drop every Wednesday at 6am EST. Interviews will drop every other Friday at 6am EST. Art for the podcast was created by Kelly Steen. Editing/Production for the podcast by Bltzwolff (bltzwolff@gmail.com). ​WILDCIDE Podcast and any content posted is presented solely for general informational, educational, and entertainment purposes. The use of information on this podcast or materials linked from this podcast or website is at the user’s own risk. It is not intended as a substitute for the advice of a physician, professional coach, psychotherapist, or other qualified professional, diagnosis, or treatment. Users should not disregard or delay in obtaining medical advice for any medical or mental health condition they may have and should seek the assistance of their healthcare professionals for any such conditions. References Potter, T. (2014, August 6). Witness recalls day woman died at Valley Center compound | wichita eagle. The Witchita Eagle. https://www.kansas.com/news/article1092974.html Nolasco, S. (2020, May 2). Angel’s Landing survivor recalls escaping deadly cult in new doc: “it didn’t take long for things to turn.” Fox News. https://www.foxnews.com/entertainment/angels-landing-survivor-tells-all-deadly-cults-oxygen-doc Leiker, A. R. (2015, February 12). Daniel Perez testifies beating, memory loss led him to Lou Castro identity | wichita eagle. Daniel Perez testifies beating, memory loss led him to Lou Castro identity. https://www.kansas.com/news/local/crime/article9907157.html Tidd, J. (2020, March 6). Case of Kansas cult killer and rapist Daniel Perez, Aka Lou Castro, featured on TV. Case of Kansas cult killer and rapist Daniel Perez, AKA Lou Castro, featured on TV. https://www.kansas.com/news/local/crime/article240933986.html Public Offender Registry Bennett, J. (2015, May 9). Columbia’s brush with an agent of pure evil. The Daily Herald. https://www.columbiadailyherald.com/story/news/local/2015/05/09/columbia-s-brush-with-agent/25703906007/ State v. Perez, 396 P.3d 78 (Kan. 2017). State v. Perez, 396 P.3d 78 | Casetext Search \u0026#43; Citator Potter, T. (2015, February 18). Identity quest: How Nine-year pursuit of ‘Lou Castro’ unfolded | wichita eagle. The Wichita Eagle. https://www.kansas.com/news/local/crime/article11501540.html",
      "release": "2024-12-04T08:20:00Z",
      "duration": "01:12:43.9460000",
      "explicit": true,
      "spotifyId": "6nXWiRxvX34D9jPOCX9nMn",
      "appleId": 1000679452560,
      "subjects": [
        "Angel\u0027s Landing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nXWiRxvX34D9jPOCX9nMn",
        "apple": "https://podcasts.apple.com/podcast/the-angels-landing-cult-part-2/id1721815484?i=1000679452560"
      }
    },
    {
      "id": "94fbe5b8-cbaa-4a56-bd23-11bda2770427",
      "title": "The Fall River Cult Murders (Part 2): Hysteria, Corruption and \u0027Beyond a Reasonable Doubt\u0027",
      "description": "As this case evolves, it seems as if we are reading a work of fiction. Perjury, coercion, disregarded alibis, plea bargains, and life sentences without parole all play a role in these twisted, sensationalized murder trials. After 40 years, some of the police officials originally involved in the case aren’t quite convinced of the final verdicts. Open your mind, get out the push pins and red yarn, and see if you can piece together what truly happened between October 1979 and February 1980. Is Carl Drew the self-proclaimed “Son of Satan” local pimp turned murderer that many believe him to be, or was he falsely convicted? Is this the East Coast’s version of the West Memphis Three? Or are we looking at hardcore psychopathic killers who are guilty beyond reasonable doubt? Was this a legitimate Devil-worshipping sex cult or was it a dark but effective tool to manipulate and gain control? Try to keep a rational mind throughout this convoluted, complex, and twisted case. You’ve never heard it like this before. Thanks for listening! If you want to support us, you can follow/subscribe to “WILDCIDE” on your favorite podcast listening app. While you’re there, please rate and leave us a review – we would really appreciate it! You can also visit our website at www.wildcidepodcast.com (merch coming soon!) Make sure to get updates by following us on Instagram (@wildcidepodcast) and Facebook (Wildcide Podcast). Don’t forget Wildcide Wednesdays- new episodes drop every Wednesday at 6am EST. Interviews will drop every other Friday at 6am EST. ​​Art for the podcast was created by Kelly Steen. Editing/Production for the podcast by Bltzwolff (bltzwolff@gmail.com). ​WILDCIDE Podcast and any content posted is presented solely for general informational, educational, and entertainment purposes. The use of information on this podcast or materials linked from this podcast or website is at the user’s own risk. It is not intended as a substitute for the advice of a physician, professional coach, psychotherapist, or other qualified professional, diagnosis, or treatment. Users should not disregard or delay in obtaining medical advice for any medical or mental health condition they may have and should seek the assistance of their healthcare professionals for any such conditions. References: Carl Drew’s Website: Carl Drew (carldrewsfight.com) To Read the Facts of the Carl Drew Case: click here To join the FB page, search \u0027Justice for Carl Drew\u0027 Appelcline, Shannon (2011). Designers \u0026 Dragons. Mongoose Publishing. p. 13. ISBN 978-1-907702-58-7. Carey, P. (1999). UNDERCOVER IN A MURDEROUS CULT: A Case One Detective Will Never Forget. Paul Carey story. http://carldrewsfight.com/page1.html Commonwealth vs. Andre O. Maltais. Justia Law. (n.d.). https://law.justia.com/cases/massachusetts/supreme-court/volumes/387/387mass79.html Cooney, A. (2022). Will one of Fall River’s “cult murderers” be paroled next week? Fall River Herald News. https://www.heraldnews.com/story/news/courts/2022/03/04/fall-river-cult-murders-robin-murphy-up-parole/9347774002/ Crews, G. (2015). An Occult Primer: Investigating Goth, Satanic, \u0026 Other Alternative Belief System Related Crimes. In J. Eterno \u0026 C. Roberson (Eds.). Handbook for Detectives, pp. 227-252. Boca Raton, FL: CRC Press. Day, James B. (Director). (2021). Fall River [film]. Epix. Folco, M. (2013). Looking back: Murder, in satan’s name. New Bedford Standard-Times. https://www.southcoasttoday.com/story/lifestyle/2013/10/06/looking-back-murder-in-satan/42739663007/ Goode, E., \u0026 Ben-Yehuda, N. (1994). Moral Panics: Culture, Politics, and Social Construction. Annual Review of Sociology, 20, 149–171. http://www.jstor.org/stable/2083363 Jeffrey S. Victor, Satanic Panic: the creation of a contemporary legend, Open Court, Chicago, 1993. Justia US Law. (n.d.). Commonwealth vs. Carl H. Drew. Justia Law. https://law.justia.com/cases/massachusetts/supreme-court/volumes/397/397mass65.html Kelly. (2019, June 5). Harbor Terrace, part Two: The murder of Barbara Raposa. Lines and Strings. https://linesandstringsandstrangedays.wordpress.com/2019/06/04/harborterraceparttwo/ Laskey, B. (2021, August 26). Sex, satanism and sacrificial slaughter: The Fall River Cult Murders, 1979-80. CVLT Nation. https://cvltnation.com/sex-satanism-sacrificial-slaughter-fall-river-cult-murders-1979-80/ Louv, J. (2014). The truth about the dungeon master who disappeared in the Steam Tunnels. Boing Boing. https://boingboing.net/2014/11/11/the-truth-about-the-dungeon-ma.html Marks, A. (2021). Satanic cult murders get new investigation in new docuseries “Fall River.” Rolling Stone. https://www.rollingstone.com/culture/culture-news/fall-river-satanic-cult-murders-epix-1174716/ Medeiros, D. (2021). “fall river” true crime documentary is a compelling study of “satanic cult” murders. Fall River Herald News. https://www.heraldnews.com/story/entertainment/2021/05/16/fall-river-epix-satanic-cult-murders-drew-murphy-marsden-documentary/5066855001/ Merrium-Webster. (n.d.). occult. In Merriam-Webster’s Dictionary. Retrieved December 22, 2023, from https://www.merriam-webster.com/dictionary/occult Merrium-Webster. (n.d.). cult. In Merriam-Webster’s Dictionary. Retrieved December 22, 2023, from https://www.merriam-webster.com/dictionary/cult Miliote, G. M. (2004, October 2). Cult Killer’ story takes a turn. Religion News Blog. https://www.religionnewsblog.com/9065/cult-killer-story-takes-a-turn Miranda, M. (2021). A look into the “fall river” murders. East Los Angeles College Campus News. https://elaccampusnews.com/2021/05/27/a-look-into-the-fall-river-murders/ McPhee, M. (2017). “Concocted” Satanic Murder Tale Sparks DA’s Review. WCVB. https://www.wcvb.com/article/bristol-county-prosecutors-to-review-satanic-cult-killings-1/8170776# Nathan, D.; Snedeker, M. (1995). Satan\u0027s Silence: Ritual Abuse and the Making of a Modern American Witch Hunt. Basic Books. ISBN 978-0-87975-809-7. Rossi, R. (2021). Did the devil make him do it? gruesome murder spree shines light on satanic worship in “Fall river” (exclusive video). TheWrap. https://www.thewrap.com/fall-river-satanic-worship-teen-girls-murdered-carl-drew/",
      "release": "2024-03-08T09:00:00Z",
      "duration": "01:11:04.5470000",
      "explicit": true,
      "spotifyId": "2DUvapwU96CtPdQxrMroMT",
      "appleId": 1000648460959,
      "youTubeId": "jDpZ0d01MqU",
      "subjects": [
        "The Fall River Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2DUvapwU96CtPdQxrMroMT",
        "apple": "https://podcasts.apple.com/podcast/the-fall-river-cult-murders-part-2-hysteria/id1721815484?i=1000648460959",
        "youtube": "https://www.youtube.com/watch?v=jDpZ0d01MqU"
      }
    },
    {
      "id": "fb27cc61-8a65-4205-acdb-369e092d608a",
      "title": "The Fall River Cult Murders (Part 1): Satanic Panic and a Murderous Devil Worshipping Cult Leader \u0027The Son of Satan\u0027",
      "description": "The Satanic Ritual Abuse Scare, or Satanic Panic, began in the 1980’s in North America and lasted throughout much of the 1990’s. This widespread hysteria swept across the country alleging threats of child sexual abuse, human ritual sacrifice, teenage abductions, animal sacrifice, claims of Satanic Cults, and even went as far as claiming that heavy metal rock, horrorcore music and fantasy games were the work of the devil. This panic was contributed to thousands of unsubstantiated cases and accusations of Satanic Ritual Abuse throughout the United States. The impact for some was much more significant than for others. Fall River Massachusetts, a historic mill city better known for the notorious case of Lizzie Borden, was arguably not immune from this hysteria and allegations. Fall River was home to what would be dubbed as ‘The Fall River Cult Murders’ which centers around the brutal slayings of three females: Doreen Levesque, Barbara Raposa and Karen Marsden. It\u0027s a classic \u0027whodunnit\u0027 case at the center of a messy web between Robin Murphy, Andy Maltais and Carl Drew aka \u0027The Son of Satan\u0027. This episode covers everything from murder, the soft white underbelly of the Fall River sex work industry, alleged Devil worshipping, to a \u0027Satanic Cult\u0027. Hang out with us while we dive down this dark rabbit hole and land in the realm of the occult for the first half of this wild case. Thanks for listening! If you want to support us, you can follow/subscribe to “WILDCIDE” on your favorite podcast listening app. While you’re there, please rate and leave us a review – we would really appreciate it! You can also visit our website at www.wildcidepodcast.com (merch coming soon!) Make sure to get updates by following us on Instagram (@wildcidepodcast) and Facebook (Wildcide Podcast). Don’t forget Wildcide Wednesdays where new episodes drop every Wednesday at 6am EST. Interviews will drop every other Friday at 6am EST. ​​Art for the podcast was created by Kelly Steen. Editing/Production for the podcast by Bltzwolff (bltzwolff@gmail.com). ​WILDCIDE Podcast and any content posted is presented solely for general informational, educational, and entertainment purposes. The use of information on this podcast or materials linked from this podcast or website is at the user’s own risk. It is not intended as a substitute for the advice of a physician, professional coach, psychotherapist, or other qualified professional, diagnosis, or treatment. Users should not disregard or delay in obtaining medical advice for any medical or mental health condition they may have and should seek the assistance of their healthcare professionals for any such conditions. References: Carl Drew’s Website: Carl Drew (carldrewsfight.com) Appelcline, Shannon (2011). Designers \u0026 Dragons. Mongoose Publishing. p. 13. ISBN 978-1-907702-58-7. Carey, P. (1999). UNDERCOVER IN A MURDEROUS CULT: A Case One Detective Will Never Forget. Paul Carey story. http://carldrewsfight.com/page1.html Commonwealth vs. Andre O. Maltais. Justia Law. (n.d.). https://law.justia.com/cases/massachusetts/supreme-court/volumes/387/387mass79.html Cooney, A. (2022). Will one of Fall River’s “cult murderers” be paroled next week? Fall River Herald News. https://www.heraldnews.com/story/news/courts/2022/03/04/fall-river-cult-murders-robin-murphy-up-parole/9347774002/ Crews, G. (2015). An Occult Primer: Investigating Goth, Satanic, \u0026 Other Alternative Belief System Related Crimes. In J. Eterno \u0026 C. Roberson (Eds.). Handbook for Detectives, pp. 227-252. Boca Raton, FL: CRC Press. Day, James B. (Director). (2021). Fall River [film]. Epix. Folco, M. (2013). Looking back: Murder, in satan’s name. New Bedford Standard-Times. https://www.southcoasttoday.com/story/lifestyle/2013/10/06/looking-back-murder-in-satan/42739663007/ Goode, E., \u0026 Ben-Yehuda, N. (1994). Moral Panics: Culture, Politics, and Social Construction. Annual Review of Sociology, 20, 149–171. http://www.jstor.org/stable/2083363 Jeffrey S. Victor, Satanic Panic: the creation of a contemporary legend, Open Court, Chicago, 1993. Justia US Law. (n.d.). Commonwealth vs. Carl H. Drew. Justia Law. https://law.justia.com/cases/massachusetts/supreme-court/volumes/397/397mass65.html Kelly. (2019, June 5). Harbor Terrace, part Two: The murder of Barbara Raposa. Lines and Strings. https://linesandstringsandstrangedays.wordpress.com/2019/06/04/harborterraceparttwo/ Laskey, B. (2021, August 26). Sex, satanism and sacrificial slaughter: The Fall River Cult Murders, 1979-80. CVLT Nation. https://cvltnation.com/sex-satanism-sacrificial-slaughter-fall-river-cult-murders-1979-80/ Louv, J. (2014). The truth about the dungeon master who disappeared in the Steam Tunnels. Boing Boing. https://boingboing.net/2014/11/11/the-truth-about-the-dungeon-ma.html Marks, A. (2021). Satanic cult murders get new investigation in new docuseries “Fall River.” Rolling Stone. https://www.rollingstone.com/culture/culture-news/fall-river-satanic-cult-murders-epix-1174716/ Medeiros, D. (2021). “fall river” true crime documentary is a compelling study of “satanic cult” murders. Fall River Herald News. https://www.heraldnews.com/story/entertainment/2021/05/16/fall-river-epix-satanic-cult-murders-drew-murphy-marsden-documentary/5066855001/ Merrium-Webster. (n.d.). occult. In Merriam-Webster’s Dictionary. Retrieved December 22, 2023, from https://www.merriam-webster.com/dictionary/occult Merrium-Webster. (n.d.). cult. In Merriam-Webster’s Dictionary. Retrieved December 22, 2023, from https://www.merriam-webster.com/dictionary/cult Miliote, G. M. (2004, October 2). Cult Killer’ story takes a turn. Religion News Blog. https://www.religionnewsblog.com/9065/cult-killer-story-takes-a-turn Miranda, M. (2021). A look into the “fall river” murders. East Los Angeles College Campus News. https://elaccampusnews.com/2021/05/27/a-look-into-the-fall-river-murders/ McPhee, M. (2017). “Concocted” Satanic Murder Tale Sparks DA’s Review. WCVB. https://www.wcvb.com/article/bristol-county-prosecutors-to-review-satanic-cult-killings-1/8170776# Nathan, D.; Snedeker, M. (1995). Satan\u0027s Silence: Ritual Abuse and the Making of a Modern American Witch Hunt. Basic Books. ISBN 978-0-87975-809-7. Rossi, R. (2021). Did the devil make him do it? gruesome murder spree shines light on satanic worship in “Fall river” (exclusive video). TheWrap. https://www.thewrap.com/fall-river-satanic-worship-teen-girls-murdered-carl-drew/ Smith, Michelle (1989). Michelle Remembers. New York: Pocket. ISBN 0-671-69433-2 . Talbott, M. (2001). The Devil in The Nursery. The New York Times. https://archive.nytimes.com/www.nytimes.com/library/magazine/home/20010107mag-buckey.html The Commonwealth of Massachusetts. (2022, November 10). Mass.gov. www.mass.gov. https://www.mass.gov/doc/robin-murphy-life-sentence-decision-november-10-2022/download UPI Archives. (1981, March 10). A prostitute testified Tuesday that alleged pimp and Devil’s... - UPI archives. UPI. https://www.upi.com/Archives/1981/03/10/A-prostitute-testified-Tuesday-that-alleged-pimp-and-devils/5654353048400/ Virginia Commonwealth University. (n.d.). Cults That Never Were: The Satanic Ritual Abuse Scare (SRAS). A to Z directory – virginia commonwealth university. https://www.people.vcu.edu/~dbromley/undergraduate/spiritualCommunity/SatanicCults.html YouTube. (2017). Dateline NBC Mysteries 2016 Robin Murphy \u0026 Carl Drew The Fall River Cult Killers. YouTube. Retrieved December 22, 2023, from https://www.youtube.com/watch?v=8aj_g6qcLW4.",
      "release": "2024-03-06T09:43:14Z",
      "duration": "01:17:55.0740000",
      "explicit": true,
      "spotifyId": "35nUTGr2IZHWqm3QoMwea5",
      "appleId": 1000648184537,
      "youTubeId": "KZsTbmbJF8c",
      "subjects": [
        "The Fall River Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/35nUTGr2IZHWqm3QoMwea5",
        "apple": "https://podcasts.apple.com/podcast/the-fall-river-cult-murders-part-1-satanic-panic/id1721815484?i=1000648184537",
        "youtube": "https://www.youtube.com/watch?v=KZsTbmbJF8c"
      }
    },
    {
      "id": "9dcbdb9e-3db4-4cb8-86e1-262995a78cfb",
      "title": "Cults: Interview with Expert Rick Alan Ross",
      "description": "Rick Alan Ross is the founder and Executive Director of The Cult Education Institute. He is an internationally known expert regarding destructive cults, controversial groups and movements and author of the book \u0022Cults Inside Out: How People Get In and Can Get Out.\u0022 Ross is one of the most readily recognized experts offering analysis about destructive cults, controversial groups and movements in the world today. Since 1982 he has been studying, researching and responding to the problems often posed by controversial authoritarian groups and movements. Ross has been qualified and accepted and testified as an expert witness in court proceedings across the United States including US Federal Court. He has also frequently assisted local and national law enforcement and government agencies. He has personally assisted thousands of families in an effort to help the victims of destructive cults, groups and movements. GQ Magazine identified \u0022Rick Alan Ross [as] America’s leading cult expert.\u0022 And Britain\u0027s FHM Magazine named him \u0022America\u0027s number one cult buster.\u0022 He has been a paid consultant and technical consultant with prestigious film networks such as Mirimax/Disney and CBS. Ross has also been quoted within numerous publications such as Time Magazine and has extensive experience lecturing internationally. Ross has also made multiple appearances on television shows such as “Dr. Phil” and “Ophrah”. Ross\u0027 analysis has been sought on virtually every major cult story for decades.     Thanks for listening! If you want to support us, you can follow/subscribe to “WILDCIDE” on your favorite podcast listening app. While you’re there, please rate and leave us a review – we would really appreciate it! You can also visit our website at www.wildcidepodcast.com (merch coming soon!)   Make sure to get updates by following us on Instagram (@wildcidepodcast) and Facebook (Wildcide Podcast). Don’t forget Wildcide Wednesdays- new episodes drops every Wednesday at 6am EST.    Art for the podcast was created by Kelly Steen. Editing/Production for the podcast by Bltzwolff (bltzwolff@gmail.com).   WILDCIDE Podcast and any content posted is presented solely for general informational, educational, and entertainment purposes. The use of information on this podcast or materials linked from this podcast or website is at the user’s own risk. It is not intended as a substitute for the advice of a physician, professional coach, psychotherapist, or other qualified professional, diagnosis, or treatment. Users should not disregard or delay in obtaining medical advice for any medical or mental health condition they may have and should seek the assistance of their healthcare professionals for any such conditions.    Resources: Getting Help (culteducation.com) Book: https://cultsinsideout.com   National Domestic Violence Hotline (24/7). Languages: English, Spanish and 200\u002B through interpretation service. Call 800-799-7233 or chat SMS: Text START to 88788",
      "release": "2024-02-02T11:00:00Z",
      "duration": "01:17:19.6300000",
      "explicit": true,
      "spotifyId": "3KwlUd5I8ChutJe89uVh5Q",
      "appleId": 1000643923764,
      "youTubeId": "xAmtSAbr-WQ",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3KwlUd5I8ChutJe89uVh5Q",
        "apple": "https://podcasts.apple.com/podcast/cults-interview-with-expert-rick-alan-ross/id1721815484?i=1000643923764",
        "youtube": "https://www.youtube.com/watch?v=xAmtSAbr-WQ"
      }
    },
    {
      "id": "d2f6b1cd-6bea-4079-8cfe-4d571e0ba482",
      "title": "Alleged Cult: Rashad Jamal and the University of Cosmic Intelligence",
      "description": "In a digital age it would make sense to have a digital cult. Rashad Jamal White uses multiple social media platforms to promote his school, The University of Cosmic Intelligence and enlighten his followers who he refers to as “gods and goddesses”. Rashad Jamal claims to have a deep understanding in subjects from metaphysics to marine biology to world history. He is happy to share his thoughts, passions, and opinions…for a price. Hundreds of thousands are tuning in, liking, subscribing, and paying for this knowledge that he frequently uploads from the Barrow County Detainment Center. That’s right, this convicted sex offender is still largely influencing his followers and recently 6 of those confirmed followers have gone missing (including two children).  That is in addition to 2 followers who have been linked to brutal homicides. Let’s dive into the bizarre world of Rashad Jamal and his ‘culty’ University of Cosmic Intelligence and discuss the character parallels between this alleged cult leader and others. More importantly, let’s spread the word and bring these 6 missing people back home. Make sure to tune in on Friday 2/2/2024 to listen to our interview with cult expert Rick Alan Ross. Thanks for listening! If you want to support us, you can follow/subscribe to “WILDCIDE” on your favorite podcast listening app. While you’re there, please rate and leave us a review – we would really appreciate it! You can also visit our website at www.wildcidepodcast.com (merch coming soon!) Make sure to get updates by following us on Instagram (@wildcidepodcast) and Facebook (Wildcide Podcast). Don’t forget Wildcide Wednesdays- new episodes drop every Wednesday at 6am EST.  ​​Art for the podcast was created by Kelly Steen. Editing/Production for the podcast by Bltzwolff (bltzwolff@gmail.com). ​WILDCIDE Podcast and any content posted is presented solely for general informational, educational, and entertainment purposes. The use of information on this podcast or materials linked from this podcast or website is at the user’s own risk. It is not intended as a substitute for the advice of a physician, professional coach, psychotherapist, or other qualified professional, diagnosis, or treatment. Users should not disregard or delay in obtaining medical advice for any medical or mental health condition they may have and should seek the assistance of their healthcare professionals for any such conditions.    Resources: Getting Help (culteducation.com)   National Domestic Violence Hotline (24/7). Languages: English, Spanish and 200\u002B through interpretation service. Call 800-799-7233 or chat SMS: Text START to 88788    References: Today, U. (2024, January 19). YouTube cult, naked meditation, and a convicted child molester linked to 6 disappearances. USA TODAY. https://www.usatoday.com/story/news/nation/2024/01/18/university-of-cosmic-intelligence-cult-disappearances-police-say/72257648007/ Rihan, M. (2022, May 12). Rashad White. The Georgia Gazette. https://thegeorgiagazette.com/barrow/rashad-white-4/ York, M. Z. (1990). The Holy Tablets. United States: (n.p.). Kull, K. (2024, January 11). Take a look back at December 2023 [Video]. STLtoday.com. https://www.stltoday.com/news/local/crime-courts/guru-denies-being-cult-leader-says-he-doesn-t-know-people-missing-from-st-louis/article_1f116254-b00a-11ee-b256-07e0a4170d16.html Conklin, A. (2022, September 3). Followers of social media spirituality influencer accused of 2 murders in Alabama: “I am a god.” Fox News. https://www.foxnews.com/us/followers-social-media-spirituality-influencer-accused-3-murders-alabaama-i-am-god Rosenberg, R. (2023, September 13). Woman admits to faking car trouble, killing Florida college student who stopped to help her. Fox News. https://www.foxnews.com/us/woman-admits-faking-car-trouble-killing-florida-college-student-stopped-help-her?dicbo=v2-VhJCIVs Geiger, D. (2024, January 2). Alabama man drawn to ’Cult’-Like Egyptian videos attacks family, kills mom with sword. Oxygen Official Site. https://www.oxygen.com/crime-news/damien-washam-arrested-in-murder-of-mom-helen-nettles-washam Mallory, A. (2023, September 25). Eight Mile man accused of brutally killing mother with sword, found not guilty by reason of insanity. https://www.fox10tv.com. https://www.fox10tv.com/2023/09/25/eight-mile-man-accused-brutally-killing-mother-with-sword-found-not-guilty-by-reason-insanity/ Staff, T. C. D. (2024, January 16). Missouri police believe 6 people who have been missing since August could be in cult | Truecrimedaily.com. True Crime Daily. https://truecrimedaily.com/2024/01/16/st-louis-berkeley-missouri-rashad-jamal-cult-six-people-missing/",
      "release": "2024-01-31T11:00:00Z",
      "duration": "01:18:35.8600000",
      "explicit": true,
      "spotifyId": "0o05B58GfIR0HJ1bbrsuri",
      "appleId": 1000643649100,
      "subjects": [
        "University of Cosmic Intelligence"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0o05B58GfIR0HJ1bbrsuri",
        "apple": "https://podcasts.apple.com/podcast/alleged-cult-rashad-jamal-and-the-university/id1721815484?i=1000643649100"
      }
    }
  ]
}