{
  "id": "d807351c-cba4-45b4-b167-c22f17de59cd",
  "name": "Wiser Than Me with Julia Louis-Dreyfus",
  "spotifyId": "3zaHNdVeLiqOSXwxdoWcij",
  "appleId": 1678559416,
  "episodes": [
    {
      "id": "00aa5f6d-cfbe-4a3e-b56e-bac7d128e1bd",
      "title": "Julia Gets Wise with Glenn Close",
      "description": "On this episode of Wiser Than Me, Julia is joined by 78-year-old actress Glenn Close, who reflects on growing up in the Moral Re-Armament cult, her iconic work in Fatal Attraction and the new Knives Out, and the tenacity, talent, and forgiveness that have shaped her life. She also shares the impact of her grandmothers, how becoming one has changed her, and an incredible reveal from the set of The Natural. Meanwhile, Julia and her mother Judy dive into the fiery women in their own family tree. Follow Wiser Than Me on Instagram and TikTok @wiserthanme and on Facebook at facebook.com/wiserthanmepodcast. Find us on Substack at wiserthanme.substack.com. Keep up with Glenn Close @glennclose on Instagram. Find out more about other shows on our network at @lemonadamedia on all social platforms. Joining Lemonada Premium is a great way to support our show and get bonus content. Subscribe today by hitting \u0027Subscribe\u0027 on Apple Podcasts or lemonadapremium.com for any other app. For exclusive discount codes and more information about our sponsors, visit https://lemonadamedia.com/sponsors/ . For additional resources, information, and a transcript of the episode, visit lemonadamedia.com . See omnystudio.com/listener for privacy information.\n",
      "release": "2025-12-10T08:40:00Z",
      "duration": "01:13:00.8650000",
      "explicit": false,
      "spotifyId": "5YVvzY3i9SzWntrYiuyjHe",
      "appleId": 1000740602377,
      "subjects": [
        "Moral Re-Armament"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5YVvzY3i9SzWntrYiuyjHe",
        "apple": "https://podcasts.apple.com/podcast/julia-gets-wise-with-glenn-close/id1678559416?i=1000740602377"
      }
    }
  ]
}