{
  "_ts": 0,
  "id": "f0819430-53d5-4611-a4b8-73e2ba3113cb",
  "name": "Witch Hunt Podcast",
  "spotifyId": "5bhhFzmhAplYcMjVHn0Wc1",
  "appleId": 1643770324,
  "youTubeChannelId": "UCliis4vjMIUgg3wcA0pXeYQ",
  "episodes": [
    {
      "id": "040eb69e-d6d9-4387-9657-b4519b15aae9",
      "title": "Coercive Control with Kacey Baker of The Cult Vault Podcast",
      "description": "In this illuminating conversation, Kacey Baker, host of The Cult Vault podcast, shares her journey from lockdown podcaster to advocate and expert in coercive control. What began as a way to stay mentally stimulated during COVID isolation while caring for her newborn has evolved into nearly 400 episodes featuring survivor stories and in-depth discussions about cults and coercive control. Baker recently completed her master\u0027s degree in the psychology of coercive control, bringing academic rigor to her growing expertise in the field.\n\nThroughout the episode, Baker discusses how her understanding of cult dynamics and coercive control has transformed through years of interviewing survivors. She candidly acknowledges her own past misconceptions about people who join cults or remain in abusive relationships, explaining how direct conversations with survivors helped reshape her perspective. A key insight from her work is recognizing how coercive control manifests across various contexts - from cults to domestic relationships, military training, workplace abuse, and human trafficking.\n\nBaker provides valuable information about current legislation around coercive control, particularly focusing on the UK\u0027s Section 76 of the Serious Crime Act (2015). While this law criminalizes coercive control in domestic settings, she explains its limitations in addressing group contexts like cults. She discusses ongoing efforts through organizations like The Family Survival Trust and the National Working Group of Spiritual and Ritual Abuse to expand this legislation\u0027s scope.\n\nThe conversation delves into Baker\u0027s thoughtful approach to interviewing survivors, emphasizing ethical storytelling and the importance of avoiding re-traumatization. She explains how most guests reach out to her independently, and she offers various options to protect their identities, including the use of pseudonyms and careful omission of identifying details.\n\nBaker also shares insights from her recent participation in a conference about spiritual and ritual abuse, describing the powerful experience of being among professionals who deeply understand coercive control\u0027s cross-contextual nature. She discusses her role at CrimeCon events, where she often invites survivors to speak alongside her, ensuring their voices remain central to discussions about cult experiences.\n\nThe episode concludes with Baker\u0027s reflections on how personal interest can evolve into meaningful advocacy work. Her journey demonstrates how taking time to understand complex issues with compassion and curiosity can lead to significant positive change, both personally and societally.\n\nWitch Hunt is hosted by Sarah Jack and Josh Hutchinson, exploring historical witch hunts and their modern implications. This episode contains discussions of psychological abuse, coercive control, and related topics that some listeners may find disturbing. Listener discretion is advised.\n\nThe Cult Vault podcast: https://www.cultvaultpodcast.com/\n\nSign the Petition to Support Maryland Witch Trials Exoneration: www.change.org/MDwitchtrials\n\nSign the Petition to Support Boston Witch Trials Exoneration: https://change/org/witchtrials\n\nFree Ticket for February 1st Remembering the Innocent Victims of the Connecticut Witch Trials: https://www.eventbrite.com/e/hartford-remembering-the-innocent-victims-of-the-connecticut-witch-trials-tickets-1126378742139?aff=oddtdtcreator\n\nLearn about Remembering the Innocent Victims of the Connecticut Witch Trials: https://connecticutwitchtrials.org/remembering-the-innocent-victims-of-the-connecticut-witch-trials/\n\nVisit Witch Hunt on the web: https://witchhuntshow.com\n\nMake a Donation to End Witch Hunts Nonprofit: https://endwitchhunts.org/donate/\n\nSupport our GoFundMe for Magic \u0026 Witchcraft Conference 2025: https://www.gofundme.com/f/help-witch-hunt-attend-magic-witchcraft-conference-2025\n\nBuy Records of the Salem Witch-Hunt: https://bookshop.org/a/90227/9781107689619\n\nRecords and Files of the Quarterly Courts of Essex County: https://salem.lib.virginia.edu/Essex/index.html\n\nLearn about witch hunts happening now: https://endwitchhunts.org\n\nLearn about the Massachusetts Witch Trials: https://massachusettswitchtrials.org\n\nLearn about the Connecticut Witch Trials: https://connecticutwitchtrials.org",
      "release": "2025-01-29T02:55:01Z",
      "duration": "00:51:44",
      "explicit": false,
      "spotifyId": "5gPnONbSlMC9WWy2RuVez5",
      "appleId": 1000686529697,
      "youTubeId": "dW7cZo4r0f4",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5gPnONbSlMC9WWy2RuVez5",
        "apple": "https://podcasts.apple.com/podcast/coercive-control-with-kacey-baker-of-the-cult-vault-podcast/id1643770324?i=1000686529697",
        "youtube": "https://www.youtube.com/watch?v=dW7cZo4r0f4"
      }
    }
  ]
}