{
  "_ts": 0,
  "id": "13119cd1-5c9b-4924-8c04-3da3674ed99c",
  "name": "Without A Crystal Ball",
  "youTubeChannelId": "UCqW9ZAW0ZNqfWo9PZ3OX4Fg",
  "episodes": [
    {
      "id": "8120e4d6-7cac-4e82-b5ea-d46fa2dc4d14",
      "title": "Viral TikTok Dancers Trapped Inside Cult Controlling their Every Move, Family \u0026 Friends Beg for Help",
      "description": "#7M\n\nDancers that have been everywhere recently including the Super Bowl, Ellen, countless daytime talk shows, and all over the media are now at the center of a huge controversy that has gripped the dance community.\n\n7M Films manages a group of dancers who have gone viral for their throwback dancing and videos. However, the group is being controlled by a pastor who has a history of fraud.\n\nThe Church: https://shekinahchurch.com/\n\nThe Management: https://7mfilms.com/\n\n\n\nDisclaimer:\n\nWithout a Crystal Ball is a commentary channel. The views expressed by Katie Joy are her opinions and should not be considered fact. Katie Joy discusses trending topics, current events, reality tv \u0026 More. This channel is for your entertainment. Please make sure you conduct your own research on any topics to verify any information.\n\n\nSupport the Channel By Becoming a Member: \nhttps://www.youtube.com/channel/UCqW9ZAW0ZNqfWo9PZ3OX4Fg/join\n\nFollow Katie Joy on Social Media:\n\nInstagram: https://www.instagram.com/withoutacrystalball/\n\nTwitter:\nhttps://twitter.com/woacbofficial\nhttps://twitter.com/katiejoyyt\n\nFacebook:\nhttps://www.facebook.com/withoutacrystalball/\n\nWithout a Crystal Ball is a commentary channel. The views expressed by Katie Joy are her opinions and should not be considered fact.\n\nAll Clips Obtained through TLC YouTube \u0026 Used under Fair Use:\nAll clips obtained through TLC YouTube and used under Fair Use:\n\nThe Copyright Laws of the United States recognizes a “fair use” of copyrighted content.  Section 107 of the U.S. Copyright Act states:\n\n“NOTWITHSTANDING THE PROVISIONS OF SECTIONS 106 AND 106A, THE FAIR USE OF A COPYRIGHTED WORK, INCLUDING SUCH USE BY REPRODUCTION IN COPIES OR PHONORECORDS OR BY ANY OTHER MEANS SPECIFIED BY THAT SECTION, FOR PURPOSES SUCH AS CRITICISM, COMMENT, NEWS REPORTING, TEACHING (INCLUDING MULTIPLE COPIES FOR CLASSROOM USE), SCHOLARSHIP, OR RESEARCH, IS NOT AN INFRINGEMENT OF COPYRIGHT.”\nTHIS VIDEO AND OUR YOUTUBE CHANNEL IN GENERAL MAY CONTAIN CERTAIN COPYRIGHTED WORKS THAT WERE NOT SPECIFICALLY AUTHORIZED TO BE USED BY THE COPYRIGHT HOLDER(S), BUT WHICH WE BELIEVE IN GOOD FAITH ARE PROTECTED BY FEDERAL LAW AND THE FAIR USE DOCTRINE FOR ONE OR MORE OF THE REASONS NOTED ABOVE.",
      "release": "2022-03-05T01:28:35Z",
      "duration": "00:26:00",
      "explicit": false,
      "youTubeId": "ZElTU-2iweg",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZElTU-2iweg"
      }
    }
  ]
}