{
  "_ts": 0,
  "id": "bc73e16d-e8f4-4242-861d-b79483f24d0d",
  "name": "Witness Underground",
  "spotifyId": "4fe8f6S1VoIkQ0NfGirFym",
  "appleId": 1667178648,
  "youTubeChannelId": "UCnXbnuEB0iwtpY_Dl_Q9KdA",
  "episodes": [
    {
      "id": "a076f926-662e-4c09-aae6-6450a93a99f0",
      "title": "Exposing Jehovah\u0026#39;s Witness Shunning: True Crime New Zealand",
      "description": "In this episode, we feature an insightful interview with Anusha Bradley, an investigative journalist from Radio New Zealand, who will be leading a panel discussion at the Decult Cult Awareness Conference discussing Jehovah\u0027s Witness shunning a practice they are known for globally. We dive into Anusha\u0027s deep investigation into the emotional abu5e caused by shunning practices within the Jehovah\u0027s Witnesses, a widespread issue. #EmotionalAbuse #Shunning #JehovahsWitnesses\n\nGet your Livestream ticket here:\nhttps://events.humanitix.com/decult-cult-awareness-conference-tickets \n\nDuring the conversation, Anusha also delves into the ongoing New Zealand investigation into abuse in care within the Jehovah\u0027s Witnesses, an investigation the religion tried to halt by filing a lawsuit. Their attempt to avoid scrutiny only raises further suspicions. #AbuseInCare #ReligiousAbuse #NZInvestigation #JehovahsWitnessLawsuit\n\nThis episode is part of the Decult Cult Awareness Conference channel take over where we introduce you to a number of the leading speakers at Decult. Anusha Bradley will lead a panel alongside former Jehovah\u0027s Witnesses, including myself, host and director of Witness Underground documentary. We explore the dark realities of high-control groups and how these investigations are critical to holding organizations accountable. #Decult #CultAwareness #WitnessUnderground #HighControlGroups\n\nThe results of this groundbreaking investigation are expected to be revealed soon. Don\u0027t miss this opportunity to hear these important discussions by grabbing your live stream ticket today! Tickets are just $100 NZD or $65 USD. #DecultConference #InvestigativeJournalism #Accountability #ReligiousInvestigations\n\nMake sure to support the conversation, help spread awareness, and secure your ticket to the live stream of the Decult Conference! #Decult2024 #LiveStreamEvent #CultSurvivorStories #ReligiousFreedom #ExJW",
      "release": "2024-09-17T08:15:06Z",
      "duration": "00:24:11",
      "explicit": false,
      "youTubeId": "yY7Gp2yQOjc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yY7Gp2yQOjc"
      }
    },
    {
      "id": "db7145dd-8ac5-47c2-a745-0982c6b9e97f",
      "title": "Now on Apple TV!!! Stream Witness Underground",
      "description": "🚨 Big News! 🚨 Witness Underground is now officially streaming on Apple TV! 🍏🎥 \r\n\r\nThis is a huge milestone for our documentary. Watching it on Apple TV really helps boost visibility and algorithm ranking, giving the project even more momentum. Your support can make a big difference!\r\n\r\n📽️ What is it like to escape a high-control religion? Watch as they follow their personal white rabbits, navigating mind control tactics using the power of music and self-expression. \r\n\r\n🎶 Rate \u0026 Review to help spread this important story. \r\nRotten Tomatoes, Amazon \u0026 IMDb are all excellent options.\r\n\r\n 🙌 Thank you for being part of the journey! \r\n\r\nWatch now on Apple TV\r\n📺 All links to watch: https://WitnessUnderground.com\r\n\r\n#WitnessUnderground #AppleTV #NowStreaming #IndieDocumentary #MusicAndHealing #ExJWStories #ExJWCommunity #CultSurvivor #JehovahsWitnesses #FaithJourney #SupportIndieFilm #FilmRelease #NewOnAppleTV #EXJW",
      "release": "2024-09-13T22:52:54Z",
      "duration": "00:12:48",
      "explicit": false,
      "youTubeId": "KUu9jhPG6jE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KUu9jhPG6jE"
      }
    },
    {
      "id": "3d1645df-39a4-4989-99d7-ba657a01a108",
      "title": "Witness Underground Update \u002B 10th Anniversary today",
      "description": "Sept update Banana Island Films\r\n   \r\n1  Decult Cult Awareness Conference\r\n Mid October, Get your tickets\r\n\r\n2 Distribution Update\r\n \r\n3 Name Change from Witness Underground Podcast\r\n \r\n4 Things you can do\r\n Watch the film\r\nShare the website with three friends\r\n Share a post on Social Media\r\n  New push with daily videos and image posts to find new audiences\r\n  Your shares will help push the algorithm to find new audiences\r\n Write a User Review on Rotten Tomatoes \u0026 Amazon\r\n  This is evergreen. Your review will help get the film onto critics lists and review lists\r\n\r\nToday is the 10 year anniversary of the idea for the XJW Documentary series project which gave birth to the feature Witness Underground. It all started while decending the Himalayas on the way to the train back to Hanoi Vietnam, with two now award-winning film directors who I’ll introduce in a bit (Tribeca, Sundance, Berlinale, DocNYC) \r\n\r\nThey hired me to help capture audio on their personal documentary featuring a Hmong friend of mine from the Chinese border where I was living. I\u0027ll dive in more into in this video. \r\n\r\n\r\n We’re in year 8 from me actually starting the series\r\n\r\nBao Nguyen \r\n - Live From New York - SNL\r\n - Be Water - Bruce Lee\r\n Tribeca\r\n Sundance\r\n\r\nElizabeth Ai\r\n - New Wave\r\n Music that defined a generation for the diaspora after the American War in Vietnam\r\n     Tribeca\r\n     DocNYC\r\n\r\nCheck out their work!",
      "release": "2024-09-11T23:34:58Z",
      "duration": "00:26:59",
      "explicit": false,
      "youTubeId": "NPPwrs2-YMc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NPPwrs2-YMc"
      }
    },
    {
      "id": "12b5fb07-9e28-4ba0-8075-aa8eba147daa",
      "title": "Witness Underground - Revolution Cinema - Cine Movil MX",
      "description": "We just had an excellent screening of Witness Underground with Cine Movil, a cultural revolution cinema program in Playa Del Carmen, Mexico. We previously had our international premiere of Witness Underground here with Cine Movil. The host invited us back for another very special screening now that the film is in wide release.\r\n\r\nWitness Underground highlights an indie music culture that emerged inside of a religous cult. In this captivating 4-minute video, we dive into the secretive and fascinating world of Nuclear Gopher, a safe space for kids, waiting for armageddon. This bizarre situation, inspired a community of artists, including Ryan Sutter, one of the main characters in our award winning feature documentary, Witness Underground.\r\n\r\nWatch WITNESS UNDERGROUND on TUBI TV \u0026 Amazon\r\nhttp://WitnessUnderground.com\r\n\r\nSupport: \r\nhttps://Patreon.com/WitnessUnderground\r\n\r\nRyan Sutter joined the live Q\u0026A as a surprise and additionaly, announced that his long-awaited album, \u0022Capistrano\u0022 is finally available to buy and stream. He has officially re-launced Nuclear Gopher Studio with multiple releases available now.\r\n\r\nOur Blu-Ray, DVD, CD 2-Vol Motion Picture Soundtrack are now available at https://WitnessUnderground.com\r\n\r\nThanks to everyone behind Cine Movil, Cine De La Playa and the superb audience who were happy to be rained on to finish the film and stayed for a one hour special film festival style Q\u0026A. \r\n\r\n#WitnessUndergroundPodcast\r\n#XJWComingOut\r\n#ExJWJourney\r\n#IGotOut\r\n#ReligionApostate\r\n#LeavingCults\r\n#CultFreedomStories\r\n#ArtistsEscapingCults\r\n#CultMemberInterviews\r\n#JWBeliefsExposed\r\n#EscapeAbuseJourney\r\n#ReligiousCultUpbringing\r\n#HighControlGroupsEscape\r\n#HealingReligiousTrauma\r\n#FreedomFromReligion\r\n#JehovahsWitnessInsights\r\n#ExJehovahsWitnessInterviews\r\n#ReligionDebate\r\n#AtheismVsTheism\r\n#ChristianityExplained\r\n#ReligiousBeliefs\r\n#AtheistPerspective\r\n#ChristianFaithJourney\r\n#GodDebate\r\n#religionandsociety \r\n#AtheistThoughts\r\n#deconstructingfaith \r\n#faith \r\n#faithjourney \r\n#losingreligion\r\n#atheist \r\n#sectas \r\n\r\n#independentfilm #indiefilm #film #filmmaking #filmfestival #filmmaker #cinema #movie #movies #director #cinematography #supportindiefilm #documentary #indiemusic #minneapolis #music #livemusic #exjw #jw #apostate #jehovahswitnesses #jworg #jehovahswitness #cult #watchtower #exjwlife #portlandfilm #portlandfilmfestival  \r\n\r\n-~-~~-~~~-~~-~-\r\nPlease watch: \u0022Big Announcement - ExJW-Live - Are we bashing Jehovah\u0027s Witnesses?\u0022 \r\nhttps://www.youtube.com/watch?v=kX-x-L-ilq0\r\n-~-~~-~~~-~~",
      "release": "2024-06-19T10:49:13Z",
      "duration": "01:09:19",
      "explicit": false,
      "youTubeId": "SssG-rosFgE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SssG-rosFgE"
      }
    },
    {
      "id": "b27b2642-a85f-4a0c-9347-643f2b1c5cd0",
      "title": "Witness Underground \u0026amp; Banana Island Films",
      "description": "Name changes, channel updates, film progress\r\n\r\nhttps://WitnessUnderground.com\r\nhttps://BananaIslandFilms.com",
      "release": "2024-06-07T15:33:06Z",
      "duration": "00:21:52",
      "explicit": false,
      "youTubeId": "0eaPhxeRpiw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0eaPhxeRpiw"
      }
    },
    {
      "id": "c412ccc1-1eb9-4487-b2a7-5e808f5f1b1c",
      "title": "Doubting my christian faith - story behind the film trailer",
      "description": "Watch the first concept trailer for our Witness Underground documentary that I cut. Doubting my christian faith. The story  behind the film trailer version 1\n\nNow streaming on Tubi TV and Amazon. A feature film humanizing life inside and life after living in a cult.\n\nCheck out https://WitnessUnderground.com for all streaming options and the official store w/ Blu-Ray and Motion Picture Soundtrack 2 Vol CD!\n\nJoin this channel to get instant access to Witness Underground:\nhttps://www.youtube.com/channel/UCnXbnuEB0iwtpY_Dl_Q9KdA/join\n\nWatch FREE on TUBI TV. \n\nWithin the confines of an elusive cult, a vibrant alternative music community thrived, deprogramming themselves through art. Powerful live performances punctuate tragic losses to beautifully illuminate shunning by Jehovah\u0027s Witnesses.\n\nA compelling cult documentary of 2024, chronicling the journey of JWs through their transformative experience navigating the depths of underground music culture while being profoundly influenced by a cult. A gripping tale of Jehovah\u0027s Witnesses escaping the cult, surviving the realities of shunning, and find their voices.\n\nThe only documentary to humanize cult life \u0026 survival via self-expression, musicians triumph over trauma from coerced shunning. \n\n\u0022Jarring, heartbreaking, infuriating ...Movie score 8/10.\u0022 [Film Threat] \n\u0022Advocacy with a megaphone\u0022 [Bad ASSociation Podcast - Chev Clark] \n\nWitness resilience, escape, \u0026 healing through poignant original music. \n\u0022Shunning beautifully illuminated\u0022 [Chris Gray - Freestyle Distribution]\n\nRate and review on IMDb, TMDb, \u0026 Amazon\n\nIMDb - 9.5/10!  - Help keep our score extraordinarily high!\nhttps://www.imdb.com/title/tt15215562\n\nTMDb - Leave a Review\nhttps://www.themoviedb.org/movie/829437-witness-underground\n\nAmazon - Rate and Review.\nhttps://www.amazon.com/gp/video/detail/B0CVGPPFZ5\n\nGenres:\nSocial Impact Documentary, Cult, Documentary | Arts and Culture, \nSocial Issues, Music and Performances, Informational \u0026 Educational, Music Documentary\n\nShort Synopsis:\nWitness Underground is a documentary that reveals the insular DIY artist community that emerged within a religious cult in Minneapolis. Music, fame, and success are typically forbidden in this group, which instructs its members to “beware of independent thinking.”\n\nThe artists at the heart of the music scene have their faith tested. They battle for mental health and push the boundaries of their religion’s norms, where leaving means being banned from interacting with your entire family and social circle for life.\n\nAlthough severely restricted, they create the record label Nuclear Gopher and produced over 30 albums of earnest and personal music that spans: singer/songwriter, riot grrrl, psychedelic rock, pop, EDM, shoegaze, and post-rock. Carefully curated performances punctuate their stories of friendship, deep loss, and personal growth.\n\nLong Pitch:\nIn suburban Minneapolis, upstanding Jehovah’s Witnesses are arriving home after hours of doorbell ringing and front doors slamming.\n\nBut not Cindy, or the elder staring down this teenager.\nOr the man she lost her virginity to hours ago in a hotel.\n\n“Did you start it? Did you touch him?”, the elder asks.\n\n“Did you have an orgasm?”\n\nShe played a show that week. A coffee shop Witnesses flocked to.\n\nShe plucked strings to her pop-punk anthem.\nShe belted out the words her spirit had tried to hide.\nHer \u0022Prayer To No One\u0022 ricocheted off the walls to a riveted crowd.\n\nThey wanted an encore.\nShe knew a private punishment wasn’t going to be enough.\nShe went back for more.\n\nWitness Underground unveils an unexplored music community surviving within a dystopia. Humanizing the struggle, courage, and artistry of former members.\n\nFrom home-brew music videos to grand pop-up festivals over 17 years and 30 albums. Art becomes more than self-expression; it is awakening, healing, and freedom from their trauma. \u0022Frequently searing and undeniably confrontational.” [Tone Madison Music Magazine]\n\nLong Synopsis:\nA chilling, yet empowering social impact documentary, Witness Underground highlights the music and defection of doomsday cult members and the consequences of self-expression. A “unique look, with unwavering access, inside the complexities of faith, and the bond forged between artists.” [Amir George, Film and Art Programmer, True/False Film Festival.] \n\nNuclear Gopher, an underground indie record label, arose within their dystopia as a safe space for a few hundred born-in artists to express themselves. Witness the history of their most prolific underground bands as they navigated in the shadows of a high-control society. \n\nFrom homebrew music videos to pop-up music festivals this community created earnest, multi-genre, secular music, as a means of waking up, and processing trauma. \u0022Frequently searing and undeniably confrontational\u0022 [Tone Madison] As outcasts they expose the losses of community and family. Their music is more than just an outlet for self-expression but a powerful tool to heal.",
      "release": "2024-06-03T15:00:49Z",
      "duration": "00:04:17",
      "explicit": false,
      "youTubeId": "oGY7aP0bt2E",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oGY7aP0bt2E"
      }
    },
    {
      "id": "942a072d-1d53-490a-9919-1a532134ca97",
      "title": "Apostate Barbie - Deconstruction \u0026amp; Personal Growth",
      "description": "Apostate Barbie recently did an around the world tour from Australia to finally land in UK. Her exit journey, to faith deconstruction, and personal growth has been very public on her TikTok. She gave Witness Underground a boost during our Kickstarter to get our film onto Tubi TV and Amazon, so I invited her on.\r\n\r\nGo here for the links:\r\nhttps://www.WitnessUnderground.com",
      "release": "2024-05-28T06:16:46Z",
      "duration": "01:06:12",
      "explicit": false,
      "youTubeId": "PsRFGMIiI6k",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PsRFGMIiI6k"
      }
    },
    {
      "id": "c54eb44f-eed9-4c1a-ae31-400e6f0d65e2",
      "title": "Check out this New Documentary project - Decult Cult Awareness Confernece",
      "description": "An excellent team has stepped up again to work with the author of Cult Trip, Anke Richter, to capture her new ambitious project, the Decult Cult Awareness Conference and package it as a powerful documentary.\r\n\r\nWe just added Witness Underground as perk to get them over the finish line.\r\n\r\nCheck it out:\r\nhttps://www.boosted.org.nz/projects/decult-documentary\r\n\r\nBoosted is similar to Kickstarter, Seed\u0026Spark, and Indiegogo used for crowdfunding. Check out their campaign now.\r\n\r\n🎉 🎉 🎉 Decult - Cult Awareness Conference campaign is live on Boosted!!! 🎉 🎉 🎉\r\n\r\nCHECK IT OUT - https://www.boosted.org.nz/projects/decult-documentary \r\n\r\nWitness Underground documentary is successfully out in the world, in large part, due to the incredible work laid before us by the speakers who will be highlighted at the Decult Cult Awareness Conference 2024! \r\n\r\nI was already thrilled that the director of the conference invited our film to premiere in Australasia in New Zealand. \r\n\r\nBut it’s now even better. Decult is the first cult awareness conference of its kind in Australasia. They want to capture a new documentary, creating a resource that can long outlive the conference, including interviews with authors, educators, counselors, academics, and survivors, sharing their expertise and personal stories from various backgrounds exposing and educating about coercive control and manipulation.\r\n\r\nAudiences will gain a deeper understanding of harmful dynamics in cult-like groups and how to support cult leavers better. \r\n\r\nI know that with our awesome audience and soon-to-be new fans at Decult, we can do this. YOU can do this!!\r\n\r\nPlease take 2 minutes to go to their page, check out the project, and consider supporting this documentary campaign.  🎬🎬🎬\r\n\r\nTHANK YOU SO MUCH!! 🙏 🙏 🙏\r\n\r\nI have also been invited to speak at Decult. I\u0027m proud to show off their ambitious documentary project to professionally capture the best of the conference. \r\n\r\nCheck out their campaign here: https://www.boosted.org.nz/projects/decult-documentary\r\n\r\nPlease share it!\r\n\r\nUsing this link supports this channel:\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5418853294931968",
      "release": "2024-05-26T20:23:25Z",
      "duration": "00:28:31",
      "explicit": false,
      "youTubeId": "WJ5TM4QUxdk",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Psychology",
        "Cult-Expert",
        "Bhagwan Shree Rajneesh",
        "Centrepoint",
        "Agama Yoga"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WJ5TM4QUxdk"
      }
    },
    {
      "id": "1985b799-c46b-4f1e-bb31-99c530d8589f",
      "title": "Inside the Mind of a Cult Expert - Decult takeover - Ulrike Schiesser",
      "description": "Our expert guest offers practical advice for those affected by cults and how to communicate with loved ones trapped inside. Witness Underground Podcast ft. Austrian cult expert, Ulrike Schiesser. In our Decult takeover series of Witness Underground Podcast we support the Decult Cult Awareness Conference. She highlights what she plans to discuss in-depth at the upcoming Decult Cult Awareness Conference. This interview will wet your appetite for the powerful education and passionate advocacy she will bring to Decult.\n\nAustrian cult expert and professional skeptic, Ulrike Schiesser, has dedicated her life to cult awareness, supporting former cult members through her private practice, and has been highlighted across Europe as a respected public voice of reason, in a world increasingly difficult to make sense of. You\u0027re going to love her!\n\nCrowdfunding:\nSupport New Zealand documentary professionals to capture of the Decult conference as a documentary:\nhttps://www.boosted.org.nz/projects/decult-documentary \n\nDecult Cult Awareness Conference:\nhttps://decult.net\n\nIn this special installment of our Decult Takeover series, we sit down with the renowned cult expert and skeptic, Ulrike Schiesser. Join your host, Scott Homan, as we explore Ulrike\u0027s extensive knowledge and experiences working with one of the premiere goverment funded organizations in central Europe.\n\nBuy her book: Facts and Predjudice\nhttps://a.co/d/6vKQup5\n\nWhere she works in Vienna, Austria: Federal Office for Cult Affaires\nhttps://bundesstelle-sektenfragen.at\n\nUlrike Schiesser is a psychologist and psychotherapist working at the Federal Office for Cult Affaires (Bundesstelle für Sektenfragen) an Austrian state-run office who deals with cults and various problematic developments in the field of esotericism, personality cults, authoritarian and monopolizing group structures and conspiracy theories. She does counseling of family members of conspiracy affiliated persons and public stakeholders and accompanies people through rethinking and change processes.\n\nIn support of the speakers at the Decult Cult Awareness Conference, where both Ulrike Schiesser and I have been invited to speak, this episode offers a unique opportunity to understand the psychological and sociological aspects of coercive groups to help you to recognize the signs of cult influence, the psychological manipulation tactics used by these groups, and the paths to recovery for former members.\n\n🌟 Highlights of this episode:\n\nUlrike Schiesser\u0027s role in helping others recognize these complex groups.\nHow to communicate with those who are trapped by these manipulative tactics.\nPractical advice for those affected by cults.\nHow to communicate with affected loved ones.\n\n🔔 Like, comment, and subscribe to Witness Underground for more episodes of the Decult Takeover series and stay informed about our participation in the Decult Cult Awareness Conference.\n\n#WitnessUnderground #Decult #CultAwareness #UlrikeSchiesser #ScottHoman #Podcast #CultExpert #Skeptic #CultRecovery #MentalHealth\n\n\nCheck out Ulrike Schiesser\u0027s work here:\nhttps://de.wikipedia.org/wiki/Ulrike_Schiesser\nhttps://www.schiesser.co.at/ueber_mich\n\nJoin this channel to get instant access our feature documentary:\nWitness Underground - Escaping a Cult:\nhttps://www.youtube.com/channel/UCnXbnuEB0iwtpY_Dl_Q9KdA/join",
      "release": "2024-05-25T20:00:13Z",
      "duration": "00:31:43",
      "explicit": false,
      "youTubeId": "oUuYePPgUM0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oUuYePPgUM0"
      }
    },
    {
      "id": "bd63c7f4-88ad-45f1-8024-d010c83b4526",
      "title": "End Stigma! Doctor Caroline Ansley Centrepoint Restoration Project",
      "description": "Join us for an illuminating episode of the Witness Underground takeover series in support of the Decult Cult Awareness Conference. Co-host of Cult Chat Podcast, Doctor Caroline Ansley, a Christchurch New Zealand-based medical doctor, and the visionary founder of the Centrepoint Restoration Project. Dr. Ansley, a child survivor of the Centrepoint cult, has dedicated her life to supporting former cult members and their families through her community and website.\n\nIn this episode, we dive into Dr. Ansley\u0027s journey from surviving a cult to becoming a prominent activist and medical professional. We explore her work with the Centrepoint Restoration Project, her role as a co-host of Cult Chat, and her passionate advocacy for cult awareness and support for ex-members.\n\nKey discussion points include:\n\nDr. Ansley\u0027s Background and Activism: Discover how her experiences as a child survivor shaped her path and inspired the creation of the Centrepoint Restoration Project.\n\nMedical Perspective on Cults: Learn about the crucial insights doctors and medical staff need when working with cult leavers, and why this knowledge is essential for effective support and healing.\n\nDecult - Cult Awareness Conference: Understand why this event is vital for New Zealand and Dr. Ansley\u0027s involvement in raising awareness about the dangers of cults and coercive control.\n\nGlobal and Local Perspectives: Discuss the significance of cult awareness on a global scale, and why even a small island nation like New Zealand plays a pivotal role in addressing these issues globally.\n\nChanging Perceptions: Explore Dr. Ansley\u0027s vision for changing the way society views current and former cult members, and the importance of ending the stigma surrounding them.\n\nSupport and Resources: Highlight the need for better therapy, social justice, and support systems for cult survivors, and the efforts being made to develop professional skills and rally community support.\n\nDr. Ansley\u0027s work is a beacon of hope and resilience, demonstrating the power of community and the importance of addressing cult-related issues with compassion and understanding. Tune in to gain a deeper insight into the Centrepoint Restoration Project, the challenges faced by cult survivors, and the ongoing efforts to create a safer and more informed society.\n\nDon\u0027t miss this compelling conversation where we explore the complexities of cult dynamics, the journey to recovery, and the collective efforts needed to make a real difference.\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCnXbnuEB0iwtpY_Dl_Q9KdA/join",
      "release": "2024-05-21T20:00:03Z",
      "duration": "00:32:41",
      "explicit": false,
      "youTubeId": "5YuNMNZkLSU",
      "subjects": [
        "Centrepoint"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5YuNMNZkLSU"
      }
    },
    {
      "id": "4d266221-ecf9-4829-9710-ccfb49548737",
      "title": "Witness Underground documentary release pitch - Tubi TV \u0026amp; Amazon",
      "description": "Ryan Sutter and I created this documentary release pitch video for our Witness Underground documentary which is now available to stream on Tubi TV and Amazon.\n\nCheck out https://WitnessUnderground.com for all streaming options and official store.\nBuy our Blu-Ray and Motion Picture Soundtrack 2 Vol CD.\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCnXbnuEB0iwtpY_Dl_Q9KdA/join\n\nWatch Witness Underground Documentary for FREE on TUBI TV. Within the confines of an elusive cult, a vibrant alternative music community thrived, deprogramming themselves through art. Poignant live performances punctuate tragic losses to beautifully illuminate shunning by Jehovah\u0027s Witnesses.\n\nFREE on TUBI TV\nhttps://www.tubitv.com/movies/100018684/witness-underground\n\nA compelling cult documentary of 2024, chronicling the journey of JWs through their transformative experience navigating the depths of underground music culture while being profoundly influenced by a cult. A gripping tale of Jehovah\u0027s Witnesses escaping the cult, surviving the realities of shunning, and find their voices.\n\nThe only documentary to humanize cult life \u0026 survival via self-expression, musicians triumph over trauma from coerced shunning. \n\n\u0022Jarring, heartbreaking, infuriating ...Movie score 8/10.\u0022 [Film Threat] \n\u0022Advocacy with a megaphone\u0022 [Bad ASSociation Podcast - Chev Clark] \n\nWitness resilience, escape, \u0026 healing through poignant original music. \n\u0022Shunning beautifully illuminated\u0022 [Chris Gray - Freestyle Distribution]\n\nRate and review on IMDb, TMDb, \u0026 Amazon\n\nIMDb - 9.5/10!  - Help keep it extraordinarily high!\nhttps://www.imdb.com/title/tt15215562\n\nTMDb - Leave a Review\nhttps://www.themoviedb.org/movie/829437-witness-underground\n\nAmazon - Boost the algorithm with a review.\nhttps://www.amazon.com/gp/video/detail/B0CVGPPFZ5\n\nGenres:\nSocial Impact Documentary, Cult, Documentary | Arts and Culture, \nSocial Issues, Music and Performances, Informational \u0026 Educational, Music Documentary\n\nShort Synopsis:\nWitness Underground is a documentary that reveals the insular DIY artist community that emerged within a religious cult in Minneapolis. Music, fame, and success are typically forbidden in this group, which instructs its members to “beware of independent thinking.”\n\nThe artists at the heart of the music scene have their faith tested. They battle for mental health and push the boundaries of their religion’s norms, where leaving means being banned from interacting with your entire family and social circle for life.\n\nAlthough severely restricted, they create the record label Nuclear Gopher and produced over 30 albums of earnest and personal music that spans: singer/songwriter, riot grrrl, psychedelic rock, pop, EDM, shoegaze, and post-rock. Carefully curated performances punctuate their stories of friendship, deep loss, and personal growth.\n\nLong Pitch:\nIn suburban Minneapolis, upstanding Jehovah’s Witnesses are arriving home after hours of doorbell ringing and front doors slamming.\n\nBut not Cindy, or the elder staring down this teenager.\nOr the man she lost her virginity to hours ago in a hotel.\n\n“Did you start it? Did you touch him?”, the elder asks.\n\n“Did you have an orgasm?”\n\nShe played a show that week. A coffee shop Witnesses flocked to.\n\nShe plucked strings to her pop-punk anthem.\nShe belted out the words her spirit had tried to hide.\nHer \u0022Prayer To No One\u0022 ricocheted off the walls to a riveted crowd.\n\nThey wanted an encore.\nShe knew a private punishment wasn’t going to be enough.\nShe went back for more.\n\nWitness Underground unveils an unexplored music community surviving within a dystopia. Humanizing the struggle, courage, and artistry of former members.\n\nFrom home-brew music videos to grand pop-up festivals over 17 years and 30 albums. Art becomes more than self-expression; it is awakening, healing, and freedom from their trauma. \u0022Frequently searing and undeniably confrontational.” [Tone Madison Music Magazine]\n\nLong Synopsis:\nA chilling, yet empowering social impact documentary, Witness Underground highlights the music and defection of doomsday cult members and the consequences of self-expression. A “unique look, with unwavering access, inside the complexities of faith, and the bond forged between artists.” [Amir George, Film and Art Programmer, True/False Film Festival.] \n\nNuclear Gopher, an underground indie record label, arose within their dystopia as a safe space for a few hundred born-in artists to express themselves. Witness the history of their most prolific underground bands as they navigated in the shadows of a high-control society. \n\nFrom homebrew music videos to pop-up music festivals these groups created earnest, multi-genre, secular music, as a means of waking up, and processing trauma. \u0022Frequently searing and undeniably confrontational\u0022 [Tone Madison] As outcasts they expose the losses of community and family. Their music is more than just an outlet for self-expression but rather as a powerful tool to heal.",
      "release": "2024-05-20T15:00:48Z",
      "duration": "00:00:41",
      "explicit": false,
      "youTubeId": "x1sPeXePkGM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x1sPeXePkGM"
      }
    },
    {
      "id": "366360ab-4bc5-4791-931a-9a27c579bbdc",
      "title": "Decult Cult Awareness Conference \u0026amp; New Documentary - Boosted Campaign",
      "description": "Decult Cult Awareness Conference \u0026 New Documentary. Check out the Live Campaign!\r\n\r\nhttps://www.boosted.org.nz/projects/decult-documentary\r\n\r\nAustralasia will host its first ever cult awareness conference in October. Tickets, newsletter and info: https://www.decult.net\r\n\r\nExperts and survivors will meet in Christchurch to highlight how cults work, and the harm they cause.\r\n\r\nThe conference is called Decult, and is being organised by journalist and author of Cult Trip: Inside the World of Coercion and Control, Anke Richter, an Author, reporter and cult researcher.\r\n\r\nThe Aim:\r\nDecult 2024 is a pioneering conference that addresses the pervasive harm inflicted by high-control groups in New Zealand. By giving cult survivors a voice and bringing experts from various fields together, they’re creating a unique opportunity for mental health professionals, government departments, law enforcement and first responders to offer better support and prevent cultic harm in the future. The aim is to develop lasting networks for professionals and to present ongoing events. More cult awareness will improve the wellbeing of vulnerable individuals.\r\n\r\nThe Conference:\r\nSpend a weekend with authors and educators, academics and counsellors, survivors and their advocates as they share their expertise and personal stories. Decult is for anyone interested in spirituality, religion or personal growth who wants to engage in respectful discussion to broaden their knowledge – especially health professionals and frontline services helping cult victims: How does recruitment work, what are the signs of coercive control, how can people get out, and how can they recover?\r\n\r\nRegardless of their background, faith or belief system, attendees will leave with a deeper understanding of harmful dynamics in cult-like groups and how to support cult leavers better. This thought-provoking event will be a forum for those who left their communities to connect with others and feel heard and seen. Let’s show them that we care.\r\n\r\nThe Documentary:\r\nAward-winning film makers Robyn Jordaan and Caleb MacDonald have an ambitious plan to create a documentary about the Decult 2024 Conference in October. As this is the first cult awareness conference of its kind in Australasia, they’re creating a resource that can long outlive the conference. \r\n\r\nTheir film will include interviews with our speakers – authors, educators, counsellors, academics and survivors – sharing their expertise and personal stories. It is our hope that audiences will gain a deeper understanding of harmful dynamics in cult-like groups, how to prevent them, and how to support cult leavers better. \r\n\r\nThis amount will allow them to produce a 20-30 minute documentary which showcases the conference and also features interviews with speakers and survivors.\r\n\r\nThe funding goal allows us to cover the basic costs of creating the documentary and recaps (transport, filming, production tasks, marketing fees). The stretch goal will provide additional creative support for the conference and the Decult Charitable Trust.\r\n\r\nDon’t have the ability to contribute? You could consider spreading the word. Share this link: https://www.boosted.org.nz/projects/decult-documentary\r\n\r\nCheck out the Decult website founded by renouned author of Cult Trip, Anke Richter. https://www.decult.net\r\n\r\nCult Recovery Conference \u0026 Training\r\n\r\nDECULT 2024 is a ground-breaking cult awareness conference with international experts, cult survivors and victim advocates to address a critical gap and reduce harm. We’re especially inviting psychologists, therapists and counsellors. Keynote speaker Dr Gillie Jenkinson, a UKCP accredited psychotherapist specialising  in coercive control, religious trauma and group-based abuse, will offer additional two- and five-day workshops in post-cult recovery for mental health professionals after the Decult conference. This is a first in NZ.\r\n\nJoin us on October 19-20, 2024, in Christchurch, where journalists, authors, and cult researchers like Anke Richter will delve into the insidious workings of high-control groups.\n\nDecult 2024 aims to shed light on the lasting harm caused by cults. Survivors and experts will convene to share stories and insights, empowering mental health professionals, law enforcement, and frontline responders to better assist those affected by coercive control.\n\nThe conference promises a weekend of learning and connection, featuring renowned speakers like Dr. Gillie Jenkinson, a psychotherapist specializing in cult recovery. Dive into topics such as recruitment tactics, signs of control, and pathways to recovery.\n\nThe documentary will capture the essence of Decult 2024 to amplify survivor voices and educate audiences on identifying and supporting victims of cultic abuse.\n\nJoin the movement to combat cultic harm. Consider supporting the documentary campaign. Together, we can raise awareness and promote healing for survivors of coercive groups.",
      "release": "2024-05-13T08:42:34Z",
      "duration": "01:07:53",
      "explicit": false,
      "youTubeId": "9FkIzv-Y6So",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Cult-Expert",
        "Bhagwan Shree Rajneesh",
        "Centrepoint",
        "Agama Yoga",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9FkIzv-Y6So"
      }
    },
    {
      "id": "785c335f-7082-4aa6-83bf-b462b24ff831",
      "title": "Distribute your Indie Film on Tubi \u0026amp; Amazon \u002B Film Festival Strategy",
      "description": "Distribute your indie film \u002B Film Festival Strategy - Tubi \u0026 Amazon Prime Video\r\n\r\nI discuss exactly how I navigated the Film Festival sumissions to get 11 official selections and an award, by building a relationship with the people at the festival. I reveal exactly what worked that got us into 11 festivals and won Best Documentary Feature. I also discuss four options to secure film distribution. I\u0027m a documentary director with two films. I\u0027ve run Banana Island Films since 2016\r\n\r\nSign up for resources and my lastest interviews: https://bit.ly/BananaIslandFilms\n\nHanoiMixtape\r\nhttp://www.HanoiMixtape.com \r\n\r\nWitness Underground\r\nhttp://www.WitnessUnderground.com\r\nhttps://tubitv.com/movies/100018684/witness-underground\r\nhttps://www.amazon.com/gp/video/detail/B0CVGPPFZ5\r\n\r\nRate \u0026 Review\r\nhttps://www.imdb.com/title/tt15215562\r\n\r\nSupport\r\nhttps://www.Patreon.com/WitnessUnderground\r\n\r\nPlugs: [If you head there, mention me]\r\nFFM Film Festival Mastery\r\nhttps://www.filmfestivalmastery.com/details-1\r\n\r\nThe Kickstarter Guy:\r\nhttps://www.thekickstarterguy.com\r\n\r\nExcellent Groups:\r\n\r\nDistribution and Marketing for Filmmakers\r\nhttps://www.facebook.com/groups/858345391005501\r\n\r\nProtect Yourself from Predatory Film Distributors/Aggregators\r\nhttps://www.facebook.com/groups/699825860525598\r\n\r\nAlex Ferrari:\r\n\r\nIndie Film Hustle Podcast\r\nhttps://indiefilmhustle.com\r\n\r\nRise of the Filmtrepreneur - Book\r\nhttps://a.co/d/7i6h4vh\r\n\r\nHoman shares invaluable tips and strategies for navigating the competitive world of film festivals and maximizing your chances of getting noticed, by creating a real human connection with festival directors and programmers. Whether you\u0027re a seasoned filmmaker or just starting out, these strategies are proven.\r\n\r\nLearn the essential steps to submit your movie to film festivals effectively, from crafting the key art, using social media, building your audience, targeting the right festivals for your project, setting up for crowdfunding as a market angle, and getting and staying on the radar of festival programmers. \r\n\r\nDiscover our winning film festival strategy that helped us secure distribution on top platforms like Tubi and Amazon Prime Video.\r\n\r\nI share filmmaking lessons gleaned from 12 years of experience, offering practical advice for aspiring directors. Whether you\u0027re interested in DIY filmmaking or considering enrolling in a digital film class or documentary filmmaking course, my expertise will guide you on your journey. Please ask questions in the comment and I\u0027ll address them in a new video.\r\n\r\nExplore my film distribution strategy and learn how to get your film on Tubi and other popular streaming platforms such as Amazon Prime Video. The clouds will clear and you\u0027ll gain the confidence and knowledge you need to get to your goal of a distributed and money making film.\r\n\r\nSubscribe now for more insights on film directing, film production, and valuable digital cinema courses. I\u0027ll be putting more together with your input. I\u0027m seeking a pilot group of filmmakers to work together on elevating imporant social-impact filmmaking.\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5418853294931968",
      "release": "2024-05-08T00:51:11Z",
      "duration": "00:59:34",
      "explicit": false,
      "youTubeId": "iTOT3ck_67c",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iTOT3ck_67c"
      }
    },
    {
      "id": "cd1230dd-e93b-4263-8668-093f2c5f7e3f",
      "title": "Human Rights activist Barbara Anderson wants to know",
      "description": "Barbara Anderson is a legend in the fight for global human rights. She invited me onto her weekly show to help spread the word about our community project and crowdfunded documentary, Witness Underground.",
      "release": "2024-04-28T00:30:52Z",
      "duration": "02:21:03",
      "explicit": false,
      "youTubeId": "55X-orfNUc0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=55X-orfNUc0"
      }
    },
    {
      "id": "75abe9b5-fdb4-47a2-8095-58a920e3c8ba",
      "title": "Fight for Human Rights - Jackson Family - NDE - Near Death Experience",
      "description": "Experience Kerry Kaye\u0027s remarkable journey as she fights for human rights and freedom from cult shunning using self expression through painting and writing. From surviving a near death experience, NDE, and breaking free from the Jehovah Witness community, Kerry\u0027s story is one of resilience and triumph. The Jackson family played a key personal role in Kerry having her initial wake up experience as a Jehovah\u0027s Witness to become a free thinker.\r\n\r\nhttps://kerrykaye.com\r\nhttps://fineartamerica.com/profiles/kerrykaye-davies/shop\n\nFollow her art process:\nhttps://www.instagram.com/kerry_kaye\nhttps://www.youtube.com/@kerry_kaye\n\r\nAs a former cult member artist, Kerry found solace and healing through painting art therapy, using her craft to free her mind from the constraints of her past. Join her as she shares her experience as a professional artist.\r\n\r\nExplore Kerry Kaye\u0027s refined art paintings, each brushstroke a testament to her journey of self-discovery and empowerment. Through her art shop and Kerry Kaye paintings, she invites you to join her on a transformative path of art therapy and healing.\r\n\r\nDiscover the depths of Kerry Kaye\u0027s narrative as she shares her story as a memoir author about her JW and exJW experience as well as her women\u0027s empowerment novel that she\u0027s workshopping right now. Through her journey, she explores esoteric Christianity and the mystics, challenging the teachings of Jehovah\u0027s Witness leaders and their prophecy to \u0027stay alive to 1975.\u0027 \u0022Stay alive to 75.\u0022\r\n\r\nKerry Kaye is aremarkable artist whose journey from Jehovah\u0027s Witness to acclaimed painter is nothing short of extraordinary. Join us as we unveil the powerful narrative of Kerry Kaye\u0027s artistic evolution and the profound impact it has had on her life and the lives of others.\r\n\r\nIn this compelling interview we\u0027ll dive into Kerry\u0027s near-death experience, NDE, and how it served as a catalyst for her liberation from the mental contraints imposed by the Jehovah\u0027s Witness community. Through her art, Kerry found solace, healing, and a newfound sense of purpose—a testament to the transformative power of creativity.\r\n\r\nExplore Kerry\u0027s unique style and refined art techniques, honed through years of dedication and perseverance. Her paintings, imbued with depth and emotion, serve as a reflection of her journey from repression to freedom.\r\n\r\nDelve into Kerry\u0027s intimate narrative as she shares her experiences as a former cult member and her transition into becoming a beacon of inspiration for exJW artists worldwide. Learn about her involvement with the Witness Underground movement and how she uses her platform to advocate for human rights and artistic expression.\r\n\r\nThrough Kerry\u0027s story, discover the resilience of the human spirit and the boundless possibilities of art as therapy. Join us on this unforgettable journey as we celebrate Kerry Kaye\u0027s remarkable talent and unwavering commitment to using art as a tool for empowerment and change.\r\n\r\nDon\u0027t miss out on Kerry Kaye\u0027s inspiring message of liberation and empowerment. Tune in to the Witness Underground podcast and visit her art shop to embark on your own journey of art therapy and self-discovery. \r\n\r\nThe transformative power of process painting art therapy, told through the lens of a former cult member artist, in this captivating live stream. Join ExJW painter, Kerry Kaye as shes delves into the depths of their emotions and experiences. Witness the creative journey unfold this exceptional exJW artist explores the healing process of painting as therapy. Expore the heart of art therapy with Witness Underground podcast, as she shares her stories and insights. \r\n\r\nTune in to check out the refined artistry of Kerry Kaye. Visit Kerry Kaye Art Shop to explore her unique approach and witness the beauty of her refined art. Hear her firsthand account of leaving a cult in this interview, shedding light on the reasons why she chose to leave Jehovah\u0027s Witnesses. Gain a deeper understanding of the journey from JW to ex cult member through this insightful interview. Explore the intersection of art therapy and personal liberation, providing support and understanding for the exJW / XJW community.",
      "release": "2024-04-25T19:15:13Z",
      "duration": "02:02:47",
      "explicit": false,
      "youTubeId": "m9dVF3O5P88",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=m9dVF3O5P88"
      }
    },
    {
      "id": "ee86d82f-b1d0-436a-9396-19de279bc4e5",
      "title": "Gnostic teachings about Yahweh Jesus Satan vs Jehovah Witness?",
      "description": "Emmanuel Goldstein grew up in a Gnostic faith in Germany and was incorrectly taught that all Christians essentially worship, believe, and act similar to how the extremist cult that my family joined, actually do. Gnostic teachings about Yahweh, Jesus, Satan vs Jehovah Witness. Which god is YHWH in the biblical Jewish pantheon? One of the core teachings of Gnostics is that the god that christians actually worship, is... well you know what, I don\u0027t know. That\u0027s why Emmanuel Goldstein [1984 Orwell fame] is coming on to reveal what he was raised to believe, from a modern gnostic perspective. \r\n\r\nHe\u0027s a facinating guy!\nFollow his substack here:\nhttps://emmanuelgoldstein1984.substack.com\n\nCheck out his channel before the live stream. Consider subscribing:\nhttps://www.youtube.com/@EmmanuelGoldsteinINGSOC\n\nTubi TV Witness Underground\nhttps://tubitv.com/movies/100018684/witness-underground\n\nPrepare to join me with our esteemed guest, Emmanuel Goldstein. Hailing from a Gnostic upbringing in Germany, Goldstein brings a unique perspective shaped by his lived experience with gnostic teachings. Join us as we delve into his experiences and insights, challenging conventional beliefs about Christianity and the worship of YHWH in the biblical Jewish pantheon.\n\nIntriguingly, Goldstein was led to believe that all mainstream Christians adhere to extremist ideologies akin to the cult I once belonged to—a misconception that we\u0027ll explore. Central to Gnostic teachings is the notion that the deity worshipped by Christians may not be as straightforward as it seems. Goldstein tantalizingly hints at revelations regarding this concept that intriugued me. He promises to shed light on the true nature of the god Christians worship and revelations about what he actually discovered and why he reached out to me.\n\nIn anticipation of this discussion, we invite you to explore Emmanuel Goldstein\u0027s channel for a glimpse into his thought-provoking perspectives. Prepare to expand your understanding of Gnosticism and its implications for modern religious discourse. Don\u0027t miss out on this opportunity to challenge preconceptions and delve into the mysteries of faith.\n\nBe sure to tune in to the live stream and join the conversation in the chat as we unravel the complexities of Gnostic beliefs and how what I and many actually lived in the Jehovah\u0027s Witnesses was what he was warned about.",
      "release": "2024-04-24T06:19:03Z",
      "duration": "01:56:48",
      "explicit": false,
      "youTubeId": "PCkmfEtFHZ0",
      "subjects": [
        "Universal Life",
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PCkmfEtFHZ0"
      }
    },
    {
      "id": "2408ce95-0e45-47c5-a177-d82a693d3160",
      "title": "Cult holding your family hostage? Take the power back - Stef Woke Up",
      "description": "Host of the Stef Woke Up channel is coming onto Witness Underground Podcast to discuss her experience after successfully navigating cult mind control, to take the power back over her life and relationships. Is a cult holding your family hostage? Check out her inspiring channel and show up live in the chat. See you there!\n\nhttps://www.youtube.com/@StefWokeUp\n\nStef\u0027s awakening from the Jehovah\u0027s Witnesses cult is a powerful journey we will explore. She will answer, why I quit Jehovah\u0027s Witnesses. The devastating consequences of cult shunning becomes painfully clear through her story. In this narrative, Stef will highlight the overlooked power held by mothers within such restrictive environments. Growing up in a cult was a challenging experience for Stef, shaping her decision to leave. \n\nHolding her family hostage to the cult\u0027s beliefs was a burden she couldn\u0027t bear any longer. Her account is a gripping leaving a cult story that sheds light on the struggles of losing faith in religion. \n\nThrough the Witness Underground podcast, listeners gain insight into the process of leaving high control groups like Jehovah\u0027s Witnesses. Stef\u0027s decision to awaken from the cult was a brave and life-changing moment. The reality of Jehovah Witness shunning only strengthened her resolve to leave. \n\nEx JW YouTube interviews provide a platform for former cult members like Stef to share their experiences authentically. The raw honesty of ex cult members in interviews offers a deeper understanding of the challenges they face. Witness Underground serves as a beacon of support and understanding for the exJW, xJW, and ex JW community.",
      "release": "2024-04-22T23:37:18Z",
      "duration": "02:25:25",
      "explicit": false,
      "youTubeId": "wOUXjZzKu5Q",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wOUXjZzKu5Q"
      }
    },
    {
      "id": "8f58e56c-2ec4-43d1-b02a-1c505839c2de",
      "title": "Phenomenon of High Control Religion - UK Cult Hackers Podcast",
      "description": "UK Cult Hackers Podcast co-host, joins Witness Underground to do a retrospective look at \u0022season one\u0022 with 267 episodes! Explore the phenomenon of High Control religion. We\u0027re diving into what organizational psychologist, Stephen Mather, has learned from hosting 267 episodes with former cult members, and cult experts around the world, with deep journalistic and academic integrity.\r\n\r\nDive in with Witness Underground as we uncover the intriguing world of global cults, exploring cults in America and the UK, guided by none other than Stephen Mather, the host of the acclaimed UK podcast, Cult Hackers.\r\n\r\nCult Hackers Podcast has always been about trying to understand the phenomenon of cults and High Control, as well as listen to people’s stories. Stephen is an activist against any one particular group. His goal is to understand the psychological processes at work and help people understand what happens, as well as think about how people make sense of their lives after they leave.\r\n\r\nHe\u0027s hoping to start a PhD this year to get even deeper into the processes at work behind the cult and high control phenomenon on the rise. \r\n\r\nIn this episode, I interview the host of Cult Hackers Podcast, Stephen Mather, an organizational psychologist. He delves into the complex dynamics of cults, based on 267 episodes that he and his co-host Celine Mather, his daughter, conducted in what they are calling, \u0022season one\u0022 of Cult Hackers. 12\u002B episodes for a season is typical. 267 episodes is next level! Delve into the psychological dynamics behind these groups with insights from an organizational psychologist. \r\n\r\nStephen Mather spent a lot of his adult life, and in Cult Hackers, exploring the complexity of personal identity for new leavers, those who have exited a cult recently. The cult told members who you are and what your is or was. At this point in your life you need to form your own identity. That topic is deeply fascinating to me and essential for everyone. We\u0027ll get into the topic of behavior and identity guiding you to the authentic you.\r\n\r\nFrom chilling tales of cults in America and UK to the lesser-known groups emerging today in many countries, witness gripping accounts of the scariest cults in America and gain insight into church cults which we will reveal on the show. Stephen is cult expert with a personal background one global high-control cult.\r\n\r\nStephen and Celine have been excellent partners in helping to get the cult documentary \u0022Witness Underground\u0022 out into wide release with the unique global outreach throughout 2023 and we\u0027ll dive into documentaries on cults 2023 and 2024. This video offers real stories that will leave you captivated. \r\n\r\nWhether you\u0027re a fan of cult podcasts or simply curious about the high control phenomenon, don\u0027t miss out on this enlightening exploration with an expert. Subscribe now for the best insights into cults, hosted by the one and only, Stephen Mather!",
      "release": "2024-04-17T20:17:55Z",
      "duration": "01:36:34",
      "explicit": false,
      "youTubeId": "1u1-2kKNHRg",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1u1-2kKNHRg"
      }
    },
    {
      "id": "fd5dca26-7bc2-4365-b4e5-a604d8cbb7ac",
      "title": "Witness Underground New Violin Raffle gifting - ExJW Life Coach Love",
      "description": "In this video, Ex Jehovah\u0027s Witness ExJW life coach, Elle Reno, is taking her new Violin that she won from Witness Underground (and Gary Alt) through our new violin raffle gifting it to an ExJW Violinist who is part of her life coach community. Elle Reno is our Bad ASSociate Producer for Witness Underground. She selected to join a raffle and she won!\n\nElle Reno offers her expertise in assisting ExJWs, former Jehovah\u0027s Witnesses, on their journey of healing and self-discovery. She provides insights into the significance of music and art in the healing process. \n\nGet her free roadmap:\nhttps://ellerenocoaching.myflodesk.com/e9kb75zgl3?fbclid\n\nThrough her work, Elle sheds light on the unique challenges faced by ExJWs and the transformative power of artistic expression in overcoming trauma. This video serves as a testament to Elle\u0027s dedication to helping individuals navigate their post-cult lives and find healing through creative avenues.\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCnXbnuEB0iwtpY_Dl_Q9KdA/join\n\nIn this video, Elle re-gifts her new violin that she got from Gary Alt. Gary Alt is a former Jehovah\u0027s Witness Bethel elder who hosted music night at the world headquarters of Jehovah\u0027s Witnesses. Now he admins two important ExJW groups on Facebook and highlights musicians and encourages self-expression. The focus of the documentary film, Witness Underground | Escapaing a Cult, is on the individual\u0027s experiences and struggles within the Jehovah\u0027s Witness life, exploring themes of identity, trauma, and healing. As an Associate Producer of the \u0022Witness Underground\u0022 documentary, Elle helps others to heal from traumatic childhood experiences, highlighting the role of art in processing and overcoming trauma. \n\nOriginal songs created by Jehovah\u0027s Witnesses are artfully woven throughout the documentary adding depth to the exploration of what it\u0027s like growing up in a cult and the journey of healing from it. For those seeking to heal their trauma today, check out Elle Reno\u0027s group. She\u0027s educated in how to effectively assist others in pealing back the layers of trauma and guiding others in the power of art for healing trauma.\n\n-~-~~-~~~-~~-~-\nPlease watch: \u0022Big Announcement - ExJW-Live - Are we bashing Jehovah\u0027s Witnesses?\u0022 \nhttps://www.youtube.com/watch?v=kX-x-L-ilq0\n-~-~~-~~~-~~-~-\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCnXbnuEB0iwtpY_Dl_Q9KdA/join",
      "release": "2024-04-11T18:15:01Z",
      "duration": "00:00:49",
      "explicit": false,
      "youTubeId": "dD3a1yEU5Lw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dD3a1yEU5Lw"
      }
    },
    {
      "id": "7a07ff83-a70c-404e-8b81-4f6578549252",
      "title": "Jehovah\u0026#39;s Witness Life Coach - Unboxing Art - Bad ASSociate Producer",
      "description": "In this video, Ex Jehovah\u0027s Witness life coach, Elle Reno, is unboxing art. She is our Bad ASSociate Producer for Witness Underground. As part of joining our team she got an extremely limited edition music box-set from founder of Nuclear Gopher music studio, a remastered discography, an exclusive collection of 31 discs in a hand painted archival box. \n\nElle Reno offers her expertise in assisting ExJWs, former Jehovah\u0027s Witnesses, on their journey of healing and self-discovery. She provides insights into the significance of music and art in the healing process. \n\nGet her free roadmap:\nhttps://ellerenocoaching.myflodesk.com/e9kb75zgl3?fbclid\n\nThrough her work, Elle sheds light on the unique challenges faced by ExJWs and the transformative power of artistic expression in overcoming trauma. This video serves as a testament to Elle\u0027s dedication to helping individuals navigate their post-cult lives and find healing through creative avenues.\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCnXbnuEB0iwtpY_Dl_Q9KdA/join\n\nIn this video, Elle shows off a printed history of Nuclear Gopher written on 80\u0027s tractor paper printer. The focus of the documentary film, Witness Underground, is on the individual\u0027s experiences and struggles within the Jehovah\u0027s Witness life, exploring themes of identity, trauma, and healing. As an Associate Producer of the \u0022Witness Underground\u0022 documentary, Elle reflects on her insights into the making of the film and its impact of the cult indie music culture. Alongside the narrative, as she\u0027s unboxing art that was created as a means of healing from traumatic childhood experiences, highlighting the role of art in processing and overcoming trauma. Original songs created by Jehovah\u0027s Witnesses are artfully woven throughout the documentary adding depth to the exploration of what it\u0027s like growing up in a cult and the journey of healing from it. For those seeking to heal their trauma today, this video offers a glimpse into one person\u0027s experience after her first watch of Witness Underground - Escaping a Cult and the power of art for healing trauma.\n\n-~-~~-~~~-~~-~-\nPlease watch: \u0022Big Announcement - ExJW-Live - Are we bashing Jehovah\u0027s Witnesses?\u0022 \nhttps://www.youtube.com/watch?v=kX-x-L-ilq0\n-~-~~-~~~-~~-~-",
      "release": "2024-04-11T15:00:04Z",
      "duration": "00:06:00",
      "explicit": false,
      "youTubeId": "65RxIhI8Pgk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=65RxIhI8Pgk"
      }
    },
    {
      "id": "d4c42567-8054-4b1b-9bb4-be0256cb1409",
      "title": "Big Announcement - ExJW-Live - Are we bashing Jehovah\u0026#39;s Witnesses?",
      "description": "Deep dive into the origin of Witness Underground | Escaping a Cult \u002B a big announcement. ExJW-Live interview with film director, Scott Homan - Are we bashing Jehovah\u0027s Witnesses? Find out in this candid interview by Nash \u0026 Greg of ExJW-Live. They discuss the personal impact of our award-winning film, key moments that affected them and announce the wide public release of our documentary, Witness Underground.\r\n\r\nLike \u0026 Comment\n\nWatch Witness Underground documentary for free on TUBI TV!\r\nhttps://tubitv.com/movies/100018684/witness-underground\n\nRate on IMDb\n - https://www.imdb.com/title/tt15215562\n\nReview on TMDb \u0026 Amazon\n - https://www.themoviedb.org/movie/829437-witness-underground\n - https://www.amazon.com/gp/video/detail/B0CVGPPFZ5\n\nSubscribe to ExJW-Live\nhttps://www.youtube.com/@exjw-live6932\n\nExplore the intricate world of Jehovah\u0027s Witnesses with our enlightening documentary, \u0027Witness Underground | Escaping a Cult.\u0027 Jehovah Witness beliefs and practices of this often misunderstood faith are unraveled demonstrating shunning, a misunderstood form of spritual abuse, used to coerce and manipulate active members to abuse anyone who questions the nine leaders. From the origins of the religion to its modern-day implications, \u0027Witness Underground | Escaping a Cult\u0027 offers a comprehensive understanding of the Jehovah Witness community from the inside, through the profoundly powerful music of active members. See yourself in their transformative journey out, finding their voice and leading them to free thought. \n\nWe hear firsthand reflections from ex-cult members who share their journeys of leaving the Jehovah\u0027s Witness organization. Through \u0027Witness Underground,\u0027 viewers gain insight into the struggles and triumphs of those who have escaped the clutches of the Jehovah Witness cult and went on to build lives on the outside that are humanizing and heartwarming.\n\nExJW-Live channel hosts Doug and Nash interview Scott Homan, the films\u0027 director. They discuss these in-depth interviews with former members sheding light on the experiences of exJWs, also known as exJW, ex JW, xJW, or simply JW. The resilience of individuals who have bravely faced the challenges of breaking free from the tight grip of the Jehovah\u0027s Witness organization over their families and their minds is raw and impressive. \n\nWhether you\u0027re a Jehovah Witness seeking clarity or someone interested in understanding the dynamics of this religious group, \u0027Witness Underground\u0027 provides a compelling narrative that explores the complexities of being part of, and leaving, the Jehovah\u0027s Witness community captured in film, music and an entire art scene that you\u0027ll probably be sad that you missed. Some of the best of the Nuclear Gopher archive is highlighted in this award-winning documentary. This interview captures a never told story behind the director\u0027s life. \n\nExperience \u0027Witness Underground | Escaping a Cult\u0027 now, available for free on TUBI TV.",
      "release": "2024-04-07T17:44:13Z",
      "duration": "02:06:48",
      "explicit": false,
      "youTubeId": "kX-x-L-ilq0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kX-x-L-ilq0"
      }
    },
    {
      "id": "6f2ce36f-c714-41f9-b9fb-111dd211e139",
      "title": "This woman was interrogated and abused by cult leaders",
      "description": "This woman was interrogated by cult leaders. Female Hollywood writer, actor, director, Bonnie Root, explores the system of manipulation, abuse, and control in the Jehovah Witnesses and the film industry. We dive into her experience with a cult Judicial Committee, sexual interrogations, her award-winning film, \u0022Sissy\u0022 about grooming of teens, The Movie, a physchological thriller, and her new ExJW film coming out, Diary of Heather Keating, a narrative exposing the Judicial Committee for the abuse common in the Jehovah\u0027s Witness system of punishment. \n\nShare your experience with the community in the comments!\n\nWe met because my Witness Underground documentary and her film, THE MOVIE, both played at GenreBlast Film Festival. The director, Michael Mandell, approached me after seeing Witness Underground to let me know that Bonnie Root, the star actor in his film, THE MOVIE, was also a former Jehovah\u0027s Witness. I invited her to our California film premiere in Los Angeles at the Filmocracy Film Festival. A bunch of ExJW\u0027s showed up and we\u0027ve been in touch ever since. \n\nI\u0027m so excited to be able to share her amazing work with you!\n\nIn this gripping narrative directed by Bonnie Root, a prominent female director in Hollywood, the harrowing realities of religious oppression and manipulation come to light. Her experience being interrogated and abused by cult leaders has shaped much of her life and empowered her to expose this religion for what it really is, a dangerous manipulative control cult. Her films delve into the depths of cruelty within religious processes, highlighting the systemic violations of women\u0027s rights.\n\nThis woman\u0027s journey unfolds as she faces offensive religious interrogations and manipulative control tactics by the Jehovah Witnesses\u0027 judicial committee. Through Root\u0027s lens, we witness the profound impact of the system of manipulation, abuse, and control within this organization.\n\n\u0022Diary of Heather Keating,\u0022 scripted by Root, promises a raw exploration of narcissistic abuse within the context of religious communities. Root\u0027s previous work on \u0022Sissy\u0022 has established her as a formidable force in shedding light on sensitive topics, particularly the destructive form of grooming common in this cult.\n\nShe confronts the reality of women\u0027s rights violations and the insidious nature of religious oppression processes. Experience the power of storytelling to expose the truth to ignite global awareness and change.\n\n🎬 👁️‍🗨 In her gripping psychological thriller, The Movie, Bonnie Root, who once endured the negative experiences of an abusive cult, the Jehovah\u0027s Witnesses, takes us on a journey through the real inspiration behind horror. Join us as she shares profound insights into the parallel themes of abuse, drawing from her own life experiences.\n\n🔍 Bonnie Root\u0027s portrayal as a Hollywood actress mirrors the haunting realities of her past. Discover the chilling narrative of a repairman tormenting a washed-up actress in her own home, echoing the psychological trauma she endured within the confines of the abusive Jehovah\u0027s Witnesses cult.\n\n🎥 Gain an intimate understanding of the making of thi\n\n\nSubscribe to the newsletter for weekly episodes: https://bit.ly/WitnessUnderground\n\nWatch now:\nhttp://WitnessUnderground.com (https://witnessunderground.com/) \n\nWatch \u0026 Support:\nhttps://vimeo.com/ondemand/witnessunderground\nhttps://Patreon.com/WitnessUnderground (https://patreon.com/WitnessUnderground) \nhttps://YouTube.com/@WitnessUnderground (https://youtube.com/@WitnessUnderground) \n\nStore:\nhttps://witness-underground-cult-documentary-release.pledgebox.com/preorder\n\nReach out directly: \nXJWdoc@gmail.com\n\n-Scott",
      "release": "2024-04-02T14:38:23Z",
      "duration": "01:25:59",
      "explicit": false,
      "spotifyId": "38MLKgceY6X3HIqFVUx7y3",
      "appleId": 1000651195205,
      "youTubeId": "egKoyq6uS24",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38MLKgceY6X3HIqFVUx7y3",
        "apple": "https://podcasts.apple.com/podcast/this-woman-was-interrogated-and-abused-by-cult-leaders/id1667178648?i=1000651195205",
        "youtube": "https://www.youtube.com/watch?v=egKoyq6uS24"
      }
    },
    {
      "id": "265994b4-0f55-4e36-8ebc-3501596327ae",
      "title": "This woman was interrogated by cult leaders - women\u0027s rights violation",
      "description": "This woman was interrogated by cult leaders. Female Hollywood writer, actor, director, Bonnie Root, explores the system of manipulation, abuse, and control in the Jehovah Witnesses and the film industry. We dive into her experience with a cult Judicial Committee, sexual interrogations, her award-winning film, \u0022Sissy\u0022 about grooming of teens, The Movie, a physchological thriller, and her new ExJW film coming out, Diary of Heather Keating, a narrative exposing the Judicial Committee for the abuse common in the Jehovah\u0027s Witness system of punishment. \n\nShare your experience with the community in the comments!\n\nSupport \u0026 Watch our documentary:\nVimeo:  https://Vimeo.com/ondemand/witnessunderground\nTUBI: https://tubitv.com/movies/100018684/witness-underground\nPatreon: https://Patreon.com/WitnessUnderground\nYouTube: https://YouTube.com/@WitnessUnderground\n\nExJW Art:\nhttps://witness-underground-cult-documentary-release.pledgebox.com/preorder\n\nWe met because my Witness Underground documentary and her film, THE MOVIE, both played at GenreBlast Film Festival. The director, Michael Mandell, approached me after seeing Witness Underground to let me know that Bonnie Root, the star actor in his film, THE MOVIE, was also a former Jehovah\u0027s Witness. I invited her to our California film premiere in Los Angeles at the Filmocracy Film Festival. A bunch of ExJW\u0027s showed up and we\u0027ve been in touch ever since. \n\nI\u0027m so excited to be able to share her amazing work with you!\n\nIn this gripping narrative directed by Bonnie Root, a prominent female director in Hollywood, the harrowing realities of religious oppression and manipulation come to light. Her experience being interrogated and abused by cult leaders has shaped much of her life and empowered her to expose this religion for what it really is, a dangerous manipulative control cult. Her films delve into the depths of cruelty within religious processes, highlighting the systemic violations of women\u0027s rights.\n\nThis woman\u0027s journey unfolds as she faces offensive religious interrogations and manipulative control tactics by the Jehovah Witnesses\u0027 judicial committee. Through Root\u0027s lens, we witness the profound impact of the system of manipulation, abuse, and control within this organization.\n\n\u0022Diary of Heather Keating,\u0022 scripted by Root, promises a raw exploration of narcissistic abuse within the context of religious communities. Root\u0027s previous work on \u0022Sissy\u0022 has established her as a formidable force in shedding light on sensitive topics, particularly the destructive form of grooming common in this cult.\n\nShe confronts the reality of women\u0027s rights violations and the insidious nature of religious oppression processes. Experience the power of storytelling to expose the truth to ignite global awareness and change.\n\n🎬 👁️‍🗨 In her gripping psychological thriller, The Movie, Bonnie Root, who once endured the negative experiences of an abusive cult, the Jehovah\u0027s Witnesses, takes us on a journey through the real inspiration behind horror. Join us as she shares profound insights into the parallel themes of abuse, drawing from her own life experiences.\n\n🔍 Bonnie Root\u0027s portrayal as a Hollywood actress mirrors the haunting realities of her past. Discover the chilling narrative of a repairman tormenting a washed-up actress in her own home, echoing the psychological trauma she endured within the confines of the abusive Jehovah\u0027s Witnesses cult.\n\n🎥 Gain an intimate understanding of the making of this horror film, where the actress behind the scenes reflects on her personal struggles and triumphs. This exclusive interview explores the psychopath horror film through the lens of someone who has faced abuse and emerged stronger.\n\n🌌 This Patreon and YouTube Memberships Early access exclusive, not only reveals the psychological thriller movie trailer but also offers a poignant connection between the dark side of Hollywood and Bonnie Root\u0027s own journey through abuse and the cult experience. Subscribe, become a member, and immerse yourself in the unsettling world of \u0022The Movie,\u0022 \u0022Sissy,\u0022 and \u0022Diary of Heather Keating,\u0022 where the themes of Hollywood horror actor abuse resonate with the actress\u0027s past in the Jehovah\u0027s Witnesses cult.\n\n🎞️ Don\u0027t miss this riveting interview as Bonnie Root candidly discusses the film\u0027s connection to her negative experiences and triumphs in the face of abuse. Join our community for an in-depth exploration of the real-life inspirations behind this chilling cinematic experience. We explore the profound connection between Hollywood\u0027s dark underbelly and Bonnie Root\u0027s journey from cult victim to vocal survivor. #AbuseSurvivor #PsychologicalThriller #BonnieRootInterview\n\n-~-~~-~~~-~~-~-\nPlease watch: \u0022This woman was groomed and abused. She wrote and directed a film exposing it\u0022 \nhttps://www.youtube.com/watch?v=WXdSL0pdxgo\n-~-~~-~~~-~~-~-",
      "release": "2024-04-01T15:00:50Z",
      "duration": "01:25:59",
      "explicit": false,
      "youTubeId": "yTxXedzPE7Q",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yTxXedzPE7Q"
      }
    },
    {
      "id": "aca796ed-a708-4556-bf0f-5a36d7b5a22d",
      "title": "Bearded Big Brother has spoken! Brighter Light takeover [ExJW]",
      "description": "Joined by Brighter Light Podcast hosts, Anthos \u0026 Kelly, we discuss what the cult leader said. Bearded Big Brother has spoken about clothes, oh my!!! Join us as we make fun of everything new about this absurd cult, the Jehovah\u0027s Witnesses. \r\n\r\nWhy are we picking on them? First, it\u0027s really easy. They are asking for it. But second, we all have family members trapped in the obsurdity and if these old men are going to decide what our mom\u0027s can wear then we have a right to talk about. Get out of our mom\u0027s pants you disgusting pigs! Join for the comedy and get into the chat. \r\n\r\nSee you there",
      "release": "2024-03-18T17:44:19Z",
      "duration": "01:33:16",
      "explicit": false,
      "youTubeId": "xIwFy5hEeEE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xIwFy5hEeEE"
      }
    },
    {
      "id": "10b81462-eb95-4298-ae44-1441b197748e",
      "title": "What motivates religious activism? How can you get involved? [ExJW]",
      "description": "What motivates religious activism? How can you get involved? [ExJW] Apostate Weekly \u0026 Former2Free show host James Winner and director of the documentary Witness Underground discuss the deep motivations behind cult and religious activism and how you can help your favorite channel(s) in a meaningful way.\n\n- Resources discussed are added below -\n\nWe dive into our original and sustaining reasons for our religious activism on Apostate Weekly, Former2Free and Witness Underground channels. We explore the intricate motivations driving individuals to become activists within religious communities, with a particular focus on the Jehovah\u0027s Witness cult.\n\nJoining me is none other than James Winner, the show co-host for both Apostate Weekly and host of Former2Free YouTube channels. Alongside him is Scott Homan, the director of the documentary \u0022Witness Underground\u0022 and the extension, the XJW Coming Out series, and the Witness Underground Podcast on the Witness Underground YouTube channel.\n\nTogether, James and Scott candidly unravel the layers of their personal and emotional motivations that led them to initiate their channels and Scott\u0027s ambitious film.\n\nIn this dynamic conversation, the duo also addresses the significance of religion in society and the role of activism in shedding light on religious practices. They explore the meanings of apostasy and apostate, encouraging viewers to support the apostasy movement, join the growing community of ExJWs, and engage in compelling discussions about leaving Jehovah\u0027s Witnesses.\n\nThis episode serves as a call to action, urging the ExJW community to come together and support one another through an engaging education project. James and Scott emphasize the importance of backing channels that resonate with you before taking the plunge into creating your own. It\u0027s not just an interview – it\u0027s a rallying cry for collective empowerment and a reminder that everyone has a role to play in the journey towards understanding and liberation.\n\nGet involved, join the conversation, and be a part of the movement towards enlightenment and support within the ExJW community. Don\u0027t miss out on this insightful discussion that promises to inspire and ignite change.\n\nResources:\nExJW Books that are available to read:\nhttps://docs.google.com/document/d/1WHFEd_wIUuJMewuqrd3Pg-0eyfHpnZgJ5WtVVdzGrwE/edit?usp=sharing\n\nExJW Films, Shows, \u0026 TikToks\nhttps://docs.google.com/document/d/14enHUuAC63qwBHFZOR3EaaeuagZ7KuhNQA4wqhAlEXY/edit?usp=sharing\n\n#jworg #jehovahswitnesses #watchtower #exjw",
      "release": "2024-03-14T11:23:09Z",
      "duration": "01:13:17",
      "explicit": false,
      "youTubeId": "w2AAjWNJB5g",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=w2AAjWNJB5g"
      }
    },
    {
      "id": "ff90736d-eb2c-4a20-9919-8f27f6cf4983",
      "title": "This woman was interrogated by cult leaders | New Film Coming",
      "description": "New film coming out called Diary of Heather Keating. This woman was interrogated by cult leaders over her developing identity and sexuality. Her film chronicles a young woman\u0027s real experience being interrogated and punished by religious leaders in Jehovah\u0027s Witnesses. Interview with director and career actor, Bonnie Root. \n\nGet ready for an intense cinematic experience with the upcoming film \u0022Diary of Heather Keating,\u0022 set to be released in late 2024. This gripping narrative delves into the true story of actor and director Bonnie Root\u0027s life as a teenager, facing daunting challenges within the Jehovah\u0027s Witnesses.\n\nFollow her work!\nhttps://themoviethemoviethemovie.com\nhttps://instagram.com/diaryofheatherkeating\n\nWatch her film, Sissy, and our full interview, a Masterclass in Manipulation, highlighting her new film, Diary of Heather Keating. - Become a YouTube member of Witness Underground to watch!\n\n00:00 Introduction\n00:22 What is your new film?\n00:41 What is this form of abuse?\n01:11 What is the main cause for your activism?\n01:22 What kind of professional training do the cult leaders get?\n01:57 What inspired this story?\n02:21 What\u0027s the timeline for release?\n02:51 Who will relate to this social impact film?\n03:11 Does this relate to Human Rights trial in Norway?\n03:27 Watch her film Sissy on Witnes Underground\n03:47 Become a YouTube member of Witness Underground\n\nThe film explores a powerful storyline involving the protagonist, Heather Keating, who finds herself under the scrutiny of a Jehovah\u0027s Witness judicial committee. In a unique twist, both the real life character and the film director, Bonnie Root, were interrogated by cult leaders within the storyline. The film takes a deep dive into the struggles and complexities of Heather\u0027s life, providing an insightful portrayal of her experiences.\n\nJoin us for an exclusive interview with Bonnie Root, the talented female director, as she shares her insights into the making of this thought-provoking film. The film will be a groudbreaking piece exploring this never before seen form of abuse common among this global, yet secretive cult.\n\nDiary of Heather Keating promises to be a cinematic masterpiece, shedding light on the inner workings of Jehovah\u0027s Witnesses and the impact of their punishments by their judicial committees. Stay tuned for this compelling new release, as Bonnie Root\u0027s exceptional storytelling brings Diary of Heather Keating to life on the big screen. Get ready for an emotional journey as the film explores the depths of interrogation, cult dynamics, and the resilience of the human spirit. \n\n-~-~~-~~~-~~-~-\nPlease watch: \u0022This woman was groomed and abused. She wrote and directed a film exposing it\u0022 \nhttps://www.youtube.com/watch?v=WXdSL0pdxgo\n-~-~~-~~~-~~-~-\n\nBonnie Root IMDb:\nhttps://www.imdb.com/title/tt1646936\nBonnie Root is empowered to speak truth to abuse.\n\nBonnie Root is known for her extensive acting work:\nhttps://watch.plex.tv/person/bonnie-root\n\n2022\nThe Movie · as Janet/claudia\n2018\nCruel Hearts · as Teri Walker\n2016\nNo Way to Live · as Bea\n2015\nWicked City (TV Series) · as Pam\n2012\nPerception (TV Series) · as Fbi Agent Nina Curtis\n2010\nLaw \u0026 Order: LA (TV Series) · as Maura Dillon\n2010\nBlue Bloods (TV Series) · as Kathy Elliot\n2010\nThe Event (TV Series) · as Mary Stern\n2010\nPretty Little Liars (TV Series) · as Lawyer\n2010\nJustified (TV Series) · as Mary Archer\n2009\nFlower Girl · as Victoria Darling\n2009\nHawthoRNe (TV Series) · as Valerie Dayton\n2009\nLove Takes Wing · as Mrs. Pine\n2008\nCrash (TV Series) · as Sheriff Emily Mariel\n2008\nThe Mentalist (TV Series) · as Tanya Derask\n2007\nRails \u0026 Ties · as Laura Danner\n2007\nMoonlight (TV Series) · as Ellen\n2006\nVanished (TV Series) · as Violet\u0027s Mom\n2005\nDon\u0027t Tell · as Izzy\n2005\nClose to Home (TV Series) · as Molly\n2005\nCriminal Minds (TV Series) · as Keri Derzmond\n2005\nBones (TV Series) · as Haley Kent\n2004\nThe Ranch · as Emily\n2004\nKiller Diller · as Ladonna\n2003\nCold Case (TV Series) · as Alexandra Thomas\n2003\nL.A. Dragnet (TV Series) · as Julie Davis\n2002\nDancing at the Harvest Moon · as Diane Webber\n2002\nWithout a Trace (TV Series) · as Jenny Alden\n2000\nThe Fearing Mind (TV Series) · as Annabel / Isabel\n2000\nFreakylinks (TV Series)\n2000\nThe Fugitive (2000) (TV Series) · as Mia Traeger\n2000\nCSI: Crime Scene Investigation (TV Series) · as Tonya Charles\n2000\nStrong Medicine (TV Series) · as Shay Phillips\n2000\nIn the Weeds · as Becky\n1999\nThird Watch (TV Series) · as Melanie\n1999\nComing Soon · as Stream Hodsell\n1998\nTrinity (TV Series)\n1998\nCharmed (TV Series) · as Susan Coleman\n1997\nTouch Me · as Julie\n1997\nThe Accident: A Moment of Truth Movie · as Lizzie\n1997\nNightMan (TV Series) · as Deana Winston\n1997\nThe Practice (TV Series) · as Jan Carlson\n1997\nHome Invasion · as Willow Patchett\n1996\nEden · as Lucy\n1995\nJAG (TV Series) · as Lt. Sandy Winters\n1994\nER (TV Series) · as Lori\n1994\nUnder Suspicion (TV Series) · as Shana\n1956\nAs The World Turns (TV Series) · as Eve Coleman Browning",
      "release": "2024-03-12T15:00:42Z",
      "duration": "00:04:09",
      "explicit": false,
      "youTubeId": "rJaLb5RC7ng",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rJaLb5RC7ng"
      }
    },
    {
      "id": "53819e80-d749-4d96-9e88-9d924e345d4f",
      "title": "She directed a film exposing abuse [ExJW] True life story behind the film",
      "description": "The true life story behind the film Sissy, by ExJW writer, actor, director, Bonnie Root. She directed a film exposing abuse called Sissy, an award winning film about grooming, regarded as essential viewing to safeguard children from this dangerous reality. Is it love bombing or grooming? \n\nFILM SUMMARY:\nSissy is a girl living on the streets to escape her dysfunctional home. Her mother feels guilty about her daughter\u0027s situation and has her go on the road with \u0022Uncle Charlie\u0022, a struggling magician headed through Nevada.\n\nDirected by Bonnie Root. \nStarring James Duval (of Donny Darko), Peter Giles, and young Malerie Grady as Sissy.\n\nFollow her work!\nhttps://themoviethemoviethemovie.com\nhttps://instagram.com/diaryofheatherkeating\n\nWatch Sissy and our full interview, a Masterclass in Manipulation, highlighting Diary of Heather Keating, her new film, also deeply rooted in her past.\n\nFull interview:\nhttps://youtu.be/yTxXedzPE7Q\n\n00:00 Intro\n00:13 Real life origin\n00:45 Trailer Official\n01:37 True story deep dive\n05:22 Watch Sissy - Become YouTube Member\n05:54 Watch Full Interview - Become YouTube Member\n\nDefinition:\nGrooming is when someone builds a relationship, trust and emotional connection with a child or young person so they can manipulate, exploit and abuse them. Children and young people who are groomed can be sexually abused, exploited or trafficked.\n\nBonnie Root IMDb:\nhttps://www.imdb.com/title/tt1646936\nBonnie Root strikes out on her own, empowered to speak truth to abuse through her award winning directorial debut, Sissy, which is now the pilot for the feature film in the works.\n\nSissy will be made available for a limited time for YouTube Members as a special offer to Witness Underground.\n\nSYNOPSIS:\nSissy is a fourteen year old girl living on the streets to escape her dysfunctional home. Her mother, addicted to good-for-nothing men but carrying some guilt about her daughter\u0027s situation, has a plan. She arranges for Sissy to go on the road with \u0022Uncle Charlie,\u0022 a struggling, unstable magician headed out on a two-bit tour through Nevada. When the trip begins to deteriorate, so does Charlie. This leaves Sissy even more isolated than she was when she was all alone, and forces her to find the strength she never knew she had.\n\nSissy, and our full interview, reveal the true life story of her teenage years. Gain a deeper understanding of the film\u0027s inspiration, rooted in her experience as an abuse victim within the Jehovah\u0027s Witnesses and a resulting dysfunctional home. This film addresses the abuse horror stories that often go untold, the complexities of leaving the Jehovah Witness religion and the courage it takes to share such a personal narrative with the world.\n\nSissy is a powerful testament to resilience and strength. Don\u0027t miss this thought-provoking exploration into abuse, grooming, and survival. \n\n\nBonnie Root is known for her extensive acting work in:\nhttps://watch.plex.tv/person/bonnie-root\n\n2022\nThe Movie · as Janet/claudia\n2018\nCruel Hearts · as Teri Walker\n2016\nNo Way to Live · as Bea\n2015\nWicked City (TV Series) · as Pam\n2012\nPerception (TV Series) · as Fbi Agent Nina Curtis\n2010\nLaw \u0026 Order: LA (TV Series) · as Maura Dillon\n2010\nBlue Bloods (TV Series) · as Kathy Elliot\n2010\nThe Event (TV Series) · as Mary Stern\n2010\nPretty Little Liars (TV Series) · as Lawyer\n2010\nJustified (TV Series) · as Mary Archer\n2009\nFlower Girl · as Victoria Darling\n2009\nHawthoRNe (TV Series) · as Valerie Dayton\n2009\nLove Takes Wing · as Mrs. Pine\n2008\nCrash (TV Series) · as Sheriff Emily Mariel\n2008\nThe Mentalist (TV Series) · as Tanya Derask\n2007\nRails \u0026 Ties · as Laura Danner\n2007\nMoonlight (TV Series) · as Ellen\n2006\nVanished (TV Series) · as Violet\u0027s Mom\n2005\nDon\u0027t Tell · as Izzy\n2005\nClose to Home (TV Series) · as Molly\n2005\nCriminal Minds (TV Series) · as Keri Derzmond\n2005\nBones (TV Series) · as Haley Kent\n2004\nThe Ranch · as Emily\n2004\nKiller Diller · as Ladonna\n2003\nCold Case (TV Series) · as Alexandra Thomas\n2003\nL.A. Dragnet (TV Series) · as Julie Davis\n2002\nDancing at the Harvest Moon · as Diane Webber\n2002\nWithout a Trace (TV Series) · as Jenny Alden\n2000\nThe Fearing Mind (TV Series) · as Annabel / Isabel\n2000\nFreakylinks (TV Series)\n2000\nThe Fugitive (2000) (TV Series) · as Mia Traeger\n2000\nCSI: Crime Scene Investigation (TV Series) · as Tonya Charles\n2000\nStrong Medicine (TV Series) · as Shay Phillips\n2000\nIn the Weeds · as Becky\n1999\nThird Watch (TV Series) · as Melanie\n1999\nComing Soon · as Stream Hodsell\n1998\nTrinity (TV Series)\n1998\nCharmed (TV Series) · as Susan Coleman\n1997\nTouch Me · as Julie\n1997\nThe Accident: A Moment of Truth Movie · as Lizzie\n1997\nNightMan (TV Series) · as Deana Winston\n1997\nThe Practice (TV Series) · as Jan Carlson\n1997\nHome Invasion · as Willow Patchett\n1996\nEden · as Lucy\n1995\nJAG (TV Series) · as Lt. Sandy Winters\n1994\nER (TV Series) · as Lori\n1994\nUnder Suspicion (TV Series) · as Shana\n1956\nAs The World Turns (TV Series) · as Eve Coleman Browning",
      "release": "2024-03-03T15:00:33Z",
      "duration": "00:06:19",
      "explicit": false,
      "youTubeId": "WXdSL0pdxgo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WXdSL0pdxgo"
      }
    },
    {
      "id": "843e5ee6-e605-4c8c-8a3c-31d5ba9deda3",
      "title": "Asheville AVL Film director - Audio Engineer at AuxBus - Libsyn",
      "description": "Ryan DuVal, software engineer and old friend from Colorado, was the only person I asked to help produce Witness Underground. He flew up from Asheville North Carolina as our producer in Minneapolis and was the guiding light for multiple editing revisions.He brought a fresh perspective to the project that became essential in telling this deep nuanced story. This episode was recorded at the Auxbus podcast studio in Asheville, a start-up where he pioneered the audio software we recorded this on. He interviews me and my personal back story for the first time.  (Auxbus was later bought by Libsyn and his software is their trademark audio editing software for their podcast  distribution company). This was recorded on the heals of our production together, and after story-lock in our documentary post-production phase. He had a huge hand in the production influencing the story, and pulling out many valuable moments across our interviews. He also ran sound, wrote interview questions, and asked the interview questions, co-directing the storytelling.  He also ran second camera for interviews, live performance music videos, and also some of the side stories that made it into the film, among many additional roles that we shared. He was essential in the creation of this film.  Enjoy this episode as he digs into my back story and the creation of this film, the XJW Coming Out series, and this podcast.Thanks Ryan!Watch now:http://WitnessUnderground.comWatch \u0026 Support:https://vimeo.com/ondemand/witnessundergroundhttps://Patreon.com/WitnessUndergroundhttps://YouTube.com/@WitnessUndergroundStore:https://witness-underground-cult-documentary-release.pledgebox.com/preorderJump into our Discordhttps://discord.gg/WUp9c95rsXReach out directly: XJWdoc@gmail.com-Scott",
      "release": "2024-01-31T15:00:00Z",
      "duration": "00:58:00.0090000",
      "explicit": false,
      "spotifyId": "6t91rsDXcdZvLWUhwPcmy3",
      "appleId": 1000643676603,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6t91rsDXcdZvLWUhwPcmy3",
        "apple": "https://podcasts.apple.com/podcast/asheville-avl-film-director-audio-engineer-at-auxbus/id1667178648?i=1000643676603"
      }
    },
    {
      "id": "d231c33c-10bb-429e-b6df-98f67dc0a069",
      "title": "Ex Jehovah Witnesses speak out | Growing up in a religious cult",
      "description": "Ex Jehovah Witnesses speak out and talk about growing up in a religious cult. \n\nSubscribe - Like - Comment \n@WitnessUnderground\n\nWatch the XJW Coming Out playlist:\nhttps://www.youtube.com/playlist?list=PLSh1p2dV3s8f-8ojM0M6DBgOtYN_jDjRP\n\nLearn More: \nhttps://WitnessUnderground.com\n\nSupport \u0026 Watch:\nhttps://Vimeo.com/ondemand/witnessunderground\nhttps://Patreon.com/WitnessUnderground\nhttps://YouTube.com/@WitnessUnderground\n\nExJW Art:\nhttps://witness-underground-cult-documentary-release.pledgebox.com/preorder\n\nEx-Jehovah Witnesses speak out, sharing their raw and unfiltered experiences of growing up in a religious cult. This eye-opening video delves into the intricate fabric of the Jehovah\u0027s Witnesses, exploring the beliefs, struggles, and transformative journeys of those who have broken free from the confines of this high control group.\n\n🗣️ Voices of Liberation: Cult Member Interviews and Leaving Religion Stories 🗣️\nListen to firsthand accounts from ex-Jehovah Witnesses who have taken the courageous step to speak out. Through powerful cult member interviews, discover the personal narratives that illuminate the challenges faced while growing up in a religious cult and the pivotal moments that led to leaving the organization.\n\n🌈 Awaken from Cult: Stories of Liberation and Life After Living in a Cult 🌈\nExplore the profound theme of awakening from the clutches of mind control and cult dogma. This video is not just about leaving a high control group; it\u0027s about life after living in a cult. Hear stories of liberation, resilience, and the pursuit of authenticity beyond the restrictions of religious indoctrination.\n\n🔗 Why You Should Leave Religion: Ex-Cult Member Interviews and Stories of Cult Survivors 🔗\nThis video confronts the question of why individuals should consider leaving religion, as ex-cult members provide insight into the reasons behind their decisions. From \u0022Why I Quit Jehovah\u0027s Witnesses\u0022 to chilling \u0022I Survived a Cult\u0022 stories, this content serves as a compelling exploration of the journey towards personal freedom.\n\n🎥 Subscribe now to witness these powerful stories and gain a deeper understanding of the complex world of ex-Jehovah Witnesses. 🎥\n\n🌐 Join the conversation, break the silence, and support those who have chosen to escape abuse and share their JW experiences. 🌐\n\n-~-~~-~~~-~~-~-\nAchieve cinematic audio in your videos. Learn here: \u0022Adobe Premiere Pro Audio Workflow - Cinematic Audio Advanced Tutorial\u0022 \nhttps://www.youtube.com/watch?v=hy-LYLU36L4\n-~-~~-~~~-~~-~-",
      "release": "2024-01-30T13:00:32Z",
      "duration": "00:02:30",
      "explicit": false,
      "youTubeId": "OkM5blYZjmo",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OkM5blYZjmo"
      }
    },
    {
      "id": "88855f70-9fc6-42c0-b8d7-4525e0cec789",
      "title": "12 Questions about life and death - Understanding Jehovah Witness",
      "description": "12 Answers to some of the most common questions about life and death. Understanding Jehovah Witness culture and beliefs. The clear explanations found in God\u0027s Word may surprise you, as interpreted by Jehovah\u0027s Witnesses. Why leave Jehovahs Witnesses? Excellent insight from five people who lived under their manipulation, coercion, control, and abuse.\n\nMoments from the XJW Coming Out documentary series. \n\n00:00 Introduction to former cult member activism\n00:12 Witness tells daughter to kill herself\n00:22 Death is not a solution to problems\n00:32 Use suicide to get into paradise\n00:42 Jehovah\u0027s Witness abuse starts with baptism\n00:55 Dedicated to \u0022The Society,\u0022 not god\n01:05 Witnesses are coerced to shun family until death\n01:15 Don\u0027t indoctrinate your kids\n01:33 Life improves when you escape\n01:44 Take your freedom, get out of trap\n01:56 Prioritize freedom of thought\n02:11 Guilt is their method of control, get out\n\nSubscribe - Like - Comment \n@WitnessUnderground\n\nWatch the XJW Coming Out playlist:\nhttps://www.youtube.com/playlist?list=PLSh1p2dV3s8f-8ojM0M6DBgOtYN_jDjRP\n\nLearn More: \nhttps://WitnessUnderground.com\n\nSupport \u0026 Watch:\nhttps://Vimeo.com/ondemand/witnessunderground\nhttps://Patreon.com/WitnessUnderground\nhttps://YouTube.com/@WitnessUnderground\n\nExJW Art:\nhttps://witness-underground-cult-documentary-release.pledgebox.com/preorder\n\nYOUTUBE GROWTH: https://www.Tubebuddy.com/pricing?a=WitnessUnderground \n\nWelcome to a gripping exploration of the human psyche with our latest video release – a compelling trailer for the highly anticipated cult series, XJW Coming Out, within the Witness Underground project. Delve into the enigmatic world of cults through riveting cult member Interviews, where survivors share their experience with Jehovah\u0027s Witness cultural norms related to death and stories that will leave you on the edge of your seat.\n\nUnearth the truth behind extreme beliefs in our documentary series trailer that peels back the layers of the cult dogma, exposing the dark and often mysterious aspects of life within these closed societies. Join us as we tackle the challenging questions about life and death, unraveling the complexities of the Jehovah Witness faith in the aftermath of the Watchtower.\n\nDiscover firsthand accounts of those who have awakened from cult indoctrination, providing insight into what it\u0027s like growing up in a cult. Hear powerful narratives from cult survivors, as they courageously recount their journeys of escaping the clutches of extremist ideologies in our death cult series.\n\nExplore the depths of the ExJW (Ex-Jehovah\u0027s Witness) experience, as individuals share their reasons for leaving the Jehovah\u0027s Witness life. Gain a deeper Understanding of Jehovah Witness beliefs about death.\n\nPrepare yourself for how I survived a cult story, a slice of our series that confronts the most challenging aspects of cult life and the resolute spirit of those who managed to break free. Don\u0027t miss this opportunity to challenge preconceptions and embark on a thought-provoking journey into the world of extreme beliefs.",
      "release": "2024-01-25T15:00:38Z",
      "duration": "00:02:30",
      "explicit": false,
      "youTubeId": "lHiNhb6bHww",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lHiNhb6bHww"
      }
    },
    {
      "id": "c08ba34a-1bad-4272-bc6e-4dc5503d2d71",
      "title": "Devil Drinks Mocha - Story Editor and Novelist",
      "description": "Walmsley Krubeck did the heavy lifting of story editing and color for our feature documentary Witness Underground. In this episode we dive into the process, challenges, clashes, pressures, frustrations, and successes of working together in our first discussion after creating the film. She has since worked on several other films and also written her first novel. All of Siân\u0027s links:https://linktr.ee/sjkrubeckRead The Devil Drinks Mocha:https://a.co/d/19S3x2zWatch now:http://WitnessUnderground.comWatch \u0026 Support:https://vimeo.com/ondemand/witnessundergroundhttps://Patreon.com/WitnessUndergroundhttps://YouTube.com/@WitnessUndergroundStore:https://witness-underground-cult-documentary-release.pledgebox.com/preorderJump into our Discordhttps://discord.gg/WUp9c95rsXReach out directly: XJWdoc@gmail.com-Scott",
      "release": "2024-01-24T15:00:00Z",
      "duration": "01:19:31.7930000",
      "explicit": false,
      "spotifyId": "0NPKfhUw3w8Kgj8ChZD9tv",
      "appleId": 1000642791885,
      "youTubeId": "MXHELuzxVbY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NPKfhUw3w8Kgj8ChZD9tv",
        "apple": "https://podcasts.apple.com/podcast/devil-drinks-mocha-story-editor-and-novelist/id1667178648?i=1000642791885",
        "youtube": "https://www.youtube.com/watch?v=MXHELuzxVbY"
      }
    },
    {
      "id": "5ea9527f-8dd5-4420-b3e1-509d20058b60",
      "title": "Former Bethel Elder Become a Blues Rocker",
      "description": "Former Elder in Jehovah\u0027s Witnesses, Gary Alt, was even a long-time \u0022Bethelite,\u0022 a worker at their world headquarters called Watchtower (a book publishing company masquerading as a religion). One of his contributions while there was cultural. He was asked to host a monthly music entertainment night at Bethel.Check out his songs:\u0022Here are a handful of songs you might be interested in. The \u0022still IN\u0022 songs variously have something to do with my exiting the JWs.[still IN]Falling Down vocal by Jaywayhttps://www.youtube.com/watch?v=Tl__9Y2BJq8Bleed For You vocal by Jaywayhttps://www.youtube.com/watch?v=USzsewK8WZsSpinhttps://www.youtube.com/watch?v=8poJf5pTzxEWhatever (I knew this wasn\u0027t a good song when I did it, but I needed one more for my album Not For Sale To Minors and wanted it to be raw-sounding - deliberately done with the angst and minimalist values of John Lennon\u0027s early solo recordings)https://www.youtube.com/watch?v=LjOZPqdskaA[OUT]Never Ending Always vocal by Lori Klein (written for my novel, Force of Will which used the pseudonym Tan Swiftwater - there\u0027s an interesting story to the song)https://www.youtube.com/watch?v=JbRK0HbqMiMThis Holy Day vocal by post-JW Gayann from NYhttps://www.youtube.com/watch?v=1OMPcoB9vL0Wake Up vocal by post-JW Emma-Jade Mechen, daughter of Shane, from New Zealandhttps://www.youtube.com/watch?v=1LAjNwRe6GwAnything else you might be interested in may be found on Spotify by searching for \u0022Gary Alt\u0022 and the following album names, all done when I was JW:-Tribute-(Not) For Sale To Minors-Beef Wellington and the Mad Cows - Masticated Bovine (joint project with JW friend Jayway when I was in)-Gift of Projection (EP that predicted Art of Survival but has only 2 songs in common with it)-Art of Survival (my best IMO)And a couple of relatively recent extra songs that are not on any album:-Shine a Light-The Moon is Broken Tonight-Western Lady - vocal by Rick Barth (YouTube only, not actually released)-Color Wind (demo only)Back in the Free World - vocal by Larry Hayden https://www.youtube.com/watch?v=3g0Ch6YYMeg \u0022 - Written FOR the JWs back when I was in. I now reinterpret thWatch now:http://WitnessUnderground.comWatch \u0026 Support:https://vimeo.com/ondemand/witnessundergroundhttps://Patreon.com/WitnessUndergroundhttps://YouTube.com/@WitnessUndergroundStore:https://witness-underground-cult-documentary-release.pledgebox.com/preorderJump into our Discordhttps://discord.gg/WUp9c95rsXReach out directly: XJWdoc@gmail.com-Scott",
      "release": "2024-01-17T00:00:00",
      "duration": "02:02:06.6380000",
      "explicit": false,
      "spotifyId": "0nTFBNDqvL2WdzePCz9Eni",
      "appleId": 1000641987243,
      "youTubeId": "i8zV6W-lKiE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nTFBNDqvL2WdzePCz9Eni",
        "apple": "https://podcasts.apple.com/podcast/former-bethel-elder-become-a-blues-rocker/id1667178648?i=1000641987243",
        "youtube": "https://www.youtube.com/watch?v=i8zV6W-lKiE"
      }
    },
    {
      "id": "ecc68a1f-4505-4139-9b54-3887a0be209a",
      "title": "Three former Jehovah\u0027s Witnesses give advice",
      "description": "Watch \u0026 Support:\nhttps://vimeo.com/ondemand/witnessunderground\nhttps://Patreon.com/WitnessUnderground\nhttps://YouTube.com/@WitnessUnderground\nhttp://WitnessUnderground.com\n\nStore:\nhttps://witness-underground-cult-documentary-release.pledgebox.com/preorder\n\nDuring production of Witness Underground documentary, we took a break between interviews and shooting, to have a former Jehovah\u0027s Witness meetup in Minneapolis. We ended up shooting these additional short interviews in the backyard during the event for the XJW Coming Out series as a bonus episode.\n\nThree short interviews capture the diverse experiences of individuals who found the courage to question their upbringing in this \u0022Apocalyptic cult\u0022 and, in doing so, discovered the strength to forge their own paths.\n\nListen to three former Witnesses, Jesse America, Erica Rae, and James Zimmerman who got out. They all describe what life was like inside, pressures they experienced, why they left, and their new world views. \n\nThey dive into how they feel about this group looking back into their strange past.\n\nTopics discussed:\nCognitive dissonance, conflict caused by religion, inner feelings as a witness, cultural norms within the cult, mis-education, becoming open-minded, disconnection with organized religion, different way to believe in god, atheism, enjoying life now rather than waiting on a higher power, reconnecting with grandparents and other family that were disconnected from because of this religions intolerance of non-members. Being honest about reality, achieving contentment in life through community, life passions, bond through powerful friendships. Family strength, success through education, first in family history to get a degree, feeling of freedom and access to pursue passions, showing love without judgement towards others.\n\nUntethered from authoritarian control what did you do with your freedom?\n\nAre you happier now?\n\nWhat do you do now with your life?\n\nWhat advice can you give to active members of the Jehovah\u0027s Witnesses?\n\n\u0022I\u0027m so much happier not being in this religion anymore. I want that for them.\u0022 Get out!",
      "release": "2024-01-13T19:17:52Z",
      "duration": "00:15:48",
      "explicit": false,
      "youTubeId": "9y1n_AggktA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9y1n_AggktA"
      }
    },
    {
      "id": "b9cf802f-77bb-40f0-a68d-0c92e184a926",
      "title": "Cult Writer Goes Wild With Outlaw Films",
      "description": "Our Co-Producer, Anthony Mathenia, meets up with Scott Homan and Ryan Sutter in an engaging conversation highlighting his other film work with Outlaw films, and the four books he wrote.\n\nFrom Outlaw Films\n\nFree to watch with ads on Tubi:\nDope Men: America\u0027s First Drug Cartel\nhttps://tubitv.com/movies/100008549/dope-men-america-s-first-drug-cartel\n\nNight Life\nhttps://tubitv.com/movies/100009015/night-life\nNew release for download or rent on Amazon:\n\nPsychedelic Revolution\nhttps://www.amazon.com/Psychedelic-Revolution-Secret-History-Trade/dp/B0CKLYM2YX\n\nFrom Gorilla Convict\nLucky Graphic Novel — Read for free with Kindle Unlimited\nhttps://www.amazon.com/Lucky-Gangster-Graphic-Novel-Luciano-ebook/dp/B0CFBV714N\n\nwww.gorillaconvict.com\n\nReach out directly: \nXJWdoc@gmail.com",
      "release": "2023-11-14T01:13:40Z",
      "duration": "01:39:27",
      "explicit": false,
      "appleId": 1000641192430,
      "youTubeId": "kyhAPbxw9Rs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/cult-writer-goes-wild-with-outlaw-films/id1667178648?i=1000641192430",
        "youtube": "https://www.youtube.com/watch?v=kyhAPbxw9Rs"
      }
    },
    {
      "id": "60ac262a-a4dc-4ed3-9c65-5567f8156e32",
      "title": "Call to Collaborate - Film Release Update - Witness Underground",
      "description": "Join our Core Team or our Street Team and do this along with us!\n\nStreet \u0026 Core Team:\nhttps://discord.gg/WUp9c95rsX\n\nReach out directly with your interest and we\u0027ll get you up to speed XJWdoc@gmail.com\n\n-Scott\njoin the mission \nhttps://sendfox.com/bananaisland\n\nhttps://WitnessUnderground.com\nhttps://Patreon.com/WitnessUnderground\nhttps://YouTube.com/@WitnessUnderground",
      "release": "2023-09-12T18:57:56Z",
      "duration": "00:42:54",
      "explicit": false,
      "youTubeId": "AnesyqlBUkU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AnesyqlBUkU"
      }
    },
    {
      "id": "00b1a0d8-66a9-40cb-966c-ef0c4e69ad7f",
      "title": "Jehovah Witness Death Phobia - Escaping A Cult | Witness Underground",
      "description": "Subscribe - Like - Comment \n@WitnessUnderground\n\nWatch two full seasons of the XJW Coming Out\n\nSUPPORT \u0026 WATCH: https://Patreon.com/WitnessUnderground\nFEATURE \u0026 PODCAST: https://WitnessUnderground.com\nNEWSLETTER: https://sendfox.com/BananaIsland\n\nYOUTUBE GROWTH: https://www.Tubebuddy.com/pricing?a=WitnessUnderground \n[Amazing growth tool!]\nPRODUCTION:   https://www.riverside.fm/?via=scott-homan\n[The highest-end recording tool. Richest tool set on the backend of any tool I\u0027ve used]\nPOST PRODUCTION: https://Podmachine.com Promo code: PODSCOTT  \n[You get a 10% discount]\nGUESTING:   https://joinpodmatch.com/witnessunderground  \n[The best way I’ve found to grow my audience and convert]\n\nPrepare for a gripping 2-minute teaser that showcases the unshackled voices of brave souls who broke free from the dangerous clutches of the Jehovah\u0027s Witness death cult. Witness their courageous accounts of survival, resilience, and freedom as they expose the dark realities of the cult\u0027s harmful doctrines and extreme beliefs.\n\n🚫 Shunned and Escaped: The Journey to Liberation 🚫\n\nIn this powerful teaser, join former Jehovah\u0027s Witness cult members who escaped and are now living full lives outside the confines of the cult. These brave individuals reflect on their experiences and share the emotional toll of being shunned by the community they once called family.\n\n💀 Death Views and Heartless Remarks 💀\n\nListen as they discuss the harrowing death views ingrained within the cult, where one mother shockingly tells her daughter Miranda to take her own life rather than face a supposed Armageddon punishment by Jesus. Their chilling accounts reveal the psychological manipulation and control wielded by the cult\u0027s leaders, highlighting the danger posed to its members.\n\n👨‍👩‍👧‍👦 Raising Free Thinkers: Breaking the Cycle 👨‍👩‍👧‍👦\n\nAmidst the darkness, one father shares his journey of raising his children as free thinkers, encouraging them to explore their beliefs independently. His inspiring story is juxtaposed with footage of his punk rock band, Serial Killer Sunday School, where his voice echoes the message of breaking free from indoctrination and embracing individuality.\n\n🔥 A Call to Action 🔥\n\nThese stories of survival and resilience will leave you moved and inspired. As they fight to protect themselves and others from the dangers of the Jehovah\u0027s Witness cult, they urge viewers to Subscribe here @WitnessUnderground to watch the XJW Coming Out Series and Witness Underground Documentary https://Patreon.com/WitnessUnderground. Together, let\u0027s amplify their voices and spread awareness about the dangers of this high-control death cult.\n\n🌟 Join the Movement: Watch XJW Coming Out Series and Witness Underground Documentary to Empower Others to Break Free 🌟\n\nDon\u0027t miss this captivating teaser that gives a glimpse into the lives of those who escaped the Jehovah\u0027s Witness death cult and found freedom. The XJW Coming Out Series and Witness Underground Documentary are calls to action, paving the way for change and helping others find their path to liberation. Stand with these survivors and join the fight against the darkness of the cult. \nWatch now! 🔔\nhttp://WitnessUnderground.com",
      "release": "2023-07-30T15:00:42Z",
      "duration": "00:02:37",
      "explicit": false,
      "youTubeId": "tvE9eSebY3w",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tvE9eSebY3w"
      }
    },
    {
      "id": "eca6e770-3821-4286-825c-e27c922f4186",
      "title": "Creatively Healing From Cults - Witness Underground Podcast (S02E04)",
      "description": "Subscribe - Like - Comment \n@WitnessUnderground\n\nWatch all of the other full episodes in the XJW Coming Out Playlist\n\nSUPPORT \u0026 WATCH: https://Patreon.com/WitnessUnderground\nFEATURE \u0026 PODCAST: https://WitnessUnderground.com\nNEWSLETTER: https://sendfox.com/BananaIsland\n\nPost Production: https://Podmachine.com Promo code: PODSCOTT  \n(You get a 10% discount)\nGuesting:   https://joinpodmatch.com/witnessunderground  \n(The best way I’ve found to grow my audience and convert)\nYoutube Growth: https://www.Tubebuddy.com/pricing?a=WitnessUnderground \n(amazing growth tool!)\nProduction:   https://www.riverside.fm/?via=scott-homan\nThe highest-end recording tool. Richest tool set on the backend of any tool I\u0027ve used\n\nAfter watching the thought-provoking documentary \u0022Witness Underground,\u0022 Three artists: an actor, a writer, and a musician engage in a profound conversation about their personal experiences with shunning and how they navigate through it. Join us as we explore the transformative power of art, music, therapy, movement, and meditation in coping while inside and healing after leaving a cult. Together, we\u0027ll embark on a remarkable exploration of consciousness and creativity.\n\nDescription:\nIn this compelling episode, we sit down with Gina Brown, Christopher of the band Scifidelic and Writer Brie Yarbrough in discussion with Scott Homan, Director of the award winning and eye-opening documentary \u0022Witness Underground,\u0022 which sheds light on artists who escaped a cult.\n\nTogether, we delve deep into their unique perspectives on shunning, drawing from their diverse experiences. We explore the profound impact of music, art, therapy, movement, and meditation as coping mechanisms during their time in the cult and as tools for healing after leaving.\n\nPrepare to be inspired as we explore their creative endeavors, from dance and acting to crafting a new Streaming Series pitch and building on a successful TikTok channel. We\u0027ll also uncover the intriguing story behind their decades-long music project called Scifidelic, featuring a band member known as Caustic, who was once a high-ranking member at the world headquarters of the Jehovah\u0027s Witnesses. Discover how their music directly addresses the themes of faith and exiting from it.\n\nOur guest, Gina, shares details about her exciting project—a series about the complexities of love, where an unlikely couple comes together amidst their vastly different worlds. Having experienced trauma within the Jehovah\u0027s Witness community, Gina incorporates her personal journey into the script, exploring the challenges of same-sex relationships and the harmful influence of the faith. We\u0027ll also touch upon the harrowing experiences of her sister-in-law, who faced life-threatening complications during childbirth due to the cult\u0027s ban on blood transfusions.\n\nAdditionally, we discuss Brie\u0027s upcoming book, which inspired her escape from the cult and provided solace and courage during her challenging journey. \n\nTogether, we explore strategies for overcoming triggers, dealing with attachment, and addressing past baggage. Moreover, we delve into the diverse interpretations of the cult\u0027s teachings regarding the end of the world and the impact it had on our guests\u0027 lives.\n\nJoin us for this thought-provoking conversation that unveils the power of art, resilience, and self-discovery. Get ready to expand your consciousness and embark on a journey of inspiration and empowerment.",
      "release": "2023-05-28T00:20:22Z",
      "duration": "01:14:11",
      "explicit": false,
      "youTubeId": "IlaWSh88x1U",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IlaWSh88x1U"
      }
    }
  ]
}