{
  "id": "bc73e16d-e8f4-4242-861d-b79483f24d0d",
  "name": "Witness Underground",
  "spotifyId": "4fe8f6S1VoIkQ0NfGirFym",
  "appleId": 1667178648,
  "youTubeChannelId": "UCnXbnuEB0iwtpY_Dl_Q9KdA",
  "episodes": [
    {
      "id": "88855f70-9fc6-42c0-b8d7-4525e0cec789",
      "title": "12 Questions about life and death - Understanding Jehovah Witness",
      "description": "12 Answers to some of the most common questions about life and death. Understanding Jehovah Witness culture and beliefs. The clear explanations found in God\u0027s Word may surprise you, as interpreted by Jehovah\u0027s Witnesses. Why leave Jehovahs Witnesses? Excellent insight from five people who lived under their manipulation, coercion, control, and abuse.\n\nMoments from the XJW Coming Out documentary series. \n\n00:00 Introduction to former cult member activism\n00:12 Witness tells daughter to kill herself\n00:22 Death is not a solution to problems\n00:32 Use suicide to get into paradise\n00:42 Jehovah\u0027s Witness abuse starts with baptism\n00:55 Dedicated to \u0022The Society,\u0022 not god\n01:05 Witnesses are coerced to shun family until death\n01:15 Don\u0027t indoctrinate your kids\n01:33 Life improves when you escape\n01:44 Take your freedom, get out of trap\n01:56 Prioritize freedom of thought\n02:11 Guilt is their method of control, get out\n\nSubscribe - Like - Comment \n@WitnessUnderground\n\nWatch the XJW Coming Out playlist:\nhttps://www.youtube.com/playlist?list=PLSh1p2dV3s8f-8ojM0M6DBgOtYN_jDjRP\n\nLearn More: \nhttps://WitnessUnderground.com\n\nSupport \u0026 Watch:\nhttps://Vimeo.com/ondemand/witnessunderground\nhttps://Patreon.com/WitnessUnderground\nhttps://YouTube.com/@WitnessUnderground\n\nExJW Art:\nhttps://witness-underground-cult-documentary-release.pledgebox.com/preorder\n\nYOUTUBE GROWTH: https://www.Tubebuddy.com/pricing?a=WitnessUnderground \n\nWelcome to a gripping exploration of the human psyche with our latest video release – a compelling trailer for the highly anticipated cult series, XJW Coming Out, within the Witness Underground project. Delve into the enigmatic world of cults through riveting cult member Interviews, where survivors share their experience with Jehovah\u0027s Witness cultural norms related to death and stories that will leave you on the edge of your seat.\n\nUnearth the truth behind extreme beliefs in our documentary series trailer that peels back the layers of the cult dogma, exposing the dark and often mysterious aspects of life within these closed societies. Join us as we tackle the challenging questions about life and death, unraveling the complexities of the Jehovah Witness faith in the aftermath of the Watchtower.\n\nDiscover firsthand accounts of those who have awakened from cult indoctrination, providing insight into what it\u0027s like growing up in a cult. Hear powerful narratives from cult survivors, as they courageously recount their journeys of escaping the clutches of extremist ideologies in our death cult series.\n\nExplore the depths of the ExJW (Ex-Jehovah\u0027s Witness) experience, as individuals share their reasons for leaving the Jehovah\u0027s Witness life. Gain a deeper Understanding of Jehovah Witness beliefs about death.\n\nPrepare yourself for how I survived a cult story, a slice of our series that confronts the most challenging aspects of cult life and the resolute spirit of those who managed to break free. Don\u0027t miss this opportunity to challenge preconceptions and embark on a thought-provoking journey into the world of extreme beliefs.",
      "release": "2024-01-25T15:00:38Z",
      "duration": "00:02:30",
      "explicit": false,
      "youTubeId": "lHiNhb6bHww",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lHiNhb6bHww"
      }
    },
    {
      "id": "c08ba34a-1bad-4272-bc6e-4dc5503d2d71",
      "title": "Devil Drinks Mocha - Story Editor and Novelist",
      "description": "Walmsley Krubeck did the heavy lifting of story editing and color for our feature documentary Witness Underground. In this episode we dive into the process, challenges, clashes, pressures, frustrations, and successes of working together in our first discussion after creating the film. She has since worked on several other films and also written her first novel. All of Siân\u0027s links:https://linktr.ee/sjkrubeckRead The Devil Drinks Mocha:https://a.co/d/19S3x2zWatch now:http://WitnessUnderground.comWatch \u0026 Support:https://vimeo.com/ondemand/witnessundergroundhttps://Patreon.com/WitnessUndergroundhttps://YouTube.com/@WitnessUndergroundStore:https://witness-underground-cult-documentary-release.pledgebox.com/preorderJump into our Discordhttps://discord.gg/WUp9c95rsXReach out directly: XJWdoc@gmail.com-Scott",
      "release": "2024-01-24T15:00:00Z",
      "duration": "01:19:31.7930000",
      "explicit": false,
      "spotifyId": "0NPKfhUw3w8Kgj8ChZD9tv",
      "appleId": 1000642791885,
      "youTubeId": "MXHELuzxVbY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NPKfhUw3w8Kgj8ChZD9tv",
        "apple": "https://podcasts.apple.com/podcast/devil-drinks-mocha-story-editor-and-novelist/id1667178648?i=1000642791885",
        "youtube": "https://www.youtube.com/watch?v=MXHELuzxVbY"
      }
    },
    {
      "id": "5ea9527f-8dd5-4420-b3e1-509d20058b60",
      "title": "Former Bethel Elder Become a Blues Rocker",
      "description": "Former Elder in Jehovah\u0027s Witnesses, Gary Alt, was even a long-time \u0022Bethelite,\u0022 a worker at their world headquarters called Watchtower (a book publishing company masquerading as a religion). One of his contributions while there was cultural. He was asked to host a monthly music entertainment night at Bethel.Check out his songs:\u0022Here are a handful of songs you might be interested in. The \u0022still IN\u0022 songs variously have something to do with my exiting the JWs.[still IN]Falling Down vocal by Jaywayhttps://www.youtube.com/watch?v=Tl__9Y2BJq8Bleed For You vocal by Jaywayhttps://www.youtube.com/watch?v=USzsewK8WZsSpinhttps://www.youtube.com/watch?v=8poJf5pTzxEWhatever (I knew this wasn\u0027t a good song when I did it, but I needed one more for my album Not For Sale To Minors and wanted it to be raw-sounding - deliberately done with the angst and minimalist values of John Lennon\u0027s early solo recordings)https://www.youtube.com/watch?v=LjOZPqdskaA[OUT]Never Ending Always vocal by Lori Klein (written for my novel, Force of Will which used the pseudonym Tan Swiftwater - there\u0027s an interesting story to the song)https://www.youtube.com/watch?v=JbRK0HbqMiMThis Holy Day vocal by post-JW Gayann from NYhttps://www.youtube.com/watch?v=1OMPcoB9vL0Wake Up vocal by post-JW Emma-Jade Mechen, daughter of Shane, from New Zealandhttps://www.youtube.com/watch?v=1LAjNwRe6GwAnything else you might be interested in may be found on Spotify by searching for \u0022Gary Alt\u0022 and the following album names, all done when I was JW:-Tribute-(Not) For Sale To Minors-Beef Wellington and the Mad Cows - Masticated Bovine (joint project with JW friend Jayway when I was in)-Gift of Projection (EP that predicted Art of Survival but has only 2 songs in common with it)-Art of Survival (my best IMO)And a couple of relatively recent extra songs that are not on any album:-Shine a Light-The Moon is Broken Tonight-Western Lady - vocal by Rick Barth (YouTube only, not actually released)-Color Wind (demo only)Back in the Free World - vocal by Larry Hayden https://www.youtube.com/watch?v=3g0Ch6YYMeg \u0022 - Written FOR the JWs back when I was in. I now reinterpret thWatch now:http://WitnessUnderground.comWatch \u0026 Support:https://vimeo.com/ondemand/witnessundergroundhttps://Patreon.com/WitnessUndergroundhttps://YouTube.com/@WitnessUndergroundStore:https://witness-underground-cult-documentary-release.pledgebox.com/preorderJump into our Discordhttps://discord.gg/WUp9c95rsXReach out directly: XJWdoc@gmail.com-Scott",
      "release": "2024-01-17T00:00:00",
      "duration": "02:02:06.6380000",
      "explicit": false,
      "spotifyId": "0nTFBNDqvL2WdzePCz9Eni",
      "appleId": 1000641987243,
      "youTubeId": "i8zV6W-lKiE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nTFBNDqvL2WdzePCz9Eni",
        "apple": "https://podcasts.apple.com/podcast/former-bethel-elder-become-a-blues-rocker/id1667178648?i=1000641987243",
        "youtube": "https://www.youtube.com/watch?v=i8zV6W-lKiE"
      }
    },
    {
      "id": "ecc68a1f-4505-4139-9b54-3887a0be209a",
      "title": "Three former Jehovah\u0027s Witnesses give advice",
      "description": "Watch \u0026 Support:\nhttps://vimeo.com/ondemand/witnessunderground\nhttps://Patreon.com/WitnessUnderground\nhttps://YouTube.com/@WitnessUnderground\nhttp://WitnessUnderground.com\n\nStore:\nhttps://witness-underground-cult-documentary-release.pledgebox.com/preorder\n\nDuring production of Witness Underground documentary, we took a break between interviews and shooting, to have a former Jehovah\u0027s Witness meetup in Minneapolis. We ended up shooting these additional short interviews in the backyard during the event for the XJW Coming Out series as a bonus episode.\n\nThree short interviews capture the diverse experiences of individuals who found the courage to question their upbringing in this \u0022Apocalyptic cult\u0022 and, in doing so, discovered the strength to forge their own paths.\n\nListen to three former Witnesses, Jesse America, Erica Rae, and James Zimmerman who got out. They all describe what life was like inside, pressures they experienced, why they left, and their new world views. \n\nThey dive into how they feel about this group looking back into their strange past.\n\nTopics discussed:\nCognitive dissonance, conflict caused by religion, inner feelings as a witness, cultural norms within the cult, mis-education, becoming open-minded, disconnection with organized religion, different way to believe in god, atheism, enjoying life now rather than waiting on a higher power, reconnecting with grandparents and other family that were disconnected from because of this religions intolerance of non-members. Being honest about reality, achieving contentment in life through community, life passions, bond through powerful friendships. Family strength, success through education, first in family history to get a degree, feeling of freedom and access to pursue passions, showing love without judgement towards others.\n\nUntethered from authoritarian control what did you do with your freedom?\n\nAre you happier now?\n\nWhat do you do now with your life?\n\nWhat advice can you give to active members of the Jehovah\u0027s Witnesses?\n\n\u0022I\u0027m so much happier not being in this religion anymore. I want that for them.\u0022 Get out!",
      "release": "2024-01-13T19:17:52Z",
      "duration": "00:15:48",
      "explicit": false,
      "youTubeId": "9y1n_AggktA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9y1n_AggktA"
      }
    },
    {
      "id": "b9cf802f-77bb-40f0-a68d-0c92e184a926",
      "title": "Cult Writer Goes Wild With Outlaw Films",
      "description": "Our Co-Producer, Anthony Mathenia, meets up with Scott Homan and Ryan Sutter in an engaging conversation highlighting his other film work with Outlaw films, and the four books he wrote.\n\nFrom Outlaw Films\n\nFree to watch with ads on Tubi:\nDope Men: America\u0027s First Drug Cartel\nhttps://tubitv.com/movies/100008549/dope-men-america-s-first-drug-cartel\n\nNight Life\nhttps://tubitv.com/movies/100009015/night-life\nNew release for download or rent on Amazon:\n\nPsychedelic Revolution\nhttps://www.amazon.com/Psychedelic-Revolution-Secret-History-Trade/dp/B0CKLYM2YX\n\nFrom Gorilla Convict\nLucky Graphic Novel — Read for free with Kindle Unlimited\nhttps://www.amazon.com/Lucky-Gangster-Graphic-Novel-Luciano-ebook/dp/B0CFBV714N\n\nwww.gorillaconvict.com\n\nReach out directly: \nXJWdoc@gmail.com",
      "release": "2023-11-14T01:13:40Z",
      "duration": "01:39:27",
      "explicit": false,
      "appleId": 1000641192430,
      "youTubeId": "kyhAPbxw9Rs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/cult-writer-goes-wild-with-outlaw-films/id1667178648?i=1000641192430",
        "youtube": "https://www.youtube.com/watch?v=kyhAPbxw9Rs"
      }
    },
    {
      "id": "60ac262a-a4dc-4ed3-9c65-5567f8156e32",
      "title": "Call to Collaborate - Film Release Update - Witness Underground",
      "description": "Join our Core Team or our Street Team and do this along with us!\n\nStreet \u0026 Core Team:\nhttps://discord.gg/WUp9c95rsX\n\nReach out directly with your interest and we\u0027ll get you up to speed XJWdoc@gmail.com\n\n-Scott\njoin the mission \nhttps://sendfox.com/bananaisland\n\nhttps://WitnessUnderground.com\nhttps://Patreon.com/WitnessUnderground\nhttps://YouTube.com/@WitnessUnderground",
      "release": "2023-09-12T18:57:56Z",
      "duration": "00:42:54",
      "explicit": false,
      "youTubeId": "AnesyqlBUkU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AnesyqlBUkU"
      }
    },
    {
      "id": "00b1a0d8-66a9-40cb-966c-ef0c4e69ad7f",
      "title": "Jehovah Witness Death Phobia - Escaping A Cult | Witness Underground",
      "description": "Subscribe - Like - Comment \n@WitnessUnderground\n\nWatch two full seasons of the XJW Coming Out\n\nSUPPORT \u0026 WATCH: https://Patreon.com/WitnessUnderground\nFEATURE \u0026 PODCAST: https://WitnessUnderground.com\nNEWSLETTER: https://sendfox.com/BananaIsland\n\nYOUTUBE GROWTH: https://www.Tubebuddy.com/pricing?a=WitnessUnderground \n[Amazing growth tool!]\nPRODUCTION:   https://www.riverside.fm/?via=scott-homan\n[The highest-end recording tool. Richest tool set on the backend of any tool I\u0027ve used]\nPOST PRODUCTION: https://Podmachine.com Promo code: PODSCOTT  \n[You get a 10% discount]\nGUESTING:   https://joinpodmatch.com/witnessunderground  \n[The best way I’ve found to grow my audience and convert]\n\nPrepare for a gripping 2-minute teaser that showcases the unshackled voices of brave souls who broke free from the dangerous clutches of the Jehovah\u0027s Witness death cult. Witness their courageous accounts of survival, resilience, and freedom as they expose the dark realities of the cult\u0027s harmful doctrines and extreme beliefs.\n\n🚫 Shunned and Escaped: The Journey to Liberation 🚫\n\nIn this powerful teaser, join former Jehovah\u0027s Witness cult members who escaped and are now living full lives outside the confines of the cult. These brave individuals reflect on their experiences and share the emotional toll of being shunned by the community they once called family.\n\n💀 Death Views and Heartless Remarks 💀\n\nListen as they discuss the harrowing death views ingrained within the cult, where one mother shockingly tells her daughter Miranda to take her own life rather than face a supposed Armageddon punishment by Jesus. Their chilling accounts reveal the psychological manipulation and control wielded by the cult\u0027s leaders, highlighting the danger posed to its members.\n\n👨‍👩‍👧‍👦 Raising Free Thinkers: Breaking the Cycle 👨‍👩‍👧‍👦\n\nAmidst the darkness, one father shares his journey of raising his children as free thinkers, encouraging them to explore their beliefs independently. His inspiring story is juxtaposed with footage of his punk rock band, Serial Killer Sunday School, where his voice echoes the message of breaking free from indoctrination and embracing individuality.\n\n🔥 A Call to Action 🔥\n\nThese stories of survival and resilience will leave you moved and inspired. As they fight to protect themselves and others from the dangers of the Jehovah\u0027s Witness cult, they urge viewers to Subscribe here @WitnessUnderground to watch the XJW Coming Out Series and Witness Underground Documentary https://Patreon.com/WitnessUnderground. Together, let\u0027s amplify their voices and spread awareness about the dangers of this high-control death cult.\n\n🌟 Join the Movement: Watch XJW Coming Out Series and Witness Underground Documentary to Empower Others to Break Free 🌟\n\nDon\u0027t miss this captivating teaser that gives a glimpse into the lives of those who escaped the Jehovah\u0027s Witness death cult and found freedom. The XJW Coming Out Series and Witness Underground Documentary are calls to action, paving the way for change and helping others find their path to liberation. Stand with these survivors and join the fight against the darkness of the cult. \nWatch now! 🔔\nhttp://WitnessUnderground.com",
      "release": "2023-07-30T15:00:42Z",
      "duration": "00:02:37",
      "explicit": false,
      "youTubeId": "tvE9eSebY3w",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tvE9eSebY3w"
      }
    },
    {
      "id": "eca6e770-3821-4286-825c-e27c922f4186",
      "title": "Creatively Healing From Cults - Witness Underground Podcast (S02E04)",
      "description": "Subscribe - Like - Comment \n@WitnessUnderground\n\nWatch all of the other full episodes in the XJW Coming Out Playlist\n\nSUPPORT \u0026 WATCH: https://Patreon.com/WitnessUnderground\nFEATURE \u0026 PODCAST: https://WitnessUnderground.com\nNEWSLETTER: https://sendfox.com/BananaIsland\n\nPost Production: https://Podmachine.com Promo code: PODSCOTT  \n(You get a 10% discount)\nGuesting:   https://joinpodmatch.com/witnessunderground  \n(The best way I’ve found to grow my audience and convert)\nYoutube Growth: https://www.Tubebuddy.com/pricing?a=WitnessUnderground \n(amazing growth tool!)\nProduction:   https://www.riverside.fm/?via=scott-homan\nThe highest-end recording tool. Richest tool set on the backend of any tool I\u0027ve used\n\nAfter watching the thought-provoking documentary \u0022Witness Underground,\u0022 Three artists: an actor, a writer, and a musician engage in a profound conversation about their personal experiences with shunning and how they navigate through it. Join us as we explore the transformative power of art, music, therapy, movement, and meditation in coping while inside and healing after leaving a cult. Together, we\u0027ll embark on a remarkable exploration of consciousness and creativity.\n\nDescription:\nIn this compelling episode, we sit down with Gina Brown, Christopher of the band Scifidelic and Writer Brie Yarbrough in discussion with Scott Homan, Director of the award winning and eye-opening documentary \u0022Witness Underground,\u0022 which sheds light on artists who escaped a cult.\n\nTogether, we delve deep into their unique perspectives on shunning, drawing from their diverse experiences. We explore the profound impact of music, art, therapy, movement, and meditation as coping mechanisms during their time in the cult and as tools for healing after leaving.\n\nPrepare to be inspired as we explore their creative endeavors, from dance and acting to crafting a new Streaming Series pitch and building on a successful TikTok channel. We\u0027ll also uncover the intriguing story behind their decades-long music project called Scifidelic, featuring a band member known as Caustic, who was once a high-ranking member at the world headquarters of the Jehovah\u0027s Witnesses. Discover how their music directly addresses the themes of faith and exiting from it.\n\nOur guest, Gina, shares details about her exciting project—a series about the complexities of love, where an unlikely couple comes together amidst their vastly different worlds. Having experienced trauma within the Jehovah\u0027s Witness community, Gina incorporates her personal journey into the script, exploring the challenges of same-sex relationships and the harmful influence of the faith. We\u0027ll also touch upon the harrowing experiences of her sister-in-law, who faced life-threatening complications during childbirth due to the cult\u0027s ban on blood transfusions.\n\nAdditionally, we discuss Brie\u0027s upcoming book, which inspired her escape from the cult and provided solace and courage during her challenging journey. \n\nTogether, we explore strategies for overcoming triggers, dealing with attachment, and addressing past baggage. Moreover, we delve into the diverse interpretations of the cult\u0027s teachings regarding the end of the world and the impact it had on our guests\u0027 lives.\n\nJoin us for this thought-provoking conversation that unveils the power of art, resilience, and self-discovery. Get ready to expand your consciousness and embark on a journey of inspiration and empowerment.",
      "release": "2023-05-28T00:20:22Z",
      "duration": "01:14:11",
      "explicit": false,
      "youTubeId": "IlaWSh88x1U",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IlaWSh88x1U"
      }
    }
  ]
}