{
  "id": "bc73e16d-e8f4-4242-861d-b79483f24d0d",
  "name": "Witness Underground",
  "spotifyId": "",
  "appleId": null,
  "youTubeChannelId": "UCnXbnuEB0iwtpY_Dl_Q9KdA",
  "episodes": [
    {
      "id": "eca6e770-3821-4286-825c-e27c922f4186",
      "title": "Creatively Healing From Cults - Witness Underground Podcast (S02E04)",
      "description": "Subscribe - Like - Comment \n@WitnessUnderground\n\nWatch all of the other full episodes in the XJW Coming Out Playlist\n\nSUPPORT \u0026 WATCH: https://Patreon.com/WitnessUnderground\nFEATURE \u0026 PODCAST: https://WitnessUnderground.com\nNEWSLETTER: https://sendfox.com/BananaIsland\n\nPost Production: https://Podmachine.com Promo code: PODSCOTT  \n(You get a 10% discount)\nGuesting:   https://joinpodmatch.com/witnessunderground  \n(The best way I’ve found to grow my audience and convert)\nYoutube Growth: https://www.Tubebuddy.com/pricing?a=WitnessUnderground \n(amazing growth tool!)\nProduction:   https://www.riverside.fm/?via=scott-homan\nThe highest-end recording tool. Richest tool set on the backend of any tool I\u0027ve used\n\nAfter watching the thought-provoking documentary \u0022Witness Underground,\u0022 Three artists: an actor, a writer, and a musician engage in a profound conversation about their personal experiences with shunning and how they navigate through it. Join us as we explore the transformative power of art, music, therapy, movement, and meditation in coping while inside and healing after leaving a cult. Together, we\u0027ll embark on a remarkable exploration of consciousness and creativity.\n\nDescription:\nIn this compelling episode, we sit down with Gina Brown, Christopher of the band Scifidelic and Writer Brie Yarbrough in discussion with Scott Homan, Director of the award winning and eye-opening documentary \u0022Witness Underground,\u0022 which sheds light on artists who escaped a cult.\n\nTogether, we delve deep into their unique perspectives on shunning, drawing from their diverse experiences. We explore the profound impact of music, art, therapy, movement, and meditation as coping mechanisms during their time in the cult and as tools for healing after leaving.\n\nPrepare to be inspired as we explore their creative endeavors, from dance and acting to crafting a new Streaming Series pitch and building on a successful TikTok channel. We\u0027ll also uncover the intriguing story behind their decades-long music project called Scifidelic, featuring a band member known as Caustic, who was once a high-ranking member at the world headquarters of the Jehovah\u0027s Witnesses. Discover how their music directly addresses the themes of faith and exiting from it.\n\nOur guest, Gina, shares details about her exciting project—a series about the complexities of love, where an unlikely couple comes together amidst their vastly different worlds. Having experienced trauma within the Jehovah\u0027s Witness community, Gina incorporates her personal journey into the script, exploring the challenges of same-sex relationships and the harmful influence of the faith. We\u0027ll also touch upon the harrowing experiences of her sister-in-law, who faced life-threatening complications during childbirth due to the cult\u0027s ban on blood transfusions.\n\nAdditionally, we discuss Brie\u0027s upcoming book, which inspired her escape from the cult and provided solace and courage during her challenging journey. \n\nTogether, we explore strategies for overcoming triggers, dealing with attachment, and addressing past baggage. Moreover, we delve into the diverse interpretations of the cult\u0027s teachings regarding the end of the world and the impact it had on our guests\u0027 lives.\n\nJoin us for this thought-provoking conversation that unveils the power of art, resilience, and self-discovery. Get ready to expand your consciousness and embark on a journey of inspiration and empowerment.",
      "release": "2023-05-28T00:20:22Z",
      "duration": "01:14:11",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "IlaWSh88x1U",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=IlaWSh88x1U"
      }
    },
    {
      "id": "60ac262a-a4dc-4ed3-9c65-5567f8156e32",
      "title": "Call to Collaborate - Film Release Update - Witness Underground",
      "description": "Join our Core Team or our Street Team and do this along with us!\n\nStreet \u0026 Core Team:\nhttps://discord.gg/WUp9c95rsX\n\nReach out directly with your interest and we\u0027ll get you up to speed XJWdoc@gmail.com\n\n-Scott\njoin the mission \nhttps://sendfox.com/bananaisland\n\nhttps://WitnessUnderground.com\nhttps://Patreon.com/WitnessUnderground\nhttps://YouTube.com/@WitnessUnderground",
      "release": "2023-09-12T18:57:56Z",
      "duration": "00:42:54",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "AnesyqlBUkU",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=AnesyqlBUkU"
      }
    }
  ]
}