{
  "id": "351ad155-c2de-4305-af79-3a80a0d25a3d",
  "name": "WKYC Channel 3",
  "youTubeChannelId": "UCNBmxc6FvKyxtCpUygcdINA",
  "episodes": [
    {
      "id": "52b40101-3d48-4a7b-be67-2fc686cb5358",
      "title": "Bloodline and Blind Faith: Reflecting on the Kirtland cult killings 35 years later",
      "description": "After arrests were made and trials were finished, Jeff Lundgren’s group was destroyed.\r\n\r\nIn total, 13 Kirtland cult members went to prison.\r\n\r\n“At first, I had a horrible time,” Damon remembered. “I did not do well; I got in fights constantly. We were socially awkward because we were secluded or cut off from the rest of the world. I didn’t have the mental capability yet to live on my own, to be my own person.”\r\n\r\nIt wasn’t until years after their sentencing that Damon and Danny both ended up in the Mansfield Correctional Institution, the facility where 3News investigator Peter Fleischer visited and interviewed both over the course of several months.\r\n\r\nDamon says seeing a familiar face changed the course of his life.\r\n\r\n“I needed somebody who was better than me to force me to be better than myself,” Damon reflected upon being reunited with Kraft. “I grew up, I quit being an idiot, I quit being an inmate and started acting like an adult.”\r\n\r\nThe two say they began sharing a cell in the mid-1990s. According to disciplinary records and several conversations Fleischer had with various prison staff, they’ve found a way to live behind bars.\r\n\r\nThey’re both active in Mansfield’s work programs. They create art and work on music. Copies of the prison’s newspaper confirm some of their proudest stories: helping to build Habitat for Humanity homes and repairing thousands of toys so that families on the outside can enjoy a holiday.\r\n\r\n“That was something I could be proud of,” Damon smiles as he looks back on the work he’s done behind bars. “It was the first time in my life I ever had things I could be proud of. It was something that I did that improved the world around me and made life better for other people.”\r\n\r\nRead: https://www.wkyc.com/article/news/investigations/kirtland-cult-killings-jeff-lundgren-damon-danny-kraft-35-years-later-bloodline-blind-faith-mansfield-correctional/95-eb98e320-20cd-4cc5-8b29-8b5e3f7f901b",
      "release": "2025-11-21T23:28:01Z",
      "duration": "00:08:13",
      "explicit": false,
      "youTubeId": "HNcG-0sMPLo",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HNcG-0sMPLo"
      }
    },
    {
      "id": "095ac288-54d5-4c5e-8b10-8bc2bc099c42",
      "title": "Bloodline and Blind Faith Part 4: Jeff Lundgren trial",
      "description": "The night after he murdered the Avery family, Jeff Lundgren gathered his group of followers and chose exile. They landed in rural West Virginia, a place Jeff felt called to, and a place he claimed God would appear.\r\n\r\n“The idea was that we would go into the wilderness so that we could remove ourselves from the rest of the world,” explained Kraft. “God would feel comfortable to come down and live among us.”\r\n\r\nBut even Jeff’s most devout followers struggled with the way they lived. Tents and cold conditions were tough enough, but life with Jeff himself was the biggest challenge.\r\n\r\n“It was an expression of labor for godliness, and that just takes all the damn fun out of it,” said Damon Lundgren, detailing the group’s way of life in West Virginia and how his father started to wear on others.\r\n\r\nRead more: https://www.wkyc.com/article/news/investigations/kirtland-cult-killings-jeff-lundgren-trials-west-virginia-bloodline-blind-faith-arrest-avery-damon-danny-kraft/95-9e1e3348-402c-4a4f-b3ba-421d1f6133eb",
      "release": "2025-11-20T23:46:06Z",
      "duration": "00:06:47",
      "explicit": false,
      "youTubeId": "8QTl7lnIbto",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8QTl7lnIbto"
      }
    },
    {
      "id": "b3231c99-4b65-41b1-a95c-ceac7a8405f6",
      "title": "Bloodline and Blind Faith Part 3: Jeff Lundgren\u0027s accusations",
      "description": "Former cult members grapple with the aftermath of the 1989 Kirtland killings, questioning the justification of past actions and the influence of Jeff Lundgren.",
      "release": "2025-11-19T23:57:04Z",
      "duration": "00:06:53",
      "explicit": false,
      "youTubeId": "vWq8tDWYLiM",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vWq8tDWYLiM"
      }
    },
    {
      "id": "e6884f10-c121-4738-b920-bd43c8321e0c",
      "title": "Bloodline and Blind Faith: Jeff Lundgren and Kirtland cult kill Avery family",
      "description": "The following is part two of our five-part series: \u0022Bloodline and Blind Faith: Untold Stories of the Kirtland Cult Killings,\u0022 a look at the 1989 Kirtland cult killing of the Avery family by Jeff Lundgren and his followers. \r\n\r\nBy the late 1980s, Jeff Lundgren was more than a tour guide at the Kirtland Temple; church leaders had handed him the keys. He controlled finances, and as his power grew, so did his defiance. Temple tours turned into private, unsupervised classes.\r\n\r\n“Those of us who attached ourselves to him and his family, I think, looked at this as we’re on a journey to become God’s people,” Kraft explained.\r\n\r\nRead more: https://www.wkyc.com/article/news/investigations/kirtland-cult-killing-jeff-lundgren-avery-family-bloodline-blind-faith-temple-damon-danny-kraft-barn/95-db7f7e1e-29ea-4858-9969-2dc65d6f1fd9",
      "release": "2025-11-19T00:03:35Z",
      "duration": "00:06:30",
      "explicit": false,
      "youTubeId": "jGyEDWimACg",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jGyEDWimACg"
      }
    },
    {
      "id": "813e75ac-d1bf-45fe-8699-6b0c87757e24",
      "title": "Bloodline and Blind Faith: The Kirtland cult forms and Jeffrey Lundgren gains power",
      "description": "The following is part one of our five-part series: \u0022Bloodline and Blind Faith: Untold Stories of the Kirtland Cult Killings,\u0022 a look at the 1989 Kirtland cult killing of the Avery family by Jeff Lundgren and his followers. \r\n\r\nWATCH ON WKYC\u002B: \u0027Bloodline and Blind Faith: Untold Stories of the Kirtland Cult Killings\u0027\r\n\r\nJeff Lundgren grew up in Missouri, in a home defined by strict faith and a controlling, abusive father.\r\n\r\n“It was a lonely life. I had few playmates and I had few friends,” Lundgren once admitted.\r\n\r\nEventually, he realized force brought power.\r\n\r\n“I was very proud of myself the day I was finally big enough,” he recalled of fighting back against his father. “He [Jeff’s father] said, ‘I’m going to take you back to that fence,’ and I stood up, looked him in the eye and said, ‘Let’s go.’”\r\n\r\nJeff left college and served aboard a Navy ship during the Vietnam War. At sea, he studied the Book of Mormon vigorously. When his ship went unscathed during an intense attack, Jeff decided God had spared him.\r\n\r\nBut once discharged and back in Missouri, he struggled, bouncing between jobs and homes.\r\n\r\n“Dad screwed up. Dad stole from work. Dad was a bad employee,” Jeff\u0027s oldest son Damon confessed, recounting a childhood that included constant moving and financial challenges.\r\n\r\nBy then a family man, Damon and Jeff’s wife Alice absorbed his rage most often.\r\n\r\n“He was very aggressive, very dominating. Incredibly strong. He was abusive in a lot of situations,” Damon said. “But I don’t think that was the key defining thing about him. He was the most devout person I’ve ever seen. The one thing above all was my dad actually did believe the religious teachings that he followed.”\r\n\r\nREAD MORE: https://www.wkyc.com/article/news/investigations/kirtland-cult-jeff-lundgren-killing-bloodline-blind-faith-temple-danny-kraft-avery-damon/95-753fdd61-23ba-47d8-adee-b902c8a7c344\r\n\r\n\r\nAt 3News, we’re here to share the stories that you say matter most to you. Share your ideas, thoughts, concerns and engage in conversations about the communities in which we all call home.\r\nFollow 3News on Social:\r\n\r\nhttps://www.facebook.com/wkyc.channel3/  \r\nTwitter: https://twitter.com/wkyc  \r\nInstagram: https://www.instagram.com/wkyc3/  \r\n\r\nVisit our site: https://www.wkyc.com/\r\n\r\nAnd be sure to download our app here: https://wkyc.com/app",
      "release": "2025-11-17T23:13:08Z",
      "duration": "00:07:17",
      "explicit": false,
      "youTubeId": "1XV2SAt3akw",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1XV2SAt3akw"
      }
    },
    {
      "id": "781e18df-58f0-417b-aff3-602cbb141a23",
      "title": "From the archives: Alice Lundgren talks to federal agents after arrest for Avery killings",
      "description": "Alice Lundgren\u0027s interrogation with the ATF immediately upon being arrested for the Avery murders. This is the interview as it was published by law enforcement in 1990.\n\nIn 1989, Northeast Ohio cult leader Jeff Lundgren killed the Avery family: Dennis, Cheryl, and their three young daughters. A dozen men and women followed the self-proclaimed prophet through fanaticism, into the wilderness, and ultimately to prison.\n\nThirty-five years after justice was served, Damon Lundgren — Jeff’s oldest son — and Danny Kraft — Jeff’s most loyal follower — are speaking to the media for the first time.\n\nIn our five-part series titled, “Bloodline and Blind Faith: Untold Stories of the Kirtland Cult Killings,” investigative reporter Peter Fleischer sits down with Lundgren and Kraft for the only interviews they’ve ever given.",
      "release": "2025-11-15T01:35:30Z",
      "duration": "00:38:26",
      "explicit": false,
      "youTubeId": "FZG1oxlXeC4",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FZG1oxlXeC4"
      }
    },
    {
      "id": "04b883c1-5145-4460-9161-3fbd84d0ff3c",
      "title": "From the archives: Kirtland cult killer Jeff Lundgren sits with WKYC\u0027s Tom Sweeney in 1990",
      "description": "In 1989, Northeast Ohio cult leader Jeff Lundgren killed the Avery family: Dennis, Cheryl, and their three young daughters. A dozen men and women followed the self-proclaimed prophet through fanaticism, into the wilderness, and ultimately to prison.\n\nThirty-five years after justice was served, Damon Lundgren — Jeff’s oldest son — and Danny Kraft — Jeff’s most loyal follower — are speaking to the media for the first time.\n\nIn our five-part series titled, “Bloodline and Blind Faith: Untold Stories of the Kirtland Cult Killings,” investigative reporter Peter Fleischer sits down with Lundgren and Kraft for the only interviews they’ve ever given.",
      "release": "2025-11-15T01:09:24Z",
      "duration": "00:07:46",
      "explicit": false,
      "youTubeId": "r5POExdo9bw",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=r5POExdo9bw"
      }
    },
    {
      "id": "16bd9fdb-3b42-4ee8-992b-363cd5a0c612",
      "title": "\u0027Bloodline and Blind Faith\u0027: 3News Investigates the untold stories of the Kirtland Cult Killings",
      "description": "This past January marked 35 years since the gruesome discovery of a family murdered and buried beneath a barn in Kirtland. The shocking crime — five members of the Avery family killed by cult leader Jeffrey Lundgren and his followers — remains one of the darkest chapters in Northeast Ohio history. \r\n\r\nBut while the somber anniversary was remembered by local media and community members earlier this year, 3News Investigates was quietly working behind the scenes to open a new chapter in this decades-old case.\r\n\r\nThrough months of letters, phone calls, and visits to Mansfield Correctional Institution, Investigator Peter Fleischer gained unprecedented access to two of the youngest cult members — Lundgren’s son, Damon, and his most devoted follower, Danny Kraft — both still incarcerated for their roles in the killings.  \r\n\r\nPeter Fleischer reports: https://www.wkyc.com/article/news/crime/true-crime/kirtland-cult-killings-bloodline-and-blind-faith-jeffrey-lundgren-damon-danny-kraft-avery-3news-investigates/95-c0916369-8ee4-470a-ae4b-8843b343a1a5 --\n\nAt 3News, we’re not here to tell you the news, we’re here to share the stories that you say matter most to you. Share your ideas, thoughts, concerns and engage in conversations about the communities in which we all call home.\n\nFollow 3News on Social:\n\nFacebook: https://www.facebook.com/wkyc.channel3/  \nTwitter: https://twitter.com/wkyc  \nInstagram: https://www.instagram.com/wkyc3/  \n\nVisit our site: https://www.wkyc.com/\nAnd be sure to download our app here: https://wkyc.com/app",
      "release": "2025-11-13T23:54:33Z",
      "duration": "00:05:22",
      "explicit": false,
      "youTubeId": "JM-EJu3hfqU",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JM-EJu3hfqU"
      }
    },
    {
      "id": "33ebd6a2-ff68-4893-9278-b6d974fba082",
      "title": "32nd anniversary of Waco siege of the Branch Davidians compound and David Koresh",
      "description": "April 19th marks the anniversary of the 1993 siege of the Branch Davidians compound in Waco, Texas. Federal and state authorities attacked the compound and when it ended 76 Branch Davidians, including children, and the cult\u0027s leader David Koresh were dead.\n\nCourtesy: NBC News Channel\n\nRELATED STORY: https://www.wkyc.com/article/features/originals/the-branch-davidians-25-years-later-a-congregation-living-online/287-547377099\n\nAt 3News, we’re here to share your voice and tell your story. Share your ideas, thoughts, concerns and engage in conversations about the communities in which we all call home.\n\nFollow 3News on Social:\n\nFacebook: https://www.facebook.com/wkyc.channel3/  \n\nTwitter: https://twitter.com/wkyc  \n\nInstagram: https://www.instagram.com/wkyc3/  \n\nVisit our site: https://www.wkyc.com/\n\nAnd be sure to download our app here: https://wkyc.com/app",
      "release": "2025-04-18T15:46:56Z",
      "duration": "00:01:44",
      "explicit": false,
      "youTubeId": "ucBeFLca-H4",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ucBeFLca-H4"
      }
    },
    {
      "id": "42e0a749-c65b-47fd-a68a-bb82956c3b0e",
      "title": "The Kirtland Cult Killings 35 years later",
      "description": "January 2025 marks 35 years since the gruesome discovery of the bodies of a family of five from under a local barn. \n\nThe case, known as the Kirtland Cult Killings, was the worst mass murder in the history of Lake County.\n\nOfficers from the Lake County Sheriff’s Office, Kirtland Police Department, and the Lake County Crime Lab worked alongside the FBI and ATF on a tip that bodies were buried under a barn at 8671 Chardon Road.\n\nInvestigators on scene found five bodies later identified as members of the same family: Dennis Avery, his wife Cheryl, and their daughters, 15-year-old Trina, 13-year-old Rebecca, and 7-year-old Karen. All five victims were gunned down in April 1989, but their bodies weren’t recovered until January 4, 1990, according to police.\n\nRead more: https://www.wkyc.com/article/news/local/lake-county/january-2025-35-years-since-kirtland-cult-killings/95-e8d3128f-2d32-4afe-b378-98fd0021f515 --\n\nAt 3News, we’re not here to tell you the news, we’re here to share the stories that you say matter most to you. Share your ideas, thoughts, concerns and engage in conversations about the communities in which we all call home.\n\nFollow 3News on Social:\n\nFacebook: https://www.facebook.com/wkyc.channel3/  \nTwitter: https://twitter.com/wkyc  \nInstagram: https://www.instagram.com/wkyc3/  \n\nVisit our site: https://www.wkyc.com/\nAnd be sure to download our app here: https://wkyc.com/app",
      "release": "2025-01-06T05:01:49Z",
      "duration": "00:02:07",
      "explicit": false,
      "youTubeId": "LGle1xbMnTU",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LGle1xbMnTU"
      }
    }
  ]
}