{
  "_ts": 0,
  "id": "d22d0467-bcc7-4dea-81c5-f1c30cea898f",
  "name": "wocomoHUMANITY",
  "youTubeChannelId": "UCHPFaQfUgV0a2oJ78m2d_-w",
  "episodes": [
    {
      "id": "e2ba2065-fd20-4b7b-a1ee-e9808e0d855b",
      "title": "Journey into the World of Transcendental Meditation - David Wants To Fly (Documentary, 2010)",
      "description": "David Sieveking follows the path of his idol, David Lynch, into the world of transcendental meditation (TM). That leads him to the movement’s founder, Maharishi, the one-time guru of the Beatles. Today, TM is a global conglomerate, promising world peace and yogic flying. How does this chime with the dark films of David Lynch? Inspired by his idol, the young director starts to meditate, too, submerging himself ever deeper in the strange world of TM.\n\n-------\n\nThe unprecedented success story of Maharishi Mahesh Yogi began in the Himalayas. In order to spread his meditation teachings and achieve world peace, the Indian guru came to Hollywood at the end of the 1950s and gained numerous celebrity followers, such as the Beatles, Mia Farrow and Clint Eastwood. Today, almost six million people worldwide practise Transcendental Meditation (TM). David, a young filmmaker in search of inspiration, also wants to try meditation. His idol, the legendary director David Lynch, personally assures him that TM is a source of creativity and the key to success.\n\nDavid decides to take his idol at his word: He undergoes the expensive meditation training, receives his personal mantra and tries his hand at yogic flying. But the inconsistencies soon mount up. The Indian guru\u0027s organization has become an industry worth billions. When Maharishi suddenly dies, there is a dispute over the successor. David Lynch becomes the organization\u0027s most important international ambassador.\n\nDespite all his doubts and the break-up with his girlfriend, David continues to hope for enlightenment. The filmmaker becomes a pilgrim on the trail of the TM movement. His steps are now closely followed by the organization - as he gets too close to some well-kept secrets. When David Lynch finally acknowledges the film team\u0027s research with a threat of legal action, the inner peace is gone. David travels to the USA and India: instead of the “heaven on earth” prophesied by Maharishi, he encounters abysses. Finally, in the heights of the Himalayas, at the icy source of the Ganges, David finds his own truth.\n\nDavid Sieveking manages the feat of telling his detective-like search for meaning as a light-footed journey into the cinematic self. On his adventurous odyssey from Berlin\u0027s Teufelsberg via Hollywood to the Himalayas, he combines spiritual experiences and bizarre observations with exciting documentary investigation.\n\n#documentary #fulldocumentary #transcendentalmeditation #davidlynch #maharishi \n-------\n\nSubscribe to wocomoHUMANITY: https://goo.gl/5Sp36B\nFollow us on Facebook: https://www.facebook.com/wocomo\n\n-------\n\nOriginal title: David Wants To Fly\nA film by David Sieveking\n© 2010, Licensed by Lichtblick Film\n\n------- \nDocumentaries about people and cultures from around the globe: wocomoHUMANITY offers high-quality content which is produced by leading production companies. \n\nCheck out our other channels to watch high quality documentaries:\n▷ wocomoDOCS: https://www.youtube.com/wocomoDOCS\n▷ wocomoWILDLIFE: https://www.youtube.com/wocomoWILDLIFE\n▷ wocomoHISTORY: https://www.youtube.com/wocomoHISTORY\n▷ wocomoTRAVEL: https://www.youtube.com/wocomoTRAVEL\n▷ wocomoCOOK: https://www.youtube.com/wocomoCOOK\n\nWocomo HUMANITY is part of the Wocomo channel network by NIKITA VENTURES. Wocomo - wonderful content in motion.",
      "release": "2025-05-07T15:00:06Z",
      "duration": "01:35:54",
      "explicit": false,
      "youTubeId": "AM_AoK7RiNU",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AM_AoK7RiNU"
      }
    },
    {
      "id": "3887fd33-d051-4e5d-ab08-0645faee48e5",
      "title": "Inside Osho\u0027s controversial cult - The dark side of the Rajneesh movement (Full Documentary, 2013)",
      "description": "The wild 1970s. A quest for higher consciousness, spirituality and sexual freedom. In\nhis Ashram in Poona, Bhagwan urges his disciples to meditate and practise tantric sex in order\nto reach a higher level of consciousness. Hugh, the guru’s bodyguard, watches his ascent on\npeople. Sheela becomes his secretary and the powerful boss of Bhagwan’s community in the\nmountains of Oregon. The guru, decried as ”sex-guru” by the Western media in the 1970s, is\nnow making headlines with his Rolls-Royces. The dream turns into a nightmare, for Hugh into a\nmental breakdown, for Sheela into a prison sentence. Where did it all begin to go wrong?\n\n-------\nChapters\n▷ 0:00:00 - Intro\n▷ 0:03:58 - Rajneesh as a religious movement\n▷ 0:06:50 - Osho\u0027s family background\n▷ 0:13:09 - Bhagwan Rajneesh\n▷ 0:14:53 - Feelings\n▷ 0:17:16 - The pressure on Rajneesh\n▷ 0:03:58 - Rajneesh as a religious movement\n▷ 0:23:07 - Love for life\n▷ 0:26:30 - Paradise\n▷ 0:31:31 - Therapy\n▷ 0:47:58 - The beginning\n▷ 0:49:22 - Working Vision\n▷ 0:51:45 - Big Muddy Ranch\n▷ 1:33:13 - Credits\n\n#documentary #osho #guru #bhagwan #wildwildcountry \n-------\nSubscribe to wocomoHUMANITY: https://goo.gl/5Sp36B\nFollow us on Facebook: https://www.facebook.com/wocomo\n-------\n\nOriginal title: GURU - Bhagwan, his Secretary \u0026 his Bodyguard\n\nDirected by Sabine Gisiger \u0026 Beat Häner\n\n© 2013, Licensed by Magnetfilm\n------- \n\nDocumentaries about people and cultures from around the globe: wocomoHUMANITY offers high-quality content which is produced by leading production companies. \n\nCheck out our other channels to watch high quality documentaries:\n▷ wocomoDOCS: https://www.youtube.com/wocomoDOCS\n▷ wocomoWILDLIFE: https://www.youtube.com/wocomoWILDLIFE\n▷ wocomoHISTORY: https://www.youtube.com/wocomoHISTORY\n▷ wocomoTRAVEL: https://www.youtube.com/wocomoTRAVEL\n▷ wocomoCOOK: https://www.youtube.com/wocomoCOOK\n\nWocomo HUMANITY is part of the Wocomo channel network by NIKITA VENTURES. Wocomo - wonderful content in motion.",
      "release": "2024-04-16T16:00:34Z",
      "duration": "01:35:28",
      "explicit": false,
      "youTubeId": "_6UVw7M5tlo",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_6UVw7M5tlo"
      }
    }
  ]
}