{
  "id": "4d059311-a1cc-4595-a06a-f9e7ee6909f6",
  "name": "World Of Secrets",
  "spotifyId": "7IhoWIUlWsueU2qqDm2ME6",
  "appleId": 1704480561,
  "episodes": [
    {
      "id": "60f84b45-6e3f-48b9-ab97-82ba1dded1e1",
      "title": "The Disciples: 9. Man of God",
      "description": "The secret daughter of TB Joshua, who dared to rebel against her prophet father. Ajoke was born to a different mother than her sisters, and disciples have told us how she fought back against the prophet. Two years ago, we tracked her down but we weren’t able to use the recording – until now. She tells us her story.Hosts Charlie Northcott and Yemisi Adegoke unravel a story of miracles, faith and manipulation, carried out by one of the most powerful religious figures of the century.Please note, some episodes in this series of World of Secrets contain graphic descriptions of sexual and physical violence, including sexual assault, rape and the language associated with it.If you\u0027ve been affected by any of the issues in this series, please contact support organisations in your own country. For a list of organisations in the UK that can provide support for survivors of sexual abuse, go to bbc.co.uk/actionlineArchive: SABC, Channels TV, Emmanuel TV#WorldofSecrets",
      "release": "2024-01-08T00:09:00Z",
      "duration": "00:39:43.5420000",
      "explicit": true,
      "spotifyId": "6cNMH1PGzaPMTR48qHukXK",
      "appleId": 1000640839718,
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cNMH1PGzaPMTR48qHukXK",
        "apple": "https://podcasts.apple.com/podcast/the-disciples-9-man-of-god/id1704480561?i=1000640839718"
      }
    },
    {
      "id": "6f37a698-5903-4fdc-b121-6c9bf8af2d88",
      "title": "The Disciples: 8. Collapse",
      "description": "People are trapped under rubble in the Lagos church compound. The eyes of the world are now on TB Joshua. Beneath the collapsed building is 23-year-old Princess, from South Africa. Her mother says she’s told: “just pray”. Disciple Emmanuel goes to the scene. “You could hear people, and their voices are fading. From louder, it’s getting weaker.” As suspicion about the cause of the collapse intensifies, Nigeria’s president, Goodluck Jonathan, flies in to offer his condolences to TB Joshua and the bereaved families. Meanwhile, the prophet gives a bizarre explanation.Hosts Charlie Northcott and Yemisi Adegoke unravel a story of miracles, faith and manipulation, carried out by one of the most powerful religious figures of the century.Please note, this season of World of Secrets contains graphic descriptions of sexual and physical violence, including sexual assault, rape and the language associated with it.If you\u0027ve been affected by any of the issues in this series, please contact support organisations in your own country. For a list of organisations in the UK that can provide support for survivors of sexual abuse, go to bbc.co.uk/actionlineArchive: Channels TV, Associated Press, CGTN Africa, The Synagogue Church of All Nations, Emmanuel TV, TV360, MrBallu58#WorldofSecrets",
      "release": "2024-01-08T00:08:00Z",
      "duration": "00:27:28.4830000",
      "explicit": true,
      "spotifyId": "6PwgcIoNREtAwbZJHsyBeS",
      "appleId": 1000640839220,
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6PwgcIoNREtAwbZJHsyBeS",
        "apple": "https://podcasts.apple.com/podcast/the-disciples-8-collapse/id1704480561?i=1000640839220"
      }
    },
    {
      "id": "c11bc92c-5d3a-4285-a5aa-35d688470f6a",
      "title": "The Disciples: 7. Beware of blasphemers",
      "description": "A once loyal disciple and recruiter for TB Joshua speaks out. Bisola’s video emerges on the internet - she calls it Deception of the Age. For the prophet, it’s betrayal. He won’t let go and delves into his archive of confessions to try and discredit her. Other disciples are frightened, including Rae.Hosts Charlie Northcott and Yemisi Adegoke unravel a story of miracles, faith and manipulation, carried out by one of the most powerful religious figures of the century.Please note, this season of World of Secrets contains graphic descriptions of sexual and physical violence, including sexual assault, rape and the language associated with it. If you\u0027ve been affected by any of the issues in this series, please contact support organisations in your own country. For a list of organisations in the UK that can provide support for survivors of sexual abuse, go to bbc.co.uk/actionlineArchive: Emmanuel TV#WorldofSecrets",
      "release": "2024-01-08T00:07:00Z",
      "duration": "00:24:59.7430000",
      "explicit": true,
      "spotifyId": "1kJ6wqMtjrpbTn9UsFBWLz",
      "appleId": 1000640838592,
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1kJ6wqMtjrpbTn9UsFBWLz",
        "apple": "https://podcasts.apple.com/podcast/the-disciples-7-beware-of-blasphemers/id1704480561?i=1000640838592"
      }
    },
    {
      "id": "494a93ad-4deb-46a7-b3db-c54beadc13e0",
      "title": "The Disciples: 6. Miracle machine",
      "description": "Healer or fraud? The truth about TB Joshua, whose miracles made him rich and famous. Videos show doctors testifying to his unexplainable ability to cure the sick. From restoring sight and the ability to walk, nothing seemed beyond the prophet’s power. But behind the miracles is a secret machine run by TB Joshua’s most trusted disciples. And some of them are turning whistleblowers. What was the human cost of these so-called miracles?Hosts Charlie Northcott and Yemisi Adegoke unravel a story of miracles, faith and manipulation, carried out by one of the most powerful religious figures of the century.   Please note, some episodes in this season of World of Secrets contain graphic descriptions of sexual and physical violence, including sexual assault, rape and the language associated with it. This episode also includes very strong language.If you\u0027ve been affected by any of the issues in this series, please contact support organisations in your own country. For a list of organisations in the UK that can provide support for survivors of sexual abuse, go to bbc.co.uk/actionlineArchive:  The Synagogue Church of All Nations, Emmanuel TV, JesusSetsFree, mightymiracles, Sky News#WorldofSecrets",
      "release": "2024-01-08T00:06:00Z",
      "duration": "00:36:20.7780000",
      "explicit": true,
      "spotifyId": "5uqbUrvPrfaRCpUdnLNAl1",
      "appleId": 1000640838150,
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5uqbUrvPrfaRCpUdnLNAl1",
        "apple": "https://podcasts.apple.com/podcast/the-disciples-6-miracle-machine/id1704480561?i=1000640838150"
      }
    },
    {
      "id": "cf2b710f-2872-4493-9f08-a66de9678ca7",
      "title": "The Disciples: 5. The maze",
      "description": "Anneka confronts TB Joshua. What really happened in his fifth-floor apartment at the top of the Lagos church compound? And can she escape his clutches? Anneka flees home to England but her ordeal isn’t over. TB Joshua sends one of his most trusted disciples to bring her back. “I knew she’d been sent to take me,” Anneka says. Hosts Charlie Northcott and Yemisi Adegoke unravel a story of miracles, faith and manipulation, carried out by one of the most powerful religious figures of the century. Please note, this season of World of Secrets contains graphic descriptions of sexual and physical violence, including sexual assault, rape and the language associated with it. This episode includes descriptions of forced abortions.If you\u0027ve been affected by any of the issues in this series, please contact support organisations in your own country. For a list of organisations in the UK that can provide support for survivors of sexual abuse, go to bbc.co.uk/actionline#WorldofSecrets",
      "release": "2024-01-08T00:05:00Z",
      "duration": "00:28:20.2100000",
      "explicit": true,
      "spotifyId": "00jb2UXCTBRaeLbIq66Sn6",
      "appleId": 1000640837050,
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/00jb2UXCTBRaeLbIq66Sn6",
        "apple": "https://podcasts.apple.com/podcast/the-disciples-5-the-maze/id1704480561?i=1000640837050"
      }
    },
    {
      "id": "69ecf302-cbc5-4688-b05c-010821b64744",
      "title": "The Disciples: 4. Daddy’s calling",
      "description": "Namibian teenager Jessica gives up everything to join prophet TB Joshua in Lagos. She is taken to a special place, where the church was born, now transformed from a swamp into a lake, with islands and a helipad. As one of a privileged few, she sees strange rituals with swords, crosses and photographs. Back in the church compound, disciples are encouraged to call TB Joshua “Daddy”. Then, Anneka tries to escape. Hosts Charlie Northcott and Yemisi Adegoke unravel a story of miracles, faith and manipulation, carried out by one of the most powerful religious figures of the century.Please note, this season of World of Secrets contains graphic descriptions of sexual and physical violence, including sexual assault, rape and the language associated with it. If you\u0027ve been affected by any of the issues in this series, please contact support organisations in your own country. For a list of organisations in the UK that can provide support for survivors of sexual abuse, go to bbc.co.uk/actionline#WorldofSecrets",
      "release": "2024-01-08T00:04:00Z",
      "duration": "00:31:11.2100000",
      "explicit": true,
      "spotifyId": "1SZofxRqqZDvyIslBwwZK6",
      "appleId": 1000640836385,
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1SZofxRqqZDvyIslBwwZK6",
        "apple": "https://podcasts.apple.com/podcast/the-disciples-4-daddys-calling/id1704480561?i=1000640836385"
      }
    },
    {
      "id": "e6c30da2-0a89-4548-b98e-593bc37d49a4",
      "title": "The Disciples: 3. The compound",
      "description": "TB Joshua’s new disciples Rae and Anneka leave behind their lives in England to follow the prophet, along with other young people from around the world. Isolated and sleep deprived, life is tough for the disciples but the only thing that matters to them is following Jesus – and TB Joshua is their passage. Outside of the closed compound in Lagos, Nigeria, people are noticing that something is wrong. Hosts Charlie Northcott and Yemisi Adegoke unravel a story of miracles, faith and manipulation, carried out by one of the most powerful religious figures of the century. Please note, some episodes in this season of World of Secrets contain graphic descriptions of sexual and physical violence, including sexual assault, rape and the language associated with it.If you\u0027ve been affected by any of the issues in this series, please contact support organisations in your own country. For a list of organisations in the UK that can provide support for survivors of sexual abuse, go to bbc.co.uk/actionlineArchive: The Synagogue Church of All Nations, Channel 4#WorldofSecrets",
      "release": "2024-01-08T00:03:00Z",
      "duration": "00:34:29.7210000",
      "explicit": true,
      "spotifyId": "7CCvSm7lxjB8LeJXh9r2I3",
      "appleId": 1000640835796,
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7CCvSm7lxjB8LeJXh9r2I3",
        "apple": "https://podcasts.apple.com/podcast/the-disciples-3-the-compound/id1704480561?i=1000640835796"
      }
    },
    {
      "id": "27fa934b-3063-4496-9066-76de688fa40d",
      "title": "The Disciples: 2. The prophet",
      "description": "The myths around Nigerian pastor TB Joshua draw young disciples into his web. His miracles go viral, bringing thousands more followers, hoping to be healed. Chosen ones, like Rae and Anneka, are invited to his Lagos church, with the coveted chance of becoming his disciples. Hosts Charlie Northcott and Yemisi Adegoke unravel a story of miracles, faith and manipulation, carried out by one of the most powerful religious figures of the century.Please note, some episodes in this season of World of Secrets contain graphic descriptions of sexual and physical violence, including sexual assault, rape and the language associated with it.If you\u0027ve been affected by any of the issues in this series, please contact support organisations in your own country. For a list of organisations in the UK that can provide support for survivors of sexual abuse, go to bbc.co.uk/actionlineArchive: The Synagogue Church of All Nations, Emmanuel TV, CBN News, Powered by Dunamis, Journeyman Pictures#WorldofSecretsAudio for this episode was updated on 8th January 2024",
      "release": "2024-01-08T00:02:00Z",
      "duration": "00:37:15.0490000",
      "explicit": true,
      "spotifyId": "0faDXIS1h3z85Q55xuJ6De",
      "appleId": 1000640836887,
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0faDXIS1h3z85Q55xuJ6De",
        "apple": "https://podcasts.apple.com/podcast/the-disciples-2-the-prophet/id1704480561?i=1000640836887"
      }
    },
    {
      "id": "03fbdc52-5f3d-48fd-b7a5-8081090549d4",
      "title": "The Disciples: 1. Sin no more",
      "description": "Shots ring out at a church guarded by gunmen in Lagos, Nigeria. Behind the blacked-out windows and high walls are secrets. In a pub in Oxford, England, a woman comes to us with a story. Hosts Charlie Northcott and Yemisi Adegoke investigate the cult of TB Joshua.   Please note, some episodes in this season of World of Secrets contain graphic descriptions of sexual and physical violence, including sexual assault, rape and the language associated with it. This episode also contains strong language.If you\u0027ve been affected by any of the issues in this series, please contact support organisations in your own country. For a list of organisations in the UK that can provide support for survivors of sexual abuse, go to bbc.co.uk/actionlineArchive: The Synagogue Church of All Nations, Journeyman Pictures#WorldofSecrets",
      "release": "2024-01-08T00:01:00Z",
      "duration": "00:34:42.5720000",
      "explicit": true,
      "spotifyId": "4SJ5mSTfaskbTzgtkaFGiZ",
      "appleId": 1000640833092,
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4SJ5mSTfaskbTzgtkaFGiZ",
        "apple": "https://podcasts.apple.com/podcast/the-disciples-1-sin-no-more/id1704480561?i=1000640833092"
      }
    }
  ]
}