{
  "_ts": 0,
  "id": "b58dd4d0-0143-4595-b1e0-113866b116c2",
  "name": "Writing Your Resilience: Building Resilience, Embracing Trauma and Healing Through Writing",
  "spotifyId": "3MEnrgariPykSEQ00KZVt8",
  "appleId": 1723385843,
  "youTubeChannelId": "UColPDzpoQlVktIv7-f7ObRg",
  "episodes": [
    {
      "id": "e8a05246-bfb8-467b-b813-7e1afc169792",
      "title": "Recovering from Cults and Religious Trauma Through Writing with Tia Levings",
      "description": "Tia Levings joins the Writing Your Resilience Podcast to discuss her experience as a debut author, writing to heal without retraumatizing yourself, the gaslighting that happens in religion, and getting things off your chest and onto the page to educate others with your writing. As you listen to this episode, consider the following questions: What would you need to do to claim your story? What would tell you it has legs? What would you need to do to see it from a wider lens? If it is a really tough story, how would you care for yourself as you work on it? Tia is an author and guest expert who exposes the abuses in Christian Fundamentalism. She’s been quoted in Salon, the Huffington Post, and the New York Times and appeared in the hit Amazon docu-series, Shiny Happy People. Her memoir, A Well-Trained Wife, will be published August, 6, 2024 by St. Martin\u0027s Press. Online, Tia connects our current news headlines with high-control religious roots. Find her work @TiaLevingsWriter on Instagram, Facebook and TikTok, and through her Substack, The Anti-Fundamentalist. Episode Highlights: 10:00 Signals Your Project Has Legs 15:00: How Writing Heals 17:00 Gaslighting and Religion 20:00 Finding the Wider Lens 25:00 Understanding Your Boundaries 28:00 Writing Without Retraumatizing Yourself 35:00 Claiming Your Story 39:00 Caring for the Soft Animal of Your Body Items mentioned in this episode: The Best Way to Deal with End-of_year Angst (Blog post on writing in a vacuum) Welcome to The Anti-Fundamentalist (Post where Tia holds her book) Shiny Happy People where to find it Shitty First Drafts by Anne Lamott Dr. Ramani On Gaslighting Plotting Your Novel with The Plot Clock Deep Work by Cal Newport Connect with Tia: Website: https://tialevings.com Tia’s Book: https://tialevings.com/book Instagram: https://www.instagram.com/TiaLevingsWriter Facebook: https://facebook.com/TiaLevingsWriter Substack: https://tialevings.substack.com Connect with your host, Lisa: Get Your Free Copy of Write More, Fret Less: https://lisacooperellison.com/newsletter-subscribe/ Website: https://lisacooperellison.com/ Instagram: https://www.instagram.com/lisacooperellison/ YouTube: https://www.youtube.com/channel/UColPDzpoQlVktIv7-f7ObRg Facebook: https://www.facebook.com/lisacooperellison/ LinkedIn: https://www.linkedin.com/in/lisa-ellison-b5483840/ Sign up for Create Your Memoir’s Beat Sheet: https://janefriedman.com/craft-your-memoirs-beat-sheet-with-lisa-cooper-ellison/ Produced by Espresso Podcast Production: https://www.espressopodcastproduction.com",
      "release": "2024-03-14T05:00:00Z",
      "duration": "00:53:37.0840000",
      "explicit": false,
      "spotifyId": "1YriK77Luyu56ks7vhPLmE",
      "appleId": 1000649152532,
      "youTubeId": "JD6vxepXQB4",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YriK77Luyu56ks7vhPLmE",
        "apple": "https://podcasts.apple.com/podcast/recovering-from-cults-and-religious-trauma-through/id1723385843?i=1000649152532",
        "youtube": "https://www.youtube.com/watch?v=JD6vxepXQB4"
      }
    }
  ]
}