{
  "id": "d724360d-baf6-49ec-b8aa-4ad0f34f0f66",
  "name": "Ya Never Know w/ Jake Haendel",
  "spotifyId": "7iCbSLb2kK4jmkvIXLjIDx",
  "appleId": 1819381961,
  "youTubeChannelId": "UCpoJxQNKSybRuSXEEuQ0cNA",
  "episodes": [
    {
      "id": "d35a20e6-4446-41dc-92bb-d10ccbe7dfe1",
      "title": "Ep. 23: Elizabeth Tells Us: Part 1—Growing Up in a Cult, Purity Culture, Her Sister’s Unsolved Death",
      "description": "In Part One of Elizabeth’s story, she opens up about a childhood shaped by a cult-like environment, strict purity culture, and an abusive father. She walks us through the hidden rules, the fear, and the control that defined her upbringing—and how it all set the stage for a deeply painful, messy marriage she didn’t see coming.\n\nElizabeth also shares the heartbreaking story of her sister’s death at 20 years old—a case that, eight years later, remains unsolved.\n\nJake and Elizabeth draw unexpected parallels between their lives, including the moment Jake reflects on his own marriage to Elle (Ellen) and the realization that he didn’t truly know the person he had committed to—mirroring Elizabeth’s experience of discovering who her husband really was after the wedding.\n\nThis is Part One of a story filled with trauma, resilience, and unanswered questions. Part Two dives even deeper.",
      "release": "2025-11-23T13:01:14Z",
      "duration": "00:45:41",
      "explicit": false,
      "spotifyId": "1pdgS4oAizNZ6V9W3Me6hm",
      "appleId": 1000737989572,
      "youTubeId": "_5Oqv2wtq20",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1pdgS4oAizNZ6V9W3Me6hm",
        "apple": "https://podcasts.apple.com/podcast/elizabeth-tells-us-part-one-growing-up-in-a-cult/id1819381961?i=1000737989572",
        "youtube": "https://www.youtube.com/watch?v=_5Oqv2wtq20"
      }
    },
    {
      "id": "36e6065b-f9d0-41b9-8b32-3a355178117c",
      "title": "18: Breaking Free From The Cult — Daniella’s Journey From The Children Of God To Military Intelligence (Part 2)",
      "description": "This episode picks up where Part One left off — after Daniella’s daring escape from the Children of God cult. What came next was a new kind of structure, discipline, and control: the U.S. military. Daniella (@daniellamyoung_) opens up about serving two tours in military intelligence, the psychological aftermath of leaving one cult only to find herself in another, and how she ultimately reclaimed her freedom and voice. Her bestselling memoir, Uncultured: A Memoir (available everywhere), tells the story of her journey from indoctrination to independence. Her forthcoming book, The Culting of America (available now for pre-sale at knittingcultlady.com), explores how cult dynamics appear in modern society. This is Part Two — powerful, revealing, and impossible to forget.",
      "release": "2025-10-12T12:00:00Z",
      "duration": "00:54:17.7840000",
      "explicit": false,
      "spotifyId": "7bGmfnWDo2uXwEYgEBR8VK",
      "appleId": 1000731447800,
      "youTubeId": "EP4T5ABRRVw",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7bGmfnWDo2uXwEYgEBR8VK",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-from-the-cult-daniellas-journey-from/id1819381961?i=1000731447800",
        "youtube": "https://www.youtube.com/watch?v=EP4T5ABRRVw"
      }
    },
    {
      "id": "2a7f692c-2e34-4b70-9a5f-2ba06bc65a06",
      "title": "17: Daniella The Knitting Cult Lady Tells Us What It’s Like Growing Up In Children Of God — And How She Escaped The Cult (Part One)",
      "description": "This episode dives into a story so wild it sounds like fiction — but it’s all very real. Daniella, also known as the knitting cult lady, was born into Children of God as a third-generation member. From birth, she suffered control, abuse, and was even trafficked across borders under the guise of loyalty to the cult. What makes her story even more extraordinary is how she broke free. As a teenager she escaped, built a new life for herself, and later served in the U.S. military. Her resilience led her to become an author. Her first memoir, Uncultured: A Memoir (available now) ( bookshop.org ) reflects on her journey through indoctrination and freedom. Her second book, The Culting of America, is currently on pre-sale (ships January 20, 2026) ( knittingcultlady.com ) and examines cult behavior in modern society. Follow Daniella on Instagram: @daniellamyoung_ This is Part One of her escape — raw, gripping, and full of revelations.",
      "release": "2025-10-05T12:00:00Z",
      "duration": "01:05:24.7200000",
      "explicit": false,
      "spotifyId": "0XFCk0YYkyfjoSfP4i3KMk",
      "appleId": 1000730214182,
      "youTubeId": "hxa13CJoyy8",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0XFCk0YYkyfjoSfP4i3KMk",
        "apple": "https://podcasts.apple.com/podcast/daniella-the-knitting-cult-lady-tells-us-what-its/id1819381961?i=1000730214182",
        "youtube": "https://www.youtube.com/watch?v=hxa13CJoyy8"
      }
    }
  ]
}