{
  "_ts": 0,
  "id": "6736d6df-a814-4eca-b853-60df3ec2b665",
  "name": "YaleCourses",
  "youTubeChannelId": "UC4EY_qnSeAP1xGsh61eOoJA",
  "episodes": [
    {
      "id": "1b2f6dec-cb29-411e-b068-381dc559df9b",
      "title": "European Intellectual History since Nietzsche: Cls 15, Hannah Arendt, Totalitarianism-Nature of Evil",
      "description": "“. . .totalitarianism has discovered a means of dominating and terrorizing human beings from within. In this sense it eliminates the distance between the rulers and the ruled. . .” –Hannah Arendt, Origins of Totalitarianism.\nHIST 271/HUMS 339: European Intellectual History since Nietzsche is a survey course designed to introduce students to the dominant trends in modern European intellectual history. The class aims to sketch a narrative arc from the late 18th century transition to modernity through the late 20th century transition to post-modernity. Following an overview of the Enlightenment and Romanticism, we move through Hegelianism and Marxism and then on to Nietzsche’s declaration of the death of God. (God had been multifunctional, fulfilling epistemological, ontological and ethical roles. His death left an enormous empty space. Much of modern thought could be described as an attempt to replace God.) Topics include Marxism-Leninism, psychoanalysis, expressionism, structuralism, phenomenology, existentialism, anti-politics, and deconstruction. Authors include Nietzsche, Lenin, Kafka, Freud, Husserl, de Beauvoir, Heidegger, Arendt, Adorno, Sartre, Girard, Foucault, Derrida and Havel. \nWith Marci Shore, Associate Professor of History at Yale.\nTo view and/or download a course syllabus and class handouts, please go to this link.\nhttps://yale.box.com/s/8s4i0lmgxmtk69jgxttk7peqdx8wa3xt",
      "release": "2024-01-02T17:53:16Z",
      "duration": "00:50:36",
      "explicit": false,
      "youTubeId": "Naev-AFcN5k",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Naev-AFcN5k"
      }
    }
  ]
}