{
  "_ts": 0,
  "id": "c7f0274a-9bdf-435d-aa1a-c9b9c1e0056d",
  "name": "Yasmine Mohammed",
  "youTubeChannelId": "UCL3JuJ41_RgM_D983YFvuRw",
  "episodes": [
    {
      "id": "a75b2582-3f10-4877-adcd-24cc4568f706",
      "title": "Jezebel: Hateful cult? Jehovah’s Witness Royalty Speaks Out",
      "description": "Jezebel, an ex-Jehovah’s Witness and Doomsday Cult survivor, spent over 20 years in the organization, enduring intense indoctrination, mind control, and emotional and mental abuse. Her experiences, including severe anxiety, depression, and eating disorders, are chronicled in two books written under her pen name.\n\nA lifelong historian and pro-freedom activist, Jezebel advocates for trauma survivorship and the sacredness of individual sovereignty. She promotes positive survivor mentality, emphasizing inner strength and gratitude, and educates others about the dangers of childhood indoctrination, mind control, deceptive propaganda, weaponized language, censorship, and totalitarianism.\n\nThrough her work, Jezebel aims to raise awareness and ensure that others know they are not alone in their struggles.\n\n📸Follow Yasmine on Instagram @yasmohammedxx \n\n📖Read Yasmine’s story here\n\n🫶Support Yasmine\u0027s organization, Free Hearts Free Minds here \n\n🎙️Listen to Yasmine’s podcast to hear inspiring conversations with unsung heroes and unknown warriors who have survived insurmountable odds and overcome the most vicious of obstacles.\nSubscribe on Spotify here \nSubscribe on Apple podcast here\n\n💌Stay in touch \nWebsite: www.yasminemohammed.com \nEmail :confessionsofanexmuslim@gmail.com \n\n#Islamotrauma #Islamophobia #GenderEquality #FreeHeartsFreeMinds #ExMuslim #CultSurvivor #Freethinkers",
      "release": "2024-08-13T15:38:30Z",
      "duration": "01:44:56",
      "explicit": false,
      "youTubeId": "4ewkBCg1ERE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4ewkBCg1ERE"
      }
    }
  ]
}