{
  "id": "496fbcf0-d6c4-44fb-a6c8-8350b99b9cbe",
  "name": "Yeah... Nah!",
  "spotifyId": "4vUHHTqwRQav9AJPP9ilbK",
  "appleId": 1609385108,
  "episodes": [
    {
      "id": "4c00d2d8-8fd1-4edb-b445-276736ba4bf3",
      "title": "Super Equine Destraws",
      "description": "Mark and Bronwyn are back from the DeCult conference, and have some thoughts about their experiences while they were there, and some of the suggestions that had been floated about how to deal with the issue of cults. Mark comes full-circle on the idea of a weirdly shaped straw, Katrina wants to be a super-hero, but is disappointed in the lack of progress science is making to realise her dreams. And Brad gets horsey again, trying to figure out why some of his friends and colleagues pay good money for ineffective equine treatments. Warning: This episode has brief mentions of abuse during the cult segment. About this episode Articles we talk about: Decompressing from DeCult Anti-Ageing Straws Superhero science IRL Equine Touch Newsletter issues these articles appear in: 2024-10-29",
      "release": "2024-11-03T10:00:00Z",
      "duration": "01:19:02.3090000",
      "explicit": false,
      "spotifyId": "3f6RJLZKEDzMzAQ73zuCad",
      "appleId": 1000675510664,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3f6RJLZKEDzMzAQ73zuCad",
        "apple": "https://podcasts.apple.com/podcast/super-equine-destraws/id1609385108?i=1000675510664"
      }
    },
    {
      "id": "034fe5db-545f-4bfe-99ad-7c077153a6ed",
      "title": "DECULT",
      "description": "In this VERY special episode, Mark and Bronwyn talk with Anke, a journalist with a long-standing interest in cult groups who is organising a weekend conference in Christchurch in October that focuses on all things culty. We talk about cult survivors, cult experts, the difficulties of organising a large event, and Anke’s hopes for the future.",
      "release": "2024-09-19T09:00:00Z",
      "duration": "01:03:36.5830000",
      "explicit": false,
      "spotifyId": "7MwUKwM9r3nTpDv90v7eAY",
      "appleId": 1000670428510,
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MwUKwM9r3nTpDv90v7eAY",
        "apple": "https://podcasts.apple.com/podcast/decult/id1609385108?i=1000670428510"
      }
    }
  ]
}