{
  "id": "96c3b827-2519-4b42-a41c-d8ca9a111dfb",
  "name": "Yeet the Rich",
  "spotifyId": "0GxCu8xXVgapWmzZ3J1VfG",
  "appleId": 1684853359,
  "episodes": [
    {
      "id": "86d66ddc-91fa-470d-910e-b7dda372ca51",
      "title": "LuLaRoe Part Two- There are NOT enough Legs!!",
      "description": "We are back for More Lularoe! Last ep we talked about how this small MLM turned into a massive problem and almost definitely a pyramid scheme. Mostly women and often stay at home moms were turning to Lularoe to make some extra money but instead were going into debt just to break even. The only people truely benefiting were Founders Mark and Deanne Stidhan and those lucky few that got in early and were getting massive bonuses for recruiting. The quality of the clothing was getting worse and the quality of the design was plummeting. But they went from 5,000 retailers to 80,000 in less than three years. So the scam outgrew their ability to control it and, the cracks are starting to show. This week we are going to fully get into them!We will talk about the logistical failings, the companies use of cult tactics to control and manipulate their retailers, and then the MANY MANY lawsuits! Enjoy! Sources for this week: “Lula Rich” -Amazon Prime Documentary (2021) “The Rise and Fall of Lularoe”-Documentary on Max (2021) “The Rise and fall of Lularoe” -6 part Podcast series hosted by Stephanie Mcneal https://www.stephaniemcneal.com/lularoe-documentary-Buzz Feed Reporter Stephanie Mcneal. Compalition of 11 articles written from 2017 to 2020: “Why MLMs Like Lularoe Are Disturbingly Similar to Cults”- By Drew Schwartz Newsletter on Vice.com(2021) https://www.vice.com/en/article/is-lularoe-cult-mlm-lularich-documentary/ “Life After MLM Podcast” by Roberta Blevins Episode (2021) \u0022Sam Schultz, LuLaRoe\u0027s Former Event ManagerContinues to Sart new Businesses\u0022 -Katherine J Igoe- Bustle(Sept 2021) https://www.bustle.com/entertainment/lularoe-nephew-sam-schultz-weed-farm-businesses “Lularoe Faces Verdict in Fraud and Contract Case” -By Zach Barretto for Expertinstute.com https://www.expertinstitute.com/resources/insights/lularoe-fraud-contract-case/ Follow the podcast @yeettherichpod Follow Emily @thefunnywalsh Follow Danny @dmoss315 Send us a text! Let us know what topics you want us to cover!",
      "release": "2025-01-14T07:00:00Z",
      "duration": "01:13:45.7690000",
      "explicit": false,
      "spotifyId": "3BbUBCAFUKbhZMYcs7T2N5",
      "appleId": 1000683897004,
      "subjects": [
        "LuLaRoe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BbUBCAFUKbhZMYcs7T2N5",
        "apple": "https://podcasts.apple.com/podcast/lularoe-part-two-there-are-not-enough-legs/id1684853359?i=1000683897004"
      }
    },
    {
      "id": "63007322-c334-4a97-b070-1bc6ed5b6c7e",
      "title": "LuLaRoe Part One-If Not Pyramid, Why Pyramid  Shaped?",
      "description": "This week we are talking about LuLaRoe and it is a fun one! LuLaRoe is a clothing company known for their “Buttery Soft Leggings” and bold patterns. With Promises of full time pay for part time work, The Lularoe life appealed to many people in America struggling to make ends meet. Especially women and often stay at home moms who may have just left their job to begin their family. Established in 2013 it reached its height in 2016-2017 with nearly $2 billion in sales and 80000 independent “Fashion Consultants” selling lularoe clothing. Consultants would spend tens of thousands of dollars buying leggings and dresses in bulk and do their best to make their “investment back”. Luckily for these struggling retailers there was a second way to make money at Lularoe: Recruitment. The more people you recruited the more money you would get. As the company got bigger and bigger it began to look less and less like a Legging company and more and more like a Pyramid. Less like a way for struggling families to make some extra cash and more like a predatory machine funneling money up to the very top of the food chain. Enjoy! Sources for this week: “Lula Rich” -Amazon Prime Documentary (2021) “The Rise and Fall of Lularoe”-Documentary on Max (2021) “The Rise and fall of Lularoe” -6 part Podcast series hosted by Stephanie Mcneal https://www.stephaniemcneal.com/lularoe-documentary-Buzz Feed Reporter Stephanie Mcneal. Compalition of 11 articles written from 2017 to 2020: Millennial Women Made LuLaRoe Billions. Then They Paid The Price. February 2020. LuLaRoe Is Paying More Than $4 Million To Settle A Lawsuit That Claimed It Was Running A Pyramid Scheme February 2021 LuLaRoe Is Firing All 167 Employees At Its Warehouse After Years Of Legal Drama October 2019 An Ex-LuLaRoe Employee Says In Lawsuit He Was Tormented By His Coworkers With Racist Jokes And Slurs February 2018 Women Say They\u0027re Stuck With $20,000 Of Worthless Clothing In A LuLaRoe \u0022Pyramid Scheme\u0022 October 2017 Women Are Furious Because They Say Their LuLaRoe Leggings Rip Like \u0022Wet Toilet Paper\u0022 April 2017 Follow the podcast @yeettherichpod Follow Emily @thefunnywalsh Follow Danny @dmoss315 Send us a text! Let us know what topics you want us to cover! Send us a text! Let us know what topics you want us to cover!",
      "release": "2025-01-07T07:00:00Z",
      "duration": "01:13:52.8480000",
      "explicit": false,
      "spotifyId": "6MNU8HaOMdIGA6POZTjgkX",
      "appleId": 1000682980204,
      "subjects": [
        "LuLaRoe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6MNU8HaOMdIGA6POZTjgkX",
        "apple": "https://podcasts.apple.com/podcast/lularoe-part-one-if-not-pyramid-why-pyramid-shaped/id1684853359?i=1000682980204"
      }
    },
    {
      "id": "f899b1d1-aedf-4606-b6ba-9f5d4e90a165",
      "title": "Couple To Throuple- Part Two of the Oneida Community",
      "description": "This week we really get into life on the commune with John Humphrey and his followers at the Oneida Community. The comune is growing. They are Industrializing and the sex stuff gets even weirder. Also Emily gives you her simple step by step plan on how to create a cult...but dont create a cult please! Sources: “Oneida: From Free Love Utopia to the Well Set Table\u0022 by Ellen Wayland Smith(2016) The Days of My Youth: A Childhood Memoir of life in the Oneida CommunityBy CorinaAckley Noyes(2015) Follow the podcast @yeettherichpod Follow Emily @thefunnywalsh Follow Danny @dmoss315",
      "release": "2024-03-05T09:00:00Z",
      "duration": "00:52:07.4840000",
      "explicit": false,
      "spotifyId": "27Yiu3qKQulkgMpMTD28Yl",
      "appleId": 1000648050716,
      "subjects": [
        "Oneida Community"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/27Yiu3qKQulkgMpMTD28Yl",
        "apple": "https://podcasts.apple.com/podcast/couple-to-throuple-part-two-of-the-oneida-community/id1684853359?i=1000648050716"
      }
    },
    {
      "id": "8859ac82-6750-4b17-9e96-96190c41cd70",
      "title": "Silverware Sex Cult- Part One of the Oneida Community",
      "description": "This week we begin discussing the fascinating Oneida Community.Oneida Community Limited becomes one of the largest silverware manufacturers in the United States. But this episode we discuss its humble beginnings as an 1800s communist sex cult in upstate New York! Sources: “Oneida: From Free Love Utopia to the Well Set Table\u0022 by Ellen Wayland Smith(2016) The Days of My Youth: A Childhood Memoir of life in the Oneida CommunityBy CorinaAckley Noyes(2015) Follow the podcast @yeettherichpod Follow Emily @thefunnywalsh Follow Danny @dmoss315",
      "release": "2024-02-27T09:00:00Z",
      "duration": "00:56:50.4420000",
      "explicit": false,
      "spotifyId": "1IDNNNXI6SriTA023BEgPg",
      "appleId": 1000647204484,
      "subjects": [
        "Oneida Community"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IDNNNXI6SriTA023BEgPg",
        "apple": "https://podcasts.apple.com/podcast/silverware-sex-cult-part-one-of-the-oneida-community/id1684853359?i=1000647204484"
      }
    }
  ]
}