{
  "id": "ab35b8d2-840d-479a-89f9-5379de0b5e56",
  "name": "Yelloux Cove",
  "youTubeChannelId": "UCqxy6NWZyK4Qn4Na_0KrgrQ",
  "episodes": [
    {
      "id": "3205b09f-7dd4-4db7-a8be-90521dc4a5a6",
      "title": "J6 MAGA Rioter REJECTS Trump’s Pardon: “I Was in a Cult. I Was a Volunteer, Not a Victim” 🔥",
      "description": "✊🏾 Pam Hemphill JAN 6 RIOTER REFUSES TRUMP\u0027S PARDON\u0022I was a volunteer, not a victim.\u0022 — Pam Hemphill, a convicted Jan. 6 participant, speaks out on national TV and calls out the LIES behind Trump’s insurrection. In a stunning reversal, she rejects his pardon and exposes how MAGA operates like a political cult. This clip includes powerful segments from both CNN and MSNBC, showing Pam confronting the reality of her actions, holding herself accountable, and warning the country about the violent, radicalized base Trump continues to enable.🔥 140\u002B officers were assaulted.🔥 Over 1,500 people were pardoned.🔥 Trump is trying to rewrite history.🎙️ Featuring:• Pam Hemphill• CNN \u0026 MSNBC anchors (full interviews)• Captions \u002B commentary for context✊🏾 THIS is what accountability looks like.👇🏾 Comment below: Do YOU believe more former Trump supporters will start telling the truth — or are they still too deep in the cult?\n\nCREDITS: This video contains excerpts from CNN and MSNBC interviews under Fair Use. All rights belong to their respective creators. Commentary, captions, and edits have been added for educational and journalistic purposes.\n@katiephangnews\n\n\nFAIR USE NOTICE: This content is provided for educational, commentary, and news analysis purposes under Section 107 of the Copyright Act of 1976. Fair use allows limited use of copyrighted material without permission from the rights holders\n\n💵 Support This ChannelCashApp ➤ $YellouxCove\n#jan6insurrection    \n #TrumpPardon #PamHemphill #Insurrection #CapitolRiot #magagranny  #PoliticalAccountability #MSNBC #CNN #volunteers  #Gaslighting #FairUse #trumplegacy  #civilrights  #rejection #politicalcommentary#ExMAGA #J6 #domesticterrorist",
      "release": "2025-06-08T21:08:45Z",
      "duration": "00:14:57",
      "explicit": false,
      "youTubeId": "8L07OcVR_Kg",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8L07OcVR_Kg"
      }
    }
  ]
}