{
  "_ts": 0,
  "id": "ffa3043f-f685-4b42-9d6a-f2fd3250e8b4",
  "name": "Yolanda Brooks",
  "youTubeChannelId": "UCEhERBZFvya4VGVRNJaGRrw",
  "episodes": [
    {
      "id": "d2f9fea0-b39b-4083-b87f-57bb945937d9",
      "title": "I escaped a cult at 14 years old...",
      "description": "Hey Guys!! This is my raw and almost unedited video of me leaving the Mormon church and also escaping my physically and mentally abusive home. I want to thank my friends, mentors, God mother, coach, friend\u0027s parents, and my sister Kaeleigh for always being there for me because truly, I would have never made it this far without them all. Above all, I want to give the glory to God for allowing me to have a platform and use my story to bring others unto him. I want to live my life more intentionally especially since most of my childhood was taken from me. I choose to forgive the same way Jesus has forgiven me of my sins. It is important to love on the ones who are far from him because we can show them the true love of Christ through us.\n\nHere is my link to my Go Fund Me site: https://gofund.me/d6ed2913 \nif you are interested in helping to fund for my college and other life expenses. Anything helps and if you are unable to, just watching and sharing this meant a lot to me:)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTags:\n\nmormon church,mormon,lds church,mormons,mormon stories,church,leaving mormon church,mormon church explained,book of mormon,why i left the mormon church,mormon church documentary,the church of jesus christ of latter-day saints,ex mormon,mormon lds,exmormon,mormon tithing,the time when a christian went to a mormon church.,mormon culture,what do mormons believe,3 mormons,anti mormon,fair mormon,true church,mormon conversion,the mormons",
      "release": "2024-11-03T23:02:18Z",
      "duration": "00:52:10",
      "explicit": false,
      "youTubeId": "PPRG66CIPCk",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PPRG66CIPCk"
      }
    }
  ]
}