{
  "_ts": 0,
  "id": "cd57a8f3-dbb2-4b3b-a479-ab1c363e3122",
  "name": "You Must Be Some Kind of Therapist",
  "spotifyId": "3g73xg37dTN3OqnnQBZYiV",
  "appleId": 1612777134,
  "youTubeChannelId": "UCgj5mELe7dL_v-QbyoN6lwg",
  "episodes": [
    {
      "id": "5e7dd166-8940-4c37-a8e6-9da47e884b20",
      "title": "96. From Cult to Gender Clinic: Misdiagnosis, Detransition \u0026 Healing — Layton, part 2",
      "description": "In part two of my conversation with Layton, she continues to share her journey of navigating the trauma of leaving a cult, bad therapy, the harmful effects of the trans medical industrial complex, and how she finally found wholeness. Missed part 1? Listen to episode 95 here. Layton opens up about her experience of undergoing synthetic testosterone as a female and the traumatic impact it had on her body and mind. We delve into the dangerous territory of misdiagnosis and the lack of consideration for her PTSD, dissociation, and other comorbidities by therapists and gender clinics. Layton shares her frustration at not being given the opportunity to explore healing from her trauma before being pushed towards medical gender transition. As the conversation unfolds, we explore the boundaries crossed by Layton\u0027s therapist and the power dynamics at play. How did her therapist so egregiously overlook her real needs? What countertransference issues on the part of the therapist might have contributed to this massive ethical breach? We touch on the sadistic element that may have influenced her therapist\u0027s actions and the flattery used to manipulate and groom Layton. We also discuss the importance of ethical boundaries in therapy and the potential harm caused by therapists who fail to manage their countertransference. Layton shares her journey of self-discovery and the pivotal moment when she started to question her decision to transition. Through somatic therapy, nervous system regulation, and healing her PTSD, she began to reconnect with her body and realized that she didn\u0027t have gender dysphoria. We explore the process of reconciling with her womanhood and the challenges she faced in finding her true identity. Layton is an Anthroposophical artist, Somatic practitioner, YouTuber, and detransitioner. Having left a religious cult, and then the social cult that is Gender Ideology, she is passionate about educating others about mental health, healing and spirituality in a way that heavily emphasizes self-trust and personal autonomy. While she doesn\u0027t consider herself to be an activist, she is vocal in regards to the medicalisation of children and vulnerable adults under the guise of \u0022Gender Affirming Care.” Visit her website at PsychicSomatic.com X: @origina1ange1 Psychic Somatic YouTube Channel 00:00 Start [00:00:00] Trauma of synthetic testosterone. [00:07:36] The dangers of misinformed therapy. [00:10:16] Comorbidities and transitioning. [00:12:28] Medical prioritization and mental health. [00:16:41] Dissociation and identity building. [00:22:16] Sadistic elements in therapy. [00:25:12] Therapist-client boundaries and detransitioners. [00:29:36] Projection and vulnerability in therapy. [00:36:28] Lack of boundaries. [00:39:37] Faux sense of connection. [00:43:41] Detransitioning and self-discovery. [00:48:09] Identity and self-discovery. [00:52:13] Dissociation and Fragmentation. [00:56:36] Nervous system self-care. [01:02:31] Self-discovery and inner healing. [01:06:06] Histamine intolerance and allergies. [01:10:03] Anaphylactic symptoms and restrictions. [01:14:07] Hormonal effects of testosterone. [01:18:43] Unconditional love and boundaries. [01:22:06] Generational longing for unconditional love. [01:25:33] Esoteric Christianity and Anthroposophy. [01:30:10] Trauma and medical mistreatment. [01:35:11] Admitting mistakes and ego death. [01:40:11] Craving stability in your 30s. [01:44:09] Join my community. To support this show, please leave a rating \u0026 review on Apple , Spotify , or wherever you get your podcasts . Subscribe, like, comment \u0026 share via my YouTube channel . Or recommend this to a friend! Learn more about Do No Harm. Take $200 off your EightSleep Pod Pro Cover with code SOMETHERAPIST at EightSleep.com . Take 20% off all superfood beverages with code SOMETHERAPIST at Organifi. Check out my shop for book recommendations \u0026#43; wellness products . Show notes \u0026 transcript provided with the help of SwellAI . Special thanks to Joey Pecoraro for our theme song, “Half Awake,” used with gratitude and permission. Watch NO WAY BACK: The Reality of Gender-Affirming Care (our medical ethics documentary, formerly known as Affirmation Generation). Stream the film or purchase a DVD. Use code SOMETHERAPIST to take 20% off your order. Follow us on X @2022affirmation or Instagram at @affirmationgeneration . Have a question for me? Looking to go deeper and discuss these ideas with other listeners? Join my Locals community! Members get to ask questions I will respond to in exclusive, members-only livestreams, post questions for upcoming guests to answer, plus other perks TBD. ★ Support this podcast on Patreon ★",
      "release": "2024-02-12T09:00:00Z",
      "duration": "01:45:11.6400000",
      "explicit": false,
      "spotifyId": "4rVHgJQCp3IaomWuxRYZEe",
      "appleId": 1000645013362,
      "youTubeId": "6BuAxWmzG5Y",
      "subjects": [
        "International House of Prayer Kansas City",
        "Bethel Church (Redding CA)",
        "Troubled Teen Industry",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4rVHgJQCp3IaomWuxRYZEe",
        "apple": "https://podcasts.apple.com/podcast/96-from-cult-to-gender-clinic-misdiagnosis-detransition/id1612777134?i=1000645013362",
        "youtube": "https://www.youtube.com/watch?v=6BuAxWmzG5Y"
      }
    },
    {
      "id": "b090fccd-e908-4c32-8211-92f71ad1e89f",
      "title": "95. Transing the Gay Away? Cults, Actual Conversion Therapy, \u0026 Dissociation: part 1 with Layton",
      "description": "Today I’m excited to bring you part 1 of a fascinating conversation with Layton, a detransitioner who shares her journey of leaving a religious cult and the subsequent challenges she faced. We delve into her experiences with actual gay conversion therapy, where she was told that her homosexuality was a form of cannibalism and a result of trauma. Layton opens up about the psychological manipulation and shame she endured during this time, and how it laid the groundwork for dissociation and vulnerability to further exploitation.We also explore the aftermath of leaving the cult and the difficulties Layton faced as she tried to navigate the outside world. She shares her struggles with trust, identity, and finding a sense of safety. We discuss the impact of her traumatic experiences on her mental health and how an earnest search for psychological help led her to end up pushed down the trans rabbit hole by an unscrupulous therapist who Layton has now filed a lawsuit against.This is part 1 of a two-part conversation; be on the lookout for part 2 next week!Layton is an Anthroposophical artist, Somatic practitioner, YouTuber, and detransitioner. Having left a religious cult, and then the social cult that is Gender Ideology, she is passionate about educating others about mental health, healing and spirituality in a way that heavily emphasizes self-trust and personal autonomy. While she doesn\u0027t consider herself to be an activist, she is vocal in regards to the medicalisation of children and vulnerable adults under the guise of \u0022Gender Affirming Care.”Visit her website at PsychicSomatic.comX: @origina1ange1Psychic Somatic YouTube Channel00:00 Start[00:02:21] Gender-affirming care and malpractice.[00:06:08] Conversion therapy experiences.[00:10:46] Gay conversion therapy experience.[00:13:40] Trauma and Homosexuality.[00:19:08] Harmful treatment of lesbian identity.[00:22:42] Bizarre restrictions on personal relationships.[00:27:07-00:27:17] Learning about heterosexual relationships.[00:30:31] Affiliated cults and experiences.[00:36:45] Religious abuse and hypnosis.[00:39:18] Traumatic experiences in cult.[00:43:31] Forming a secret connection.[00:48:52] Leaving a high control environment.[00:52:02] Leaving one abusive relationship.[00:57:51] Feeling like a trans woman.[00:59:20] Dissociation and therapist\u0027s diagnosis.[01:06:09] Therapist\u0027s grandiosity and ego.[01:08:42] Dissociation and gender identity.[01:11:57] Podcast promotion and engagement. To support this show, please leave a rating \u0026 review on Apple, Spotify, or wherever you get your podcasts. Subscribe, like, comment \u0026 share via my YouTube channel. Or recommend this to a friend!Learn more about Do No Harm.Take $200 off your EightSleep Pod Pro Cover with code SOMETHERAPIST at EightSleep.com.Take 20% off all superfood beverages with code SOMETHERAPIST at Organifi.Check out my shop for book recommendations \u002B wellness products.Show notes \u0026 transcript provided with the help of SwellAI.Special thanks to Joey Pecoraro for our theme song, “Half Awake,” used with gratitude and permission.Watch NO WAY BACK: The Reality of Gender-Affirming Care (our medical ethics documentary, formerly known as Affirmation Generation). Stream the film or purchase a DVD. Use code SOMETHERAPIST to take 20% off your order. Follow us on X @2022affirmation or Instagram at @affirmationgeneration.Have a question for me? Looking to go deeper and discuss these ideas with other listeners? Join my Locals community! Members get to ask questions I will respond to in exclusive, members-only livestreams, post questions for upcoming guests to answer, plus other perks TBD.    ★ Support this podcast on Patreon ★ ",
      "release": "2024-02-05T09:00:00Z",
      "duration": "01:12:38.0630000",
      "explicit": false,
      "spotifyId": "6Y62iK50NtAcGXqq9nIY1J",
      "appleId": 1000644186221,
      "youTubeId": "9CzonMkcmpU",
      "subjects": [
        "International House of Prayer Kansas City",
        "Bethel Church (Redding CA)",
        "Troubled Teen Industry",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Y62iK50NtAcGXqq9nIY1J",
        "apple": "https://podcasts.apple.com/podcast/95-transing-the-gay-away-cults-actual-conversion/id1612777134?i=1000644186221",
        "youtube": "https://www.youtube.com/watch?v=9CzonMkcmpU"
      }
    }
  ]
}