{
  "id": "033531bc-0f62-4193-85d7-f74832a70c3f",
  "name": "You Can’t Make This Up",
  "spotifyId": "3hDsTlBt1o1qIizN8phRzO",
  "appleId": 1375339408,
  "episodes": [
    {
      "id": "78f56e63-b42d-4224-a86f-51db97c1c08d",
      "title": "The Program: Cons, Cults and Kidnapping",
      "description": "Like hundreds before her, Katherine Daniel was sent by her parents to a school for troubled teens. The Academy at Ivy Ridge claimed to use therapy and recreational activities to help its students. Instead, teens suffered mental and physical abuse in a program that operated like a cult. Years later, Katherine and her former classmates rummaged through the files and videotapes left behind in the abandoned school. Their goal was to come to terms with what happened to them within its walls and hold those responsible to account. The Netflix documentary series The Program: Cons, Cults and Kidnapping is a gripping look at the so-called Troubled Teen Industry by those traumatized from its practices. It also explores the company whose business model is to keep parents paying huge fees while their children suffer horrors at the hands of their schools’ staff. In this episode of You Can\u0027t Make This Up, host Rebecca Lavoie interviews Director Katherine Kubler. SPOILER ALERT! If you haven\u0027t watched The Program: Cons, Cults and Kidnapping yet, make sure to add it to your watch-list before listening on. Listen to more from Netflix Podcasts .",
      "release": "2024-03-06T10:00:00Z",
      "duration": "00:36:39.0920000",
      "explicit": false,
      "spotifyId": "5fkdgrlHHYr8k464agAbdW",
      "appleId": 1000648186229,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5fkdgrlHHYr8k464agAbdW",
        "apple": "https://podcasts.apple.com/podcast/the-program-cons-cults-and-kidnapping/id1375339408?i=1000648186229"
      }
    },
    {
      "id": "f229651d-583d-4668-a33d-68f8c4f8e7e7",
      "title": "Escaping Twin Flames",
      "description": "With its expensive online courses, Twin Flames Universe promised members would find their true loves. The online cult was better at making money than finding love, so leaders Jeff and Shaleia Ayons began matchmaking its followers with one another. Though many had identified as straight and cis, they were paired with same sex partners and prodded to rethink their gender identity. The Netflix documentary series Escaping Twin Flames examines the controversial online community, brings us into Jeff and Sheleia’s online classroom, and tells the stories of those hurt by its teachings. The series asks whether anything can actually be done to stop it from taking advantage of people who are only looking for love. Host Rebecca Lavoie interviews filmmakers Cecilia Peck and Inbal Lessner. SPOILER ALERT! If you haven\u0027t watched Escaping Twin Flames yet, make sure to add it to your watch-list before listening on. Listen to more from Netflix Podcasts .",
      "release": "2023-11-15T10:00:00Z",
      "duration": "00:39:30.4810000",
      "explicit": false,
      "spotifyId": "3R0AwdJPe7TsRJMLHGkR8r",
      "appleId": 1000634888493,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3R0AwdJPe7TsRJMLHGkR8r",
        "apple": "https://podcasts.apple.com/podcast/escaping-twin-flames/id1375339408?i=1000634888493"
      }
    },
    {
      "id": "c62bdf79-7392-4460-9ff8-f9487b05158d",
      "title": "Waco: American Apocalypse, Part 4",
      "description": "The tragedy at Waco became a rallying cry for the anti-government movement within America and the foundation for arguments surrounding gun rights and religious freedom. In this final episode of the Waco companion podcast, Tiller speaks again with Lee Hancock and then with Bob Ricks, the FBI’s Assistant Special Agent in Charge, about the FBI’s failed response to Waco, rampant conspiracy theories, government distrust, Waco’s connection to the Oklahoma City Bombing a year later, and how the events of 30 years ago resonates through to the present day. Waco: American Apocalypse is streaming now on Netflix.",
      "release": "2023-03-29T09:00:00Z",
      "duration": "00:26:20.7210000",
      "explicit": false,
      "spotifyId": "7sIluOGp63FSLBgQ6g2qMa",
      "appleId": 1000606430179,
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7sIluOGp63FSLBgQ6g2qMa",
        "apple": "https://podcasts.apple.com/podcast/waco-american-apocalypse-part-4/id1375339408?i=1000606430179"
      }
    },
    {
      "id": "26fc7c54-bc79-4038-8952-2cee2aef54f1",
      "title": "Keep Sweet: Pray and Obey",
      "description": "In this episode of You Can\u0027t Make This Up, we are talking about the Netflix documentary series \u0022Keep Sweet: Pray and Obey\u0022 out now on Netflix. Host Rebecca Lavoie interviews director Rachel Dretzin. Through personal accounts, \u0022Keep Sweet\u0022 reveals the incredible events leading to the 2011 life sentence of Warren Jeffs, the self-professed prophet of The Fundamentalist Church of Jesus Christ of Latter-Day Saints. In a dramatic raid at the Yearning for Zion Ranch, which generated headlines around the world, law enforcement and Child Protective Service agents uncovered stunning evidence of systemic sexual, physical and psychological abuse. SPOILER ALERT! If you haven\u0027t watched \u0022Keep Sweet: Pray and Obey\u0022 yet, make sure to add it to your watch-list before listening on.",
      "release": "2022-06-15T09:00:00Z",
      "duration": "00:30:41.8670000",
      "explicit": false,
      "spotifyId": "6KA1Q9WkRZfUtO2yAL1Kg3",
      "appleId": 1000566488061,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KA1Q9WkRZfUtO2yAL1Kg3",
        "apple": "https://podcasts.apple.com/podcast/keep-sweet-pray-and-obey/id1375339408?i=1000566488061"
      }
    },
    {
      "id": "1ad4b4e2-f1b0-4cd0-9a67-e5eac0535a3c",
      "title": "Bad Vegan: Fame. Fraud. Fugitives. by Swindled",
      "description": "Today we\u0027re talking about \u0022Bad Vegan: Fame. Fraud. Fugitives.\u0022 which is the latest documentary series on Netflix, directed by Chris Smith. Bad Vegan is about a wild four-part documentary series that explores how Sarma Melngailis, the celebrity restaurateur behind the glittering New York hotspot Pure Food and Wine, went from being the queen of vegan cuisine to being known as the “Vegan Fugitive.” Shortly after meeting a man named Shane Fox on Twitter in 2011, Melngailis begins draining her restaurant’s funds and funneling the money to Fox, after he cons her into believing he could make her dreams a reality... but only if she continues to obey his every request without question. Bad Vegan: Fame. Fraud. Fugitives. takes viewers on a journey more bizarre than fiction. Today we\u0027re turning over this episode to our friends at Swindled, a true-crime podcast about white-collar criminals, con artists, and corporate evil. In this episode, we\u0027ll dive even deeper into the story of Sarma Melngailis, Shane Fox, and the scandal that took down a burgeoning vegan empire.",
      "release": "2022-03-23T11:00:00Z",
      "duration": "00:47:26.7200000",
      "explicit": false,
      "spotifyId": "0cuQZPGpjkDt61km8x1jYl",
      "appleId": 1000554970354,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0cuQZPGpjkDt61km8x1jYl",
        "apple": "https://podcasts.apple.com/podcast/bad-vegan-fame-fraud-fugitives-by-swindled/id1375339408?i=1000554970354"
      }
    },
    {
      "id": "1c6ce235-2264-4533-90f7-72e3ebb4256d",
      "title": "Pray Away",
      "description": "Ex-leaders and a survivor of the so-called \u0022conversion therapy\u0022 movement speak out about its harm to the LGBTQ\u0026#43; community and its devastating persistence. In this episode, Rebecca Lavoie speaks with Director Kristine Stolakis and producer Jessica Devaney about the Netflix documentary film \u0022Pray Away.\u0022 This episode contains spoilers so make sure to watch all of \u0022Pray Away\u0022 before listening on.",
      "release": "2021-08-24T08:00:00Z",
      "duration": "00:36:54.2430000",
      "explicit": false,
      "spotifyId": "4yyotYhth5UlTXkgky06gv",
      "appleId": 1000532950756,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4yyotYhth5UlTXkgky06gv",
        "apple": "https://podcasts.apple.com/podcast/pray-away/id1375339408?i=1000532950756"
      }
    },
    {
      "id": "a960e1e2-e80c-461d-8a3e-927e11e1c3e0",
      "title": "Bikram: Yogi, Guru, Predator",
      "description": "This month, we have a documentary film following Bikram Choudhury, the man who popularized yoga in America. Returning hosts Kevin Flynn and Rebecca Lavoie speak with director Eva Orner and lawyer Micki Jafa-Bodden about the rise and fall of a yoga guru who preyed on the very women who trusted him.",
      "release": "2019-11-20T09:00:00Z",
      "duration": "00:28:24.9860000",
      "explicit": false,
      "spotifyId": "4OorZpIbOZjdQal6zoJcVK",
      "appleId": 1000457474268,
      "subjects": [
        "Bikram Yoga"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4OorZpIbOZjdQal6zoJcVK",
        "apple": "https://podcasts.apple.com/podcast/bikram-yogi-guru-predator/id1375339408?i=1000457474268"
      }
    },
    {
      "id": "a2663f40-65b2-41e7-8393-08b2734e36e4",
      "title": "Wild Wild Country",
      "description": "Wild Wild Country directors Chapman and Maclain Way sit down with Lindsey Weber, co-host of the podcast Who? Weekly, for an in depth conversation about the series. They talk about constructing the narrative, visiting Antelope now, what it was like interviewing Ma Anand Sheela, and so much more.",
      "release": "2018-05-02T10:00:00Z",
      "duration": "00:42:40.3130000",
      "explicit": false,
      "spotifyId": "5GxIou0J0EfH2Pf7g65mgA",
      "appleId": 1000410467160,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GxIou0J0EfH2Pf7g65mgA",
        "apple": "https://podcasts.apple.com/podcast/wild-wild-country/id1375339408?i=1000410467160"
      }
    }
  ]
}