{
  "_ts": 0,
  "id": "cd57a8f3-dbb2-4b3b-a479-ab1c363e3122",
  "name": "You Must Be Some Kind of Therapist",
  "spotifyId": "3g73xg37dTN3OqnnQBZYiV",
  "appleId": 1612777134,
  "youTubeChannelId": "UCgj5mELe7dL_v-QbyoN6lwg",
  "episodes": [
    {
      "id": "b090fccd-e908-4c32-8211-92f71ad1e89f",
      "title": "95. Transing the Gay Away? Cults, Actual Conversion Therapy, \u0026 Dissociation: part 1 with Layton",
      "description": "Today I’m excited to bring you part 1 of a fascinating conversation with Layton, a detransitioner who shares her journey of leaving a religious cult and the subsequent challenges she faced. We delve into her experiences with actual gay conversion therapy, where she was told that her homosexuality was a form of cannibalism and a result of trauma. Layton opens up about the psychological manipulation and shame she endured during this time, and how it laid the groundwork for dissociation and vulnerability to further exploitation.We also explore the aftermath of leaving the cult and the difficulties Layton faced as she tried to navigate the outside world. She shares her struggles with trust, identity, and finding a sense of safety. We discuss the impact of her traumatic experiences on her mental health and how an earnest search for psychological help led her to end up pushed down the trans rabbit hole by an unscrupulous therapist who Layton has now filed a lawsuit against.This is part 1 of a two-part conversation; be on the lookout for part 2 next week!Layton is an Anthroposophical artist, Somatic practitioner, YouTuber, and detransitioner. Having left a religious cult, and then the social cult that is Gender Ideology, she is passionate about educating others about mental health, healing and spirituality in a way that heavily emphasizes self-trust and personal autonomy. While she doesn\u0027t consider herself to be an activist, she is vocal in regards to the medicalisation of children and vulnerable adults under the guise of \u0022Gender Affirming Care.”Visit her website at PsychicSomatic.comX: @origina1ange1Psychic Somatic YouTube Channel00:00 Start[00:02:21] Gender-affirming care and malpractice.[00:06:08] Conversion therapy experiences.[00:10:46] Gay conversion therapy experience.[00:13:40] Trauma and Homosexuality.[00:19:08] Harmful treatment of lesbian identity.[00:22:42] Bizarre restrictions on personal relationships.[00:27:07-00:27:17] Learning about heterosexual relationships.[00:30:31] Affiliated cults and experiences.[00:36:45] Religious abuse and hypnosis.[00:39:18] Traumatic experiences in cult.[00:43:31] Forming a secret connection.[00:48:52] Leaving a high control environment.[00:52:02] Leaving one abusive relationship.[00:57:51] Feeling like a trans woman.[00:59:20] Dissociation and therapist\u0027s diagnosis.[01:06:09] Therapist\u0027s grandiosity and ego.[01:08:42] Dissociation and gender identity.[01:11:57] Podcast promotion and engagement. To support this show, please leave a rating \u0026 review on Apple, Spotify, or wherever you get your podcasts. Subscribe, like, comment \u0026 share via my YouTube channel. Or recommend this to a friend!Learn more about Do No Harm.Take $200 off your EightSleep Pod Pro Cover with code SOMETHERAPIST at EightSleep.com.Take 20% off all superfood beverages with code SOMETHERAPIST at Organifi.Check out my shop for book recommendations \u002B wellness products.Show notes \u0026 transcript provided with the help of SwellAI.Special thanks to Joey Pecoraro for our theme song, “Half Awake,” used with gratitude and permission.Watch NO WAY BACK: The Reality of Gender-Affirming Care (our medical ethics documentary, formerly known as Affirmation Generation). Stream the film or purchase a DVD. Use code SOMETHERAPIST to take 20% off your order. Follow us on X @2022affirmation or Instagram at @affirmationgeneration.Have a question for me? Looking to go deeper and discuss these ideas with other listeners? Join my Locals community! Members get to ask questions I will respond to in exclusive, members-only livestreams, post questions for upcoming guests to answer, plus other perks TBD.    ★ Support this podcast on Patreon ★ ",
      "release": "2024-02-05T09:00:00Z",
      "duration": "01:12:38.0630000",
      "explicit": false,
      "spotifyId": "6Y62iK50NtAcGXqq9nIY1J",
      "appleId": 1000644186221,
      "youTubeId": "9CzonMkcmpU",
      "subjects": [
        "International House of Prayer Kansas City",
        "Bethel Church (Redding CA)",
        "Troubled Teen Industry",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Y62iK50NtAcGXqq9nIY1J",
        "apple": "https://podcasts.apple.com/podcast/95-transing-the-gay-away-cults-actual-conversion/id1612777134?i=1000644186221",
        "youtube": "https://www.youtube.com/watch?v=9CzonMkcmpU"
      }
    }
  ]
}