{
  "_ts": 0,
  "id": "1d1e582d-0cbe-459a-b426-7ae5aff5bc7c",
  "name": "Your Ink Story",
  "spotifyId": "5QglnFOXwRs9CBV5OH6dxB",
  "appleId": 1701112604,
  "episodes": [
    {
      "id": "09943709-3a98-4783-907e-485ba8e6069a",
      "title": "A Powerful Path to Recovery from a Cult, Mafia Hit and Cancer",
      "description": "Greetings Inklings! Welcome to Your Ink Story Podcast, where personal sagas come alive through the power of storytelling. On this episode we dive into an extraordinary journey of resilience and transformation. Our remarkable guest, Kendra Petty, has withstood the kind of hardships most people can\u0027t even imagine. From surviving a mafia hit and escaping the clutches of an abusive cult to the harrowing battles with breast cancer and mental illness within her family, Kendra\u0027s life reads like a page-turning thriller. Yet, here she stands, not just a survivor, but a beacon of hope and powerful healing that will leave you feeling inkspired. Kendra turned her pain into purpose, penning her tribulations and triumphs with the aid of a ghostwriter, into a page-turning memoir called \u0022I Can\u0027t Believe I\u0027m Not Dead.\u0022 You’ll hear how Kendra excised the negativity from her life, and curated joy and gratitude with purposeful intention. This includes the story behind her evocative \u0022lucky\u0022 tattoo, a symbol etched on her palm that serves as a powerful daily reminder to shift her pathways away from trauma and towards the power of gratitude. Tune into hear this profound conversation, and let\u0027s honor the strength it takes to turn tragedy into triumph, and the courage it takes to rewrite one\u0027s life journey. Can\u0027t get enough of Kendra’s story? Dive deeper through her book, \u0022I Can\u0027t Believe I\u0027m Not Dead,\u0022 and engage with the awe*mazing stories she shares and the wonderful wisdom from her healing journey. Visit https://amzn.to/48fnzM8 to get your copy. If you\u0027re not already subscribed to our podcast, do so now to get uplifting and transformative stories delivered right to your ears. \u0026#x1f3a7; Tap this link to learn more about Kendra, and hop on over to Your Ink Story’s Instagram feed to watch the video reel showcasing Kendra’s INKspirational Lucky tattoo. Shoutout to Orlando Quintanilla @orlando_sdtlv at @skindesigntattoos for Kendra’s powerful palm tattoo! Please rate and review this podcast wherever you are tuning in, and if this episode inspired you, please share it, so we can bring more people together, inspire connection, and ignite conversations that go beyond the surface. If you or someone you know has an ink story to share on the podcast, please send me an email: ande at yourinkstory.com. You can also share your thoughts and INKspirations from these conversations in the comment threads wherever you’re tuning in … or over on Instagram @tellmeyourinkstory. Waving from Boston and wishing you an INKspirational day, everywhere you glow – cheers! Ande ♥ Connect with Your Ink Story and Ande on Social Media: Instagram: Your Ink Story and Ande Lyons TikTok: Your Ink Story and Ande Lyons Facebook: Your Ink Story and Ande Lyons Threads: Your Ink Story and Ande Lyons LinkedIn: Your Ink Story and Ande Lyons Subscribe to Your Ink Story\u0027s Substack here",
      "release": "2024-01-02T19:00:00Z",
      "duration": "00:32:20.2970000",
      "explicit": false,
      "spotifyId": "0raKyBhw4pZ0ZrIKMsAYm7",
      "appleId": 1000640352176,
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0raKyBhw4pZ0ZrIKMsAYm7",
        "apple": "https://podcasts.apple.com/podcast/a-powerful-path-to-recovery-from-a-cult-mafia-hit-and-cancer/id1701112604?i=1000640352176"
      }
    }
  ]
}