{
  "id": "0b3e9395-f2a4-412e-9a64-f8b13e656d9b",
  "name": "Your Undivided Attention",
  "spotifyId": "4KI3PtZaWJbAWK89vgttoU",
  "appleId": 1460030305,
  "episodes": [
    {
      "id": "25519179-6a66-4150-9159-f9aefd7181e5",
      "title": "How To Free Our Minds — with Cult Deprogramming Expert Dr. Steven Hassan",
      "description": "How would you know if you were in a cult? If not a cult, then at least under undue influence? The truth is: we\u0027re all under some form of undue influence. The question is: to what degree and to what extent we’re aware of this influence — which is exacerbated by social media. In an era of likes, followers, and echo chambers, how can we become aware of undue influence and gain sovereignty over our minds? Our guest this week is Dr. Steven Hassan, an expert on undue influence, brainwashing, and unethical hypnosis. He’s the founder of the Freedom of Mind Resource Center — a coaching, consulting, and training organization dedicated to helping people freely consider how they want to live their lives. Dr. Hassan was himself a member of a cult: the Unification Church (also known as the Moonies), which was developed in Korea in the 1950\u0027s. Since leaving the Moonies, Dr. Hassan has helped thousands of individuals and families recover from undue influence. RECOMMENDED MEDIA Freedom of Mind website: The website for Dr. Hassan’s Freedom of Mind Resource Center, which includes resources such as his Influence Continuum , BITE model of authoritarian control, and Strategic Interactive Approach for alleviating people of undue influence The Influence Continuum with Dr. Steven Hassan: Dr. Hassan’s podcast exploring how mind-control works, and how to protect yourself from its grips Reckonings: A podcast that told the stories of people who’ve transcended extremism, expanded their worldviews, and made other kinds of transformative change. Start with episode 17 featuring a former paid climate skeptic, or episode 18 featuring the former protégé of Fox News chairman Roger Ailes RECOMMENDED YUA EPISODES Can Your Reality Turn on a Word? Guest: Anthony Jacquin: https://www.humanetech.com/podcast/34-can-your-reality-turn-on-a-word The World According to Q. Guest: Travis View: https://www.humanetech.com/podcast/21-the-world-according-to-q The Cure for Hate. Guest: Tony McAleer: https://www.humanetech.com/podcast/11-the-cure-for-hate Your Undivided Attention is produced by the Center for Humane Technology . Follow us on Twitter: @HumaneTech_",
      "release": "2022-05-05T09:00:00Z",
      "duration": "00:51:28.1430000",
      "explicit": false,
      "spotifyId": "66Ti3v2kH1L7X1YfO0gqr3",
      "appleId": 1000559682409,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/66Ti3v2kH1L7X1YfO0gqr3",
        "apple": "https://podcasts.apple.com/podcast/how-to-free-our-minds-with-cult-deprogramming-expert/id1460030305?i=1000559682409"
      }
    }
  ]
}