{
  "id": "cd8c7b5b-82d9-47a7-a751-3e2f6690c41e",
  "name": "Your Favorite Thing with Wells \u0026 Brandi",
  "spotifyId": "4eP4DEMKMf8nKqFDfricmB",
  "appleId": 1270288526,
  "episodes": [
    {
      "id": "45fadf41-7065-45d4-b283-f8be99597d62",
      "title": "Are the Mormons right?!",
      "description": "Just before hopping on to record today, Brandi’s piggy Puddles crossed the rainbow bridge. Wells proceeds to ask very empathic questions like “do you like bacon?” He then shares that he’s really come to love New York and has figured out a couple things he’d like to share with the class. Your hosts share their fave and least fave things before diving into The Secret Lives of Mormon Wives and all the things that don’t make sense there. They also listen to your voicemails, one of which has them exploring a brand-new cult… Favorite things mentioned: The Great Gatsby (Broadway) Monsters: The Lyle and Eric Menendez Story (Netflix) Rebel Ridge (Netflix) Heavy Heart by Olympic Antitgua Thanks to our awesome sponsors for supporting this episode! HelloFresh: Get 10 FREE meals at HelloFresh.com/freeyft. Applied across 7 boxes, new subscribers only, varies by plan. Schedule35: Get 15% Off with code YFT at Schedule35.co Don’t forget to rate, review, and follow Your Favorite Podcast! Plus, keep up with us between episodes on our Instagram pages, @yftpodcast @wellsadams and @brandicyrus \u0026#43; our TikTok @yftpodcast \u0026 be sure to leave us a voicemail with your fave things at 858-630-1856! This podcast is brought to you by Podcast Nation",
      "release": "2024-10-02T10:00:00Z",
      "duration": "00:57:24.7410000",
      "explicit": false,
      "spotifyId": "5E3fGmsjBcsYt4ELevrg7S",
      "appleId": 1000671538141,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5E3fGmsjBcsYt4ELevrg7S",
        "apple": "https://podcasts.apple.com/podcast/are-the-mormons-right/id1270288526?i=1000671538141"
      }
    }
  ]
}