{
  "id": "630745cc-041a-4c02-8b60-9107c6e8f673",
  "name": "Your Friend, The Therapist",
  "spotifyId": "0kXByhhCd0cv7efP0uu3Z3",
  "appleId": 1703304602,
  "episodes": [
    {
      "id": "3bf35bfd-eaf1-4a58-8b3b-f47f460f6a3e",
      "title": "Narcissism, Gaslighting, and High-Control Groups",
      "description": "Narcissism, Gaslighting, and High-Control Groups Alisa Stamps is a therapist who helps adult children of narcissists, cult abuse and religious trauma survivors, and those struggling with disordered eating and body image overcome their emotional and relational trauma so that they can discover their true authentic selves. She is the author of The Gaslighting Recovery Journal--Prompts and Practices for Healing from Emotional Abuse and host of the podcast, You\u0027re Not the Crazy One!. You can find all the information about Alisa’s book and podcast and information about how to work with her on her website, https://www.alisastamps.com/ . You can also follow along on Instagram at @alisastamps.therapist. Summary In this conversation, Alisa Stamps discusses her personal background and upbringing in a conservative Jewish synagogue. Alisa also explores her fascination with high control groups and cults, particularly in relation to narcissistic family systems. She explains the concept of gaslighting and its use in manipulation and control. Alisa highlights the impact of moral and religious gaslighting and the “never enough” mentality. She discusses the roots of narcissistic behavior and the projection of self-hatred onto others. Finally, Alisa shares her journey from being a music teacher to becoming a therapist and the inspiration behind her podcast, You\u0027re Not the Crazy One!. Your Friend, The Therapist is hosted and produced by Kari Fillian. You can follow the show on Instagram at @yourfriendthetherapistpod . Subscribe to my Substack for more musings: https://yourfriendthetherapist.substack.com/ You can listen to the show on Substack , Spotify \u0026 Apple Podcasts . This is a public episode. If you would like to discuss this with other subscribers or get access to bonus episodes, visit yourfriendthetherapist.substack.com",
      "release": "2024-04-18T04:00:00Z",
      "duration": "00:46:26.5230000",
      "explicit": false,
      "spotifyId": "3y1MQ6hbHsILoXMkFOpy6M",
      "appleId": 1000652813060,
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3y1MQ6hbHsILoXMkFOpy6M",
        "apple": "https://podcasts.apple.com/podcast/narcissism-gaslighting-and-high-control-groups/id1703304602?i=1000652813060"
      }
    }
  ]
}