{
  "id": "71c89cb1-9e46-4693-aed8-b9bc223d2f6d",
  "name": "Your Bish Therapist- Melissa Reich, MA",
  "spotifyId": "1Mf6wqKekNnrAuC3EwzcW4",
  "appleId": 1702959562,
  "youTubeChannelId": "UCu8bmVPTlWANg5v7rGRJjow",
  "episodes": [
    {
      "id": "54b798cb-e45a-4919-b373-7b7ee0b9ebd9",
      "title": "The Cult of the Real Housewives and Viall Files with Caitlin Marshall @bestiesbycaitlin",
      "description": "Caitlin shares her experience with the Tik Tok awards and being featured in the new Mary Cosby Doc. Caitlin discussed the controversy when she and other content creators were involved without knowledge and consent. Melissa and Caitlin discuss Austen Kroll’s recent interview on the Viall Files that went viral for all the wrong reasons. Melissa discusses the importance of focus on mental health over entertainment. TW: Discussion of sibling loss (sending LOVE to the entire sibling loss community) We hope you enjoy the episode. THANK YOU FOR LISTENING and for all the support! Please follow YBT podcast and give a 5-star comment \u0026 rating (it really helps!) Please follow @yourbishtherapist on Instagram, Patreon, YouTube, FB, and TT For full video (ad free, bonus content \u0026 early releases) visit YBT Patreon, Spreaker Supporters Club or YouTube Patreon: https://patreon.com/YourBishTherapist?utm_medium=unknown\u0026utm_source=join_link\u0026utm_campaign=creatorshare_creator\u0026utm_content=copyLink APPLE PODCAST https://apple.co/3Mfskze Spreaker Supporters club: https://www.spreaker.com/podcast/your-bish-therapist--6065109/support YouTube: https://www.youtube.com/channel/UCu8bmVPTlWANg5v7rGRJjow?subconfirmation=1 To find links to all YBT content: https://linktr.ee/yourbishtherapist Brand Ambassador: www.Iamhumanthebrand.com for clothing with a purpose. Code BISH20 for 20% off purchase Disclaimer: Posts are not intended to diagnose, treat or provide medical advice. Your Bish Therapist (YBT) is for entertainment and informational purposes only. The podcast, my opinions, and posts, are my own and are not associated with past or present employers, any organizations, Bravo TV, Grey Heart productions or any other television network. The information in YBT podcast and on its its social media is provided for general informational purposes only and is not intended to diagnose or treat. Please do not act or refrain from acting based on anything you read, see, or hear on YBT, podcast or associated social media. Communicating with YBT via email, and/or social media does not form a therapeutic alliance. Melissa, operator of YBT, is unable to provide any therapeutic advice, treatment or feedback.",
      "release": "2026-01-13T05:00:08Z",
      "duration": "01:04:13.7920000",
      "explicit": false,
      "spotifyId": "5jgX00wZos1rjwzYAasN5X",
      "appleId": 1000744935470,
      "youTubeId": "mKg0yYP3-gI",
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jgX00wZos1rjwzYAasN5X",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-the-real-housewives-and-viall/id1702959562?i=1000744935470",
        "youtube": "https://www.youtube.com/watch?v=mKg0yYP3-gI"
      }
    },
    {
      "id": "dd59a14a-2f53-4f01-984b-03a218139471",
      "title": "Darling, Bish Hour: The Cult of the Real Housewife",
      "description": "Happy New Year! In the first Darling, Bish Hour of 2026 Melissa and Amy delve into the documentary about Mary Cosby, exploring the manipulative tactics used by cults, within Mary’s church, the generational trauma that influences her behavior, and the psychological profile of a would-be cult leader. Newly revealed audio is released, revealing new dimensions to Mary \u0026 Robert Cosby and Faith Temple Pentecostal Church. Melissa and Amy discuss the impact of the Enoch family and Cameron Williams’ story, the financial exploitation within cults, and the isolation tactics used by leaders to maintain control. The conversation raises important questions about accountability and the future of Mary Cosby on reality TV, emphasizing the need for individuals to listen to themselves and seek freedom from manipulative environments. We hope you enjoy the episode. THANK YOU FOR LISTENING and for all the support! Please follow YBT podcast and give a 5-star rating (it really helps!) Please follow @yourbishtherapist on Instagram, Patreon, YouTube, FB, and TT For full video (ad free, bonus content \u0026 early releases) visit YBT Patreon, Spreaker Supporters Club or YouTube Patreon (Ad Free, Bonus Content, Early Release, Full video): https://patreon.com/YourBishTherapist?utm_medium=unknown\u0026utm_source=join_link\u0026utm_campaign=creatorshare_creator\u0026utm_content=copyLink Apple Podcast Subscription (Ad Free, Bonus Content, Early Release) https://apple.co/3Mfskze Spreaker Supporters club: https://www.spreaker.com/podcast/your-bish-therapist--6065109/support YouTube: https://www.youtube.com/channel/UCu8bmVPTlWANg5v7rGRJjow?subconfirmation=1 To find links to all YBT content: https://linktr.ee/yourbishtherapist Brand Ambassador: www.Iamhumanthebrand.com for clothing with a purpose. Code BISH20 for 20% off purchase Disclaimer: Posts are not intended to diagnose, treat or provide medical advice. Your Bish Therapist (YBT) is for entertainment and informational purposes only. The podcast, my opinions, and posts, are my own and are not associated with past or present employers, any organizations, Bravo TV, Grey Heart productions or any other television network. The information in YBT podcast and on its its social media is provided for general informational purposes only and is not intended to diagnose or treat. Please do not act or refrain from acting based on anything you read, see, or hear on YBT, podcast or associated social media. Communicating with YBT via email, and/or social media does not form a therapeutic alliance. Melissa, operator of YBT, is unable to provide any therapeutic advice, treatment or feedback.",
      "release": "2026-01-06T05:00:08Z",
      "duration": "01:12:48.9270000",
      "explicit": false,
      "spotifyId": "6UOnCcn34s9nKXkNWvrDei",
      "appleId": 1000743920355,
      "youTubeId": "TZS-ukwo6Nk",
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6UOnCcn34s9nKXkNWvrDei",
        "apple": "https://podcasts.apple.com/podcast/darling-bish-hour-the-cult-of-the-real-housewife/id1702959562?i=1000743920355",
        "youtube": "https://www.youtube.com/watch?v=TZS-ukwo6Nk"
      }
    },
    {
      "id": "cfecbd93-1c27-472a-9d40-cebd67adb734",
      "title": "Twin Flames Universe: Cult or Spiritual Refuge?",
      "description": "Trigger warning: This episode contains discussion of cults, abuse (religious/spiritual, emotional, verbal and sexual), coercion around sexual orientation and gender identity/expression, discussion of gender dysphoria and trauma. This episode features direct quotes from victims and perpetrators; Listener discretion is advised. In this supersized season finale episode, YBT dives deep into the world of Twin Flames leaders Jeff and Shaleia Ayan. Information shared in the podcast was compiled from two documentaries, a podcast and several news articles. YBT synthesized all this content to bring you a full picture of the Twin Flames Universe. YBT discusses different types of cults, warning signs about whether a group is a cult and provides an extensive explanation of how and why people get sucked into cults. YBT shares FACTS based on research studies, science and psychology. Hosted on Acast. See acast.com/privacy for more information. Become a supporter of this podcast: https://www.spreaker.com/podcast/your-bish-therapist--6065109/support .",
      "release": "2023-11-28T10:30:11Z",
      "duration": "01:59:15.9570000",
      "explicit": false,
      "spotifyId": "7F9KVoueSXpvtuPOYFNM9g",
      "appleId": 1000636763580,
      "youTubeId": "QazzEd2LU_o",
      "subjects": [
        "Twin Flames Universe",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7F9KVoueSXpvtuPOYFNM9g",
        "apple": "https://podcasts.apple.com/podcast/season-finale-twin-flames-universe-cult-or-spiritual/id1702959562?i=1000636763580",
        "youtube": "https://www.youtube.com/watch?v=QazzEd2LU_o"
      }
    }
  ]
}