{
  "id": "fe9d6086-e0ab-4640-9f23-7fdc8f28e58e",
  "name": "ZDFheute Nachrichten",
  "youTubeChannelId": "UCeqKIgPQfNInOswGRWt48kQ",
  "episodes": [
    {
      "id": "c46988d0-d92e-4207-8913-8f410feb6026",
      "title": "Epstein-Files: Macht, Missbrauch \u0026 Geschäfte - so nutzte Epstein seine Kontakte | ZDFheute live",
      "description": "Die Epstein-Files offenbaren immer weitere Teile eines weltumspannenden Netzwerks rund um den amerikanischen Sexualstraftäter Jeffrey Epstein. Er unterhielt teils enge Kontakte zu mächtigen Politikern, Geschäftsleuten und Prominenten.  \n\nJüngste Offenbarungen sorgen derzeit für ein Beben, nicht zuletzt in mehreren, europäischen Königshäusern: So ist in Großbritannien der ehemalige Prinz Andrew Mountbatten-Windsor festgenommen worden und auch die Norwegische Kronprinzessin Mette-Marit steht wegen ihrer Verbindung zu Epstein in der Kritik. \n\nAuch in die Wirtschaftsszene lassen sich Verbindungen nachweisen. Wie ZDFheute live bereits berichtete, pflegte die Deutsche Bank lukrative Geschäftsbeziehungen zu Epstein: https://www.youtube.com/watch?v=3tUATfbpJok \n\nWie funktionierte das Epstein-Netzwerk? Wie viel Einfluss konnte er darüber ausüben? Und wie vernetzt war Epstein in der Welt? Einer Antwort nähert sich Barbara Parente bei ZDFheute live mit der ZDF-London Studioleiterin Hilke Petersen und Nils Metzger vom ZDFheuteCheck-Team. \n\n#Epstein #Andrew #USA \n\n00:00 Darum geht es\n01:28 ZDF-Studioleiterin in London, Hilke Petersen, über die Untersuchungen bei Ex-Prinz Andrew\n07:51 Nils Metzger vom ZDFheuteCheck-Team zu der Epstein-Affäre in Großbritannien\n13:12 Das Epstein-Netzwerk\n18:25 Welche Verbindungen hatte Epstein nach Russland?\n24:53 Dieses Weltbild hatte Epstein\n\n-----\n\nHier auf ZDFheute Nachrichten erfahrt ihr, was auf der Welt passiert und was uns alle etwas angeht: Wir sorgen für Durchblick in der Nachrichtenwelt, erklären die Hintergründe und gehen auf gesellschaftliche Debatten ein. Diskutiert in Livestreams mit uns und bildet euch eure eigene Meinung mit den Fakten, die wir euch präsentieren.\n\nAbonniert unseren Kanal, um nichts mehr zu verpassen.\n\nImmer auf dem aktuellen Stand seid ihr auf http://www.ZDFheute.de/.",
      "release": "2026-02-20T19:00:43Z",
      "duration": "00:27:31",
      "explicit": false,
      "youTubeId": "6ygVGaKx5dA",
      "subjects": [
        "Human Trafficking",
        "_America",
        "_London"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6ygVGaKx5dA"
      }
    },
    {
      "id": "a089911b-53dc-4929-a6c9-71d5357f4192",
      "title": "Podcast: Epstein: Elite ohne Moral? | Lanz \u002B Precht, Folge 233",
      "description": "Die Epstein-Affäre zieht immer größere Kreise. Ex-Prinz Andrew wird von der britischen Polizei verhaftet. Was sagt der Fall Epstein über die Moral in unserer Gesellschaft? Warum scheint Recht und Gesetz nicht für alle zu gelten? \nÜber diese Fragen sprechen Markus Lanz und Richard David Precht in dieser Folge. Erleben wir die \u0022spätrömische Dekadenz\u0022 des 21. Jahrhunderts? Richard David Precht blickt auf die Abgründe des absolutistischen Frankreichs und der römischen Senatoren und kommt zu dem Schluss: \u0022Wann immer eine Sozialnorm auf eine Marktnorm trifft, wird die Sozialnorm kannibalisiert.\u0022 Der Fall Epstein jedenfalls wirkt wie eine \u0022Säure für die Demokratie.\u0022\n\n-----\n\nHier auf ZDFheute Nachrichten erfahrt ihr, was auf der Welt passiert und was uns alle etwas angeht: Wir sorgen für Durchblick in der Nachrichtenwelt, erklären die Hintergründe und gehen auf gesellschaftliche Debatten ein. Diskutiert in Livestreams mit uns und bildet euch eure eigene Meinung mit den Fakten, die wir euch präsentieren.  \n\nAbonniert unseren Kanal, um nichts mehr zu verpassen.\nImmer auf dem aktuellen Stand seid ihr auf https://www.zdfheute.de\n#lanz #precht #epstein #podcast",
      "release": "2026-02-20T13:00:38Z",
      "duration": "00:53:45",
      "explicit": false,
      "youTubeId": "Kx2hyhcl5KE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Kx2hyhcl5KE"
      }
    },
    {
      "id": "380190c0-2ccb-46ce-b135-85981262da49",
      "title": "Royals, Bosse und Politiker: Wie die Epstein Files fast eine Regierung zu Fall brachten",
      "description": "Ein Prinz in Verbannung, ein Premier am Abgrund und ein \u0022Fürst der Finsternis\u0022. Die Epstein-Akten erschüttern die britische Elite.\n\nWas genau hatte Andrew Mountbatten Windsor mit Jeffrey Epstein zu tun? Und warum brach der Kontakt nicht ab – selbst nachdem Epstein wegen Zuhälterei von Minderjährigen verurteilt worden war? Diese Fragen lasten auf der Krone. \n\nDie Epstein-Krise beschäftigt auch die britische Politik. Hausdurchsuchung beim ehemaligen Labour-Politiker Peter Mandelson: Neue Indizien aus den Epstein-Akten sollen zeigen: Mandelson habe 2010 als Wirtschaftsminister vertrauliche Unterlagen der Labour-Regierung an Epstein weitergegeben. Darunter eine Vorab-Information über den Euro-Rettungsschirm. Mandelson bestreitet das. Die Briten nennen ihn den \u0022Fürst der Finsternis\u0022, weil er in London alle – und jedes Geheimnis – kennt. \n\nWohl deshalb schickte Premierminister Keir Starmer den gerissenen und bestens vernetzten Mandelson als Botschafter nach Washington. Wer sollte Trump besser handhaben, als ein Fürst der Finsternis? Auch bei ihm die Frage: Wie eng war der Kontakt zu Epstein? Warum hielt er den Kontakt – selbst nachdem Epstein wegen Zuhälterei verurteilt worden war? Und wieviel von all dem wusste Premierminister Keir Starmer, als er Mandelson zum Botschafter in Washington machte? All diese Fragen führten jetzt zu einem dramatischen Showdown im Parlament. Bislang hat Starmer die Revolte überstanden. Doch ein Ende der Epstein-Enthüllungen ist lange noch nicht abzusehen. \n_____\n\nHier auf ZDFheute Nachrichten erfahrt ihr, was auf der Welt passiert und was uns alle etwas angeht: Wir sorgen für Durchblick in der Nachrichtenwelt, erklären die Hintergründe und gehen auf gesellschaftliche Debatten ein. Diskutiert in Livestreams mit uns und bildet euch eure eigene Meinung mit den Fakten, die wir euch präsentieren.\n\nAbonniert unseren Kanal, um nichts mehr zu verpassen.\nImmer auf dem aktuellen Stand seid ihr auf https://www.ZDFheute.de/.\n#epsteinfiles #starmer #royalfamily",
      "release": "2026-02-12T16:01:19Z",
      "duration": "00:05:44",
      "explicit": false,
      "youTubeId": "q0sYlJdFLo8",
      "subjects": [
        "Human Trafficking",
        "_America",
        "_London"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=q0sYlJdFLo8"
      }
    },
    {
      "id": "2ca213ac-0d61-4cb3-bd12-2d212867a5d6",
      "title": "Experte zum Fall Epstein: „Norwegische Monarchie muss jetzt konsequent reagieren“ | ZDFheute live",
      "description": "Norwegen unter Schock: Neben Kronprinzessin Mette-Marit finden sich auch ehemalige ranghohe norwegische Politiker in den Epstein-Files. Unter ihnen Ex-Ministerpräsident Jagland und Ex-Außenminister Brende. Eine Botschafterin wurde mittlerweile suspendiert. Ihre Kinder sollten laut Akten fünf Millionen Dollar von Jeffrey Epstein erben. Bei ZDFheute live erklärt Politikwissenschaftler Tobias Etzold, wie eng seine Verbindungen nach Norwegen waren. \n\nFür ihren Kontakt zu Epstein hat sich Mette-Marit mittlerweile entschuldigt. In Mails sollen sie und der Sexualstraftäter sich über mehrere Jahre zu pikanten Themen ausgetauscht haben - nachdem Epstein bereits zum ersten Mal verurteilt worden war und eine Haftstrafe abgesessen hatte. Diese Verbindung ist nicht der einzige Skandal, der das norwegische Königshaus zurzeit belastet: Mette-Marits Sohn Marius Borg Høiby steht seit Anfang Februar unter anderem wegen Vergewaltigung vor Gericht. \n\nWie groß ist der Vertrauensverlust in Politik und Monarchie in Norwegen? Darüber spricht Ralph Szepanski bei ZDFheute live mit Politikwissenschaftler Tobias Etzold.  \n\n#epstein #norwegen #epsteinfiles \n\n----- \nHier auf ZDFheute Nachrichten erfahrt ihr, was auf der Welt passiert und was uns alle etwas angeht: Wir sorgen für Durchblick in der Nachrichtenwelt, erklären die Hintergründe und gehen auf gesellschaftliche Debatten ein. Diskutiert in Livestreams mit uns und bildet euch eure eigene Meinung mit den Fakten, die wir euch präsentieren. \n\nAbonniert unseren Kanal, um nichts mehr zu verpassen. \nImmer auf dem aktuellen Stand seid ihr auf https://www.ZDFheute.de/.",
      "release": "2026-02-07T15:00:04Z",
      "duration": "00:15:34",
      "explicit": false,
      "youTubeId": "aNIzn8OlZoU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aNIzn8OlZoU"
      }
    },
    {
      "id": "f01e7d11-308d-48c4-906d-0753b90010de",
      "title": "Epstein-Files: Wie ein deutscher Forscher mit Epstein Karriere machte | Recherche bei ZDFheute live",
      "description": "In den Epstein-Files tauchen nach und nach mehr Namen auf: Neben US-Präsident Trump, Ex-Prinz Andrew, die norwegische Kronprinzessin Mette-Marit - das ZDF hat eine andere Spur nach Deutschland gefunden. Die Recherche mit dem „Spiegel“ und dem „Standard“ zeigt: Der deutsche KI-Wissenschaftler Joscha Bach hat über eine Million Dollar vom Sexualstraftäter Epstein erhalten. Die Zahlungen sollen eine bedeutende Rolle beim frühen Karriereaufbau des Forschers in den USA gespielt haben.  \n\nLaut Bach ist das Geld nie an Bedingungen geknüpft gewesen. Warum hat Epstein den deutschen Forscher so stark finanziell unterstützt? Wie war das Verhältnis zwischen beiden?  \n\nBei ZDFheute live erzählt der Journalist Daniel Laufer, wie das Investigativteam Chatverläufe und Kontoauszüge ausgewertet hat und welche Details sie zur Verbindung zwischen dem KI-Forscher und Epstein herausgefunden haben. Seid dabei und stellt Eure Fragen! \n\n#epstein #usa #epsteinfiles \n\n00:00 Darum geht es\n01:05 Wie das Team Joscha Bach gefunden hat\n02:18 Wie Epstein Bach unterstützt hat \n04:23 Welches Interesse Epstein verfolgt hat\n06:11 Wusste Bach über Epsteins Machenschaften Bescheid?\n08:04 Wie lange waren beide in Kontakt?\n09:14 Gibt es Folgen für Joscha Bach?\n10:10 Sind weitere deutsche Namen aufgetaucht?\n12:56 Wie es mit den Recherchen weitergeht\n-----\n\nHier auf ZDFheute Nachrichten erfahrt ihr, was auf der Welt passiert und was uns alle etwas angeht: Wir sorgen für Durchblick in der Nachrichtenwelt, erklären die Hintergründe und gehen auf gesellschaftliche Debatten ein. Diskutiert in Livestreams mit uns und bildet euch eure eigene Meinung mit den Fakten, die wir euch präsentieren.\n\nAbonniert unseren Kanal, um nichts mehr zu verpassen.\n\nImmer auf dem aktuellen Stand seid ihr auf http://www.ZDFheute.de/.",
      "release": "2026-02-04T19:02:11Z",
      "duration": "00:17:54",
      "explicit": false,
      "youTubeId": "NKdsHQPA7Go",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NKdsHQPA7Go"
      }
    }
  ]
}