{
  "id": "e8384675-d2df-408a-a558-45d1d7d86557",
  "name": "Zembla",
  "youTubeChannelId": "UCMo9uZjfZuvVRxKDgaTBOyQ",
  "episodes": [
    {
      "id": "344a1626-1d73-4330-898c-130a859c31ee",
      "title": "How this sadistic online network incites young people to commit horrific acts | Zembla International",
      "description": "In this investigation, Zembla shows how a dark network is growing in restricted parts of the internet. A sadistic online network that pushes vulnerable children or young people toward violence or even suicide. We investigate how this international community, known as “764,” has also gained a foothold in the Netherlands. The consequences for victims are profound and leave deep psychological and physical scars. But who is behind it?\n\nThe Dutch police have arrested a 25-year-old man in Eindhoven on suspicion of terrorism. Zembla’s investigation shows that he had a leading role within the network. Under the name “Cxrpse,” he incited young people to commit gruesome acts, including self-harm, animal abuse, sexual abuse, or even suicide. According to the Public Prosecution Service, the man is suspected of participating in the terrorist organization “No Lives Matter,” a branch of “764.” He is being held in the high-security terrorism wing in Vught and will appear in court at the end of October.\n\nThe police have now identified dozens of Dutch victims of the “764” network. According to Annemiek van Noord of the child pornography investigation unit, the images are exceptionally severe. According to her, the material is so horrific that specialized police detectives sometimes cannot bear to watch it. The chat groups circulate not only violent videos, but also manuals explaining how murders can be carried out and how members can evade police investigations. The ultimate goal of the network is said to be to create chaos and destroy the existing order.\n\nProsecutor Linda van den Oever of the National Public Prosecution Service says that the Public Prosecution Service does not yet have a complete picture of the size of the network, but it is clear that it is a worldwide phenomenon with countless subgroups. She speaks of “extremely harmful chats” and emphasizes that it is often nearly impossible for victims to escape the network. That is why the priority lies in tracking down the perpetrators and freeing the victims.\n\nZembla discovered that Cxrpse is not the only Dutch offender active within the “764” network. In addition to him, three other individuals have been identified: a 28-year-old man from Amsterdam and two underage boys from Sittard and Zaandam. The youth from Sittard has since been sentenced to juvenile detention and treatment, while a house search took place at the suspect from Zaandam.\n\nThe police warn that children in the Netherlands are also vulnerable to the influence of these groups. Victims are often blackmailed with images or threats, and they are too afraid and ashamed to ask for help. Parents and teachers are therefore urged to be alert to signs of isolation or behavioral changes in young people. “Children need to know they are allowed to talk about it,” says Van Noord. “They need someone who can help them before it’s too late.”\n\nThe international impact of the “764” network is significant. In Germany, Sweden, and the United States, multiple violent crimes have already been committed by young people who identified with the movement. In Germany, a 17-year-old boy was convicted of murder after sharing his act in a livestream. In Sweden, elderly passersby were attacked by underage members of the group, and in the U.S., the FBI is investigating hundreds of cases linked to the network.\n\nZembla shows how, within the international “764” network, young people are encouraged to commit extreme violence and how that network is also active in the Netherlands. The investigation reveals new information about Dutch suspects and victims, and shows how police and prosecutors are trying to get a grip on an online world in which abuse, coercion, and terror spread at lightning speed.\n\nIf this topic has affected you, please reach out for support. Contact a local mental health helpline or crisis service in your country. If you\u0027re in immediate danger, call your local emergency number. You don’t have to deal with this alone.\n\n00:00 What is this video about?\n00:57 A new extremist online network\n05:16 The case of a Canadian victim\n09:20 The notorious sadistic network ‘764’\n14:47 We dive into the ‘764’ network\n20:00 We find Dutch perpetrators\n24:02 The severe consequences for victims\n28:34 We expose and confront a Dutch offender\n37:12 Conclusion\n\nDirector: Sander Rietveld\nResearcher: Rob Meekes\nChief editor: Roelof Bosma\n\nLuister onze onderzoeksverhalen in onze podcast:\nSpotify podcast: https://spoti.fi/2UBbCQ6\nApple podcast: https://apple.co/3wVX4ZA\n\nVolg ons ook hier:\nInstagram: https://www.instagram.com/zembla_bnnvara\nFacebook: https://www.facebook.com/zembla.tv/\nTwitter: https://twitter.com/ZEMBLA\nBluesky: https://bsky.app/profile/zembla-bnnvara.bsky.social\nLinkedIn: https://www.linkedin.com/company/zembla-bnnvara\nTikTok: https://www.tiktok.com/@zembla_bnnvara",
      "release": "2025-12-10T16:00:18Z",
      "duration": "00:39:56",
      "explicit": false,
      "youTubeId": "4Tmak-2NbXo",
      "subjects": [
        "The Order of Nine Angles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4Tmak-2NbXo"
      }
    }
  ]
}