{
  "id": "9100c062-4a80-4bad-8ecc-12b46e66d980",
  "name": "Zen Confidential",
  "youTubeChannelId": "UCt9Q74t3o7AUCJ_bKTc5CgA",
  "episodes": [
    {
      "id": "b9321951-2457-4afe-98ae-fcb5c8ef1a3e",
      "title": "I was in a cult! And so are you??",
      "description": "My friend has a family member who is straight-up in a cult. In fact, I was also in a cult once upon a time. So, yeah! Let\u0027s get into that!\n\nIn my experience -- and I used to live in California, after all -- there are 3 kinds of cults.\n\n1) The Crazy-Ass Cult. These folks live outside of mainstream society entirely. Charlie Manson\u0027s cult. David Koresh\u0027s cult. I.e. the types of cults that you think of when you think of the word cult. There are fewer of these crazy-ass cults now, but they tend to show up during times of extreme societal change and crisis, so . . . be on the lookout. I have a feeling we\u0027re due for some of these toxic mushrooms to start popping up after recent and ongoing societal storms.\n\n2) The Wellness Cult. This is the kind of cult that my friend\u0027s family member is caught up in. The wellness cult is a very 21st century/neolib phenomenon. These cults are right out in the open, with storefronts selling facial cream made from salmon sperm and high-priced healing crystals. Leaders of these cults offer you special \u0022hacks\u0022 to get around your personal problems so that you can blah-blah-blah manifest your supreme potential etc. To access said hacks, however, you may need to give your bank pin number, not to mention your body, and/or a LOT of your free labor, to the cult leader. . . . \n\n3) The Personality Cult . . . takes place in a legitimate institution that is embedded somewhere within mainstream society. There is a charismatic or especially talented leader -- or huckster -- who bends the will of the institution to his/her vision. For example, I think that if you work at Tesla in the main offices, you probably treat Elon like the leader of a personality cult. He\u0027s seen as more than just your regular CEO. (He\u0027s a regular CEO with FANTASTIC hair plugs!) \n\nAnd, yes, I would say that my Zen teacher created a cult of personality around himself. He was a big personality who exerted a gravitational pull on the people and organization around him. In some ways this worked. In other ways it really, really did not.\n\nBottom line? Your teacher/Roshi/Priest/Rabbi/Imam/Guru . . . none of these people are going to lay down in your grave one day and die for you. You will have to do that yourself. And you and you alone will have to live every single day of your life until that moment arrives. No cult leader, no matter how charismatic, no matter how great their promises, can give you a hack that will solve your deepest problems. \n\nFortunately, that job belongs to you, and you alone are qualified to do it.\n\nI offer these videos for free, but you can support my work here:\n\nhttps://www.paypal.com/donate/?business=2TDEMUWSYMFG2\u0026no_recurring=0\u0026currency_code=USD\n\nYou can find essays, blogs, and videos here:\n\npatreon.com/ShozanJackHaubner\n\nAnd buy my books here:\n\nhttps://www.amazon.com/Shozan-Jack-Haubner/e/B00BU82XU6?ref=sr_ntt_srch_lnk_1\u0026qid=1632966931\u0026sr=8-1",
      "release": "2026-02-11T18:07:47Z",
      "duration": "00:20:48",
      "explicit": false,
      "youTubeId": "uEoCqnC_tzo",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uEoCqnC_tzo"
      }
    }
  ]
}