{
  "id": "1298966c-422e-4d68-b1be-a2d0e8c74a0e",
  "name": "Zero Signal",
  "spotifyId": "5u6WhSMveHbd4fEt5CUfBS",
  "appleId": 1834723966,
  "episodes": [
    {
      "id": "6398c37a-6273-4603-b96c-02a46007beb7",
      "title": "Inside The Zizians Cult: AI, Vegan Extremism, and True Crime",
      "description": "How does a brilliant young engineer go from writing about artificial intelligence and ethics to leading one of the most disturbing cult-like movements of the 2020s? In this episode, we take a deep dive into the Zizians — a shadowy group linked to multiple murders across Vermont, California, and Pennsylvania. We explore how founder Jack “Ziz” LaSota used rationalist blogs, AI risk philosophy, and extreme vegan ethics to recruit vulnerable, high-achieving young people into a circle that demanded loyalty through mind hacking, debucketing, and sacrifice. From recruitment tactics that started in online forums to the cult psychology that pressured members to sever family ties, we break down how ideas turned into identity — and how identity turned into violence. If you’ve ever wondered how radical ideologies spread online, why smart people fall into cults, or how abstract theories about AI and morality can end in bloodshed, this is the episode you can’t miss. Exclusive Listener Discounts: Support the show and grab exclusive deals from our sponsors Using Code ZEROSIGNAL Aspire Drinks – Green tea-powered healthy energy. \u0026#x1f449; 20% OFF at ASPIREDRINKS.COM Prep Starts Now – Conquer uncertainty, one step at a time. \u0026#x1f449; 15% OFF at PREPSTARTSNOW.COM Zivolife – Exclusive patented superfood! \u0026#x1f449; 30% OFF at ZIVO.LIFE Klear Protein – Elevate your protein game with Klear Whey Protein Powder.\u0026#x1f449; 20% OFF at KLEARPROTEIN.com HyperNatural – The Best Men’s Polo Shirts-Men’s Journal \u0026#x1f449; 20% OFF at HYPERNATURALSTYLE.COM \u0026#x1f4f1; Connect with Zero Signal: Reddit , BlueSky , X , TikTok , and YouTube",
      "release": "2025-09-23T10:00:36Z",
      "duration": "00:58:49.6700000",
      "explicit": false,
      "spotifyId": "1OqXwy0R7HhT32Fvwk853p",
      "appleId": 1000728025462,
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1OqXwy0R7HhT32Fvwk853p",
        "apple": "https://podcasts.apple.com/podcast/inside-the-zizians-cult-ai-vegan-extremism-and-true-crime/id1834723966?i=1000728025462"
      }
    }
  ]
}