{
  "id": "04187a9b-b6a2-4b7d-b121-983f49d78048",
  "name": "Zeteo",
  "youTubeChannelId": "UCVG72F2Q5yCmLQfctNK6M2A",
  "episodes": [
    {
      "id": "05d9e47c-58c2-4288-8235-710f6d33d77f",
      "title": "Inside the Epstein Investigation With the Reporter Who Uncovered It",
      "description": "“I know a lot of stuff, but I can\u0027t report it because the victims don\u0027t want to go public, and they\u0027re afraid. And, you know, I can\u0027t go out there and say this happened without having some proof… I just keep digging and hopefully I\u0027ll get to the truth, you know? But, this whole climate in the media is very disheartening.”\n\nIn this Substack Live, John Harwood speaks with journalist Julie K. Brown, whose investigations into Jeffrey Epstein led to his arrest in 2019. They discuss Trump’s relationship with Epstein, the files and if the Trump administration can continue to ignore calls for the full release.\n\nThe investigative reporter who broke the Epstein story in November 2018 says she believes she still hasn’t learned the full scope of crimes in this scandal involving wealthy and powerful people and the young girls who were victimized.\n\nThis Substack Live discussion published last week on zeteo.com. If you want early, exclusive access to this kind of independent, unfiltered journalism — subscribe to our Substack here: https://zeteo.com/subscribe\n\nIf you want to increase your financial support for our work and help us grow, donate to Zeteo! https://zeteo.com/p/donate-to-zeteo\n\nCHAPTERS\n00:00 Intro\n03:07 Reporting on Jeffrey Epstein\n07:08 Growing Epstein scandal\n12:54 Trump and Epstein’s relationship\n17:11 Why didn’t the Biden administration go after Trump?\n22:36 Are Epstein victims conversations credible?\n24:50 Epstein’s network\n30:45 Epstein’s death\n37:27 Republican Party\n40:15 Media under Trump’s second term\n\n\n\nSubscribe to Zeteo to support independent and unfiltered journalism: https://zeteo.com/subscribe\n\nFind Zeteo:\nTwitter: https://twitter.com/zeteo_news\nInstagram: https://www.instagram.com/zeteonews\nTikTok: https://www.tiktok.com/@zeteonews\nBluesky: https://bsky.app/profile/zeteo.com\n\nFind Mehdi:\nSubstack: https://substack.com/@mehdirhasan\nTwitter: https://twitter.com/@mehdirhasan\nInstagram: https://www.instagram.com/@mehdirhasan\nTik Tok: https://www.tiktok.com/@mehdirhasan",
      "release": "2026-01-18T19:30:53Z",
      "duration": "00:45:25",
      "explicit": false,
      "youTubeId": "iAlVNxnJd3U",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iAlVNxnJd3U"
      }
    }
  ]
}